{
    "data": [
        {
            "title": "Fluorine & Tofu Brine Lead To Battery Breakthroughs In China",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p>While the US focuses on extracting and burning coal just like the world did in the 19th century, researchers in China are actively engaged in finding new, less expensive batteries with higher power and longer service life. While America looks back wistfully to its horse and buggy roots, China is preparing for an all-electric future.</p>\n<p>According to <em><a href=\"https://www.chinadaily.com.cn/a/202602/27/WS69a0d3d6a310d6866eb3a702.html\">China Daily</a></em>, Chinese scientists led by Chen Jun, an academician of the Chinese Academy of Sciences and vice president of Nankai University in Tianjin, have developed a lithium metal battery that boasts an energy density of more than 700 watt-hours per kilogram and stable performance at extremely low temperatures. This marks a significant advancement in the production of high-energy batteries for electric vehicles. The research paper was <a href=\"https://www.nature.com/articles/s41586-026-10210-6\">published on Thursday in the science journal <em>Nature</em></a><em>.</em> Here is the abstract to that journal entry, which was published on February 25, 2026:</p>\n<p style=\"padding-left: 80px;\">Electrolyte solvents for electrochemical devices have been dominated by oxygen (O)-based and nitrogen (N)-based ligands over the past decades, for which the dipole–ion (Li+, Na+ and so on) interaction usually lays the foundations of ion dissociation and transport but frustrates the charge transfer process at the electrolyte–electrode interface.</p>\n<p style=\"padding-left: 80px;\">Here, by synthesizing alkanes with monofluorinated structures, we show that fluorine (F)-based ligands with designed steric hindrance and Lewis basicity enable salt dissolution of more than 2 mol l. Among them, 1,3-difluoro-propane (DFP)-based Li-ion electrolyte is endowed with all merits for energy-dense and low-temperature batteries, including low viscosity (0.95 cp), high oxidation stability (&gt;4.9 V) and ionic conductivity of 0.29 mS cm at −70 °C.</p>\n<p style=\"padding-left: 80px;\">By incorporating F atoms in the first solvation shell, the weak F–Li+ coordination facilitates the Li plating/stripping process with Coulombic efficiency (CE) up to 99.7% and exchange current density one magnitude larger than O–Li+ coordination at −50 °C.</p>\n<p style=\"padding-left: 80px;\">The electrolytes further enable the operation of lithium-metal pouch cells under an electrolyte amount of less than 0.5 g Ah, achieving energy densities greater than 700 Wh kg at room temperature and about 400 Wh kg at −50 °C. The hydrofluorocarbon (HFC) electrolytes in this work provide a feasible approach to building electrochemical systems beyond traditional coordination chemistry.</p>\n<p>Okay, got all that? Here’s the plain language translation: Chen said the team has replaced oxygen atoms with fluorine ones. It designed and synthesized novel fluorinated hydrocarbon solvent molecules, which created a new electrolyte system based on lithium-fluorine coordination.</p>\n<p>Laboratory tests showed that the battery could achieve energy density above 700 watt-hours per kilogram, maintaining nearly 400 Wh/kg at -50°C. Energy density and low-temperature performance are the biggest bottlenecks hindering the widespread adoption of EVs, Chen said.</p>\n<p>To address this challenge, his team redesigned the battery electrolyte at the molecular level. By developing fluorinated hydrocarbon solvent molecules and establishing a lithium-fluorine coordination system, the researchers improved ion transfer and enabled stable operation at ultrahigh energy densities and extremely low temperatures.</p>\n<p>“High-energy batteries using this electrolyte have vast potential in new energy vehicles, embodied intelligent robots and the low-altitude economy, as well as in polar regions, aerospace and aviation,” Chen said.</p>\n\n<p>The team has also made significant progress in advancing cutting-edge technologies toward practical applications. Earlier this month, the team collaborated with Chinese automaker Hongqi to release a mass-producible <a href=\"https://cleantechnica.com/2026/02/19/faw-begins-testing-semi-solid-state-battery-with-500-wh-kg-energy-density/\">ultra-high energy density lithium-rich manganese solid-liquid battery system</a>. The system boasts a cell energy density exceeding 500 Wh/kg, which translates into a driving range of more than 1,000 kilometers on a single charge for equipped vehicles.</p>\n<p>Yan Zhenhua, a professor at Nankai University’s College of Chemistry, said the new battery uses a self-developed composite electrolyte that improves both safety and durability. “It not only achieves a leap in energy density but, more important, solves the high cost and high risk challenges associated with lithium metal batteries, significantly enhancing cycle life and intrinsic safety,” Yan added.</p>\n<p>Lu Tianjun, general manager of China Automotive New Energy Battery Technology, said that vehicles equipped with the batteries and capable of exceeding 1,000 kilometers per charge are expected to enter mass production by the end of this year. “This serves as a model and a leading example of collaboration between universities and enterprises.”</p>\n<p>“This battery, whether in terms of energy density, technological advancement or progress in application, represents a leading level both domestically and internationally,” Lu said. “Conservatively, its performance would mean an improvement of about 50 percent compared with current technologies.”</p>\n<p>Chen, the Nankai University researcher, said that translating scientific breakthroughs into practical technologies requires close collaboration between researchers and industry. “We can’t always stay in the ivory tower. Our goal is to address real industrial challenges.”</p>\n<h3 style=\"text-align: center;\">Tofu Brine To The Rescue!</h3>\n\n<p style=\"text-align: left;\"><em><a href=\"https://oilprice.com/Energy/Energy-General/The-Tofu-Brine-Battery-That-Could-End-the-Lithium-Era.html\">OilPrice.com</a></em> also has a report this week about a new <a href=\"https://cleantechnica.com/2025/05/18/a-new-flow-battery-takes-on-the-data-center-energy-crisis/\">aqueous battery</a> developed by Chinese researchers that purports to be capable of 120,000 charge/discharge cycles. Aqueous batteries have not proven to be well suited for powering automobiles, but they could play an important role in battery energy storage systems. The typical life cycle limit for lithium-ion batteries is around 3,000 charge/discharge events. Once again, for our technically inclined readers, here is the abstract for this study, which was published in <a href=\"https://www.nature.com/articles/s41467-026-69384-2\"><em>Nature Communications</em> on February 18, 2026</a>:</p>\n<p style=\"padding-left: 80px;\">The electrolytes of aqueous batteries are mostly acidic or alkaline, resulting in inevitable side reactions. More importantly, when batteries are disposed of, strongly acidic and alkaline solutions harm the environment.</p>\n<p style=\"padding-left: 80px;\">In this study, we synthesized covalent organic polymers as negative electrode materials for aqueous divalent ion (Mg2+ and Ca2+) storage, which exhibit favorable performance in electrolytes with a pH of 7.0 (the electrolytes are environmentally benign and can even be “brine” in tofu production).</p>\n<p style=\"padding-left: 80px;\">Polymers containing electron-donating linking bonds exhibit fast kinetics and low potential for use in aqueous Mg2+/Ca2+ batteries. In neutral electrolytes (pH = 7.0), Hexaketone-tetraaminodibenzo-p-dioxin covalent organic polymers exhibit 120,000 cycles and deliver specific capacities (up to 112.8 mA h/g).</p>\n<p style=\"padding-left: 80px;\">The negative electrode was paired with a positive electrode, creating a full cell that has a voltage interval of 2.2 V and achieves a specific energy of up to 48.3 Wh/kg, which is calculated on the basis of the total mass of the negative electrode, positive electrode, and electrolyte at the full cell level, together with long-term cycling stability over 120,000 cycles at a specific current of 20 A.</p>\n<p style=\"padding-left: 80px;\">The full cells are environmentally benign and nontoxic and can be directly discarded to environments according to various standards (GB 18599-2020, ISO 14001, Resource Conservation and Recovery Act RCRA, US).</p>\n<p>“Compared with current aqueous battery systems … our system delivers exceptional long-term cycling stability and environmental friendliness under neutral conditions,” the research team said. It was composed of scientists from the City University of Hong Kong and Southern University of Science and Technology in Shenzhen.</p>\n<p>“At over a hundred thousand cycles, this could mean a single water based battery could last at least a decade or so. For applications like grid storage (solar farms, wind balancing), that’s extremely valuable,” they claim.</p>\n<p><span id=\"more-368961\"></span></p>\n<p>These tofu-brine batteries could prove safer and more environmentally friendly than lithium-ion batteries. According to the study authors, the full cells are environmentally benign and nontoxic and can be directly discarded to environments while meeting national and local disposal standards. Water based (also called aqueous) batteries can also be cheap to produce as they rely on ingredients that are far less costly than those used in conventional lithium-ion batteries.</p>\n<p>If this new tofu-brine battery proves scalable and applicable outside of a laboratory environment, it could be another step toward Beijing’s goal of near-total domination of clean energy technology value chains and status as the world’s first and premiere ‘electro-state,’ says OilPrice.com reporter Haley Zaremba.</p>\n<p>While other countries are aware of China’s dominance in clean energy technologies — largely because of its solid support of basic research — and are taking pains to protect and promote domestic battery manufacturing, those efforts may be too little, too late.</p>\n<p>“For globally competitive battery manufacturing industries to emerge outside of Asia over the next ten years, companies will need to do far more than ensure regulatory compliance,” summarizes a McKinsey &amp; Company report released in January. “Challenges will need to be overcome on multiple fronts spanning supply chains, talent management, operations and technology.”</p>\n<p>Putting up tariff barriers is one sure way to make sure that China wins while others — especially the US — are the <a href=\"https://cleantechnica.com/2026/02/27/maga-is-making-america-stupid-the-effects-will-be-felt-for-generations/\">biggest losers and left gasping on the side of the highway that leads to the future</a>.</p>\n<p>We have said many times here at <em>CleanTechnica</em> that the batteries in use in 2030 haven’t been invented yet. They will cost less and do more than any commercially available batteries of today and make the transition to an electricity based economy a no-brainer. When it comes to electro-states, the future’s so bright, you gotta wear sunglasses — especially if you happen to be China.</p>\n</div>",
            "link": "https://cleantechnica.com/2026/02/28/fluorine-tofu-brine-lead-to-battery-breakthroughs-in-china/",
            "pub_date": "2026-03-01 09:36:31",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Tesla Vehicles Finally Come To Africa",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p><span style=\"font-weight: 400;\">Tesla recently announced that the company’s vehicles will now be available in an African country for the first time ever. Starting in the middle of this year, the Model 3 and Y will be available in Morocco. Morocco was always going to be the first one, given its proximity to Europe, where Tesla already has a big presence. Holiday makers from Europe have been taking their Teslas to Morocco for a long time now, and therefore Tesla opened a Supercharger network in Morocco a while ago. There is also a strong local Tesla fanbase there with Moroccans independently importing Teslas into the country. Now Moroccans will have official Tesla dealerships and can soon get brand new Teslas with full backup service and warranties. </span></p>\n<p><span style=\"font-weight: 400;\">Tesla did have some presence on the African continent before. A small office in Cape Town some years back focused on the energy side of Tesla’s business (Powerpacks). Powerwalls have been available in South Africa since the first-generation Powerwall. The Powerwall 3 is also now available in South Africa. Back to the vehicle side of things, it’s good to see another brand bridging in electric vehicles, albeit in one country for now. The continent has 54 countries, and if they do their due diligence properly, they could find more markets to get good sales. </span></p>\n<p><span style=\"font-weight: 400;\">Let’s look at the overall Morocco market for example. In 2025, just over 235,000 brand new cars were sold in Morocco, up 33% from 2024. These were mostly ICE vehicles. Now let’s look at Africa’s largest market for new vehicle sales, South Africa. In 2025, just under 600,000 brand new vehicles were sold in South Africa in the overall market, the highest number in over a decade and up 15.7% year on year. That’s almost 3 times the number of vehicles sold in Morocco. Over 96% of these sales were ICE vehicles, though. So, South Africa presents a much larger addressable market and should have a bigger market for Tesla to take advantage of. In fact, South Africa is a larger vehicle market than a lot of countries where Tesla has had a presence for years. </span></p>\n<p><span style=\"font-weight: 400;\">Tesla could also be encouraged by the fact that new brands seem to be catching on fast in South Africa. For example, two brands from Chery Group doing well in South Africa are Omoda and Jaecoo. Omoda &amp; Jaecoo South Africa sales have officially surpassed 20,000 total vehicles since launching in the local market in 2023. The brand has now achieved a cumulative sales figure of 20,857 units. Part of this growth has been fueled by growing market interest in electrified mobility. Plug-in hybrid sales from the brands continue to rise, with 590 SHS (Super Hybrid System) models already contributing to overall sales volumes. The J7 SHS, in particular, has shown strong momentum, with 317 units sold since its debut in June 2025. The C9 SHS, which carries a starting price of R999,900, has also performed well despite being the most premium offering in the Omoda &amp; Jaecoo lineup.</span></p>\n<p><span style=\"font-weight: 400;\">There are several countries now that have pro EV policies on the African continent and could be markets of interest for Tesla. It’s good to see that Tesla is at least now looking into the African market through this Morocco launch. Hopefully more markets will follow.</span></p>\n</div>",
            "link": "https://cleantechnica.com/2026/02/28/tesla-vehicles-finally-come-to-africa/",
            "pub_date": "2026-02-28 23:42:02",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "We’re At War With Iran — Buy An EV To Avoid $6+ Gas Prices",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p>I woke up this morning here in New Mexico to the news that long-standing neoconservative hawk dreams finally came true: “Operation Epic Fury” is underway. The U.S. and Israel are officially trading massive blows with Iran and Trump’s stated goal is regime change. The country is at war. <a href=\"https://youtu.be/s8hEtI9AI0U?si=eIzL4I-pPX2aw0bn\">Cue John McCain singing “Bomb Iran.”</a></p>\n<p>If you read CleanTechnica regularly, you probably already understand the environmental and ethical insanity of another conflict in the Middle East. But right now, we need to talk about the brutal macroeconomic physics that are about to hit every American driver.</p>\n<p>There is a very seductive narrative coming out of the regime right now: that these will be “surgical” strikes that “degrade capabilities” while supporting a popular uprising, paving the way for a swift, clean victory that will save democracy in the middle east and cost the American public nothing.</p>\n<p>I’m here to tell you that this is a fantasy.</p>\n<p>Whether you support the current man who identifies as president or not, and regardless of how you feel about regime change in Tehran, the inescapable reality is that the era of cheap, predictable gasoline just ended. When you analyze the military and market mechanics on the ground, we are looking at a 60% to 70% probability of a severe, sustained global oil shock that will likely drive national gasoline averages past $6 a gallon.</p>\n<p>If you are reading this and still driving a gas-powered vehicle, you are holding a live grenade in your wallet. Here is the cold, hard math on why it’s time to rethink your vehicle choices.</p>\n<h3 style=\"text-align: center;\">The Single Highway Exit Problem</h3>\n<p>To understand the likely energy crisis we face, you don’t need a degree in geopolitics. You just need to look at a map. <a href=\"https://iea.blob.core.windows.net/assets/760ed8e8-38b6-4418-b527-6d8976da72e4/StraitofHormuzFactsheet.pdf\">Roughly 20% of the world’s seaborne oil trade</a> has to pass through the Strait of Hormuz, a narrow, 21-mile-wide chokepoint between the Persian Gulf and the rest of the world’s oceans. Think of it as a single highway exit that serves an entire global economy.</p>\n<p>The administration’s fantasy relies on everything going perfectly so that exit stays open. It won’t.</p>\n<p>Iran’s military doctrine is based on asymmetric warfare. They know they cannot win a conventional battle against the U.S. Navy and Air Force. Their goal isn’t to “win”. Their goal is to inflict maximum economic chaos and outlast the political will of U.S. leadership. They know that with expensive fuel, Trump won’t have the power to do anything to them in about a year.</p>\n<p>And they don’t need to physically close the strait to do it. The global oil market runs on maritime insurance. You cannot sail a Very Large Crude Carrier (VLCC) containing millions of dollars of oil without coverage. As soon as Iran deploys even a few naval mines or a handful of attack drones hit commercial tankers, the maritime insurance market will instantly self-destruct. Tankers will not sail into an uninsurable war zone without massive naval escorts, slowing the global flow of oil to a trickle.</p>\n<h3 style=\"text-align: center;\">The Math Behind That $6 Gas</h3>\n<p>When that bottleneck is choked, global panic takes over. The math here is well-established by economists: for <a href=\"https://www.dallasfed.org/research/economics/2019/1001\">every $10 increase in a barrel of crude oil, you pay roughly 25 cents more per gallon at the pump</a>.</p>\n<p>Before this morning, global crude was trading around $70 a barrel. In a “Wounded Bear” scenario where Iran survives the initial strikes and initiates a long-term, asymmetric shadow war involving mines and drones (which analysts assess as having a 45-50% probability), global crude will easily sustain a price of $130 to $140 a barrel as the “risk premium” becomes permanent.</p>\n<p>Add that $60 or $70 surge to crude, do the 25-cents-per-gallon math, and you add $1.50 to $1.75 to whatever you were paying last week, and then watch the prices keep climbing as long as the conflict continues to disrupt oil trade.</p>\n<p>Now, look at the other probable outcome: The “Sunk Cost” scenario (roughly 15-20% probability). This is where the initial airstrikes fail to induce regime change, the administration’s ego takes a hit, and “mission creep” spirals into a U.S. ground invasion. In a full ground war that physically destroys neighboring Saudi and Emirati production capability, crude prices would blow past $150 or even $180 a barrel.</p>\n<p>When you combine the likelihood of these future outcomes, you are staring at a 60% to 70% probability of a sustained, catastrophic physical supply shock. You are locked into $6, $7, or even $8 gasoline for the foreseeable future.</p>\n<p>To avoid this, a man known for having no restraint would have to grow up overnight, or everything would have to go perfectly for him (civilians somehow overthrow the Revolutionary Guard because some facilities got bombed).</p>\n<h3 style=\"text-align: center;\">The Era of Financial Self-Defense</h3>\n<p>This coming April, I’ll be hitting the road for my Charge To The Parks project. I’m doing a coast-to-coast run down Route 66 from LA to Chicago, and then continuing on to the Outer Banks. If I were attempting to drag my older travel trailer across the country with a diesel or gas truck right now, I’d be sweating bullets watching the news.</p>\n<p>But I’m not. I’ll be pulling that trailer with my Chevy Silverado EV LT. Between the truck’s massive battery pack and the custom solar and battery setup I’ve been wiring into the trailer, the direct sting of a global oil shock is essentially removed from my travel math.</p>\n<p>Picking up an EV is no longer just an environmental statement. It is a vital act of financial self-defense. Here is why an EV is the only logical move today:</p>\n<p><strong>The Domestic Shield</strong>. <a href=\"https://www.eia.gov/kids/energy-sources/electricity/electricity-in-the-us.php\">Petroleum accounts for less than 1% of U.S. utility-scale electricity generation</a>. Sunshine, wind, natural gas, and nuclear power are domestic. When you drive an EV, you are breaking the geopolitical tether to the world’s most unstable region. The U.S. power grid doesn’t rely on oil tankers dodging mines in the Persian Gulf.</p>\n<p><strong>Price Predictability</strong>. Electricity rates are regulated and stable. They might slowly change year over year, but they do not spike by 30% overnight because of a drone attack halfway across the world. An EV turns your “fuel” cost into a predictable utility bill, not a volatile stock market ticket.</p>\n<p><strong>The Ultimate Exit Strategy</strong>. This is the best part: if you have solar panels on your roof (or your travel trailer), you are making your own fuel. You have completely decoupled your personal mobility from global conflict, corporate greed, and political folly.</p>\n<p><strong>We are looking at a fork in the road</strong>. On one path, you continue to gamble on volatile global politics, accepting that $6 or $7 gas is your new baseline while your disposable income evaporates. On the other path, you leverage domestic energy, insulate your wallet, and take back control.</p>\n<p>The choice is yours, and by the time you read this, local new and used car dealers that sell EVs are probably open. If you don’t have one, get one.</p>\n<p><a href=\"https://cleantechnica.com/wp-content/uploads/2026/02/IMG_0710.jpeg\"><img alt=\"\" class=\"aligncenter size-full wp-image-368945\" decoding=\"async\" height=\"224\" src=\"https://cleantechnica.com/wp-content/uploads/2026/02/IMG_0710.jpeg\" width=\"400\"/></a></p>\n<p><em>Featured image: A screenshot from Toy Story (1995) via Yarn (Fair Use).</em></p>\n</div>",
            "link": "https://cleantechnica.com/2026/02/28/were-at-war-with-iran-buy-an-ev-to-avoid-6-gas-prices/",
            "pub_date": "2026-02-28 23:01:18",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "UAW: Stellantis Can’t Blame Workers Or EVs For Losses",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p>If you work the line at a Big Three automaker, late February is usually a time to celebrate. The annual profit-sharing checks get announced, and for the last few years, they’ve been absolute blockbusters.</p>\n<p>This year? The mood in Detroit depends entirely on whose badge is on your polo shirt.</p>\n<p>Over at General Motors, workers are looking at <a href=\"https://evrimagaci.org/gpt/stellantis-workers-face-first-profit-sharing-drought-since-2011-531666\">checks north of $10,500</a>. Ford workers aren’t far behind, netting nearly $6,780. But if you clock in at a Stellantis plant, <a href=\"https://www.crainsdetroit.com/automotive/profit-sharing-stellantis-uaw-workers-drops-0\">management just handed you a fat, depressing zero</a>. It’s the ultimate Clark Griswold moment. You work hard all year, you build the products that generate the revenue, and you expect that end-of-year bonus to reflect your sweat equity. Instead of a check, you get enrolled in the Jelly of the Month Club.</p>\n<p>Actually, no. The Jelly of the Month Club is the gift that keeps on giving the whole year (even if it doesn’t cover a swimming pool). What Stellantis management just handed its UAW workers is much worse. They handed them Cousin Eddie’s sewer hose.</p>\n<p>And true to form, instead of taking accountability for dropping a historic financial disaster on their employees’ lawns, Stellantis executives are trying to point the finger at the transition to electric vehicles.</p>\n<h3 style=\"text-align: center;\">The “Shitter Was Full” Defense</h3>\n<p>In a <a href=\"https://www.reddit.com/r/Michigan/comments/1rfwy3r/stellantis_workers_go_off_on_0_profit_sharing/\">blistering internal letter released yesterday</a>, UAW Vice President Rich Boyer called out Stellantis management for a catastrophic 2025 that saw the company post a staggering <a href=\"https://intellectia.ai/blog/stellantis-profit-sharing-2025-analysis\">$26.4 billion global loss</a> and completely wipe out its North American profit margins. Boyer rightly pointed out that the company “prioritized shareholder payouts instead of investing in the future, and cut the heart and soul out of the plants to cover up the results.”</p>\n<p>Stellantis, meanwhile, has been crying to anyone who will listen that the “shift away from electric vehicles” and a “cooling market” forced their hand. They want to give EV advocates the same Cousin Eddie Merry Christmas they just gave the UAW.</p>\n<p>But we all know the truth: It’s Stellantis’s shitter that’s full, not the EV movement.</p>\n<p>Let’s get real for a second. While there are some cool people at Stellantis who care about electrifictation, Stellantis HQ didn’t even try to half-ass the EV transition. While Ford and GM were pouring billions into dedicated platforms, battery plants, and actual metal-on-the-road, Stellantis dragged its feet. They starved their product lines, jacked up the prices on their aging internal combustion Jeeps and Rams to eye-watering levels, and watched their North American market share evaporate. They made decisions to slash engineering, software development, and supplier budgets long before any “EV slowdown” materialized.</p>\n<p>You know I love the Wrangler 4xe, but that should have been step 1, not the whole game!</p>\n<p>Now, after investing a fraction of what their domestic rivals did into electrification, they want to use EVs as the scapegoat for their own executive boardroom failures.</p>\n<h3 style=\"text-align: center;\">The Big Lie Doesn’t Work For Automakers</h3>\n<p>What we are witnessing is an attempt to pass off rank incompetence as victimhood. That’s a bold strategy, Cotton.</p>\n<p>But here’s the thing: There is only one Donald Trump. Trying to weaponize victimhood to cover up a trail of massive, undeniable failures in a “Big Lie” is a reality-distortion field that Trump can get away with (at least before he blundered his way into Iran and endangered the whole oil economy). He has a monopoly on that specific brand of Teflon.</p>\n<p>Nobody else can pull it off like he can, and certainly not a multinational conglomerate bleeding tens of billions of dollars. You can’t gaslight a balance sheet, and you sure as hell can’t gaslight a UAW worker who is staring at a $0 profit-sharing statement while their neighbor at the Chevy plant is putting a down payment on a new Silverado EV LT to tow their travel trailer.</p>\n<p>The UAW sees right through the corporate greed. EV advocates see right through the scapegoating. Stellantis made its own bed, and now it’s trying to make the workers and the clean energy transition sleep in it.</p>\n<p><em>Featured image: A screenshot from a Jeep commercial years ago flaunting a future electric Wrangler that can operate underwater (likely tongue firmly in cheek). Fair Use.</em></p>\n</div>",
            "link": "https://cleantechnica.com/2026/02/28/uaw-stellantis-cant-blame-workers-or-evs-for-losses/",
            "pub_date": "2026-02-28 23:01:18",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Apollo Go Reaches 20 Million Trips, 190 Million Fully Driverless Kilometers",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p>We typically report on Waymo and other US-based robotaxi companies, but one of the biggest robotaxi services in the world is Baidu’s Apollo Go. It first launched fully driverless robotaxis in China on July 20, 2022, and was the first company to launch them there.</p>\n<p>Now we have news that, as of this month, Apollo Go has provided 20 million rides — worldwide, as it does also offer robotaxi services in some locations outside of China. Note that <a href=\"https://cleantechnica.com/2025/12/17/waymo-reaches-20-million-passenger-trips/\">Waymo passed 20 million passenger trips</a> in December 2025.</p>\n<p>The company provided 3.4 million robotaxi trips in just the 4th quarter of last year. That was a 200% increase over the 4th quarter of 2024. In its peak week, the company provided 300,000 such trips.</p>\n<p>As has been done at all robotaxi companies, Apollo Go initially had humans in the vehicles supervising the autonomous driving. With those trips included, the company has now passed 300 million kilometers (186 million miles) of autonomous driving. Only counting the fully driverless trips, it has passed 190 million kilometers (118 million miles). That’s a lot of autonomous driving….</p>\n<p>Along with providing these stats to the world, Baidu just announced that Apollo Go service has launched in South Korea. That should be a hot market for the service.</p>\n<p>While most of Apollo Go’s business is conducted in Chain, the company has been expanding beyond China significantly. Uber &amp; Lyft are supposed to be <a href=\"https://cleantechnica.com/2025/12/25/more-robotaxi-ride-hailing-partnerships/\">testing Apollo Go robotaxis in London this year</a>, A <a href=\"https://cleantechnica.com/2025/10/27/swiss-public-transport-company-to-use-apollo-go-robotaxis/\">public transport company in Switzerland</a> is also starting to use them. <a href=\"https://cleantechnica.com/2025/08/09/lyft-apollo-go-to-go-after-europe/\">Apollo Go should be entering other parts of Europe</a> through Lyft this year as well. It is also <a href=\"https://cleantechnica.com/2025/07/17/baidu-uber-partner-to-launch-thousands-of-robotaxis/\">getting into more markets in Asia and the Middle East</a> through Uber. A little more than a year ago, <a href=\"https://cleantechnica.com/2024/11/29/apollo-go-robotaxis-launch-in-hong-kong/\">Apollo Go robotaxis launched in Hong Kong</a>. I expect we’ll be hearing of its entry into several more markets through 2026. Stay tuned.</p>\n<p>And, one has to wonder: will Apollo Go be able to pass up Waymo in robotaxi rides? Both of them are expanding rapidly, so it should be an interesting and tight race for robotaxi leadership in 2026. We shall see.</p>\n</div>",
            "link": "https://cleantechnica.com/2026/02/27/apollo-go-reaches-20-million-trips-190-million-fully-driverless-kilometers/",
            "pub_date": "2026-02-28 14:20:38",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Range Anxiety Anxiety vs. Actual Electric Car Convenience",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p>Wow, time flies. An <a href=\"https://cleantechnica.com/2014/11/09/electric-car-convenience-vs-range-anxiety-anxiety/\">old article</a> that I loved when we originally published it recently came to mind, and I quickly realized it was much more relevant today than it was back in November of 2014 when it was published. It also blows my mind that the article is more than 11 years old! Wow…. Funny enough, it was originally posted on Google+, which was a great social network I loved but that didn’t last. So, if we hadn’t reposted it back then, it would have been lost to history. Anyway, I’m going to repost it again in full, and then add a little more commentary at the end.</p>\n\n<p>Originally published on <a href=\"https://plus.google.com/u/0/+AlbertBodenhamer/posts/iyXySTACkfi\" rel=\"”canonical”\">Google+</a>.<br/>\nBy Albert Bodenhamer</p>\n<p>I spend a fair bit of time following press on electric vehicles (EVs). I see stuff that’s pro-EV, anti-EV, and neutral. I see some good stuff, but a lot of poorly researched crap from every angle as well*.</p>\n<p>One thing that really bugs me is stories talking about the “huge disadvantage” EVs have in charging time and that “People don’t want to wait hours and hours for their cars to charge.”</p>\n<p>Stories like that create what I call “range anxiety anxiety”. Range anxiety is an infrequent thing, but people unfamiliar with electric cars read articles hyping short range and long charge times and they develop anxiety that they’d have range anxiety if they owned an EV.</p>\n<p>The problem isn’t in the statement itself, but in the underlying assumption. People are used to how gasmobiles work. You drive for a week or two on a tank, running it down close to empty (often inducing range anxiety). Then you stop at a gas station for a few minutes, drop 50+ bucks and then repeat the cycle. If you apply that model to an EV, it’s horrifying. Imagine getting up to go to work and your EV battery is empty! A Model S takes 10 hours to charge at a level 2 charger! I’d miss a whole day of work!!!</p>\n<p>What people don’t see is how idiotic that model is. They’ve trained themselves to put up with the nonsense gasmobiles create and they just assume it applies everywhere. If you offer to get rid of a major annoyance people experience all the time and are used to, but the cost is a new less-frequent annoyance that gets hyped by the press every 2 seconds, people will often pass on getting rid of the major annoyance.</p>\n<p>Think about the last time you had to put gas in your car. If you’re like me, you noticed the gas gauge getting low on your way home from work, but you were tired after a long day and decided to wait til morning. Morning always comes. It’s always the morning when everything is going wrong and you’re running late and you climb in the car, and “CRAP!” you’ve gotta get gas on the way to work.</p>\n<p>Imagine instead that a magic energy fairy showed up every night and refueled your car. All the fairy asks in return is that you pay about ¼ of what you used to pay in gas, and that you spend a bit more time and planning on long trips. That’s it.</p>\n<p>I took a look at my gas patterns before I bought the Model S and since. I used to buy gas about every 2 weeks. Each stop always added at least 10 minutes to my trip to or from work (I timed it). In the year and a half I’ve owned my Model S I would have made 40 gas stops**. That’s 6.5 hours I would have blown going out of my way when what I really wanted to be doing is getting on with life.</p>\n<p>EVs use a different pattern than gasmobiles do. They work like the magic energy fairy. I spend far less time recharging than I did buying gas. I just take two seconds to plug in at home and by morning I have a full battery again.</p>\n<p>There’s only once where I haven’t woken up to a full battery. I’d done a ton of driving the day before, down to downtown San Jose, up to El Sobrante and back, then back and forth to Mountain View. I pulled in at 10:30 that night with only 25 miles of range left on my car. It started charging at 12:30 and I had to leave again at 8 the next morning. I went out to leave and saw that the car was still charging. Oh no! I only had 190 miles of range to cover the 40 miles of driving I needed to do that day! I unplugged, went about my day, and the next day I woke to a full charge.</p>\n<p>The only time I wait for my car is if I’m on a road trip. Those are the exception and, for me at least, the convenience of not having to get gas the other 99% of the time easily outweighs the bit of extra time and planning I have to do on a long trip. For me, a road trip is when I’m explicitly NOT rushing. I just take my time and enjoy the drive. Most of my road trip charge stops are 20-45 minutes and I spend the time hitting the restroom, grabbing a quick bite, talking to other drivers, or just stretching my legs.</p>\n<p>There ARE some things that don’t really work yet due to lack of infrastructure, but those are getting better. They’re the reason I still wouldn’t have an EV as an ONLY car. In 2-3 years I expect those problems to be solved and I’ll dump gas for good.</p>\n<p>* The hyperbole-infested pro-EV/pro-Tesla stuff bothers me quite a bit. There are plenty of good reasons to own an EV. Spinning a bunch of BS doesn’t help anyone. I might write something on that later.<br/>\n** Actually, more than that. That’s just based on the driving <b>I</b> used to do in my old car. We now drive my wife’s car about half as much as we used to, and she buys gas much less often now too.</p>\n<p><em>About the Author: Albert is a science and tech geek, occasional gadfly, armchair philosopher, and avid hobby collector. He works for Google, where he tries not to break things in Chrome OS. Lately, he spends a lot of time thinking about electric cars, social justice, cooking, and improvisational comedy. You can follow his writing on <a href=\"https://plus.google.com/+AlbertBodenhamer\" rel=\"noopener noreferrer\" target=\"_blank\">Google +</a>.</em></p>\n<p>Related Stories:</p>\n<p style=\"padding-left: 30px;\"><a href=\"http://cleantechnica.com/2014/11/05/electric-car-range-anxiety-non-issue-millions-americans/\" title=\"Electric Car Range Anxiety Should Be A Non-Issue For Millions Of Americans\">Electric Car Range Anxiety Should Be A Non-Issue For Millions Of Americans</a></p>\n<p style=\"padding-left: 30px;\"><a href=\"http://cleantechnica.com/2014/02/20/1-reason-electric-cars-will-dominate-car-market/\">The Other #1 Reason Why Electric Cars Will Dominate The Car Market</a></p>\n\n<p>Okay, that was from 11 years ago. The story is only much more true today. <a href=\"https://cleantechnica.com/2025/10/25/the-super-exciting-thing-michael-liebreich-i-are-loving-these-days/\">Electric vehicles have gotten far, far more range on a full charge for the same price</a> (because battery costs have been absolutely slashed), and thousands more EV chargers are spread across the country and the world. Many more EV models are on the market for different tastes.</p>\n<p>Yet, at the same time, most people still suffer from range anxiety anxiety when they think about getting an electric car! Most people still don’t understand how convenient it is to have an EV, how much more convenient it is than going to the gas station every week or two. It’s sort of crazy. But this is the reality we live in. Most people don’t understand the benefits of electric cars, including one of the best and most obvious ones.</p>\n<p>How can we help to get past this problem?</p>\n<p><em>This article is also being published on <a href=\"https://cleantechnica.substack.com/subscribe\">our Substack channel</a>.</em></p>\n</div>",
            "link": "https://cleantechnica.com/2026/02/27/range-anxiety-anxiety-vs-actual-electric-car-convenience/",
            "pub_date": "2026-02-28 11:05:37",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Volkswagen Reaches 2 Million Electric Vehicle Deliveries",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p>The Volkswagen brand has reached another milestone in its electric vehicle journey. It has just delivered its 2 millionth fully electric vehicle. The milestone vehicle was a Volkswagen ID.3 produced in Volkswagen’s Zwickau factory, and then was delivered today to a customer at the company’s Transparent Factory in Dresden, Germany.</p>\n<p><a href=\"https://cleantechnica.com/wp-content/uploads/2026/02/VW-EV-Sales-2-Million.jpg\"><img alt=\"\" class=\"aligncenter size-full wp-image-368930\" decoding=\"async\" height=\"1248\" sizes=\"(max-width: 2400px) 100vw, 2400px\" src=\"https://cleantechnica.com/wp-content/uploads/2026/02/VW-EV-Sales-2-Million.jpg\" srcset=\"https://cleantechnica.com/wp-content/uploads/2026/02/VW-EV-Sales-2-Million.jpg 2400w, https://cleantechnica.com/wp-content/uploads/2026/02/VW-EV-Sales-2-Million-400x208.jpg 400w, https://cleantechnica.com/wp-content/uploads/2026/02/VW-EV-Sales-2-Million-800x416.jpg 800w, https://cleantechnica.com/wp-content/uploads/2026/02/VW-EV-Sales-2-Million-768x399.jpg 768w, https://cleantechnica.com/wp-content/uploads/2026/02/VW-EV-Sales-2-Million-1536x799.jpg 1536w, https://cleantechnica.com/wp-content/uploads/2026/02/VW-EV-Sales-2-Million-2048x1065.jpg 2048w\" width=\"2400\"/></a></p>\n<p>While BYD sold more than 2 million pure electric vehicles last year, and Tesla approached 2 million sales a year at its peak, not a lot of auto brands have gotten to the same 2 million cumulative EV sales as Volkswagen.</p>\n<p>“Volkswagen has assumed a leading role in the European BEV market with its broad range from the compact <span class=\"nowrap\">ID.3</span> to the long-distance capable <span class=\"nowrap\">ID.7</span>,” Volkswagen says. Is it tooting its own horn? Yes. But is it true? Yes.</p>\n<p>“Two million all-electric vehicles provide clear evidence of the attractiveness and competitiveness of our all-electric portfolio,” added Martin Sander, Volkswagen Board Member for Sales, Marketing and After Sales. Indeed.</p>\n<p>Now, the part that Volkswagen bragged about that I don’t think is so exciting is that Volkswagen sold its first EV in 2013, 13 years ago! “Volkswagen started its electromobility journey back in 2013 with the launch of the e-up!, and has been systematically expanding its all-electric portfolio ever since. The two million battery electric vehicles (BEVs) supplied therefore include not only models from the current <span class=\"nowrap\">ID. family</span>, but also electric precursors such as the e-up! and the e-Golf.” I actually drove the e-up! and e-Golf back in 2013. It’s wild to think it’s been that long. And when I do think that Volkswagen has sold 2 million EVs from then to now, it does sound impressive. Let’s just hope the next 2 million come much faster.</p>\n\n<p>The good news — or better news — is that Volkswagen has become a leading EV seller, in Europe and even globally. “Volkswagen has now taken on a leading position in all-electric vehicles in Germany and throughout Europe, and is among the highest-volume providers. The Volkswagen brand is also one of the largest electric car manufacturers in the world,” the company emphasizes.</p>\n<p>“We laid the foundations for electromobility early on and are driving our transformation to an all-electric future with clear strategic priority. Our strong market position, particularly in Germany and Europe, confirms the attractiveness and competitiveness of our electric portfolio,” Sander added.</p>\n<p>Volkswagen also noted that three electric vehicle models in particular have driven many of the brand’s EV sales:</p>\n<ul>\n<li><strong><span class=\"nowrap\">ID.3</span> (approx. 628,000 vehicles delivered):</strong> The <span class=\"nowrap\">ID.3</span> was the first model based on the modular electric drive matrix (MEB) and marked Volkswagen’s entry into the new era of electromobility. It was the first model in the <span class=\"nowrap\">ID. family</span> in 2020 and made all-electric mobility accessible to a broad range of customers in the compact class for the first time. A further product upgrade of the <span class=\"nowrap\">ID.3</span> will soon be launched.</li>\n<li><strong><span class=\"nowrap\">ID.4</span> (approx. 901,000 vehicles delivered*):</strong> The <span class=\"nowrap\">ID.4</span> is a key growth driver for the brand and has played a major part in expanding Volkswagen’s presence on the global BEV markets. Apart from Germany and other European countries, the most important sales markets for the SUV model include China and the United States.</li>\n<li><strong><span class=\"nowrap\">ID.7</span> (approx. 132,000 vehicles delivered):</strong> Volkswagen expanded its portfolio in 2023 to include an all-electric saloon, followed by an estate (<span class=\"nowrap\">ID.7</span> Tourer) in the upper mid-range segment. The <span class=\"nowrap\">ID.7</span> represents the technological progress of the <span class=\"nowrap\">ID. family</span> and demonstrates how Volkswagen is introducing electromobility to a new segment with long range and a high level of efficiency and comfort.</li>\n</ul>\n<p>Yup, that’s more than 1.6 million vehicles from just those three models.</p>\n<p>All of that said, the future should be even brighter, and more electric. Volkswagen is about to bring a cheaper mass-market EV model to the world, the ID. Polo. And that won’t be the only new EV model. In fact, four new electric car models in the small car and compact segments are being launched by Volkswagen in 2026. “These new models make electromobility accessible to even more customers,” said Sander. “Our aim is to introduce attractive, affordable electric vehicles for everyday use into the high-volume small car segment and, in so doing, take the next growth steps in our transformation.”</p>\n<p>It’s great to see Volkswagen hitting the 2 million EV milestone, but I really look forward to seeing it reach 2+ million EV sales a year.</p>\n</div>",
            "link": "https://cleantechnica.com/2026/02/27/volkswagen-reaches-2-million-electric-vehicle-deliveries/",
            "pub_date": "2026-02-28 10:16:10",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "How Europe Can Meet Hydrogen Fuel Mandates Without Hydrogen Fuels",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p>When I published my recent piece on Germany’s bid to <a href=\"https://cleantechnica.com/2026/02/19/germanys-bid-to-double-hydrogen-fuel-targets-ignores-operator-demand-and-cost-signals/\">double hydrogen-based fuel targets</a> to try to justify already built and already stranded hydrogen infrastructure, readers raised important questions about compliance mechanics. One pointed out that the 1% RFNBO subtarget can be met by replacing grey hydrogen in refineries rather than putting hydrogen directly into vehicles. Another noted that renewable electricity supplied to electric vehicles can generate credits that help meet transport renewable energy obligations. Both comments go to the heart of the issue. The question is not only whether hydrogen makes economic sense in transport, but how the regulation actually allows EU member states to comply.</p>\n<p>RED III—the EU’s binding 2030 renewable energy directive setting sector-specific targets for clean energy deployment across power, heat, and transport—Article 25 requires that by 2030 at least 5.5% of energy supplied to transport comes from advanced biofuels and RFNBOs combined, with at least 1% specifically from RFNBOs. RFNBOs are renewable fuels of non-biological origin. In practice this means renewable hydrogen and hydrogen-derived synthetic fuels that meet lifecycle greenhouse gas reduction thresholds of at least 70% relative to fossil comparators. The target is framed as an energy share, not a technology mandate, and it is embedded within national fuel supplier obligation systems.</p>\n<p>The first compliance pathway is direct use of RFNBOs in transport. This includes hydrogen supplied to fuel cell vehicles and synthetic fuels such as e-methanol or e-kerosene used in internal combustion engines or aviation. On paper this is the cleanest interpretation of the rule. A kilogram of renewable hydrogen contains roughly 120 MJ of lower heating value energy, or 0.12 GJ. If delivered at €12 per kilogram—hydrogen is retailing at refueling stations at prices between €10 and €20 in early 2026, with the median under €15, so this is a generous price point—, that is €100 per GJ. By comparison, diesel at roughly €1.50 per litre equates to about €42 per GJ of fuel energy. Retail electricity for depot charging at €0.20 per kWh equates to about €56 per GJ before drivetrain efficiency. A battery electric truck converting 88% of input energy to motion delivers useful energy at roughly €64 per GJ. A modern diesel truck converting about 43% of fuel energy to motion delivers useful energy at roughly €97 per GJ. A fuel cell truck converting about 55% of hydrogen energy to motion would deliver useful energy at roughly €182 per GJ if hydrogen costs €100 per GJ. Hydrogen has to be far cheaper than any retail pump available hydrogen available today or electricity has to be much more expensive in order for hydrogen to only be twice the cost per kilometer of battery electric. The arithmetic explains operator reluctance.</p>\n<p>The second pathway, and one highlighted by readers, is the refinery route. Renewable hydrogen can replace grey hydrogen used in hydrocracking and desulfurization in oil refineries or biofuel upgrading. Grey hydrogen produced from steam methane reforming emits roughly 9 to 10 kg of CO2 per kilogram of hydrogen. Replacing that with renewable hydrogen reduces refinery emissions. Under national transposition of RED rules, the renewable hydrogen input can generate compliance credits toward the transport RFNBO subtarget, even though the final fuel sold at the pump is conventional petrol or diesel. The hydrogen becomes an upstream decarbonization input, and its cost is blended into the refinery’s output fuels.</p>\n<p>Under RED, advanced biofuels are defined primarily by feedstock rather than processing method. They are fuels produced from the waste and residue streams listed in Annex IX Part A, including agricultural residues such as straw and corn stover, forestry residues, sawdust, manure, sewage sludge, non-recyclable biological municipal waste, algae, lignocellulosic material, and other non-food cellulosic inputs. These fuels must meet lifecycle greenhouse gas reduction thresholds, generally at least 65% to 70% relative to fossil fuel comparators depending on plant commissioning date. I started on a global assessment of harvestable waste biomass and the volumes of biofuels that could be delivered from them a couple of months ago, but have been distracted by more pressing research.</p>\n<p>Crop-based biofuels such as ethanol from corn or biodiesel from rapeseed do not qualify as advanced biofuels and are subject to separate caps, typically limited to 7% of transport energy for EU bunkering. Not for the rest of the world, which has a rather different perspective on allowing the agricultural industry to sell its products more freely. Annex IX Part B includes used cooking oil and certain animal fats, which can count toward renewable transport targets but are often treated differently and capped due to supply constraints, something the market and emerging verification standards are dealing with outside of the EU. The core principle is that advanced biofuels under RED are derived from waste, residue, and non-food feedstocks with lower indirect land use change risk and demonstrable greenhouse gas savings.</p>\n<p>This route changes the economics and the optics. Instead of asking motorists to buy €200 per GJ synthetic fuels, the system spreads the additional cost of renewable hydrogen across a large fuel volume. If a refinery processes 10 million tons of crude per year and consumes 100,000 tons of hydrogen, replacing that hydrogen at a premium of €5 per kilogram would imply €500 million in additional annual cost. Spread over roughly 400 million GJ of fuel output, that is about €1.25 per GJ, or around €0.04 per liter of petrol equivalent. That is politically manageable. It is also very different from building a national hydrogen refueling network.</p>\n<p>It’s also a potential additional carbon tax on road fuels, increasing the economic pressure to electrify instead. However, strategically it would be only reasonable to apply it to refineries likely to survive the massive coming cull due to being suitable for petrochemical manufacturing or biofuel refining. It’s unlikely that a refinery that isn’t going to survive would bother.</p>\n\n<p>The third pathway is production and use of synthetic fuels derived from renewable hydrogen and captured CO2. E-methanol contains about 20 MJ per kilogram. At realistic plant gate costs above €3 per kilogram, an order of magnitude higher than fossil methanol, that equates to €150 per GJ before distribution and taxes. Synthetic fuels won’t make sense even in aviation and shipping where alternatives are limited because they will be significantly more expensive than biofuels and batteries. In road transport, they will be multiples of the cost of battery electric options on both efficiency and cost.</p>\n<p>The fourth pathway involves renewable electricity supplied to electric vehicles. RED allows renewable electricity used in transport to count toward transport renewable energy targets, and member states implement crediting systems for electricity supplied to charging infrastructure. If a charging operator supplies 100 GWh of renewable electricity annually, that is 360,000 GJ of renewable transport energy. In credit-based systems, those GJ can offset obligations that would otherwise require advanced biofuels or RFNBOs. If renewable electricity credits are cheaper to generate than renewable hydrogen credits, fuel suppliers will prefer them. In practical terms, doubling the RFNBO subtarget could increase the value of renewable electricity credits and drive more investment into charging infrastructure rather than hydrogen fueling, something that commenters pointed out as a potential upside.</p>\n<p>There are also flexibilities such as multipliers and statistical transfers between member states. In earlier iterations of RED, certain fuels counted more than once toward targets. While the 1% RFNBO subtarget is defined in physical energy terms, member state accounting practices and credit trading systems can lower the effective physical volume of RFNBO molecules required domestically. Compliance becomes a matter of credit optimization rather than molecule flows.</p>\n<p>When these pathways are viewed together, the physical amount of hydrogen that must be delivered into vehicle tanks to meet the 1% subtarget—which the EU is far from on track to meet—may be far smaller than headline interpretations suggest. A member state could likely meet all of its RFNBO obligation through biofuel treatment with green hydrogen, refinery displacement of gray hydrogen and renewable electricity vehicle charging credits, with no deployment of hydrogen vehicles. That outcome aligns with operator demand signals. Fleet managers buy trucks based on total cost of ownership. Surveys by German research institutes show battery electric trucks are preferred when charging access is available. Hydrogen rail projects in several Länder have been scaled back in favor of battery multiple units. The market is voting with capital.</p>\n<p>This brings the discussion back to Germany’s push to double RFNBO targets. Doubling the subtarget from 1% to 2% would increase the nominal requirement for renewable hydrogen or hydrogen-derived fuels. It would not change the underlying cost differential between hydrogen and electricity. Member States facing higher obligations would look for the lowest-cost compliance routes available within the rules.</p>\n<p>Policy design matters. If targets are raised without tightening rules around credit substitution—something to be hoped for—, the likely outcome is more refinery hydrogen substitution and more renewable electricity credit generation. That reduces refinery emissions and accelerates EV deployment, both of which are positive developments. It does not validate a broad buildout of hydrogen fueling infrastructure for road transport. The arithmetic continues to favor direct electrification for most light and medium duty vehicles and an increasing share of heavy duty applications. Personally, my discovery of the loopholes allowing sensible transportation repowering alternatives to count for RFNBO requirements makes me think that very smart policy makers were working around Germany’s Gruppendenken around hydrogen to pay lip service to it while allowing real decarbonization that made economic sense to proceed more rapidly.</p>\n<p>If Germany succeeds in persuading the EU to double RFNBO targets, the most probable response from member states will be pragmatic. National policies will focus on biofuel processing with renewable hydrogen, incremental refinery upgrades at sites expected to endure as petrochemical manufacturers, and expanded renewable electricity crediting for EV charging. These approaches allow compliance without committing to large scale hydrogen for energy in transport. The risk is not that Europe will be flooded with hydrogen trucks with the attendant major costs. The risk is a softer one that keeps policy debates anchored in a vision of hydrogen as a broad energy carrier, while compliance practice moves quietly toward electrification and selective industrial use. Europe needs to face reality rather than finding ways to creatively comply with fantasy.</p>\n</div>",
            "link": "https://cleantechnica.com/2026/02/27/how-europe-can-meet-hydrogen-fuel-mandates-without-hydrogen-fuels/",
            "pub_date": "2026-02-28 08:26:26",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Abandoning AI Safety Might Screw Our Cars Up",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p>If you do not follow the day-to-day drama of the artificial intelligence industry, you probably missed the news this week.<a href=\"https://time.com/7380854/exclusive-anthropic-drops-flagship-safety-pledge/\"> Anthropic, one of the leading AI labs that built its reputation on safety, quietly dropped its core safety pledge.</a></p>\n<p>To the average person, this probably sounds like inside baseball for tech bros or maybe the beginning of a paranoid article about “ex-risk” (the robots are going to kill us all). But, if you drive a modern electric vehicle or plan to buy one in the next few years, this policy shift is something that’s more likely to crash right into your dashboard.</p>\n<p>Modern EVs are essentially multi-thousand-pound rolling supercomputers. Right now, every major automaker is in a desperate race to integrate Large Language Models (chatbots) into their infotainment systems and driver assist features. But Silicon Valley’s decision to embrace a “move fast and break things” mentality with AI is going to create a massive divide in the automotive world.</p>\n<p>Giving up on these safety guardrails will force the automotive industry to split into two very distinct, very frustrating camps that make us worse off in their own ways.</p>\n<h3>Camp 1: Incumbent Auto Restricts to the Point of Annoyance</h3>\n<p>Traditional automakers are inherently risk averse. They have decades of experience dealing with massive recalls, liability lawsuits, and federal safety standards. If all of the AI companies drop their liability shields, these legacy brands are going to panic and clamp down.</p>\n<p>If a standalone AI app gives you bad advice, you blame the app. If your dashboard AI tells you the wrong thing about how to handle regenerative braking while taking a travel trailer down a steep grade and you crash, the automaker is the one staring down a massive lawsuit.</p>\n<p>To protect themselves, Incumbent Auto (IA) will heavily “sandbox” their AI integrations with highly restrictive system prompts. Instead of a truly smart, free-thinking co-pilot that can intelligently manage your battery telemetry and route planning, we are likely going to get a heavily restricted voice assistant that’s good at about nothing.</p>\n<p>Instead of getting a voice assistant that can tell you about places to stop that are along your route instead of ten miles behind you, it will be neutered to the point of annoyance, refusing to answer anything beyond what is already printed in the owner’s manual just to avoid legal risk.</p>\n<h3>Camp 2: The Tech Car Bros Throw Caution to the Wind</h3>\n<p>Then you have the other side of the industry. The Tech Car Bros are already as allergic to caution as the incumbents are risk averse. They treat public roads like a Silicon Valley beta test, and they are going to view Anthropic’s pivot as a green light to put “<a href=\"https://www.npr.org/2025/07/09/nx-s1-5462609/grok-elon-musk-antisemitic-racist-content\">Mechahitler</a>” into your Tesla and hope for the best.</p>\n<p>Speaking of Tesla, it spent years selling the promise of “Full Self-Driving” only to execute a clever legal switcheroo, rebranding it to<a href=\"https://cleantechnica.com/2024/05/21/45-minute-tesla-full-self-driving-supervised-test-drive-3-interventions-video/\"> “Supervised Full Self-Driving.”</a> In my view, it is a brilliant way to shift the liability back to the driver while continuing to push beta software to millions of cars on public streets.</p>\n<p>You also have companies like <a href=\"https://comma.ai/\">Comma.ai</a> in the aftermarket space. While it doesn’t sell an autonomous vehicle system, it does enable drivers to experiment with open source software that does it. This shifts not only supervisory liability to the driver, but development and testing liability as well. Most people take this responsibility very seriously, but there are a few idiots who’ve gotten themselves and other people on the road into serious trouble hacking at the code and removing safeguards Comma built into its software to be good corporate citizens.</p>\n<p>For this group, Anthropic backing away from safety pledges validates the exact “throw caution to the wind” culture either they or some of their users already operate in. If the leading AI labs do not care about guardrails, the Tech Car Bros will just follow what the other bros are doing. We will see beta self-driving software pushed to public roads faster than ever to appease shareholders, prioritizing data collection over proven reliability.</p>\n<h3>Waking the Regulatory Bear</h3>\n<p>The whole reason AI companies signed these voluntary safety pledges in the first place was to keep government regulators at bay. By dropping them, they practically guaranteed that federal agencies are going to step in.</p>\n<p>Right now, the Tech Car Bros might be loving the current administration’s push to <a href=\"https://www.nhtsa.gov/press-releases/av-framework-plan-modernize-safety-standards\">remove regulatory barriers for autonomous vehicles</a>. But the political winds can change rapidly after the 2026 and 2028 elections. When an agency like the National Highway Traffic Safety Administration decides to regulate emerging software under a tighter administration, they tend to use a sledgehammer.</p>\n<p>In my opinion, the tech bro camp will predictably complain and blame “the libs” for over-regulating when the hammer inevitably falls. But they are not idiots. They know this regulatory backlash is coming, and they are doing it anyway to capture market share today in the hopes of massing a user base ready to fight for them later.</p>\n<p>NHTSA is already deeply skeptical of beta software controlling heavy vehicles. If sweeping AI regulations get passed because the Tech Car Bros push things too far, they will catch the risk-averse Incumbent Auto camp in the crossfire. We could see a future where simple software updates to improve battery thermal management get bogged down in months of bureaucratic red tape simply because the underlying code falls under a new, broad definition of “AI.”</p>\n<h3>The Bottom Line</h3>\n<p>Silicon Valley might be comfortable moving fast and breaking things, but breaking a line of code on a website is vastly different from breaking the code on a heavy electric truck doing 75 mph down the interstate.</p>\n<p>By backing away from their own guardrails, AI companies are forcing the auto industry into a corner. Half the market is going to annoy you with hyper-cautious, locked-down software, while the other half treats your daily commute like a live science experiment.</p>\n<p>But, the industry doesn’t have to put itself and us through all this hassle. If they’d keep their own voluntary safety and responsibility pledges, we wouldn’t have to worry about automakers and/or the government clamping down.</p>\n</div>",
            "link": "https://cleantechnica.com/2026/02/27/abandoning-ai-safety-might-screw-our-cars-up/",
            "pub_date": "2026-02-28 01:31:26",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "VinFast Deepens UAE Charging Network as Middle East EV Strategy Gains Traction",
            "description": "<div class=\"cm-entry-summary\">\n\n<strong></strong>\n\n<p>VinFast has signed a memorandum of understanding with PlusX Electric, a DEWA-certified provider of charging and mobility solutions, to enhance charging access and customer support for its UAE customers. The collaboration aims to deliver portable chargers, mobile emergency services, and integrated digital tools, addressing key barriers to EV adoption in the region.</p>\n<p>This move reinforces VinFast’s strategic focus on the Middle East, where Gulf nations are accelerating clean energy transitions. By partnering with a locally approved infrastructure specialist, VinFast seeks to build confidence among drivers of its VF6, VF7, VF8, and VF9 models, all available through exclusive distributor Al Tayer Motors.</p>\n<h3 style=\"text-align: center;\">Expanding charging and support options</h3>\n<p>The agreement covers deployment of portable EV charging pods for flexible on-demand use, alongside mobile charging services for urgent situations and roadside emergency power to reduce downtime. PlusX Electric is positioned to handle installation and maintenance of home, office, and DC fast chargers for residential, commercial, and fleet customers, ensuring compliance with UAE standards.</p>\n<p>Digital integration will simplify service bookings, real-time updates, and potential insurance offerings through the PlusX app. Co-branded charging equipment will create a unified ecosystem, blending VinFast’s vehicle lineup with reliable infrastructure tailored to local needs like handling extreme heat and long-distance travel.</p>\n<p>“This partnership delivers comprehensive support that matches the premium quality of our EVs, making ownership seamless for Middle East customers,” said Do Hoai Linh, CEO of VinFast Middle East, in a statement to the press. “By working with a DEWA-approved partner that understands local regulatory requirements and operational realities, we aim to make EV ownership simpler, more dependable, and better aligned with the expectations of customers in the region.”</p>\n<p>“PlusX Electric brings localized expertise in charger supply and installation, mobile charging operations, and fleet<br/>\nenablement. Together with VinFast, we look forward to delivering practical, scalable solutions that enhance service reliability, reduce range anxiety, and support the continued growth of sustainable mobility in the region,” Chintan Sareen, founder and CEO of PlusX Electric, stressed. “Our local expertise in charger operations and fleet solutions will drive scalable sustainable mobility alongside VinFast’s innovative vehicles.”</p>\n<h3 style=\"text-align: center;\">Building on UAE market entry</h3>\n<p>VinFast entered the UAE market in October 2024 with a flagship Dubai showroom operated by Al Tayer Motors, followed by a public charging partnership with Charge&amp;Go. The VF6 compact SUV targets entry-level buyers, while the VF7, VF8, and VF9 offer midsize to full-size options with ranges up to 263 miles and fast-charging capabilities suited to urban and highway use.</p>\n<p>The brand’s regional footprint now includes exclusive dealerships in Qatar with Al Mana Holding, which opened a Doha showroom, and Oman’s Bahwan Automobiles. In September 2025, VinFast secured 24/7 roadside assistance across six Gulf countries through the Arabian Automobile Association, covering Saudi Arabia and beyond.</p>\n<h3 style=\"text-align: center;\">Aligning with Gulf EV momentum</h3>\n<p>The Middle East represents a priority market for VinFast amid global expansion. UAE EV sales rose 45% in 2025 within a $1.95 billion market, driven by government incentives, DEWA’s charger network, and diversification from oil. Saudi Arabia’s Vision 2030 and Qatar’s post-World Cup infrastructure upgrades create similar opportunities for fleet electrification and premium EVs.</p>\n<p>VinFast delivered around 200,000 vehicles globally in 2025, doubling from prior years. Though, Middle East volumes remain in early growth stages. The PlusX deal tackles range anxiety—a top consumer concern in surveys—while fleet solutions position VinFast for ride-hailing as well as government and corporate contracts.</p>\n<p>This infrastructure push signals VinFast’s sustained investment in the Gulf, where $100 billion-plus in green pledges align with the company’s battery subscription model and over-the-air updates. As Saudi showrooms and Qatar fleet pilots advance, such partnerships fortify after-sales reliability essential for scaling in heat-intensive climates.</p>\n</div>",
            "link": "https://cleantechnica.com/2026/02/27/vinfast-deepens-uae-charging-network-as-middle-east-ev-strategy-gains-traction/",
            "pub_date": "2026-02-28 00:56:27",
            "source": "vietnamnews",
            "kind": 1,
            "language": "zh-HK"
        }
    ]
}