{
    "data": [
        {
            "title": "林佳龍談如何記憶二二八？民主轉型經驗是台灣與國際共通的語言",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>二二八事件79週年，外交部長林佳龍透過社群發文表示「往事並不如煙」，歷史不會隨時間流逝而沉默，會以不同形式，在不同世代心中回響。1947年的二二八事件，以及隨後的軍事鎮壓與清鄉行動，接續於1949年開始長達38年的戒嚴與白色恐怖，成為台灣歷史難以抹滅的傷痕。那段歲月深刻改變台灣社會，也影響了一代又一代生活在這片土地上的人民。</p><!--1--><p>\n</p><p>\r\n林佳龍指出，影視作品往往是社會大眾認識歷史與形塑記憶的重要入口。從經典電影《悲情城市》、《天馬茶房》、《超級大國民》，到近年的《返校》、《流麻溝十五號》，乃至近期描繪白色恐怖氛圍的《大濛》，都讓二二八與白色恐怖的歷史再次被看見與討論。這些作品喚起世代之間的對話，也幫助新一代台灣人更貼近那段發生在這片土地上的血淚與創傷，使歷史不再只是課本上的名詞，而是有溫度、有情感的生命故事。</p><!--2--><p>\n</p><p>\r\n然而，也有其他作品雖取材自真實歷史事件，卻因詮釋者的立場、角色內容未經當事人或家屬授權，甚至在敘事上模糊責任、誤導史實，為真正加害者卸責，而引發爭議。林佳龍表示，這提醒我們，歷史從不只是「發生過什麼」，更關乎「如何被詮釋、如何被述說」。而詮釋的角度，將深刻影響我們如何記憶、理解「我們從何處來？我們是誰？」。</p><!--3--><p>\n</p><p>\r\n林佳龍表示，歷史上的二二八有著苦痛與悲情。79年前的二二八事件中，醫師、畫家、學者、政治家、法官、檢察官與許多台籍社會菁英和無辜民眾遭逮捕、失蹤或喪命。關心平等、自由、國家與社會未來的人，在獨裁威權體制下被視為威脅。其後長期的政治禁忌與社會沉默，使冷漠和恐懼滲入日常。46年前的2月28日，發生於美麗島事件審判期間的「林宅血案」，至今仍未釐清真相，威權的陰影反覆提醒我們「民主從來不是理所當然」。</p><!--4--><p>\n</p><p>\r\n林佳龍同時指出，歷史上的二二八也有希望與團結。2004年的2月28日，數百萬台灣人民以「牽手護台灣」人鏈行動，從北到南連結彼此，其靈感來自1989年愛沙尼亞、拉脫維亞與立陶宛人民以雙手連結自由的長城串起「波羅的海之路」，向世界宣示追求自主與尊嚴的決心。</p><!--5--><p>\n</p><p>\r\n林佳龍表示，時空環境推移，台灣與國際民主夥伴仍然共享那份無懼威權、堅持由人民決定自身命運的信念與勇氣。他身為外交部長，在接待國際訪賓時，常分享台灣民主轉型的經驗。林佳龍說，這段歷史記憶不僅屬於台灣內部政治，更是所有尊重人權、追求正義與捍衛自由者共通的語言。</p><!--6--><p>\n</p><p>\n</p><p>\n</p><p>\n</p><p>\n</p><p>\r\n林佳龍提到，今年也是台灣總統直選30週年，象徵台灣人民作為國家主體，以民主程序賦予政府政治正當性、確立國家權力的產生和行使具備民意依歸的歷史轉折，也讓台灣破除威權走向新生的國家。在跨越威權30年後，試圖併吞台灣的外部威脅仍然存在、不同課題也持續挑戰著台灣的民主社會。</p><!--7--><p>\n</p><p>\r\n林佳龍引用電影《天馬茶房》台詞指出：「未來，它一直來一直來，不管好或壞它都一直來。我們如果放棄，我們就沒有未來。」當年二二八事件的受難者身影逐漸遠去，歷經威權與轉型的世代慢慢凋零；而在自由空氣中成長的新世代，正承接這段歷史的記憶與重量。我們該如何記憶二二八？不同世代、不同立場的人們，或許會給出不盡相同的答案。</p><!--8--><p>\n</p><p>\r\n林佳龍強調，民主社會本就能容納不同的歷史記憶與詮釋視角，但不能放棄的是「台灣是台灣人的台灣」。唯有台灣人民，才有權利以民主方式共同決定自己的方向與未來，一起回答「我們何去何從」這道屬於世代台灣人的習題。</p><!--9--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/5612/9349795?from=edn_newestlist_rank",
            "pub_date": "2026-02-28 13:21:34",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "美股波動放大 非投資級債抗震優勢足",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>科技股與AI估值疑慮未平，川普關稅政策變數再起，加上美國可能對伊朗展開軍事行動持續推高全球地緣風險，美股近期波動加劇，史坦普500指數2026年前八周僅三周上漲，五周下跌，而美國非投資等級債同期間漲幅與美股相近，但僅有一周下跌，彰顯其在市場波動下相對抗震優勢。</p><!--1--><p>\n</p><p>\r\n富蘭克林證券投顧表示，美股牛市多年，隨股價來到高位，市場易受消息面紛擾而放大波動。反觀擁有較高收益的非投資等級債券，其債息收入往往能在市場震盪的時候發揮下檔支撐。觀察今（2026）年以來非投資等級債上漲0.92%，與美股表現相當，若自去<a class=\"systex-link\" href=\"https://money.udn.com/industry/company/2025\" target=\"_blank\">（2025）</a>年12月10日聯準會啟動降息後來看，非投資等級債漲幅更達美股的三倍。</p><!--2--><p>\n</p><p>\r\n富蘭克林坦伯頓公司債基金經理人葛倫‧華勒表示，非投資等級債前景樂觀，基本面良好。目前整體財務體質仍屬穩健，營收與獲利延續成長動能，償債能力亦逐步企穩。觀察最新美國企業財報，截至2月20日85%史坦普500企業公布財報，72.6 %的公司每股純益（EPS）優於預期，平均成長達13.9%（倫敦證交所I/B/E/S）。此外，不僅企業獲利增長潛力仍佳，鑒於經濟仍相對穩固與政策刺激效應，預期2026年非投資等級債券整體違約率有望維持低檔。</p><!--3--><p>\n</p><p>\r\n葛倫‧華勒指出，美國消費動能強勁，企業營收與現金流穩定，有助於公司債發行企業維持良好償債能力。2026年美國民眾更享有大而美法案帶來的退稅收入，可進一步刺激消費與企業獲利，支撐公司債市基本面，且美國經濟也相對更具韌性，更能受惠人工智慧發展趨勢，整體增長前景更優於歐洲。葛倫‧華勒進一步說明，當前非投資級債利差已低，可能壓縮資本利得空間，但債息收益仍普遍高於其他債券券種，未來儘管利差擴大時，也容易吸引投資買盤回流。</p><!--4--><p>\n</p><p>\r\n富蘭克林坦伯頓公司債基金主要投資於美國非投資等級公司債，在當前市場波動上揚環境下，採取「品質優先」策略，更傾向於B與BB等級債券尋求較高品質機會，並精選CCC等級債券。產業布局則以可受惠川普政策方向為主，如較不受關稅政策變化影響的金融產業、受惠新屋持續建造的建築產業等。經理團隊精準操盤的成效明顯，短中長期報酬優於同類型平均。可做為穩健型或積極型投資人欲分享美國經濟成長又可有收息機會的投資選項。<!-- /.photo --><script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--5--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/5607/9349798?from=edn_newestlist_rank",
            "pub_date": "2026-02-28 13:21:32",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "228連假國道上午8起事故　下午國5北向恐塞到深夜",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>今天是228連假第2天，根據交通部高速公路局統計，截至上午11時共發生8起事故，預計下午12路段容易壅塞。其中國5北向宜蘭至坪林路段預計下午1時湧現車潮，可能塞到深夜。</p><!--1--><p>\n高公局發布新聞稿指出，今天截至上午11時，國道全線交通量為29.4百萬車公里，預估今天交通量為107百萬車公里，為平日年平均93百萬車公里的1.2倍，仍在預期流量範圍內。</p><!--2--><p>\n根據高公局統計，今天截至上午11時共發生8起事故，包括在國1北向342.1公里處、國3北向35公里各發生小客車追撞事故，相關事故均導致車輛回堵、影響整體車流。</p><!--3--><p>\n高公局預計，今天下午重點壅塞路段包括國1北向西螺-埔鹽系統、苗栗-湖口、圓山-大華系統；國3北向竹山-中興、草屯-霧峰、大山-香山、關西-大溪；國5南向南港系統-頭城、北向宜蘭-坪林；國4西向潭子系統-豐勢；國6西向東草屯-霧峰系統；國10西向仁武-左營端等路段。</p><!--4--><p>\n根據高公局路況預報，國5北向宜蘭至坪林路段預計下午1時湧現車潮，可能塞至深夜；至於國1北向苗栗至湖口、國3北向關西至大溪路段，可能自下午4時起陸續出現壅塞，預計晚間9時後逐步紓解。</p><!--5--><p>\n高公局建議，用路人透過高速公路1968網站及App並於行駛途中收聽警廣掌握即時路況資訊，避開國道壅塞路段及時段。</p><!--6--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/122328/9349761?from=edn_newestlist_rank",
            "pub_date": "2026-02-28 13:16:07",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "賴總統：林宅血案證據在威權時代遭系統性破壞",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>總統賴清德今天表示，與林宅血案相關檔案已全數解密，遺憾的是，當年許多證據遭系統性破壞，「誰能銷毀檔案？只有當權政府才有這樣的能力」。</p><!--1--><p>\n228事件79週年，賴總統、行政院長卓榮泰等人今天出席在高雄市立歷史博物館前舉辦的228事件79週年中樞紀念儀式。儀式後賴總統等人至會場對面的228和平紀念公園向受難者獻花，並行三鞠躬禮。</p><!--2--><p>\n賴總統致詞時表示，上任後要求加速政治檔案開放，目前已有14萬件政治檔案完整開放，而與林宅血案相關的檔案也在歷年清查全數解密，但令人遺憾的是，在經過詳盡追查後發現，「林宅血案和當年的資料並未完整，甚至口述資料也並非真實正確」。</p><!--3--><p>\n他說，根據林宅血案調查報告可看到，當年許多證據遭系統性毀滅，凶手是在林宅被嚴密監控的情況下進行謀殺，情治單位的檔案在黨國時期就被系統性銷毀，「誰能夠銷毀檔案？誰能讓情治單位阻擋司法偵查？只有當權的政府才有這樣的能力。」這也凸顯當年威權政府是如何用國家暴力傷害人民、造成社會恐慌。</p><!--4--><p>\n總統表示，這段時間有很多人走進林宅血案發生地義光教會，也希望世世代代的台灣人都能走進各地的歷史現場，反省、思考威權統治對人權、自由的破壞，共同深化台灣的民主發展。受難者家屬要走出悲情、化悲情為力量，深化台灣民主，讓悲劇不再發生。</p><!--5--><p>\n賴總統強調，228事件也教會世人「民主從來不是天上掉下來的禮物」，只有誠實面對歷史、追求真相，才能真正實現社會和解，這也是為什麼每一年的228都要舉辦紀念儀式，這是提醒大家以歷史為借鏡，歷史不能重演，「只有在民主制度下才能避免國家機器再度傷人」。</p><!--6--><p>\n另外，總統也提到，中國近年用盡各種方式，企圖併吞台灣，而身為總統，最大的使命就是守護台灣，他將團結朝野和人民共同維護民主。他重申，和平雖然無價，但對和平要有理想，不能有幻想，「放棄主權的談和，來推進統一，這不是真和平」，只有用實力作後盾的和平才是真和平。</p><!--7--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/7307/9349783?from=edn_newestlist_rank",
            "pub_date": "2026-02-28 13:16:06",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "若核彈襲美Claude可否協助擊落？傳Anthropic執行長回答激怒五角大廈",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>美國國防部與人工智慧公司Anthropic的對峙升高。美國總統川普27日下令聯邦機構停用Anthropic產品，國防部長赫塞斯隨後在X宣布將Anthropic列為供應鏈風險。Anthropic聲明回應，將走法律途徑挑戰供應鏈風險的認定。華盛頓郵報報導，雙方的不和因為一個核武來襲假設情境而加深，Anthropic執行長阿莫戴（Dario Amodei）當時的回應讓國防部感到不滿。</p><!--1--><p>\n</p><p>\r\n一名國防部官員表示，上個月一場會議中，五角大廈的科技主管討論聚焦於一個生死攸關的核武情境：如果一枚洲際彈道飛彈射向美國，軍方可否運用Anthropic的Claude AI系統協助將其擊落？</p><!--2--><p>\n</p><p>\r\n在這類情境下，科技能力與反應速度至關重要，從偵測到反制，決策時間往往在分秒之間。該名官員指出，Anthropic執行長達阿莫戴的回應令五角大廈感到不滿。官員形容他的回答是：「你們可以打電話給我們，我們再想辦法解決。」</p><!--3--><p>\n</p><p>\r\nAnthropic發言人否認阿莫戴曾作出上述回應，稱相關說法「完全不實」，並表示公司已同意Claude用於飛彈防禦。但官員指出，此事以及另一宗涉及使用Claude協助逮捕委內瑞拉領導人馬杜洛（Nicolás Maduro）的事件，近來都成為公司與五角大廈升高對峙的導火線。</p><!--4--><p>\n</p><p>\r\n紐約時報國安評論員漢尼根（W.J. Hennigan）指出，Anthropic在2024年底成為首家參與美國機密軍事網路計畫的大型AI實驗室。儘管軍方合約占Anthropic業務的比例很小，但Claude卻是美國國安體系中應用最廣泛的模型。該技術使世界各地的美軍與情報人員能夠在瞬間整合並0叉比對海量的機密資訊。 據報今年1月，美軍在抓捕委內瑞拉領導人馬杜洛的行動中就使用這項技術。</p><!--5--><p>\n</p><p>\r\nAnthropic發言人曾指出，公司未曾與國防部討論將Claude用於特定軍事行動。據報抓捕行動後不久Anthropic便過問此事，讓五角大廈感到不快。赫塞斯當時便直言，不會「採用不允許你打仗的AI模型」。</p><!--6--><p>\n</p><p>\r\n漢尼根則指出，五角大廈終止合作並未讓美國更安全，反而不必要地削弱美國的自衛能力。國防部可能需要6個月的時間才能從內部電腦系統中移除Claude，還得用另一個AI模型填補，而五角大廈尚未找到合適的替代方案。<!-- /.photo --><script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--7--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/5599/9349763?from=edn_newestlist_rank",
            "pub_date": "2026-02-28 13:06:42",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "2026上海全球投資促進大會3月14日開幕 將邀近500家內外企業與會",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>2026上海全球投資促進大會暨「投資上海」活動周將於3月14日開幕，大會以「春啓申城‧創領未來」為主題，今年主會場設在「上海東方樞紐國際商務合作區」，將邀請近500家大陸國內外知名企業參加，包括戴爾、阿斯利康、GE、賽諾菲等行業龍頭企業，也有博楓資產、KKR、啓明創投等知名投資機構，還有MiniMax、追覓科技等新銳創新力量。</p><!--1--><p>\n</p><p>\r\n上海市投促辦（上海市經濟信息化委）主任湯文侃在2月28日的記者會上表示，大會期間將舉辦「1+2+N+X」系列活動，包括1場高規格主推介會、兩場政企圓桌會、N場洽談對接活動和X場主題招商活動。</p><!--2--><p>\n</p><p>\r\n湯文侃稱，今年大會將聚焦培育新質生產力，全面展現上海產業生態優勢：發布一批賦能平台，比如智算資源、語料供給、支持企業「走出去」服務等公共平台；智慧終端軟硬適配、民用飛機先進製造、具身智能零部件等中試平台；以及國地中心人形機器人訓練場、高級別自動駕駛引領區、新型航空器試飛基地等標誌性場景；落地一批重大項目，比如東盛合芯三維晶片集成製造、通用航空發動機研發生產基地、米其林開放創新中心等；推介一批重點地塊，精選60餘幅優質工業、研發、商辦地塊，總面積超1.3萬畝。</p><!--3--><p>\n</p><p>\r\n關於當前上海投資機遇，上海市投促辦（市經濟信息化委）副主任蒲亞鵬舉例說，上海是全球AI產業發展和創新高地。下一步，C919大型客機、可重複商業火箭、商業衛星、大型LNG運輸船、大型郵輪等都在加速批產擴能，低空航空器、通航動力，深海採礦等也在前瞻佈局，上海在這些領域的產業鏈上都充滿機遇。</p><!--4--><p>\n</p><p>\r\n值得注意的是，今年主會場設在「上海東方樞紐國際商務合作區」，同時也將為該自由貿易區再度做功能落實驗證。上海東方樞紐國際商務合作區管理局副局長趙宇剛表示，國際商務合作區聚焦更高水平對外開放，推動各類創新要素資源跨境便利流動，尤其是將「一線放開、二線管住」的制度從貨物向自然人拓展，構建了覆蓋人員、行李物品、貨物的跨境便利化政策體系。</p><!--5--><p>\n</p><p>\r\n上海東方樞紐國際商務合作區以跨境商務交流為核心，疊加綜合保稅區政策與人員流動便利化措施，目標於2030年全面建成國際化功能區，2025年7月1日「上海東方樞紐國際商務合作區管理辦法」頒布實施，同年8月確認將於年底前實現先行啟動區封閉運，預計在2028年完成全域封閉運作。</p><!--6--><p>\n</p><p>\r\n據會上透露數據，2025年上海全市累計落地重點項目4,463個，涉及投資額人民幣1.26兆元，豐田雷克薩斯、C919二期、中國聚變能源等一批重大產業項目落地建設，新集聚海內外人才近15萬人。<!-- /.photo --><script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--7--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/5603/9349757?from=edn_newestlist_rank",
            "pub_date": "2026-02-28 13:01:36",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "228連假國道上午8起事故　下午國5北向恐塞到深夜",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>今天是228連假第2天，根據交通部高速公路局統計，截至上午11時共發生8起事故，預計下午12路段容易壅塞。其中國5北向宜蘭至坪林路段預計下午1時湧現車潮，可能塞到深夜。</p><!--1--><p>\n高公局發布新聞稿指出，今天截至上午11時，國道全線交通量為29.4百萬車公里，預估今天交通量為107百萬車公里，為平日年平均93百萬車公里的1.2倍，仍在預期流量範圍內。</p><!--2--><p>\n根據高公局統計，今天截至上午11時共發生8起事故，包括在國1北向342.1公里處、國3北向35公里各發生小客車追撞事故，相關事故均導致車輛回堵、影響整體車流。</p><!--3--><p>\n高公局預計，今天下午重點壅塞路段包括國1北向西螺-埔鹽系統、苗栗-湖口、圓山-大華系統；國3北向竹山-中興、草屯-霧峰、大山-香山、關西-大溪；國5南向南港系統-頭城、北向宜蘭-坪林；國4西向潭子系統-豐勢；國6西向東草屯-霧峰系統；國10西向仁武-左營端等路段。</p><!--4--><p>\n根據高公局路況預報，國5北向宜蘭至坪林路段預計下午1時湧現車潮，可能塞至深夜；至於國1北向苗栗至湖口、國3北向關西至大溪路段，可能自下午4時起陸續出現壅塞，預計晚間9時後逐步紓解。</p><!--5--><p>\n高公局建議，用路人透過高速公路1968網站及App並於行駛途中收聽警廣掌握即時路況資訊，避開國道壅塞路段及時段。</p><!--6--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/7307/9349761?from=edn_newestlist_rank",
            "pub_date": "2026-02-28 13:01:35",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "川普德州造勢談能源　未表態參議員初選偏好人選",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>美國總統川普今天在德州南部宣傳他的經濟與化石燃料政見，但不願透露在德州即將舉行的聯邦參議員共和黨初選中，他將支持3名參選人中的哪一人。</p><!--1--><p>\n路透社報導，在3月3日投票前，川普一直與黨內這場混亂的參議員初選保持距離。他這次訪問德州聖體城（Corpus Christi），讓自己靠近數個選情激烈的聯邦眾議員選區，當地的西語裔選民在全國範圍對共和黨而言是重要的選民群，可能將決定11月期中選舉的結果。</p><!--2--><p>\n川普戴著「讓美國再次偉大」（Make America GreatAgain）的紅色帽子現身，在海濱造勢活動上對數以百計的支持者發表演說，他身後停了一艘船隻，說這艘船運載來自美國「新朋友與夥伴」委內瑞拉的石油。</p><!--3--><p>\n川普誇耀自己一心一意增加化石燃料產量帶來的結果，儘管化石燃料被指為氣候變遷的元凶。他說他的政策讓汽油價格降下來、促進經濟成長。數據顯示，自去年1月以來，汽油價格下降約4%。</p><!--4--><p>\n川普說：「我們正在見證前所未見、具歷史意義的美國能源繁榮。」</p><!--5--><p>\n川普訪問德州前，德州共和黨員萬姆斯甘斯（LeighWambsganss）儘管獲得川普背書，仍輸掉德州州參議會選舉，她在選後警告，這對共和黨來說是「一記警鐘」。</p><!--6--><p>\n川普呼籲支持者踴躍投票。他說：「我們不想輸掉期中選舉。我們必須贏得期中選舉。」</p><!--7--><p>\n川普才剛發表完國情咨文演說，他在演說時試圖在民生負擔與移民執法議題上與民主黨劃清界線，兩黨都希望在今年稍晚奪回國會掌控權。</p><!--8--><p>\n期中選舉向來被視為對在位總統的檢驗，川普已警告如果他的政黨失勢，他的施政方針將受到阻撓。但首先，深具保守色彩的德州共和黨人必須先決定，他們想派誰出馬征戰11月大選。</p><!--9--><p>\n民調顯示，在德州選情進入割喉戰的選區，自2002年在任的聯邦參議員柯寧（John Cornyn）落後兩名挑戰者，分別為德州檢察長派克斯頓（Ken Paxton）與聯邦眾議員韓特（Wesley Hunt）。</p><!--10--><p>\n川普今天向媒體表示，他已「差不多」決定好將支持哪位參選人，但現在還不願公布。</p><!--11--><p>\n在造勢活動上，川普說「這將會是一場很有看頭的選舉」，接著點名到場的每名參選人，沉浸於三強鼎立的選戰局面。<script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--12--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/10511/9349750?from=edn_newestlist_rank",
            "pub_date": "2026-02-28 12:56:13",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "反思歷史教訓　英、德駐台機構發文紀念二二八",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>今天是228和平紀念日，英國在台辦事處與德國在台協會皆透過臉書發文紀念228事件。英國在台辦事處表示，228提醒著人們台灣追求和平與民主的歷程，並反思歷史教訓；德國在台協會指出，民主社會對於受害者皆有義務，繼續努力釐清事實並為受難者平反。</p><!--1--><p>\n英國在台辦事處上午於官方臉書粉絲專頁發文指出，在英國，英國人以「永誌不忘」（Lest weforget）紀念國殤紀念日（Remembrance Day），呼籲人們不要忘記前人為自由和平的犧牲。</p><!--2--><p>\n英國在台辦事處表示，在台灣，許多人於228和平紀念日，用「毋通袂記」（m̄-thang buē-kì）表達相近的呼籲，以記憶歷史並且和解，這一天不只紀念1947年的228事件，更提醒著人們台灣追求和平與民主的歷程，並反思歷史教訓。</p><!--3--><p>\n英國在台辦事處指出，許多社會在追求和平、真相和正義的過程中，承受難以言喻的集體傷痛，這些也是英國和台灣的共享價值；在變動的世界中，紀念過去對保存身份認同和珍惜自由的社會至關重要。</p><!--4--><p>\n德國在台協會上午也透過官方臉書粉絲專頁發文表示，在台灣，2月28日這天是紀念1947年因鎮壓而受害的人士，歷史的教訓很清楚，國家暴力之下的受害者幾乎都是平民百姓，經常也包括婦女與兒童，民主體制的社會與重視人權是重要的前提，以避免類似事件再次發生。</p><!--5--><p>\n德國在台協會指出，像德國與台灣這樣的民主社會，對於受害者皆有義務，繼續努力釐清事實並為受難者平反，並同時發布2019年由時任德國在台協會處長王子陶（Thomas Prinz）與時任駐德代表謝志偉，簽署台德轉型正義合作意向書的照片。<script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--6--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/7307/9349748?from=edn_newestlist_rank",
            "pub_date": "2026-02-28 12:56:11",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "日美2026利刃軍演　日媒：已確認飛彈反擊程序",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>日媒披露，日本計劃3月部署作為反擊能力核心的長程飛彈，在此之前，日本自衛隊與美軍於最近實施的聯合指揮所演習，已確認攻擊敵方飛彈發射據點等地的「反擊能力」程序。</p><!--1--><p>\n「讀賣新聞」今天引述消息人士的說法披露這則消息，而美日雙方盼藉此為日本持有反擊能力飛彈做好準備，並有意藉此提升美日的嚇阻力。</p><!--2--><p>\n美日雙方的聯合演習「利刃」（Keen Edge）每兩年舉辦一次，主要目的在於透過指揮所演習確認指揮系統等事務。今年的演習於1月29日到2月5日舉行，期間確認上述「反擊能力」相關程序。</p><!--3--><p>\n而日本去年剛成立的統合作戰司令部，今年也首度參加「利刃」演習。統合作戰司令部為統一指揮陸海空自衛隊的常設機構，主要任務之一為運用長程飛彈。</p><!--4--><p>\n而今年的演習假想日本西南群島發生緊急事態，並著眼行使反擊能力。消息人士透露，日本若遭受敵國攻擊，日本政府認定為被武力攻擊的「武力攻擊事態」，日本自衛隊與駐日美軍合作之下，已經確認選定攻擊目標，並朝敵國內的飛彈發射據點，發射長程對地飛彈的步驟。</p><!--5--><p>\n關於日本的長程飛彈，日本國產的12式陸基反艦飛彈（12式地對艦誘導彈）改良過後，射程能超過1000公里，預計在3月底前部署於日本熊本市的陸自健軍駐屯地。</p><!--6--><p>\n同時，日本也計劃於2027年度在航空自衛隊的戰機，配備12式的能力向上型；日本海上自衛隊的護衛艦「鳥海號」（Chokai）目前正在美國接受改裝，之後預定配備射程約1600公里的美國製戰斧巡弋飛彈。</p><!--7--><p>\n報導指出，日本周邊的中國、俄羅斯、北韓正在加速開發低空、雷達難以偵測且以不規則軌道滑行的極音速飛彈等兵器。對此，日本與美國加強因應能力與嚇阻力已經成為當務之急。</p><!--8--><p>\n另外，駐日美軍司令部為了與自衛隊的統合作戰司令部合作，去年新設擁有戰鬥指揮權的「統合軍司令部」，希望能確實推動雙方提升相互運用能力。<script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--9--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/5599/9349751?from=edn_newestlist_rank",
            "pub_date": "2026-02-28 12:56:10",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "花蓮逾百歲228受難者敲響和平鐘 將希望留給下一代",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>花蓮228關懷協會今天舉行追思音樂會，101歲的受難者廖丙盛帶領敲響和平鐘。他致詞表示，活到這個年紀，很多事情都淡了，有些記憶一輩子都不會忘記，選擇將希望留給下一代。</p><!--1--><p>\n花蓮228追思音樂會上午在和平廣場舉行，縣長徐榛蔚、國民黨立法院黨團總召傅崐萁等人出席，並依序獻花、向受難者及家屬致意，由受難者廖丙盛代表敲響和平鐘。</p><!--2--><p>\n廖丙盛每年都與妻子出席追思會，但妻子去年離世，今年由兒子及孫女們陪同。廖丙盛身體不如以往，今天坐在輪椅上簡單致詞。</p><!--3--><p>\n廖丙盛說，「100多年來的人生，有些記憶從未離開我，有些記憶一輩子不會忘記，到這年紀很多事情都淡了」。隨後由兒子廖建智代替他說出這些年的心路歷程。</p><!--4--><p>\n廖丙盛22歲時任教於花蓮港廳富里南國民學校，晚上在宿舍莫名被憲兵帶走，被槍托毆打、被灌水接受審訊，此後長達半年，每週都須前往花蓮市接受審訊。</p><!--5--><p>\n廖丙盛透過致詞稿表示，當時心裡只有一個念頭，只想好好活著、好好回家，這些事很少對家人說，直到政府成立關懷單位，才慢慢說出過往經歷。</p><!--6--><p>\n他表示，許多年來選擇沉默，不是因為忘記、不是因為不痛，而是不想讓下一代活在恐懼中，希望家人可以平安長大，不必背負過去的陰影。</p><!--7--><p>\n「我走過恐懼，但我選擇把希望留給下一代。」廖丙盛說，不是為了仇恨而記得這段歷史，是為了不讓悲劇重演，只希望生長在這片土地的人可以彼此尊重，願子子孫孫都能活在沒有恐懼的土地上，這也是執政者應努力的目標。</p><!--8--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/7307/9349714?from=edn_newestlist_rank",
            "pub_date": "2026-02-28 12:46:07",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "遭質疑地熱探勘行動不力　中油：非事實",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>媒體報導指中油深層地熱探勘行動不力，中油今天表示並非事實，深層地熱探勘具高度不確定性，需透過探勘、佐證後才會進入開發階段，員山1號井屬探勘井，雖未達商業發電溫度門檻，但取得珍貴探勘資料，也作為後續鑽井選址與工程設計的參考依據。</p><!--1--><p>\n媒體報導，中油先前攜手中研院舉行宜蘭員山1號井啟用典禮，宣示是全台首個深層地熱探勘行動，不過挖了1年多到4000公尺深，卻發現溫度不高不符發電效益，中油決定放棄改為監測井，加上其他地熱案場進度延遲，經濟部要求中油檢討，最後負責的探採事業部執行長遭調離主管職。</p><!--2--><p>\n針對媒體報導探勘不力，中油今天澄清非屬事實，深層地熱探勘具高度不確定性，需透過探勘、佐證後才會進入開發階段。員山1號井屬於探勘井，雖未達商業發電溫度門檻，但取得珍貴探勘資料，可作為後續鑽井選址與工程設計的參考依據。</p><!--3--><p>\n中油說，內部主管職務調整為正常輪調，並無報導所稱針對特定探勘計畫與撤換相關主管一事。</p><!--4--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/5612/9349735?from=edn_newestlist_rank",
            "pub_date": "2026-02-28 12:46:06",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "金正恩布局女力！胞妹金與正掌權力再升 金主愛單獨射擊釋接班訊號",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>北韓勞動黨日前舉行第九次黨代表大會，國家領導人金正恩的胞妹金與正在全體會議上晉升黨內要職，出任「勞動黨中央委員會總務部部長」。</p><!--1--><p>\n</p><p>\r\n韓聯社與朝鮮日報報導，勞動黨九大歷時一周，於25日閉幕。此前擔任黨宣傳煽動部副部長的金與正，於23日舉行的中央全會中晉升為黨部門負責人，但當時並未公布正式職稱。直到北韓官媒朝中社28日報導，才首次明確稱她為總務部部長，並將她列為主要黨幹部與軍事指揮官之一，並獲金正恩親自贈送一款新型狙擊步槍作為「特別禮物」。</p><!--2--><p>\n</p><p>\r\n根據朝中社報導，金正恩27日在勞動黨中央委員會本部會見包括金與正在內的主要領導幹部與軍事指揮官，並向每人贈送他以個人名義特意準備的「新一代」狙擊步槍，同時親自頒發武器證書。</p><!--3--><p>\n</p><p>\r\n他表示：「這份禮物既是對你們非凡付出的肯定，也是我對你們絕對信任的體現。我希望你們今後繼續為我們事業的勝利而奮進，認真負責，恪盡職守。」</p><!--4--><p>\n</p><p>\r\n朝中社指出，金正恩隨後與領導幹部一同前往射擊場進行狙擊武器試射與互動體驗，並合影留念。儘管新聞稿未提及金正恩的女兒金主愛，但官媒發布的照片顯示，她同樣出席贈槍儀式並參與射擊練習。北韓媒體亦罕見公開一張她單獨瞄準目標並開槍射擊的畫面。</p><!--5--><p>\n</p><p>\r\n根據報導，勞動黨總務部負責處理黨內運作與行政事務，在將總書記金正恩的指示傳達至各級黨組織方面扮演關鍵角色。外界普遍認為，隨著金與正出任該部門主管，她在黨內的影響力與權限預料將進一步擴大。</p><!--6--><p>\n</p><p>\r\n南韓國家安保戰略研究院資深研究委員金仁泰（音）表示，基於業務性質，總務部在實務層面與總書記保持密切接觸，核心職責在於確保金正恩的所有指示能夠系統且即時傳達。北韓研究大學特聘教授梁茂進分析，金與正預料將在鞏固內部體制方面發揮核心作用，並認為北韓透過強調金主愛具備步槍射擊能力，暗示她正接受接班訓練。<!-- /.photo --><!-- /.photo --><!-- /.photo --><script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--7--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/5599/9349733?from=edn_newestlist_rank",
            "pub_date": "2026-02-28 12:46:04",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "228中樞紀念儀式移師高雄 賴總統提三項宣示避免類似事件重演",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>賴總統28日出席高雄出席228事件中樞紀念儀式，他指出228事件是一段外來政權迫害無辜人民悲慘的歷史，本身並不是民主運動，也和殖民統治無關，他也提出三項宣示，加速政治檔案開放，追查真相、進一步落實轉型正義、避免類似二二八不幸事件歷史重演，並強調民主從來不是天上掉下來的禮物，而是每一個世代的台灣人，必須用性命守護、看顧的責任。</p><!--1--><p>\n</p><p>\r\n賴總統指出，228事件是二次世界大戰後，台灣歷史上最悲痛的事件。受到威權統治228事件長時間成為禁忌，社會無法不知真相，受難者以及家屬，更加含寃受屈，活在黑暗的角落，別說「平反」，連說都不敢說。因此，228事件是一段外來政權迫害無辜人民悲慘的歷史，本身並不是民主運動，也和殖民統治無關，但是228事件加上戒嚴時期白色恐怖，確實驅動了台灣人民追求當家做主的民主意志。</p><!--2--><p>\n</p><p>\r\n賴總統提到，一直到80年代，經過40年久，民主的力量才終於匯聚有成，民間團體開始行動，直到1987年7月15日，政府終於在民意的壓力下，解除戒嚴，結束38年久，當時世界最長的戒嚴，從此以後，228事件不再是禁忌，倖存的受難者以及家屬，可以打開心內的窗，說出心中的痛苦，也用親身的經歷見證那段歷史。</p><!--3--><p>\n</p><p>\r\n賴總統也說，前總統蔡英文曾經於2011年擔任民進黨主席時，發表一篇文章，題目是「寫給未來的228 」，她說，「沒有民進黨的228 ，也不應該有國民黨的228，這個世界上只有一個228 ，那是整個台灣的228 ，它的歷史真相不應該隨著政黨輪替而輪替。」也由歷史可以清楚看出，感謝民進黨前輩，自從創黨以來，便結合公民團體以及社會大眾，一路陪同受難者和家屬，走過那段風雨的日子，並堅定推動國會全面改選、總統直選，廢除黨禁、報禁、刑法一百條，追求百分之百的言論自由。不管在野或執政，追求民主自由、守護人權，一直是民進黨存在的價值。</p><!--4--><p>\n</p><p>\r\n「戒嚴解除，政治民主之後，政府對於228事件也開始採取正面的行動」，賴總統提到，接下來他有三項宣示，第一，加速政治檔案開放，追查真相，自他上任後。就已經要求國安局針對戒嚴時期，局內約100萬件的檔案資料，要以人工方式再次逐一清查其中的政治檔案，國安局經過一年四個月的自主清查，這個月已經將國安局在戒嚴時期、1992年以前、再查出超過5萬件的政治檔案全數解密；再加上國安局從2000年開始清查移交的檔案，目前總計交給國發會檔案局已經超過14萬件的政治檔案，都秉持「一件不留、一字不遮」的原則，完整開放。</p><!--5--><p>\n</p><p>\r\n其中包括跟林宅血案有直接或間接相關的檔卷，也都在這次和歷年清查中，已經全數解密。這是政府追求真相的重要一步，但他必須要坦白跟大家報告，令人遺憾的是，在經過詳盡的追查後發現，林宅血案和當年的資料並未完整，甚至口述資料也並非真實正確，尤其從促轉會或監察院等調查報告，可以看到，當年許多證據是被系統性毀滅，國安局和情治單位更刻意阻擾司法偵查，導致錯失破案時機，因此這些檔案必須要再分析、研究。</p><!--6--><p>\n</p><p>\r\n賴總統說，兇手是在林宅被嚴密監控的情況下進行謀殺，情治單位的檔案，竟然可以在黨國時期就被系統性銷毀，誰能夠銷毀檔案？誰能夠讓情治單位阻擋司法偵查？只有當權的政府才有這樣的能力，這都突顯了當年威權政府是如何用國家暴力傷害人民、造成社會恐慌，即使有許多證據已經被銷毀，但「國家機器的介入與掩蓋證據、事實，本身就是一個不容抹滅的真相。我相信我們大家都很清楚。</p><!--7--><p>\n</p><p>\r\n他強調，未來，教育部應該落實國家轉型正義教育行動綱領，把在地的歷史記憶納入學校課程，讓年輕時代從小就理解台灣歷史，愛這片土地；文化部也應該更積極辦理專𨍭型正義的文化活動，讓更多人了解台灣民主發展的歷程。讓大家都可以說自己的故事、唱自己的歌、愛自己的國家。</p><!--8--><p>\n</p><p>\r\n第二，政府會進一步落實轉型正義，去年，權利回復基金會再核發超過一千五百份名譽回復證書，就是希望政府盡最大的努力，還給被害者與家屬，遲來的正義與公道。另外對於威權統治時期侵害人權事件的發生地，文化部已經啟動審議程序，希望保存更多「具有轉型正義意義的場所」，包括今年也已經通過的林宅血案的發生所在地—義光教會，都已經列為「具有轉型正義意義場所」，予以保存、維護。</p><!--9--><p>\n</p><p>\r\n賴總統提到，他看到這段時間也有很多人走進義光教會，但我也希望，世世代代的臺灣人都能走進各地每個歷史的現場，來反省、思考威權統治對人權、自由的破壞，共同深化臺灣的民主發展。受難者家屬要走出悲情、化悲情為力量，深化台灣民主，讓悲劇不再發生。</p><!--10--><p>\n</p><p>\r\n第三，避免類似二二八不幸事件歷史重演，賴總統說，228教示大家，民主從來不是天上掉下來的禮物，而是每一個世代的台灣人，必須用性命守護、看顧的責任。只有誠實面對歷史、追求真相，才能真正實現社會和解，打造一個和諧、公益、有尊嚴的國家。因此，每一年二二八的紀念儀式，剛林牧師在講，為何我們每年都要紀念？就是提醒要以歷史為借鏡，確保歷史不再重演，也只有在民主制度下，人民作主的國家才能避免國家機器再度傷人。</p><!--11--><p>\n</p><p>\r\n賴總統提到，近年來，中國用盡各種方式，企圖併吞臺灣，身為總統，最大的使命就是守護台灣，我會團結朝野、全國人民共同捍衛主權、維護民主，確保人民決定未來前途的權利。和平雖然無價，但對和平要有理想，不能有幻想，只有用實力作後盾的和平才是真和平，放棄主權的談和，來推進統一，這不是真和平，這反將壓迫民主、傷害人權，後患無窮。</p><!--12--><p>\n</p><p>\r\n最後，賴總統也發自內心希望，藉由一年又一年的紀念儀式，讓我們在真相的基礎上，世世代代互相了解，團結彼此。確保台灣的民主，永遠不走回頭路，謝謝大家。</p><!--13--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/5613/9349731?from=edn_newestlist_rank",
            "pub_date": "2026-02-28 12:46:03",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "銅鑼工藝保存者吳宗霖辭世　文化部頒贈旌揚狀",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>新北市傳統工藝「銅鑼工藝」保存者吳宗霖於2月2日辭世，享壽68歲。文化部文化資產局長陳濟民今天出席告別式，並頒贈文化部旌揚狀，由吳宗霖兒子吳宗栩代表受贈。</p><!--1--><p>\n根據文資局發布新聞稿，陳濟民表示，銅鑼為北管音樂不可或缺的重要樂器，吳宗霖技法精湛，常就地取材，精準掌握定階定音等技藝，展現傳統藝術中難能可貴的特殊藝能，亦積極培育後進，致力傳承珍稀銅鑼工藝，為銅鑼製作技藝的保存奠定穩固基礎，其辭世令人無限感念。</p><!--2--><p>\n新聞稿指出，吳宗霖生於1959年，長年深耕銅鑼製作領域，以敏銳細膩的音感著稱，他的銅鑼作品在定音與傳聲上展現高度專業與獨到特色。</p><!--3--><p>\n吳宗霖善於結合自然素材，使作品兼具樂器機能與造型美感，外形質樸典雅，音色共鳴廣闊渾厚，充分展現銅鑼工藝的藝術性與精神內涵。</p><!--4--><p>\n吳宗霖除製作音階鑼外，亦融入在地文化特色，兼顧鍛敲藝術創作與小型銅鑼商品開發，充分體現地方文化特色與生活美學，對地方傳統藝術的保存與推廣貢獻良多。2011年經新北市政府公告認定為傳統工藝「銅鑼工藝」保存者。</p><!--5--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/122328/9349686?from=edn_newestlist_rank",
            "pub_date": "2026-02-28 12:31:49",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "偵測中國潛艦能力提升　澳國防工業部長：歸功AUKUS",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>澳洲國防工業部長康洛伊（Pat Conroy）指出，由於AUKUS「第二支柱」計畫取得成果，目前澳洲空軍P-8海神式反潛機隊針對中國潛艦的偵測能力，已經有所提高。</p><!--1--><p>\n澳洲兩大媒體集團之一南十字星媒體集團（Southern Cross Media Group）旗下的「晚間新間網」（The Nightly），昨天刊登康洛伊在訪英行程中接受「晚間新聞網」專訪報導。</p><!--2--><p>\n據報導，康洛伊強調，雖然澳英美三方安全夥伴關係（AUKUS）協助澳洲獲得核動力潛艦計畫耗時，但著重高科技戰力提升的AUKUS「第二支柱」計畫，目前已經取得成果，並成功提升澳洲的防衛能力。</p><!--3--><p>\n按照AUKUS「第一支柱」計畫，澳洲自2032年起將購置至少3艘美國維吉尼亞級核動力潛艦；然後美、英兩國將於2040年代和2050年代初期，於澳洲組裝和建造5艘全新設計的潛艦。至於「第二支柱」內容，主要包括人工智慧（AI）、量子運算等新科技在軍事上的應用和合作。</p><!--4--><p>\n康洛伊舉例，AUKUS「第二支柱」已成功讓澳洲更有效地掌握中國潛艦的蹤跡；他提到AUKUS成功開發了一套讓澳軍P-8偵察機隊共享的演算法系統，提升該機隊反潛艦戰力和效率；他說：「這要歸功於AUKUS第二支柱，讓我們（澳洲）的P-8反潛機隊戰力顯著提升。」</p><!--5--><p>\n康洛伊也提到，由於AUKUS推出的合作試驗計畫，讓澳洲的自主作戰能力，特別是自主水下作戰能力，都大有提升，「這對澳洲開發鬼鯊（Ghost Shark）和矛牙（Spear Tooth）兩款無人潛艦，都非常有用。」</p><!--6--><p>\n康洛伊提醒，AUKUS「第二支柱」還有其他成果，將會提升澳洲防衛戰力；他說：「在第二支柱推進的項目中，有些可能屬於高度機密，這取決於當中涉及開發何種技術領域；所以我想，當中實際已取得的進展，可能遠比已可公開的要多得多。」<script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--7--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/5599/9349705?from=edn_newestlist_rank",
            "pub_date": "2026-02-28 12:31:47",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OpenAI與美國戰爭部達協議　機密網路導入AI模型",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>AI聊天機器人ChatGPT開發商OpenAI執行長阿特曼今天表示，OpenAI已與美國五角大廈簽署協議，將提供AI模型供戰爭部機密網路使用，並採用「技術性防護措施」確保安全。</p><!--1--><p>\n法新社和路透社報導，阿特曼（Sam Altman）表示：「我們最重要的兩項安全原則，就是禁止用於國內大規模監控，以及確保使用武力時的人為責任，包括自主武器系統。」他補充說，這些原則已「納入我們的協議中」。</p><!--2--><p>\n</p><p>\n他在社群平台X發文表示：「在所有互動中，戰爭部展現了對安全的高度尊重，並渴望透過合作達成最佳結果。」</p><!--3--><p>\n</p><p>\n此項聲明發布之際，另一家AI新創大廠Anthropic本週才因堅持在與五角大廈的協議中加入類似的防護條款，而引發川普政府的憤怒。</p><!--4--><p>\nAnthropic執行長阿莫戴（Dario Amodei）昨天透過聲明表示，五角大廈和情報機構已在國防領域部署Anthropic的AI模型，但該公司對其技術用於大規模監控美國公民和全自動武器方面設下倫理界線。他說，「將這些系統用於國內大規模監控，與民主價值背道而馳」。</p><!--5--><p>\n川普今天下午在自家社群媒體「真實社群」（TruthSocial）發文批評Anthropic不願配合政府要求並表示，他正指示美國各個聯邦機構立即停用Anthropic的技術，「我們不需要它，也不想要它，且不會再與他們做生意！」</p><!--6--><p>\n川普寫道，像是戰爭部這樣在多個層面使用Anthropic產品的機構將有6個月的過渡汰換期。他還說，Anthropic最好在汰換期間提供協助，否則他將動用總統權力要求他們配合，且隨後將面臨「重大的民事與刑事後果」。<script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--7--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/10511/9349706?from=edn_newestlist_rank",
            "pub_date": "2026-02-28 12:31:46",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "中國2025年免簽入境外國人逾3千萬人次  增長49.5%",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>據中國國家統計局最新數據，2025年中國入境遊客1億5450萬人次，增長17.1%，其中外國人3517萬人次，通過免簽入境外國人3008萬人次，增長49.5%。目前中國共對50個國家實施單方面免簽入境政策。</p><!--1--><p>\n據中國國家統計局官網28日發布2025年國民經濟和社會發展統計公報。2025年中國國內出遊65.2億人次，比上年增長16.2%。其中，城鎮居民國內出遊50.0億人次，增長14.3%；農村居民國內出遊15.3億人次，增長22.6%。國內遊客出遊總花費人民幣6兆3003億元（約新台幣28.8兆元），增長9.5%。其中，城鎮居民出遊花費5兆2990億元，增長7.5%；農村居民出遊花費1兆12億元，增長21.4%。</p><!--2--><p>\n入境遊客1億5450萬人次，增長17.1%，其中外國人3517萬人次，香港、澳門和台灣1億1932萬人次。入境遊客總花費1311億美元，增長39.2%。通過免簽入境外國人3008萬人次，增長49.5%。中國居民出境1億6792萬人次，其中因私出境1億6166萬人次，赴港澳台出境1億1271萬人次。</p><!--3--><p>\n中國近兩年陸續對許多國家開放單方面免簽入境30天的政策，並延長實施時間至今年12月31日為止。據中國國家移民管理局網站，截至2月17日，中國共對50個國家實施單方面免簽入境政策。包括法國、德國、俄羅斯、日本、韓國、澳洲、紐西蘭、巴西、阿根廷等國。在今年初加拿大總理卡尼（Mark Carney）及英國首相施凱爾（Keir Starmer）訪中後，在17日新增加拿大與英國為免簽入境國家。<script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--4--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/5603/9349704?from=edn_newestlist_rank",
            "pub_date": "2026-02-28 12:31:44",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "銅鑼工藝保存者吳宗霖辭世　文化部頒贈旌揚狀",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>新北市傳統工藝「銅鑼工藝」保存者吳宗霖於2月2日辭世，享壽68歲。文化部文化資產局長陳濟民今天出席告別式，並頒贈文化部旌揚狀，由吳宗霖兒子吳宗栩代表受贈。</p><!--1--><p>\n根據文資局發布新聞稿，陳濟民表示，銅鑼為北管音樂不可或缺的重要樂器，吳宗霖技法精湛，常就地取材，精準掌握定階定音等技藝，展現傳統藝術中難能可貴的特殊藝能，亦積極培育後進，致力傳承珍稀銅鑼工藝，為銅鑼製作技藝的保存奠定穩固基礎，其辭世令人無限感念。</p><!--2--><p>\n新聞稿指出，吳宗霖生於1959年，長年深耕銅鑼製作領域，以敏銳細膩的音感著稱，他的銅鑼作品在定音與傳聲上展現高度專業與獨到特色。</p><!--3--><p>\n吳宗霖善於結合自然素材，使作品兼具樂器機能與造型美感，外形質樸典雅，音色共鳴廣闊渾厚，充分展現銅鑼工藝的藝術性與精神內涵。</p><!--4--><p>\n吳宗霖除製作音階鑼外，亦融入在地文化特色，兼顧鍛敲藝術創作與小型銅鑼商品開發，充分體現地方文化特色與生活美學，對地方傳統藝術的保存與推廣貢獻良多。2011年經新北市政府公告認定為傳統工藝「銅鑼工藝」保存者。</p><!--5--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/7307/9349686?from=edn_newestlist_rank",
            "pub_date": "2026-02-28 12:26:03",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "自由花蕊展破10萬人次參觀　李遠：想哭就哭吧",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>今天是228和平紀念日，正在中正紀念堂展出的「自由花蕊常設展」持續出現人潮，昨天單日2721人，累計參觀人數超過10萬人次，文化部長李遠今早在臉書發文表示「想哭就哭吧！」</p><!--1--><p>\n李遠在臉書以「靜靜的啜泣聲——228和平紀念日，想哭就哭吧」為題發文，表示他收到中正紀念堂主任（管理處處長）張惠君傳來的訊息，「今2/27自由花蕊展參觀人次2721人（倍數成長）」。</p><!--2--><p>\n張惠君訊息指出，「人很多，但大家都很有耐心慢慢前進，在家書區，靜靜的看、不吵雜，聽得到啜泣聲。年輕人、爸媽帶孩子（小學生）很多」。</p><!--3--><p>\n李遠表示，「清晨讀到這個訊息，眼眶瞬間泛淚，真的很想要痛哭一場」。</p><!--4--><p>\n根據中正紀念堂管理處統計，「自由花蕊常設展」去年11月24日開展，截至2月27日已突破10萬人次，目前達10萬2198人次。</p><!--5--><p>\n中正紀念堂管理處指出，一開始每週約6000人、到1月份每週7000人。春節假期以來，觀眾大幅增加，預估228連假會有更多人前來參觀。</p><!--6--><p>\n「自由花蕊」常設展展覽內容包括5大單元，「世界浪潮」回顧二戰後全球爭民主與人權的重要事件，並對照台灣民主大事記。</p><!--7--><p>\n「噤聲年代」呈現戒嚴時期統治者的控制手段，包括禁歌、禁母語、宵禁管制；「台灣言論自由之路」，呈現民主前輩們在47年的威權統治期間，不計生死衝撞對抗威權體制的歷程。</p><!--8--><p>\n「創傷」透過白色恐怖政治受難者的生命劇場及家書、遺書；「綻放光華」邀民眾閱覽當代民主人權議題的書籍、漫畫、繪本、影視音作品，也歡迎寫下心得，分享對於展覽的看法。<script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--9--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/7307/9349665?from=edn_newestlist_rank",
            "pub_date": "2026-02-28 12:16:49",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        }
    ]
}