{
    "data": [
        {
            "title": "南投藍營躺著選？綠營13鄉鎮市長 11個沒人要選",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>民進黨南投縣黨部第4、5類公職人員參選登記受理截止，全縣13個鄉鎮市，僅名間現任鄉長陳翰立爭取連任，前縣議員康誌合登記挑戰鹿谷鄉長，剩下11鄉鎮市長沒人選。黨部表示，縣選對會將開會討論，傾向禮讓友軍參選或徵召新人。</p><!--1--><p>\n</p><p>\r\n農曆年假一結束，民進黨南投縣黨部上周一（23日）即啟動縣議員、鄉鎮市長、鄉鎮市民代表及村里長等第4、5類公職人員提名登記程序，趕在228連假前完成登記提名作業，盼各地選將盡早就戰鬥位置，輔選拉抬黨內縣長參選人温世政。</p><!--2--><p>\n</p><p>\r\n而其黨內縣議員登記，第一選區（南投市、名間）擬提名5人，除現任的沈夙崢、吳棋楠，老將賴燕雪也回鍋參選；第二選區（草屯、中寮）提名4人，現任議員蔡銘軒爭取連任，上一屆的落選頭李帛璋、前議員黃秀女之女洪巧娟也登記挑戰。</p><!--3--><p>\n</p><p>\r\n第三（集集、水里、魚池及信義）、四（竹山、鹿谷）選區各提名1人，分由現任的王秋淑、陳玉鈴拚連任；第五選區（埔里、國姓、仁愛）提名3人，除現任的陳宜君、蘇昱誠，新秀廖崑堯參戰；六至八選區平地及山地原住民均無人登記。</p><!--4--><p>\n</p><p>\r\n然在13鄉鎮市長登記，僅2人登記參選，分別是名間鄉現任鄉長陳翰立爭取連任，前議員康誌合登記挑戰鹿谷鄉長，其餘11鄉鎮市長竟無人要選。民進黨南投縣黨部表示，將由縣選對會討論是否禮讓親綠友軍參選，或徵召優秀新人挑戰。</p><!--5--><p>\n</p><p>\r\n據了解，魚池鄉長劉啟帆兩屆任滿，其胞弟劉啟行現任魚池鄉農會常務監事，被視為延續綠營執政的接班人選；集集不排除徵召前鎮長陳紀衡回鍋。另，無黨籍水里鄉長葉銘豐競選連任，及國姓前鄉長丘埔生均被視為友軍，可望獲綠營禮讓。</p><!--6--><p>\n</p><p>\r\n國民黨部分，南投市長張嘉哲、草屯鎮長簡賜勝、集集鎮長吳大村、國姓鄉長邱美玲、仁愛鄉長江子信等5人爭取連任，竹山、名間、魚池經初選由議員蔡孟娥、蔡宗智、魚池鄉代會副主席王若嵐3人出戰，其餘5鄉鎮也均有人選布局中。</p><!--7--><p>\n<!-- /.photo --><script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--8--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/7307/9352447?from=edn_newestlist_rank",
            "pub_date": "2026-03-01 18:26:06",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "美「斬首」哈米尼得逞 專家：北京為伊朗強出頭可能性低",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>美國與以色列聯手攻擊伊朗，炸死最高領袖哈米尼與多位軍方高層，各界關切與伊朗有「全面戰略夥伴關係」的中國大陸動態，以及會否影響「川習會」的舉行。淡江大學國際事務與戰略研究所兼任副教授黃介正認為，美國總統川普與中國國家主席習近平對彼此會面都抱持期待，北京會表達不滿，但不會為了幫伊朗強出頭而取消「川習會」。</p><!--1--><p>\n</p><p>\r\n美國與以色列28日聯手對伊朗發動軍事打擊，伊朗官方今天證實哈米尼已死於美以聯軍的空襲行動。大陸外交部發聲表示高度關切，強調伊朗國家主權、安全和領土完整應該得到尊重，也呼籲立即停止軍事行動，恢復對話談判。</p><!--2--><p>\n</p><p>\r\n由於伊朗是中東地區與中國大陸關係最密切國家，伊朗石油產量有8成銷往中國大陸，外界關切北京除了口頭支持伊朗，是否會有其他實際舉措，例如取消「川習會」以表達對川普下令攻擊伊朗，斬首哈米尼的不滿？</p><!--3--><p>\n</p><p>\r\n淡江大學戰研所兼任副教授黃介正指出，川普與習近平對於會面都有很大期待，各自想要的東西不一樣。因此雖然美國連續攻打委內瑞拉與伊朗兩個中國大陸的盟友，對北京而言是很不給面子的行為，但是雙方都不會希望因此而放棄談判。</p><!--4--><p>\n</p><p>\r\n黃介正表示，北京可能會在雙方會面中，「點到」美國近日的行為，但不至於到公然替伊朗「站隊」的程度。同樣道理，川普希望與中國大陸達成的經貿交易規模之大，也會使他不可能和北京真正翻臉。至於美伊開戰是否使得美國對台軍售的額度產生變化，黃介正認為影響應該也有限。</p><!--5--><p>\n<!-- /.photo --></p><!--99--> </section>",
            "link": "https://money.udn.com/money/story/7307/9352480?from=edn_newestlist_rank",
            "pub_date": "2026-03-01 18:26:04",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "台中大建設紙上談兵？ 市府回應民代：進度穩定推進",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>台中市議員陳俞融今指出，北區肉品市場轉型、巨蛋及多處轉運中心等重大建設進度嚴重落後，且招標過程一再流標 ，市府應確實掌握市場脈動，別讓「大建設」淪為拖延市民福祉的空頭支票。市府回應說，目前進度穩定推進。</p><!--1--><p>\n</p><p>\r\n她說，北區肉品市場商場轉型案第1次招商是去年1月2日公告，地上權存續期間50年，權利金底價高達6.34億元 ，結果在去年4月2日因無人投標宣告流標 。市府同年6月9日進行第2次招標，將年期縮短為30年、底價降至4.58億元 ，竟於9月9日再度因無人投標而流標，白白浪費一整年時間，預計今年3月重新公告招標 ，顯示市府的招商策略完全脫節。</p><!--2--><p>\n</p><p>\r\n另如台中巨蛋，自2022年5月至隔年1月間，也流標高達6次，開工後還要到2030年才能完工，而超巨蛋目前更是沒有任何開工期程，如空中樓閣。還有，大台中轉運中心目前工程進度為81.48% ，預計今底才能啟用 。但烏日轉運中心，今年1月才剛完成旅運需求報告 ，目前僅同步啟動促參可行性作業 ，進度緩慢。</p><!--3--><p>\n</p><p>\r\n再加上外埔綠能園區第二期擴建工程預計今年底才能設置完成並開始投料測試 ，另一處高效堆肥設施也預計今年中前才能完成建置。以明年起全國禁用廚餘養豬而言，毫無容錯空間。而規畫已久的另一項大建設台灣智慧營運塔，雖已調整建蔽率為50%及容積率630% ，目前卻還在拜訪業者蒐集市場意見的階段，儼然成為「延宕塔」。</p><!--4--><p>\n</p><p>\r\n台中市政府表示，北區肉品市場商業區土地轉型活化，財政局已完成活化招標方案的檢討與修正，改採為地上權20年，期滿得續約10年的較短年期，並重新評估地上權權利金，預計3月重新公告招商，6月開標。</p><!--5--><p>\n</p><p>\r\n建設局說，巨蛋工程招標初期多次流標，屬國內外整體市場環境所致，目前工程已順利開工，進度超前6.908%。而交通局也說明，「大台中轉運中心興建工程」2022年6月28日開工，預計今年如期完工。</p><!--6--><p>\n</p><p>\r\n環保局說明，因應中央明年起全面禁廚餘養豬，市府已提前布局廚餘去化量能，包括外埔綠能生態園區一期厭氧發酵設施納入逐步納入少量熟廚餘處理，同時加速協調議約建置高效堆肥設施、擴建外埔綠能第二期廚餘厭氧發酵設施，預計分別於今年年中及年底開始投料測試運轉。</p><!--7--><p>\n</p><p>\r\n至於台灣智慧營運塔規畫採 70 年設定地上權招商，市府持續訪商並彙整不同意見。</p><!--8--><p>\n<!-- /.photo --></p><!--99--> </section>",
            "link": "https://money.udn.com/money/story/7307/9352495?from=edn_newestlist_rank",
            "pub_date": "2026-03-01 18:26:03",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "中東地區3千餘僑民 卓榮泰：大部分館處都正常運作能協助",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>美國與以色列昨天對伊朗發動大規模空襲，外交部今天表示目前在中東地區的僑民及台灣人3千餘人均平安，行政院長卓榮泰下午被問及是否準備撤僑？卓未鬆口要展開撤僑，他說，我國中東地區大部分的館處都正常運作，第一時間能提供國人最需要協助。</p><!--1--><p>\n</p><p>\r\n行政院長卓榮泰到嘉縣中正大學，一抵達時接受媒體聯訪，他表示，昨天開始，賴清德總統經由國安團隊簡報，充分掌握該地區所有局勢發展，我方跟主要相關民主友盟國家保持相關聯繫，希望完全掌握國人各種需求，確保該地區的國人安全，</p><!--2--><p>\n</p><p>\r\n卓榮泰指出，外交部也充分了解當地僑民安全上都沒問題，外交部第一時間也指示中東地區館處，要啟動緊急應變的機制，大部分目前都正常運作當中，除了少數配合當地政府需求，有一些另外辦公形式，讓當地國人有任何需求，第一時間能提供最需要協助。</p><!--3--><p>\n</p><p>\r\n卓榮泰說，觀光署也了解到當地還有觀光團數、旅客人數，因應這情況下，配合當地航班作業，也啟動必要備援機制，能隨時將觀光客安全返抵國門，在這時候，當地僑民、觀光客若有迫切需求，就跟當地各個館處做請求，一定全力協助。</p><!--4--><p>\n</p><p>\r\n媒體也問，針對中國大陸駐以色列使館發布持台胞證也可登記轉移撤離的看法，卓榮泰說，「我們在當地還是有一些館處，跟一些組織、機構可以來協助，希望國人經過我們館處來做任何需求」，而在這時候無論各國或其他的機構組織都會發揮人道精神，不會做無謂的政治因素顧慮或考量，「還是在以國家保護的工作為優先情況下，要求當地所有外交館處，提供最高的服務，才是我們優先跟原則」。</p><!--5--><p>\n<!-- /.photo --></p><!--99--> </section>",
            "link": "https://money.udn.com/money/story/7307/9352507?from=edn_newestlist_rank",
            "pub_date": "2026-03-01 18:26:01",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "美以攻擊伊朗整理包／傳伊朗封鎖荷莫茲海峽 油價最高恐破100美元",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<p>\n美國與以色列對伊朗發動了歷來最激烈的攻擊，襲擊斃伊朗最高領袖哈米尼，德黑蘭當局空襲中東多地，擴大此區衝突。</p><!--1--><p>\n</p><p>\n以下相關重要大事整理：</p><p>\n</p><p>\n<b>●伊朗國營電視台1日證實，最高領袖哈米尼身亡。</b></p><!--2--><p>\n</p><p>\n美國總統川普在11月期中選舉之前，做出任內最大規模的外交博弈。他形容哈米尼死亡是「伊朗民眾奪回國家的最佳機會」，並警告「猛烈且精準的轟炸將繼續進行，整個星期都不會中斷，或是持續到完成目標，即整個中東與全世界達到和平」。</p><!--3--><p>\n</p><p>\n<b>●伊朗反擊，在中東地區發動前所未見的攻擊行動，鎖定設有美軍基地的數個鄰國與以色列。</b></p><!--4--><p>\n</p><p>\n阿聯成為伊朗直接攻擊的目標，已威脅到阿聯的經濟；杜拜身為中東主要的貿易、觀光與金融中心，所受影響更大。</p><!--5--><p>\n</p><p>\n伊朗的攻擊也重創中東地區的航空運作。杜拜機場及許多中東其他機場都關閉，企業無法考慮撤出人員。安全顧問表示，大部分企業現在都告訴員工待在家裡，本周開始準備在家工作。</p><!--6--><p>\n</p><p>\n川普在真實社群發文警告，若伊朗進一步攻擊，將動用「前所未見的武力」打擊德黑蘭。</p><!--7--><p>\n</p><p>\n<b>●市場影響</b></p><p>\n</p><p>\n據報導，伊朗軍方已經不允許船隻通過荷莫茲海峽。專家預料一旦海峽確定遭到封鎖，國際油價最高可能飆到每桶108美元，天然氣價同樣油漲船高，而且亞洲國家受影響最重。</p><!--8--><p>\n</p><p>\n28日已有多起新聞報導，伊朗已禁止船隻通過荷莫茲海峽。多艘貨輪接到伊朗革命衛隊的VHF電訊，表示船隻不得通過，惟截至目前還沒有官方消息證實海峽已遭封鎖。全球10大產油國之中有5國的石油都經由荷莫茲海峽運出，每日運量超過2千萬桶，其中90%以上輸往亞洲。</p><!--9--><p>\n</p><p>\n外界普遍預期沙烏地阿拉伯、俄羅斯以及石油輸出國家組織與盟國（OPEC+）的其他6個主要成員國，將於1日宣布增產。OPEC+8個成員國組成的「自願八國」（Voluntary Eight），在美國與以色列對伊朗發動空襲的隔天召開線上會議。<script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--10--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/5599/9352584?from=edn_newestlist_rank",
            "pub_date": "2026-03-01 18:26:00",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "北市信義商圈「泰勒絲之夜」吸引300人 警消嚴密部屬防踩踏",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>有餐酒業者昨晚至今凌晨在台北市信義商圈舉辦「泰勒絲之夜 4.0」活動，號召美國歌手泰勒絲的歌迷，吸引300多人參加，警方與消防隊嚴密部屬防踩踏，事先與業者研商確保安全，活動平安落幕。</p><!--1--><p>\n</p><p>\r\n信義警分局表示，信義區夜店、KTV及餐酒館林立，為維護公共安全，上月23日邀第二消防大隊與主辦單位研商活動安全規劃，簽署「公私協力共好」意向書（MOU），獲台北醫學大學附設醫院支持加入。</p><!--2--><p>\n</p><p>\r\nMOU有動線規劃暢通、逃生策略周延、通報機制迅速、醫療救護到位、防火訓練落實、公私協力安全等6項重點，主辦單位承諾加派保全人員、管控音量及要求員工熟悉操作滅火器、AED救護器材，與公部門窗口成立協作通報機制，第一時間互通訊息。</p><!--3--><p>\n</p><p>\r\n活動在新光三越A8館外階梯廣場舉行，為防制踩踏及飲酒後相關危害，除既有深夜守望勤務，分局規劃警力因應，第二消防大隊消防員在場指導自衛消防編組人員，做好用火用電設施管理及相關因應機制。</p><!--4--><p>\n</p><p>\r\n分局指出，市政府、大巨蛋周邊電影院、餐館林立，還有街頭藝人展演，周末晚間人潮聚集，分局、第二消防大隊與北醫攜手合作維護安全，持續朝此公私協力模式，展現業者自律與公部門合作。</p><!--5--><p>\n<!-- /.photo --></p><p>\n<!-- /.photo --></p><p>\n<!-- /.photo --></p><p>\n<!-- /.photo --></p><p>\n<!-- /.photo --><script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--6--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/122328/9352445?from=edn_newestlist_rank",
            "pub_date": "2026-03-01 18:17:03",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "晶片需求旺 南韓2月出口創同期新高 緩解央行降息壓力",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>南韓2月出口動能增強，出口額創歷來同期最高，半導體出口也寫單月新高，緩解央行降息壓力，也進一步印證央行看法，即在維持中性政策立場、審慎觀察金融穩定風險之際，穩健的半導體需求正為經濟提供緩衝。</p><!--1--><p>\n</p><p>\r\n南韓產業通商資源部1日公布，2月未經調整的出口年增29%至674.5億美元，為連續第九個月成長，並為歷史同月新高。經工作日數調整後，2月每日出口年增49.3%至35.5億美元，首度突破30億美元。</p><!--2--><p>\n</p><p>\r\n2月進口增加7.5%至519.4億美元，貿易順差攀抵155億美元，寫歷來單月最高。儘管統計期間包含為期三天的農曆新年連假、工作日減少，出口動能依舊強勁。</p><!--3--><p>\n</p><p>\r\n半導體出口仍是主要動力，上月出口額年增160.8%至251.6億美元，為單月新高，也是連續第三個月超過200億美元，受益於全球對人工智慧（AI）基建和資料中心的持續投資。半導體占南韓整體出口逾四分之一。</p><!--4--><p>\n</p><p>\r\n上月汽車出口額下滑20.8%至48.1億美元，受累於工作日減少。含手機在內的無線通訊產品，上月出口額年增12.7%至14.7億美元；電腦產品則大增221.6%至25.6億美元。</p><!--5--><p>\n</p><p>\r\n出口市場方面，對中國大陸增加34.1%，對美國增近30%，對歐盟和東協（ ASEAN）分別成長10.3%和30.4%。</p><!--6--><p>\n</p><p>\r\n最新數據顯示，即使面臨美國貿易政策再添不確定性，南韓的出口引擎仍具韌性。出口動能持續強勁下，南韓央行日前將基準利率維持在2.5%不變，並釋出訊號顯示，在基準情境下，決策官員預期不會調整政策立場。</p><!--7--><p>\n</p><p>\r\n南韓央行總裁李昌鏞表示，來自匯市與房市的金融穩定風險料將持續一段時間，但近期數據已減輕進一步寬鬆的壓力。多數分析師也預期，受到全球AI相關需求支撐，南韓今年出口將保持強勁。</p><!--8--><p>\n<!-- /.photo --><script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--9--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/5599/9352550?from=edn_newestlist_rank",
            "pub_date": "2026-03-01 17:51:41",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "26秋冬米蘭時裝周／Loro Piana展開復古火車旅行 經典腰果花紋好優雅",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>頂級靜奢品牌Loro Piana於時裝周期間於米蘭總部Cortile della Seta透過沉浸式的靜態展覽發表2026-2027年秋冬系列，各種形態和色調的腰果花紋帶出本季主題Nomadic Reverie，讓人彷彿透過火車的窗戶漫遊不同的壯麗風景、探索旅行的概念。系列亦展現這種火車旅行的特點，隨著時間和距離的推移，慢慢在腦海中留下各種深刻印象。</p><!--1--><p>\n</p><p>\r\n這段旅程以多首描繪季節更迭、氣溫變化和自然色彩變幻的短詩展開，進入展場後，除了放滿詩集的小書架，造訪的每一步都伴隨著背景聲音朗讀八首詩歌，聽眾彷彿置時間長河之中。接著穿過以亮澤紅木和拉絲黃銅扶手重現火車車廂的經典裝潢的狹窄長廊，來到展示2026-2027年秋冬系列的主展廳。</p><!--2--><p>\n</p><p>\r\n深邃的大地色調和南瓜橙黃色調構成本季的主調，作為新一季焦點的腰果花紋圖案貫穿整個發佈會的各個空間，包括分隔各區的九面屏風。牆邊展示的五款披肩添上精細的網版印製腰果花紋，覆蓋Sopravisso羊毛的陳列台展示新款手提包，而牆邊的蠟面木製陳列架則掛滿Grande Unita羊絨圍巾。</p><!--3--><p>\n</p><p>\r\n腰果花紋細緻複雜，需要高超的印製技術才能製成。經典水滴形的腰果花紋誕生於二千多年前，並於18世紀傳入歐洲。位於義大利Varallo的Loro Piana歷史檔案館內便收藏了多本詳述紡織品歷史的書籍，這種精美的腰果花紋更啟發了品牌於1960年代末至1970年代創作的特色圖案。隨著腰果花紋逐漸盛行，這種圖案亦經常出現在Loro Piana的印花披肩上，並從此成為品牌系列的重要元素。</p><!--4--><p>\n<!-- /.photo --></p><p>\n<!-- /.photo --></p><p>\n<!-- /.photo --></p><p>\n<!-- /.photo --></p><p>\n<!-- /.photo --></p><p>\n<!-- /.photo --></p><p>\n<!-- /.photo --></p><p>\n<!-- /.photo --></p><p>\n<!-- /.photo --></p><!--99--> </section>",
            "link": "https://money.udn.com/money/story/122328/9352444?from=edn_newestlist_rank",
            "pub_date": "2026-03-01 17:46:07",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Onitsuka Tiger 2026秋冬解構日式間之美學 虎爪紋60周年新鞋款誕生",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>日本時尚品牌Onitsuka Tiger鬼塚虎於米蘭時裝周發表2026秋冬系列。本季以日本傳統文化概念「間」(The Aesthetics of Ma)為核心主題，表述兩個元素之間富有意義的留白或停頓。</p><!--1--><p>\n</p><p>\r\n在本季伸展台上不再侷限於正式、休閒或運動裝，而是在這些類別的「空間」中游走，透過異材質的堆疊，像是羊羔絨夾克搭配輕薄襯衫，展現層次與空間感、視覺張力。另有充滿少女氣息的學院風，以及蘋果綠抓絨外套內搭糖果粉色蝴蝶結襯衫、羽毛效果面料的裙裝，展現浪漫元素與玩味感。男裝系列同樣延續跨衣櫥混搭的設計思維，手工刺繡花卉米白色刷毛外套、襯衫搭配柔軟卡其長褲，體現自由、不拘一格的當代男性風貌。</p><!--2--><p>\n</p><p>\r\n鞋履設計方面，為慶祝品牌經典虎爪紋（Onitsuka Tiger Stripes）誕生60周年，首度推出了方頭版本的MEXICO 66。其鞋身更為扁平細長，並提供蜥蜴紋、花卉印花及純色等多樣化選擇。</p><!--3--><p>\n</p><p>\r\n此系列亦推出兩款slingback高跟鞋，一款採尖頭設計並搭配可翻折皮革飾片與皮帶，另一款則重新詮釋經典虎爪紋，也標誌著品牌進一步跨足時裝女鞋領域。</p><!--4--><p>\n</p><p>\r\n配件方面，本季推出全新包款小巧的矩形鉚釘斜挎包，以及一系列可愛的掛飾，像是蝴蝶結、迷你耳機包、口紅包，增加搭配的趣味性。</p><!--5--><p>\n<!-- /.photo --></p><p>\n<!-- /.photo --></p><p>\n<!-- /.photo --></p><p>\n<!-- /.photo --></p><p>\n<!-- /.photo --><script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--6--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/122328/9352453?from=edn_newestlist_rank",
            "pub_date": "2026-03-01 17:46:05",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "雲林觀光人氣最強的北港  公廁不足遊客不便有解方",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>針對雲林縣北港觀光重地的停車場等公共場域廁所不足問題，雲林縣府和北港鎮公所在水道頭文化園區積極建造新廁，並將攜手公家機構、協調朝天宮週邊商家合作，以友善標章提供給遊客借用，期能解決遊客如廁不便問題。</p><!--1--><p>\n</p><p>\r\n雲林縣觀光人數已突破千萬人次，人潮多數集中在北港鎮香火鼎盛的朝天宮和武德宮，兩廟觀光人數在國內名列前茅，據縣府統計朝天宮光春節連假就吸引137萬人次，觀光實力驚人。</p><!--2--><p>\n</p><p>\r\n其中北港武德宮腹地廣闊，除擁有廣大停車場，也建造五星級廁所。反觀位於北鬧區中心的朝天宮，因周邊可用的公地不多，停車和如廁成了兩大問題，近年來縣府、廟方和北港鎮公所也積極設法改善。</p><!--3--><p>\n</p><p>\r\n除改善最大的第一停車場空間，也增設北港溪高灘地停車場，紓緩車潮，但因停車場廁所不足，私人收費廁所運應而生，為解決廁所不足，每年進香期調用流動廁所因應，縣府最近也在離停車場不遠的水道頭文化園區建造新公廁。</p><!--4--><p>\n</p><p>\r\n鑑於市區公共空間有限，縣議員蔡岳儒建議縣府或公所可盤點廟周公家單位，適時協調廁所於假日彈性開放外借，也可編列經費補助廟周的店家，改善廁所設備，一方面提供遊客如廁，一方面也可吸引遊客入店帶動消費。</p><!--5--><p>\n</p><p>\r\n蔡岳儒指出，如有合適或能提供廁所的店家，縣府可製作友善店家認證標章或地圖，指引遊客，同時也可評選友善商家給予獎勵，讓遊客感受北港商店的體貼和熱情，提升形象，互蒙其利。</p><!--6--><p>\n</p><p>\r\n縣府文觀處長謝明璇表示，目前朝天宮周邊有北港遊客中心、大復戲院提供借廁服務，此外也媒合周邊店家包括朝聖酒店大樓、好住民宿、阿豐麵線糊、狀元珍水蒸蛋糕等本縣的「借問站」，營業時間提供借廁。</p><!--7--><p>\n</p><p>\r\n文觀處指出，除了借廁措施，目前水道頭文化園區新建公廁也積極趕工，預計今年3月底啟用，對於地方所提建議將邀集相關權管單位研商共擬可行方案。</p><!--8--><p>\n<!-- /.photo --></p><p>\n<!-- /.photo --></p><!--99--> </section>",
            "link": "https://money.udn.com/money/story/122328/9352469?from=edn_newestlist_rank",
            "pub_date": "2026-03-01 17:46:04",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "台南佳里「蕭壠香」將登場 201公尺百足真人蜈蚣陣進駐蕭壠園區",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>3年1科台南佳里金唐殿「蕭壠香」蓄勢待發；著名百足真人蜈蚣陣即日起至3月4日展示於蕭壠文化園區，將於3月5日「請王」、6日至8日起駕出巡，11日「送王」燒王船，預料將吸引大批香客湧入。</p><!--1--><p>\n</p><p>\r\n「蕭壠香」為南瀛3大古香之一，特色為金氏世界紀錄認證的長達201公尺百足真人蜈蚣陣遶巡佳里、七股、將軍等17角頭24村庄，2023年蜈蚣陣更首度遶行蕭壠文化園區，打破「蜈蚣不入廠」慣例，今年更特別進駐蕭壠文化園區供民眾參拜。</p><!--2--><p>\n</p><p>\r\n今年雙方合作進一步深化，園區正式成為香科重要場域，並於戶外劇場主舞台設置「蜈蚣祭壇」，完整呈現百年香科的神秘科儀。除了靜態展示，園區正門與劇場周邊也已搭建起氣勢恢宏的香科牌樓，內部更同步展出「王府神祕空間」及「百年神轎工藝」。</p><!--3--><p>\n</p><p>\r\n台南市政府文化局表示，具有金氏世界紀錄的蕭壠香百足真人蜈蚣陣，即日起至4日進駐蕭壠文化園區，5日是「請王」、6日至8日起駕出巡，11日「送王」燒王船，歡迎各界共襄盛舉，活動最新資訊請至蕭壠文化園區與金唐殿臉書粉絲專頁查詢。</p><!--4--><p>\n<!-- /.photo --></p><!--99--> </section>",
            "link": "https://money.udn.com/money/story/122328/9352497?from=edn_newestlist_rank",
            "pub_date": "2026-03-01 17:46:02",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "宜蘭溪南溪北煙火秀可一飽眼福 欣賞美麗燈花把握最後幾天",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>宜蘭在228連假期間，溪北的員山鄉及溪南的冬山鄉都各有煙火秀，不少人趕場比較哪裡美，更吸引各地攝影師到宜蘭捕捉火樹銀花，員山鄉公所施放的煙火受惠於天氣良好，璀璨亮眼，冬山鄉公所施放的煙火有舊河道水影相映，各有特色，兩地的燈節裝飾分別持續到3月3日與3月7日，可把握最後賞景機會。</p><!--1--><p>\n</p><p>\r\n員山燈節2月13日點燈持續至至3月3日，在員山公園每晚綻放美麗燈花。元宵節是3月3日，鄉公所舉辦「員山水鄉光影慶元宵」27日下午4時起踩街嘉年華、晚上7時星光晚會、晚上9時900秒的煙火秀壓軸，每年很多人期待這場煙火，提早到場卡位，15分鐘精彩煙火秀，看得十分過癮。</p><!--2--><p>\n</p><p>\r\n隔天28日冬山鄉公所舉辦「元宵花火節」，在舊河港畔施放美麗煙火，放送元宵搖搖馬小提燈時，民眾大排長龍，當天除了有花火市集，還有周六夜市登場，有吃有喝吸引人潮湧入，幾乎擠得水洩不通，攤商生意大好，有些還提早賣光，掛牌缺貨。</p><!--3--><p>\n</p><p>\r\n晚間8時26分施放600秒煙火，舊河港水面倒影，增添詩情畫意，可惜天空飄雨，民眾得要撐傘賞燈花，不少攝影師選定方位，拍攝美景瘋傳臉書等社群。</p><!--4--><p>\n</p><p>\r\n「員山燈節」燈飾持續到3月3日，位於員山公園共有11大燈區，還剩下幾天可以欣賞；「冬山舊河港燈節」展出至3月7日，燈區範圍從冬山車站前廣場延伸至舊河道步道，每天下午5時至晚間11時亮燈，沉浸式光影場域，有空可去走走逛逛。</p><!--5--><p>\n<!-- /.photo --></p><p>\n<!-- /.photo --></p><p>\n<!-- /.photo --></p><p>\n<!-- /.photo --></p><p>\n<!-- /.photo --></p><p>\n<!-- /.photo --></p><p>\n<!-- /.photo --></p><!--99--> </section>",
            "link": "https://money.udn.com/money/story/122328/9352545?from=edn_newestlist_rank",
            "pub_date": "2026-03-01 17:46:01",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MWC將登場 輝達宣布攜手Nokia軟銀搶攻6G 力推AI原生無線網路",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>輝達（Nvidia）1日表示，正與諾基亞、軟銀與T-Mobile美國公司等多家電信業者合作，致力於將人工智慧（AI）導入6G無線網絡。</p><!--1--><p>\n</p><p>\r\n在MWC開幕前夕輝達透過聲明指出，改變是必須的，因為未來許多裝置都將連網，要求將更複雜。目前的5G網路透過語音和數據連接人們，並提供檢索到的資訊，但無法支援AI的廣泛應用。 </p><!--2--><p>\n</p><p>\r\n輝達電信業務資深副總裁瓦希斯塔（Ronnie Vasishta）表示，「今日的網路就是尚未準備好為明日所使用」，「在AI年代，一切都會改變。網路將傳遞智能（intelligence），不只為在手機上的人類，也會為機器傳遞」。 </p><!--3--><p>\n</p><p>\r\n他還說，電信網路對頻譜效率的要求比現在高出數百萬倍，因為目前的無線電頻譜並不敷新用途的使用。</p><!--4--><p>\n</p><p>\r\n輝達已推出可用於電信網絡中的晶片、電腦和軟體，希望能進一步拓展市場，清除可能的路障，也希望AI能應用於更多領域，例如機器人和交通工具等實體AI，以便繼續刺激需求。少了支援AI數據流量的無線網路，輝達那個滿是人形機器人和自駕車世界的願景，可能會晚一點才能達成。</p><!--5--><p>\n</p><p>\r\n每隔十年左右，電信業就會進入下一代的無線科技，在此過程中業者會組成各式聯盟，希望將產業導向他們認為對自家產品較有利的方向。這種作法的結果未必每次都能讓業者稱心如意，有時候還會因不同陣營的角力，拖慢新技術上路時程，或出現不相容的系統。</p><!--6--><p>\n</p><p>\r\n輝達主張，新的裝置與軟體必須完全開放，收發無線電波的無線電設備，應該由軟體控制，可以更新，也可以在更通用型的電腦上運作；數據流量應由AI軟體調度路徑，這種軟體能夠回應快速變化的模式與優先順序，而這在目前還辦不到。</p><!--7--><p>\n</p><p>\r\n瓦希斯塔補充，在如此環境下，電信業將更能接受新供應商的崛起，包括那些估值能迅速衝破10億美元的新創，「新的電信獨角獸將應運而生」。他也感嘆，過去這十年電信業實在太少生力軍加入。</p><!--8--><p>\n<!-- /.photo --><script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--9--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/5599/9352521?from=edn_newestlist_rank",
            "pub_date": "2026-03-01 17:26:00",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "中東爆戰事 安聯：關注能源價格與金融市場狀況",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>美國與伊朗爆發軍事衝突，安聯投信表示，現階段建議高度聚焦能源價格與金融市場狀況。歷史經驗顯示，全球主要央行對此類短期供給衝擊會以暫時性角度評估。然而，全球部分央行可能認為成長放緩將壓抑中期價格壓力，因而傾向寬鬆；另外一些央行則可能擔憂若通膨再度持續上升，讓通膨預期失去錨定，因而選擇收緊。依近期政策傾向推測，美國聯準會與日本央行可能較偏向前者，歐洲央行與英國央行則可能較偏向後者。</p><!--1--><p>\n</p><p>\n安聯投信指出，根據美國能源資訊署（EIA）2023年數據，伊朗近九成石油出口直接流向中國；其天然氣出口則有87%透過管線輸往伊拉克與土耳其；由於荷莫茲海峽為全球兩成液化天然氣供應與25%海運石油運輸的必經之路（2023-2025年數據），後續情勢發展勢將牽動油價相關走勢與石油貿易等變化，須密切關注。相較於能源面向，伊朗非能源貿易規模可忽略不計。其名目GDP僅占全球GDP的0.4%（2024年IMF數據），其貨物貿易總額僅占全球總貨物貿易0.1%，低於2000年代制裁前的0.5%。</p><!--2--><p>\n</p><p>\n</p><p>\n</p><p>\n安聯投信說，接下來，可先關注伊朗當地政權與國際情勢變化，依不同情境，如軍事介入但未導致政權更替、政權更替或是區域戰爭升級等，作為油價可能發展的參考依據。以軍事介入但未導致政權更替的情境為例，推估屆時油價可能進一步上升至每桶75美元，隨後迅速回落至緊張前的60美元水準。天然氣價格大致不受影響。市場將出現短暫風險趨避反應，波動度可能高於委內瑞拉事件，但隨後迅速修復。若油價下降10%，將使通膨率下降0.2–0.3個百分點，提升英國降息機率，歐元區亦略受支持；其他主要央行影響有限。</p><!--3--><p>\n<!-- /.photo --><script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--4--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/5613/9352472?from=edn_newestlist_rank",
            "pub_date": "2026-03-01 17:11:51",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "觀霧「霧社櫻王」3月初盛開！「櫻花食堂」同步開張",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>白如雪的霧社櫻花是臺灣特有的原生種櫻花，花瓣潔白細緻、姿態優雅。其中，位於觀霧國家森林遊樂區的指標景觀—「霧社櫻王」，每年春季總以滿樹白花迎接遊客，今年預計於3月初進入盛開期，將再度成為山林間最受矚目的春日焦點。</p><!--1--><p>\n</p><p>\r\n配合這場春日盛宴，林業及自然保育署新竹分署特別推出「（櫻該）都找得到—櫻花食堂」集章活動，自即日起至3月15日止，於觀霧遊客中心舉辦，邀請民眾走進觀霧遊客中心、化身生態觀察家，尋找那些正在櫻花樹間覓食的「森林食客」，盛開的櫻花，同時也是森林動物們一年一度的重要餐桌。</p><!--2--><p>\n</p><p>\r\n新竹分署說明，「（櫻該）都找得到」為觀霧遊客中心自2024年起持續推動的櫻花季主題活動，透過集章體驗結合生態解說，陪伴民眾年年走進觀霧的春季森林。歷屆活動以園區可見的櫻花為設計主軸，引導遊客在蒐集紀念章的過程中，認識不同櫻花的生態特性、園區景觀與人文故事，並逐步建立友善賞花與尊重自然的觀念。本年度特別推出全新系列「櫻花食堂」印章組，將觀察視角由「看見櫻花」延伸至「理解櫻花在森林中的角色」。本屆活動以「櫻花作為森林食物來源」為核心概念，透過動物與櫻花之間的覓食關係，帶領民眾重新認識櫻花在森林食物網中的重要位置，讓集章不只是蒐集樂趣，更成為理解生態連結的入口。</p><!--3--><p>\n</p><p>\r\n活動期間，民眾可至觀霧遊客中心索取限量集章卡，依循館內動線蒐集六款印章，並參與線上生態知識問答，即有機會抽中櫻花杯墊等限定紀念好禮。考量野生動物出沒時機不定，觀霧遊客中心大廳亦設置「季節照片展示牆」，集中呈現櫻花與動物互動的珍貴生態影像，讓民眾不受時間限制，也能一覽森林中的精彩瞬間，現場並安排解說員提供專業諮詢服務。</p><!--4--><p>\n</p><p>\r\n新竹分署也提醒，霧社櫻王盛開期間，觀霧山莊前往往吸引大量賞花人潮，建議遊客可先至遊客中心參與集章活動，再前往欣賞櫻王，或賞花後順道造訪遊客中心，透過動線分流，讓整體賞花體驗更加舒適。同時呼籲民眾遵守「櫻王參觀禮儀」，不攀折枝條、不踩踏花圃、不干擾野生動物，以實際行動落實「無痕山林」精神。</p><!--5--><p>\n</p><p>\r\n春季的觀霧生機盎然，除了霧社櫻外，臺灣檫樹、馬告與笑靨花也陸續綻放，為步道增添繽紛色彩。誠摯邀請民眾在追尋霧社櫻王雪白身影的同時，放慢腳步，走進遊客中心，認識櫻花背後更豐富的森林故事。</p><!--6--><p>\n</p><p style=\"word-break:break-all;\">\r\n春季的觀霧生機勃勃，不僅是多種櫻花綻放的季節，同時也是臺灣檫樹、馬告、笑靨花盛開的時期。歡迎民眾在追隨霧社櫻王之餘，放慢腳步欣賞園區步道兩旁盛開的春季花朵。活動資訊及霧社櫻花況歡迎關注「觀霧國家森林遊樂區」臉書粉絲專頁（https://www.facebook.com/GuanwuNationalForest/），更多旅遊資訊請至台灣山林悠遊網（https://recreation.forest.gov.tw/）查詢。</p><!--7--><p>\n<!-- /.photo --></p><p>\n<!-- /.photo --></p><p>\n<!-- /.photo --></p><p>\n<!-- /.photo --><script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--8--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/122328/9352492?from=edn_newestlist_rank",
            "pub_date": "2026-03-01 16:51:44",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "中東戰火衝突 卓榮泰：確保當地國人安全",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>近來國際情勢緊張，尤其中東戰火衝突情勢持續升高，行政院長卓榮泰1日受訪時表示，從昨天開始，總統已經由國安團隊的簡報充分，而且掌握到該地區所有新的趨勢的發展；同時，我方跟主要跟相關的一些盟友國家也保持高度的聯繫，希望能夠完全掌握到國人的各種需求，確保到在該地區國人的安全。</p><!--1--><p>\n</p><p>\r\n卓榮泰強調，外交部已經充分了解在當地僑胞現在在安全上都沒有問題，外交部第一時間也指示所有中東地區的館處要啟動緊急應變的機制，那麼大部分都目前在運作當中，除了一兩個地區配合當地政府的需求，有一些另外的辦公形式，大部分都安全的，而且正常在運作，目的也是要讓國人在當地有任何的需求能夠提供第一時間而且最需要的一個協助。</p><!--2--><p>\n</p><p>\r\n至於當地觀光客的部分，卓榮泰指出，觀光署也了解到在當地我們還有一些觀光旅客，目前旅行團跟旅客的人數也完全的了解，也因應這個情況底下，目前在當地配合其他的一些航班的作業，也啟動一些必要的備援機制，隨時能夠將這些在當地的觀光客能夠安全的讓他們返國，在這個時候也希望他們在當地的不管是僑民也好，觀光客也好，如果有任何急切的需求，針對我們當地各個館處、外交的館處來做各種需要的請求，一定全力來協助。</p><!--3--><p>\n</p><p>\r\n另外，中國大陸駐設使館開放大陸公民登記撤離，其中台胞證也可以登記。卓榮泰說，我們在當地還是有一些館處跟一些組織機構可以來協助，希望國人經過我們的館處來做任何的需求，但在這個時候，無論各國或者其他的一些機構組織都會發揮人道的精神，也都不會做無謂的政治因素的顧慮或考量，「這一點，我認為國人還是在以國家保護的這個工作為優先的情況底下，我們要求在當地的所有的外交處提供最高的服務，這還是我們優先」。</p><!--4--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/7307/9352494?from=edn_newestlist_rank",
            "pub_date": "2026-03-01 16:51:42",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "中東爆戰事 安聯：關注能源價格與金融市場狀況",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>美國與伊朗爆發軍事衝突，安聯投信表示，現階段建議高度聚焦能源價格與金融市場狀況。歷史經驗顯示，全球主要央行對此類短期供給衝擊會以暫時性角度評估。然而，全球部分央行可能認為成長放緩將壓抑中期價格壓力，因而傾向寬鬆；另外一些央行則可能擔憂若通膨再度持續上升，讓通膨預期失去錨定，因而選擇收緊。依近期政策傾向推測，美國聯準會與日本央行可能較偏向前者，歐洲央行與英國央行則可能較偏向後者。</p><!--1--><p>\n</p><p>\r\n安聯投信指出，根據美國能源資訊署（EIA）2023年數據，伊朗近九成石油出口直接流向中國；其天然氣出口則有87%透過管線輸往伊拉克與土耳其；由於荷莫茲海峽為全球兩成液化天然氣供應與25%海運石油運輸的必經之路（2023-2025年數據），後續情勢發展勢將牽動油價相關走勢與石油貿易等變化，須密切關注。相較於能源面向，伊朗非能源貿易規模可忽略不計。其名目GDP僅占全球GDP的0.4%（2024年IMF數據），其貨物貿易總額僅占全球總貨物貿易0.1%，低於2000年代制裁前的0.5%。</p><!--2--><p>\n</p><p>\n</p><p>\n</p><p>\r\n安聯投信說，接下來，可先關注伊朗當地政權與國際情勢變化，依不同情境，如軍事介入但未導致政權更替、政權更替或是區域戰爭升級等，作為油價可能發展的參考依據。以軍事介入但未導致政權更替的情境為例，推估屆時油價可能進一步上升至每桶75美元，隨後迅速回落至緊張前的60美元水準。天然氣價格大致不受影響。市場將出現短暫風險趨避反應，波動度可能高於委內瑞拉事件，但隨後迅速修復。若油價下降10%，將使通膨率下降0.2–0.3個百分點，提升英國降息機率，歐元區亦略受支持；其他主要央行影響有限。</p><!--3--><p>\n<!-- /.photo --><script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--4--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/12926/9352472?from=edn_newestlist_rank",
            "pub_date": "2026-03-01 16:45:58",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "中東戰事衝擊港金融？陳茂波：短期或影響金價、油價",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>在美國與以色列2月28日聯手攻擊伊朗，並擊斃最高領袖哈米尼及多名國安高層後，中東戰火驟起，各界高度關注全球能源要道－荷姆茲海峽後續影響。香港財政司司長陳茂波1日表示，中東戰事雖對香港直接貿易影響有限，但可能帶來金融市場波動。港府已有充分預案應對資金流與市場風險，並密切監測金價、油價及運輸成本變化。</p><!--1--><p>\n</p><p>\r\n港媒《信報》指出，陳茂波1日在香港電視廣播有限公司節目《講清講楚》中表示，香港與伊朗直接貿易和投資不多，但有關戰事對全球造成很大不確定性，預料對金融市場造成的波動比較大，強調特區政府已有足夠預案作出應對。</p><!--2--><p>\n</p><p>\r\n陳茂波估計，資金流可能轉向更快，亦有不確定性，當地資金或尋求安全港而來到香港，特區政府要做好準備，會小心處理金融風險及波動，亦已經有足夠預案。同時，他又預料，金價、油價以及國際貿易運輸成本可能會於短期內受影響，強調當局一直有評估風險。</p><!--3--><p>\n</p><p>\r\n彭博稍早指出，中國約三分之一的原油供應仍經荷姆茲海峽運輸。荷姆茲海峽位於伊朗附近，是連接波斯灣與外海的狹窄水道。2月28日轟炸行動後，伊朗伊斯蘭革命衛隊已於當晚，宣布禁止任何船隻通過荷姆茲海峽海峽，這實質上也表示將海峽關閉，此舉或推高原油價格。對此，一些油輪避開該海峽航行，部分船東採取謹慎態度。</p><!--4--><p>\n</p><p>\r\n北京晚報旗下平台「北晚在線」則指，荷姆茲海峽每日承載全球約五分之一海運石油及液化天然氣，沙烏地阿拉伯、伊拉克、阿拉伯聯合大公國、科威特的大部分原油出口依賴此水道，卡達幾乎全部液化天然氣出口亦經此。</p><!--5--><p>\n</p><p>\r\n另外，香港電台1日指出，香港商務及經濟發展局局長丘應樺稍早亦在電台節目表示，中東局勢近日升溫，為全球帶來衝擊，需要深思研究這對未來全球經濟發展、供應鏈，以及美國會否減息等影響。由於這些不穩定因素，全球多國加強與中國合作， 「看到國家（指中國）經濟發展對全球影響強大，香港可受惠於國家整體經濟發展，做好超級聯繫人角色，為國家做好跨國供應鏈工作的角色，對香港是正面機遇。」</p><!--6--><p>\n<!-- /.photo --><script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--7--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/5603/9352473?from=edn_newestlist_rank",
            "pub_date": "2026-03-01 16:45:56",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "大大數位基金會捐血家年華3月起跑 目標1.5萬袋熱血",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>大大數位基金會發起的「大大攜手 讓愛永續」捐血家年華活動，三月再度起跑！延續過往兩屆的熱烈迴響，今年將由高雄出發，從南到北展開愛心接力，跨越全台七大縣市，串聯高雄市、台中市、苗栗縣、新竹縣、桃園市、新北市及台北市，號召全民挽袖捐血，為全台血庫注入穩定能量。不僅捐血目標提升至15,000袋，更將捐出逾千萬元的善款與物資，為台灣社會注入強大的暖流。</p><!--1--><p>\n</p><p>\r\n今年再度邀請主持人暨律師謝震武擔任公益代言人。謝震武表示，公益最動人的力量，在於眾人齊心。今年從高雄出發，一路向北，象徵愛心匯流、溫暖全台，期盼更多民眾響應「捐血一袋，救人一家」，讓善的循環持續擴大。</p><!--2--><p>\n</p><p>\r\n大大數位基金會表示，今年活動目標募集15,000袋熱血，從第一年的10,000袋到第二年的12,000袋，每年都比預期收獲更多愛心，這次目標再度提升，展現大大數位基金會一年比一年成長的行動力與承諾，屆時各縣市首長將親自出席，與謝震武律師共同呼籲大眾踴躍捐血，為公益站台，攜手打造充滿溫度的城市力量。</p><!--3--><p>\n</p><p>\r\n大大數位基金會董事長戴永輝表示，基金會自成立以來，始終秉持「取之於社會，用之於社會」的初心，連續三年舉辦捐血家年華，每年都有許多熱血民眾主動前往捐血站挽袖捐血，而最讓他感動的是，今年從一月份開始就有許多民眾陸續來電詢問捐血活動舉辦時間及地點，這表示大大數位基金會舉辦的捐血活動已經走進民眾的日常，成為大家心中每年期待的重要公益行動，而這份主動與熱情，正是基金會持續推動捐血家年華最重要的動力來源，「我們希望把善的力量一年比一年放大，讓公益成為日常」。</p><!--4--><p>\n</p><p>\r\n戴永輝強調，今年活動特別從高雄出發、從南到北一路匯流至全台各地，也感謝各縣市首長的支持，透過企業與地方政府合作，不僅穩定醫療血源，更同步將資源精準投入需要的地方，讓捐血行動與公益支持雙軌並進。</p><!--5--><p>\n</p><p>\r\n除了捐血行動外，大大數位基金會今年再度捐出等值逾千萬元的善款，並依照各縣市不同的需求挹注經費與資源，包括在高雄市投入社會局兒少照顧資源補助計畫200萬元；台中市捐贈財團法人台中市文教基金會200萬元；於苗栗縣資助苗栗縣政府教育處獎助學金200萬元；在新竹縣則是專款支持縣政府文化基金會200萬元；在桃園市分別撥付家外安置兒少學前教育補助計畫150萬元、及小衛星補助弱勢兒少寒暑期間照顧陪伴50萬元。</p><!--6--><p>\n</p><p>\r\n而在新北市及台北市，則是各捐贈一台復康巴士，提升身障朋友交通服務量能、並強化無障礙運輸服務。</p><!--7--><p>\n</p><p>\r\n大大基金會表示，公益不僅止於捐款，更重要的是長期陪伴與實質支持，讓教育、兒少照顧與身障交通等面向都能獲得穩定資源。</p><!--8--><p>\n</p><p>\r\n【大大攜手　讓愛永續】捐血活動特別準備暖心好禮，捐血者可獲得海霸王集團贊助的高級禮盒及大地酒店贊助的手工餅乾，讓民眾在付出愛心的同時，也感受滿滿溫暖。</p><!--9--><p>\n</p><p>\r\n戴永輝強調，從南到北，不只是地理上的接力，更是愛心的匯流與延續。誠摯邀請全台民眾三月起捲起衣袖，用一袋熱血守護更多家庭，讓善的力量在台灣這片土地上持續發光。</p><!--10--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/122328/9352468?from=edn_newestlist_rank",
            "pub_date": "2026-03-01 16:37:03",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "大大數位基金會捐血家年華3月起跑 串聯七縣市、目標15,000袋熱血",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>大大數位基金會發起「大大攜手 讓愛永續」捐血家年華活動，3月再度起跑！延續過往兩屆的熱烈迴響，今年將由高雄出發，從南到北展開愛心接力，串聯高雄市、台中市、苗栗縣、新竹縣、桃園市、新北市及台北市七大縣市，號召全民挽袖捐血，為全台血庫注入穩定能量。今年捐血目標提升至15,000袋，也將捐出逾千萬元的善款與物資，為台灣社會注入強大的暖流。</p><!--1--><p>\n</p><p>\r\n本屆活動再度邀請主持人暨律師謝震武擔任公益代言人。謝震武表示，公益最動人的力量，在於眾人齊心。今年從高雄出發，一路向北，象徵愛心匯流、溫暖全台，期盼更多民眾響應「捐血一袋，救人一家」，讓善的循環持續擴大。</p><!--2--><p>\n</p><p>\r\n捐血家年華今年已第三屆，從第一年10,000袋到第二年的12,000袋，每年比預期收獲更多愛心，這次目標再度提升，展現大大數位基金會一年比一年成長的行動力與承諾，各縣市首長也將親自出席，呼籲大眾踴躍捐血，為公益站台，攜手打造充滿溫度的城市力量。</p><!--3--><p>\n</p><p>\r\n大大數位基金會董事長戴永輝表示，基金會自成立以來，始終秉持「取之於社會，用之於社會」的初心，連續三年舉辦捐血家年華，每年都有許多熱血民眾主動共襄盛舉，今年更從1月開始就有許多民眾陸續來電詢問捐血活動舉辦時間及地點，這表示大大數位基金會舉辦的捐血活動已經走進民眾的日常，成為大家心中每年期待的重要公益行動，而這份主動與熱情，正是基金會持續推動捐血家年華最重要的動力來源，希望把善的力量一年比一年放大，讓公益成為日常。</p><!--4--><p>\n</p><p>\r\n戴永輝也強調，今年活動特別從高雄出發、從南到北一路匯流至全台各地，也感謝各縣市首長的支持，透過企業與地方政府合作，不僅穩定醫療血源，更同步將資源精準投入需要的地方，讓捐血行動與公益支持雙軌並進。</p><!--5--><p>\n</p><p>\r\n除了捐血行動外，大大數位基金會今年再度捐出等值逾千萬元的善款，並依照各縣市不同的需求挹注經費與資源，包括在高雄市投入社會局兒少照顧資源補助計畫200萬元；台中市捐贈財團法人台中市文教基金會200萬元；於苗栗縣資助苗栗縣政府教育處獎助學金200萬元；在新竹縣則是專款支持縣政府文化基金會200萬元；在桃園市分別撥付家外安置兒少學前教育補助計畫150萬元、及小衛星補助弱勢兒少寒暑期間照顧陪伴50萬元。在新北市及台北市各捐贈一台復康巴士，提升身障朋友交通服務量能、並強化無障礙運輸服務。基金會表示，公益不僅止於捐款，更重要的是長期陪伴與實質支持，讓教育、兒少照顧與身障交通等面向都能獲得穩定資源。</p><!--6--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/122328/9352461?from=edn_newestlist_rank",
            "pub_date": "2026-03-01 16:31:49",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        }
    ]
}