{
    "data": [
        {
            "title": "法外交部官員重申捍衛台海航行自由　林佳龍感謝",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>外交部今天表示，法國外交部歐洲權理部長哈達德日前在法國參議院院會重申，法國將持續捍衛台海航行自由。外交部長林佳龍誠摯感謝法國持續關注印太地區及台海的和平穩定，並表示台灣將持續與法國等民主國家緊密合作，維護和平。</p><!--1--><p>\n外交部上午發布新聞稿指出，注意到法國外交部歐洲事務權理部長哈達德（Benjamin Haddad）25日回應參議院友台小組副主席德維莎（Brigitte Devésa）有關台海安全的發言時指出，法國是印太地區一個實質存在並積極參與的強權，先前曾與英國、美國等國海軍在台海及南海執行巡弋任務，捍衛航行自由。</p><!--2--><p>\n哈達德表示，法國未來將持續與歐洲其他夥伴國家合作，將維護印太地區的集體安全與和平列為優先要務。</p><!--3--><p>\n外交部提到，德維莎在發言中說明台灣長期遭受中國全方位威脅，如果台海發生重大危機，勢必對歐洲經濟產生嚴重影響，並強調面對中國不斷施壓威脅民主台灣，歐洲應審慎省思因應之道，並籲請法國政府及歐盟協助台灣對抗中國帝國主義。</p><!--4--><p>\n外交部說明，林佳龍誠摯感謝法國持續關注印太地區及台海的和平穩定，法國是與台灣共享民主、自由及法治等普世價值的理念相近夥伴，對印太地區的和平與穩定扮演重要角色，台灣將持續與法國等民主國家緊密合作，以具體行動維護台海和平與穩定，捍衛以規則為基礎的國際秩序，共同促進印太地區乃至於全球的安全與繁榮。<script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--5--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/7307/9348059?from=edn_newestlist_rank",
            "pub_date": "2026-02-27 11:06:08",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AI 雲端明星 CoreWeave 財測遜色又大增資本支出 引發疑慮股價摔9%",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>AI雲端基礎設施供應商CoreWeave公布財報後，因虧損幅度超乎預期，加上資本支出計畫大幅攀升，引發市場對其擴張過快與資金壓力的疑慮，盤後股價重挫9%。</p><!--1--><p>\n</p><p>\r\nCoreWeave去年第4季每股虧損擴大至89美分，高於市場預計的49至72美分區間。營收為15.7億美元，年增110%，略優於預估的15.5億美元。至於市場更關注的展望，今年第1季營收預估將落在19億至20億美元之間，低於分析師預期的22.9億美元，短期成長動能略顯疲弱。</p><!--2--><p>\n</p><p>\r\n該公司並預告2026年資本支出將達到300億至350億美元，高於市場預期，也較2025年的103.1億美元顯著增加，顯示擴建資料中心與算力基礎設施的投資力道持續升溫。</p><!--3--><p>\n</p><p>\r\nCoreWeave出租輝達晶片與算力資源，客戶包括OpenAI、Meta與微軟。隨需求升溫，公司快速擴張，但債務也持續攀升。截至去年底，CoreWeave負債總額約213.7億美元。穆迪指出，其調整後槓桿倍數約6.9倍，在龐大資本支出下，未來至少18個月仍可能持續消耗現金。</p><!--4--><p>\n</p><p>\r\n對此，CoreWeave執行長英崔特（Mike Intrator）在受訪時表示，公司僅在確定客戶需求後才舉債購置設備，對此營運模式「毫無歉意」。他解釋，客戶急於取得更多算力，CoreWeave因此選擇加速擴張，即便短期內會犧牲部分利潤率。</p><!--5--><p>\n</p><p>\n</p><p>\n</p><p>\n<!-- /.photo --><script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--6--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/123398/9348056?from=edn_newestlist_rank",
            "pub_date": "2026-02-27 11:06:07",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "汽車場考3/30起增無號誌停讓　沒做1次扣32分出局",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>3月起將有多項交通新制實施，公路局預計，3月30日起小型車場考新增無號誌路口先停再開、大型車須做視野死角確認及指差確認考驗項目，一旦未做到，將一次扣32分出局。</p><!--1--><p>\n交通部公路局自1月30日起實施機車駕照筆試全面取消是非題，改為50題選擇題，而2月底至3月底還有多項交通新制將上路。</p><!--2--><p>\n公路局表示，自2月28日起實施新車（在台灣第1次申領牌照的車輛）車窗及擋風玻璃黏貼隔熱紙可見光透過率管理新制，並列為車輛檢驗項目。</p><!--3--><p>\n一般車輛若黏貼隔熱紙需有合格標識，前擋風玻璃透光率要在70%以上、前側窗40%以上；至於計程車及幼童專用車前擋黏貼70%以上、其餘車窗及後擋風玻璃均為40%以上。</p><!--4--><p>\n新申領牌照新車適用隔熱紙納管新制，舊車不溯及既往。公路局指出，若黏貼不合格的隔熱紙，各區監理所將要求限期改善並覆驗，違者依道路交通管理處罰條例第17條規定，最高可處新台幣1800元，逾期1個月以上者並吊扣牌照，逾期6個月以上者，註銷牌照。</p><!--5--><p>\n在強化以人為本駕駛訓練項目部分，公路局已要求駕訓班自1月起實施以人為本課程訓練。公路局表示，預計3月30日起小型車場考新增行經無號誌化路口先停再開、大型車須做視野死角確認及大型車指差確認等考驗項目，一旦未做到上述動作，一次扣32分，因成績達70分以上才合格，未確實執行者無法通過考試。</p><!--6--><p>\n為強化違規行為回訓矯正，交通部新增闖紅燈、無號誌路口未依路權行駛以及行近未設行車管制號誌的行人穿越道、醫院及學校等未依規定減速等項目，若一般駕駛人1年違規達3次者、營業大型車職業駕駛人1年達2次者，納入矯正講習對象，必須上3小時矯正防制班。</p><!--7--><p>\n鐵路部分，台鐵公司表示，自3月2日起，全線車站補票處除了原有的現金支付外，將全面新增信用卡及行動（條碼）支付服務；自乘車日3月3日起，每名旅客（依身分證字號、護照號碼或統一證號計算）每日可預訂車票張數，將由6張調整為9張。</p><!--8--><p>\n至於網路及行動郵局活存轉定存每日或每月合併上限自3月14日起也有所調整，根據中華郵政公告，將從300萬元降至100萬元，若超過當月限額，可至臨櫃辦理。<script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--9--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/5613/9348061?from=edn_newestlist_rank",
            "pub_date": "2026-02-27 11:06:06",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "派拉蒙確定收購華納兄弟！Netflix不玩了宣布退出「放棄併購」",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>華納兄弟探索（Warner Bros. Discovery，WBD）收購案出現關鍵變化！串流平台巨頭Netflix於昨（26）日晚間對外證實，考量競爭對手派拉蒙（Paramount Skydance）最新提出的條件更具吸引力，公司決定不再跟進出價，正式退出這場併購競逐。</p><!--1--><p>\n</p><p>\r\n綜合「衛報」報導，派拉蒙在修訂方案中將每股收購價由30美元調高至31美元，同時提出更高保障條款，包括若交易未能通過監管審查，將支付高達70億美元的終止費，並自9月起每季支付約6.5億美元的現金分段費（ticking fee）。在條件明顯優於先前方案的情況下，華納兄弟探索董事會評估後認為派拉蒙的提案更具優勢。</p><!--2--><p>\n</p><p>\r\n華納兄弟探索指出，Netflix原本仍有4個工作天可選擇是否提高報價，但Netflix共同執行長泰德薩蘭多斯與格雷格彼得斯在聲明中坦言，若要匹配派拉蒙的新條件，交易在財務層面已不具吸引力，因此決定不再參與競標。</p><!--3--><p>\n</p><p>\r\n消息公布後，市場隨即出現反應，Netflix股價於26日盤後上漲10%，派拉蒙股價上揚5%，華納兄弟探索股價則下跌約2%。華納兄弟探索執行長 大衛·扎斯拉夫 表示，Netflix確實是強勁的競爭對手，但他對與派拉蒙合併後的發展前景抱持更高期待，並強調一旦董事會通過合併協議，將有助於為股東創造長期價值。</p><!--4--><p>\n</p><p>\r\n原定於3月20日討論與Netflix合併案的華納兄弟探索股東大會，預計將改為表決與派拉蒙的合併方案。至於Netflix方面，則表示未來將回歸本業策略，持續聚焦內容投資與獲利能力。<!-- /.photo --><!-- /.photo --><script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--5--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/5599/9347935?from=edn_newestlist_rank",
            "pub_date": "2026-02-27 10:56:51",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "春雨來了 鋒面雲雨帶發展旺 北台灣大雨稍後換中部",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>春雨來了，鋒面雲系通過中，氣象粉專「台灣颱風論壇｜天氣特急」表示，雲雨帶發展相當旺盛，北台灣大雨中，稍後中部地區也要下大雨。</p><!--1--><p>\n</p><p>\r\n「台灣颱風論壇｜天氣特急」表示，今天、明天鋒面與華南雲雨帶通過，各地不定時短暫陣雨或雷雨，北部、中部有較大雨勢機會，東北季風稍增強，白天舒適、早晚偏涼。周日上午北部、中部、東部仍有降雨機會，南部多雲為主，午後雨勢趨緩，有短暫空檔，轉東南風，白天溫暖略悶。</p><!--2--><p>\n</p><p>\r\n󠀠下周一另一波鋒面影響，北部、東部短暫雨，中部陰天，南部多雲到晴。下周二華南雲雨區再度通過，各地有雨，天氣不穩定，東北季風增強，氣溫逐漸下降，早晚轉涼。</p><!--3--><p>\n</p><p>\r\n※以上言論僅供學術討論之用，氣象預報應以中央氣象署為準。<!-- /.photo --></p><!--4--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/122328/9347945?from=edn_newestlist_rank",
            "pub_date": "2026-02-27 10:56:49",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "228連假省道目前車流順暢 公路局曝下午地雷路段",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>今天為228連假第1天，交通部公路局表示，截至上午9時各省道交通車流順暢，預估下午易壅塞路段部分，主要城際道路，包括台61線鳳鼻至香山、竹南路段、中彰大橋、台1線水底寮至楓港，銜接國道路段台64線國3中和交流道、台74線快官路段西向、霧峰路段東向、台18線國3中埔交流道、台86線歸仁交流道東向、仁德系統東向將出現短暫車流。</p><!--1--><p>\n</p><p>\r\n公路局已請客運業者於115年228和平紀念日期期間籌備充足運能，並落實人員與車輛安全整備，本次連假亦推出國道客運優惠措施，如有返鄉旅運需求，仍建議搭乘公共運輸。</p><!--2--><p>\n</p><p style=\"word-break:break-all;\">\r\n公路局建議用路人出門前可先至公路局網站( http://www.thb.gov.tw )查詢路況，或下載「幸福公路」App，以避開塞車路段。<!-- /.photo --><!-- /.photo --><!-- /.photo --><!-- /.photo --><!-- /.photo --></p><!--3--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/122328/9347943?from=edn_newestlist_rank",
            "pub_date": "2026-02-27 10:56:47",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "鋒面報到 水利署把握機會在5水庫集水區人工增雨",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>北部下雨了，鋒面26日晚間影響中北部，經濟部水利署把握降雨雲層影響集水區的難得機會，於石門、寶二、永和山、明德及鯉魚潭等水庫，連續進行兩次地面人工增雨作業，今（27）日上午則於鯉魚潭施放高空燄彈，利用風向將燄劑帶往新竹山區，為集水區爭取更多的雨量。</p><!--1--><p>\n</p><p>\r\n新竹地區水情燈號25日調整為「水情提醒綠燈」，其他地區水情仍維持正常，水利署已嚴密監控各水庫蓄容，同時持續關注天氣情況，只要條件合適，不分晝夜，即啟動人工增雨作業。</p><!--2--><p>\n</p><p>\r\n根據天氣預測，水利預估明日起鋒面與華南雲雨區將持續影響台灣，這幾天只要有合適的氣象條件，立即把握時機進行增雨作業。<!-- /.photo --><script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--3--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/122328/9347928?from=edn_newestlist_rank",
            "pub_date": "2026-02-27 10:56:46",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "228連假天氣變化快速 今鋒面從北往南有雨 北部冷空氣影響大降溫",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>今天是228連假首日，天氣風險公司天氣分析師廖于霆今天表示，清晨起鋒面接近並通過台灣，北部首先開始下起雨來。隨鋒面往南移動，今天白天起，中南部也會逐漸轉為多雲時陰偶陣雨的天氣。</p><!--1--><p>\n</p><p>\r\n氣溫方面，他說，因為雲多下雨，中南部高溫略降到25至29度，感受舒適。北部及東北部受到鋒面後方東北風冷空氣影響，高溫降到18至20度，對比前一天的高溫有較大降幅，感受起來會比較冷一點。</p><!--2--><p>\n</p><p>\r\n鋒面影響到今天，廖于霆表示，明天開始東北季風增強，華南水氣通過，全台各地仍是陰陣雨天氣，降雨機率較高的地方是整個西半部。氣溫和今天差不多，北部東北部高溫18至20度，中南部及東南部高溫25至30度。各地低溫都在18至20度。</p><!--3--><p>\n</p><p>\r\n他說，周日偏南風增強，鋒面重新在台灣北方海面建立，華南雲系影響中部以北，中部以北仍有陣雨，東半部以及南部地區則是多雲天氣，南部可見到陽光。各地氣溫明顯回升，北部東北部高溫回升到24至25度。中南部及東南部高溫回升到26至30度。</p><!--4--><p>\n</p><p>\r\n今起3天連假天氣系統變化快速，廖于霆表示，每天都有不同風貌，如要外出，都要攜帶雨具，若是在北部、東北部活動，也要留意保暖，並留意台灣南北溫差。</p><!--5--><p>\n</p><p>\r\n※以上言論僅供學術討論之用，氣象預報應以中央氣象署為準。<!-- /.photo --></p><!--6--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/122328/9347870?from=edn_newestlist_rank",
            "pub_date": "2026-02-27 10:56:45",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "台灣女童在澀谷遭撞人族施暴 日網友肉搜曝本人辯稱在趕路 疑似慣犯",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>日前有一名台灣女童在日本東京澀谷街頭，遭藍衣婦人肘擊背部而撞飛，該影片曝光後，不只台灣的社群平台熱烈討論，更引起外媒注意而報導。日本X、Threads等社群平台網友對該名婦人竟向兒童出手感到憤怒，直指是暴力犯罪。據稱當事人遭肉搜到、疑辯解在「趕路」，有日本網友指此人是慣犯。</p><!--1--><p>\n</p><p>\r\n日本近幾年出現「撞人」現象，大多發生在大都會的車站周遭，早期受害者多為年輕女性，近來不少外國觀光客也有類似經驗。因台灣女童受害的影片引起討論，日本社群平台對此現象大加撻伐。</p><!--2--><p>\n</p><p>\r\n旅日台灣人「David日本奮鬥記｜日本美食·旅遊·生活觀點」在Threads發文，指日本撞人阿姨現在也在X炎上，「雖然困擾程度，日本人只判定到C+，但是附註說明還寫她是慣犯」，看樣子也不少人站出來指認了，目前累積了超過860萬瀏覽次數，「留言有人說她根本S+，不只C+」。</p><!--3--><p>\n</p><p>\r\nThreads的「日本撞人魔」標籤討論，網友議論，「有看到日本人說自己在澀谷也被同一個人撞過，如果屬實，她真的算是慣犯了」、「找到了啊，她是日本人，有人貼出來了，她自己承認了，說很趕，但看影片像故意左右肘擊」、「其實她是先撞在她左手邊的男人，再撞她右手邊的小孩，我覺得她是慣犯」、「超過1000萬個人看到原影片了」。</p><!--4--><p>\n</p><p>\r\n同樣也是旅日台灣人的「WHY LOW LIFE 歪樓人生」在Threads發文，住日本21年，這絕對是日本人，不要再說是不是中國人什麼的，在日本的撞人族不分男女、不分年紀，一直都是存在的，而且存在已久，他也有過類似經驗。「不要說什麼因為小女孩玩耍不對、被撞活該之類的話，這些撞人族即使你正常走在路上，他們也是會來撞你的」。</p><!--5--><p>\n</p><p>\r\n不少台灣網友認為日本人溫和有禮，應該不會故意撞人，「WHY LOW LIFE 歪樓人生」表示，會做這種事的，還真的只有日本人會。撞人族也是日本特有民族，連日本人都覺得頭痛。</p><!--6--><p>\n</p><p>\r\n其他網友表示，「日本在住4年的我，也被故意撞過好幾次，是真的有這些人存在」、「有在日本被撞過兩次的經驗，超傻眼，方式跟這女的一模一樣」、「我在京都過馬路時也被用力撞過，那時不知道什麼撞人族，超級痛」、「之前在日本被撞過一次，手上的iPhone直接摔下去，衝過去找那個女的理論，完全不理會」、「之前去東京玩，6天內在路上就看到有3次陌生人被撞的情況，變得在很多人的車站走路都感覺超級緊張」。<!-- /.photo --></p><!--7--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/5599/9348036?from=edn_newestlist_rank",
            "pub_date": "2026-02-27 10:50:57",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "美政府隱瞞川普早年被控猥褻未成年人？疑點重重未被採信",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>美國司法部自2025年12月起陸續上傳數百萬頁與已故「淫魔」富豪艾普斯坦相關檔案，但未包含三份涉及美國總統川普的備忘錄，疑似有人宣稱川普尚未從政前被控猥褻毆打未成年少女。不過，這些說法與川普及艾普斯坦早年活動時間線存在出入，而提出指控的女性本人亦曾面臨刑事指控。</p><!--1--><p>\n</p><p>\r\n衛報取得的文件收錄探員留下的25頁筆記，內容顯示該名女性自稱從一名兒時玩伴寄來的照片中認出艾普斯坦。不過，僅有未提及川普姓名的第一次會談內容被納入司法部公開檔案，衛報亦未公布該名女子姓名。</p><!--2--><p>\n</p><p>\r\n此前新聞中，這名女性宣稱，她在1983年、約僅13歲時被艾普斯坦介紹給川普，川普提到過類似這樣的話，「讓我教教妳小女孩應該是什麼樣子」，「之後強行將她的頭壓向他露出的性器官，她咬了他，川普便揮拳揍她的頭，並把她趕出去」。她還聲稱，曾在場聽到艾普斯坦與川普討論勒索他人，以及談及「透過賭場洗錢」等內容。</p><!--3--><p>\n</p><p>\r\n衛報已確認一名與FBI紀錄生平細節相符的女性，發現她曾面臨詐欺、竊盜及剝削老年人重罪。她的說法尚未獲得驗證，FBI亦未就此提出任何刑事起訴。此外，部分陳述內容顯得離奇，且與外界已知艾普斯坦在1980年代初期的生活情況存在矛盾。</p><!--4--><p>\n</p><p>\r\n艾普斯坦的弟弟馬克（Mark Epstein）受訪時表示，他並不知道哥哥曾於1980年代初期在這名女性居住的南卡羅來納州希爾頓黑德島度過夏天。川普曾於2002年受訪時表示，他約在15年前結識艾普斯坦。目前並無證據顯示川普與艾普斯坦在1983年相識，亦一再否認與艾普斯坦有任何不當行為。</p><!--5--><p>\n</p><p>\r\n一名政府官員證實，衛報取得的FBI報告屬實。司法部向NPR表示，「沒有任何內容被刪除」，並稱任何未公開的資料要麼屬於重複內容，要麼涉及受特權保護的資訊。司法部未立即回應置評請求。</p><!--6--><p>\n</p><p>\r\n司法部釋出的數百萬頁調查文件中，既包含曾引發涉案者辭職與被逮捕的重大指控，也包含後來被證明不實的說法。一名政府官員表示，這些於2019年提出、針對川普的指控被形容為「不具可信度」，相關文件存放於紐約南區聯邦檢察官辦公室（SDNY）的檔案中，並被審查人員列為重複文件。根據國會制定的條文規定，這類重複文件在法律上並無公開義務。<!-- /.photo --><script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--7--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/5599/9348035?from=edn_newestlist_rank",
            "pub_date": "2026-02-27 10:50:56",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "228連假首日！ 國道、省道路況一次看",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>和平紀念日連續假期首日，高公局預估27日交通量為115百萬車公里。上午重點壅塞路段為國1南向高架機場系統-楊梅端、楊梅-頭份、彰化系統-埔鹽系統，北向圓山-大華系統；國3南向中和-關西、快官-霧峰、草屯-名間；國5南向南港系統-頭城；國10東向鼎金系統-燕巢等路段。省道部分則是上午接順暢，主要是下午台61線鳳鼻至香山、竹南路段、中彰大橋、台1線水底寮至楓港，銜接國道路段台64線國3中和交流道、台74線快官路段西向、霧峰路段東向、台18線國3中埔交流道、台86線歸仁交流道東向、仁德系統東向將出現短暫車流。</p><!--1--><p>\n</p><p>\r\n高公局指出，目前僅國1高架南向校前路至楊梅休息站路段車多，其餘國道路段大致正常，截至上午7時，交通量為10.4百萬車公里，今日相關疏導措施包括： 0-12時國5石碇、坪林及5-12時國1平鎮系統、埔鹽系統南入匝道封閉，單一費率、國3新竹系統至燕巢系統採單一費率再8折收費、0-5時暫停收費、開放路肩、替代道路、匝道儀控等。</p><!--2--><p>\n</p><p>\r\n高公局預估今日上午重點壅塞路段為國1南向高架機場系統-楊梅端、楊梅-頭份、彰化系統-埔鹽系統，北向圓山-大華系統；國3南向中和-關西、快官-霧峰、草屯-名間；國5南向南港系統-頭城；國10東向鼎金系統-燕巢等路段。建議西部國道南向用路人儘量於12時後出發，國5南向用路人建議於17時後出發，節省寶貴時間。</p><!--3--><p>\n</p><p>\r\n至於省道部分，公路局指出，截至上午9時各省道交通車流順暢，預估下午易壅塞路段部分，主要城際道路台61線鳳鼻至香山、竹南路段、中彰大橋、台1線水底寮至楓港，銜接國道路段台64線國3中和交流道、台74線快官路段西向、霧峰路段東向、台18線國3中埔交流道、台86線歸仁交流道東向、仁德系統東向將出現短暫車流，建議用路人出門前可先至公路局網站查詢路況，或下載「幸福公路」App，以避開塞車路段及時段。</p><!--4--><p>\n</p><p>\r\n另高公局與公路局攜手合作，由高公局於每日的路況預報增加宣導省道及快速公路管制措施、壅塞情形預測、國道客運優惠措施等。跨機關合作整合交通資訊，提升民眾出行便利與安全。</p><!--5--><p>\n</p><p>\r\n交通部呼籲民眾出門務必檢查好車況並養足精神，開車時需繫妥安全帶並手握方向盤，勿倚賴輔助駕駛系統，隨時注意前方動態。另今日部分地區有下雨情形，行車務必開亮頭燈，適度放慢車速並拉長與前車距離，避免任意變換車道，小心駕駛以確保行車安全。</p><!--6--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/122328/9348013?from=edn_newestlist_rank",
            "pub_date": "2026-02-27 10:46:05",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "台東大學人文學院與泰國法政大學創新學院合作交流",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>國立台東大學人文學院26日與泰國國立法政大學創新學院簽署合作備忘錄，雙方未來將持續推動學生、教師與行政人員交流，發展短期研習、實習計畫與跨域研究合作。</p><!--1--><p>\n台東大學今天發布新聞稿表示，為拓展師生國際交流機會並深化學術合作，台東大學人文學院於26日與泰國國立法政大學創新學院（College of Innovation,Thammasat University）簽署合作備忘錄（MOU），共同開啟台泰跨域創新與藝術人文交流新篇章。</p><!--2--><p>\n台東大學表示，昨天簽署儀式由台東大學人文學院長兼學術副校長靳菱菱與泰國國立法政大學創新學院院長坎比拉農（Assoc. Prof. Kom Campiranon, Ph.D.）共同代表簽署。這次合作源自2025年「國立台東大學國際交流深化計畫-台東曼谷雙城生活美學學研交流計畫」。</p><!--3--><p>\n台東大學表示，依據QS 2026年世界大學排名，泰國國立法政大學於全球1501所受評比大學中名列第551名，為泰國國內第4名。該校創立於1934年，創新學院成立於1991年，定位為跨領域研究導向學院，設有服務創新、創意產業、文化資產管理、數位轉型與資料科學等學程，強調多元融合與創新實踐。</p><!--4--><p>\n預計今年6月由泰國國立法政大學創新學院選送約10名創意產業學生來台進行暑期移地教學，課程將由台東大學美術產業學系規劃，內容涵蓋部落文化體驗、台東慢食與食農實踐、大地藝術導覽、文創聚落踏查及藝文館所參訪等，帶領學生認識台東地方創生與文化創意產業發展。</p><!--5--><p>\n台東大學亦將規劃赴泰回訪交流，分享台東文創與地方創生案例，並安排藝文機構參訪與材質探索工作坊，深化雙方在藝術實踐與創意產業領域的合作。</p><!--6--><p>\n台東大學表示，依據合作備忘錄內容雙方未來將持續推動學生、教師與行政人員交流，發展短期研習、實習計畫與跨域研究合作，備忘錄效期3年，期能在既有基礎上穩健推進合作，拓展東南亞學術版圖，結合藝術人文與創新實踐，為台泰雙方師生創造更具深度與實踐性的國際學習契機。<script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--7--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/7307/9348016?from=edn_newestlist_rank",
            "pub_date": "2026-02-27 10:46:03",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AI太旺出口狂飆　主計總處估115年超額儲蓄衝破8兆元",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>人工智慧（AI）狂潮來襲，台灣半導體、資通訊產業受惠，出口屢創新高。根據主計總處最新預測，在去年的高基期之下，115年經濟成長率仍有7.71%的亮眼表現，但龐大經常帳順差也讓今年超額儲蓄衝破新台幣8兆元大關，超額儲蓄率跳升至26.03%，雙雙改寫新高。</p><!--1--><p>\n儲蓄與投資差額又被稱為「超額儲蓄」，近年規模持續擴增，109年首破3兆元後，113年向上衝破4兆元，並持續加速，114年突破5兆元，主計總處估115年將直接衝破8兆元大關，升至8兆4603億元。</p><!--2--><p>\n主計總處解釋，AI強勁需求超乎預期，且主要雲端服務業者（CSP）大幅擴增AI相關資本支出，對台灣半導體及資通產品需求持續強勁，均有助出口規模持續擴增，推升經常帳順差。</p><!--3--><p>\n而從國民所得會計恆等式觀點，經常帳順差與超額儲蓄是一體兩面；經常帳順差規模擴大，超額儲蓄也會增加。</p><!--4--><p>\n儘管外界慣以閒置資金的角度看待超額儲蓄，主計總處多次說明，近年AI熱潮來襲，出口屢創新高，國內投資也同步成長，不宜以超額儲蓄規模擴大，意味投資動能不足的方式解讀。</p><!--5--><p>\n主計總處官員指出，AI需求除了拉動出口，半導體領導廠商為了舒緩供不應求瓶頸，加快在台建廠速度或優化跨製程產能，增加高階產品產量，相關封測與記憶體業者因應市場需求調高在國內資本支出，均激勵投資動能。</p><!--6--><p>\n從數據來看，國內投資毛額114年突破7兆元大關，主計總處預估115年續升至7兆8211億元，顯示廠商投資腳步並未停歇。<script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--7--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/10869/9348017?from=edn_newestlist_rank",
            "pub_date": "2026-02-27 10:46:02",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "央視：轟6K首次飛出第一島鏈千餘公里 在巴士海峽遇外機「亮肚皮」",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>大陸央視國防軍事頻道「礪劍」欄目26日播出內容宣稱，在某次演訓中，解放軍轟6K戰機首次飛出第一島鏈1000餘公里，創造了當時空軍前出距離最遠等多項紀錄，並稱當時其雙機編隊在巴士海峽口遇到兩架「外機」逼近，且對方向其「亮肚皮」展示掛彈。報導並未提及演訓時間點。</p><!--1--><p>\n</p><p>\r\n報導表示，在某次演訓中，解放軍空軍出動轟炸機、殲擊機等多型戰機赴西太平洋開展遠海訓練，「與以往不同的是，此次任務，轟6K戰機將飛出第一島鏈1000餘公里。」一小時後，雙機編隊來到巴士海峽口時，指揮所傳來通報指，前方有兩架「外機」正在逼近。</p><!--2--><p>\n</p><p>\r\n解放軍空軍某部人員王建嶺在報導中表示，「他抵近我們之後，向我們亮肚皮，展示他的導彈，有點像攻擊位。」解放軍空軍某部人員李銳形容，「相當於兩個人，然後一個人拿著槍，可以說是，扳機隨時上膛，然後就可以擊發。」</p><!--3--><p>\n</p><p>\r\n報導接著播放一段廣播警告，內容是：「我是中國空軍，正在例行訓練，不要干擾我方行動。立刻離開，否則後果自負。」</p><!--4--><p>\n</p><p>\r\n報導稱，面對外機的層層阻撓，轟6K機組航向不變、高度不改，按時抵達目標空域，完成所有預定訓練課目。當天，他們首次飛出第一島鏈1000餘公里，創造了當時解放軍空軍前出距離最遠等多項紀錄。</p><!--5--><p>\n</p><p>\r\n轟6K的最大載彈量十幾噸，翼下可以配置六個掛架，可以攜帶遠程的巡航導彈和反艦導彈。</p><!--6--><p>\n</p><p>\r\n2015年3月，轟6K首次前出第一島鏈，飛越西太平洋。報導表示，11年來，轟6K飛越了巴士海峽、宮古海峽、對馬海峽等，實現常態化赴西太平洋遠洋訓練、常態化警巡東海防空識別區、常態化繞島巡航、常態化戰巡南海，「成為維護國家主權與領土完整的重要力量」。<!-- /.photo --></p><!--7--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/5603/9348029?from=edn_newestlist_rank",
            "pub_date": "2026-02-27 10:46:00",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "台英經貿科技合作　由政策倡議走向產業扎根",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>英國2023年與台灣建立「提升貿易夥伴關係」（ETP），是第一個與台灣建立雙邊經貿制度化架構的歐洲國家。展望新的一年，雙邊合作預期將在歷年累積的政策倡議基礎上，以促進更多產業扎根和技術落地為重點。</p><!--1--><p>\n駐英國代表姚金祥向中央社表示，總統賴清德提出打造台灣為「智慧科技島」的國政願景，政府同時推動「AI（人工智慧）新十大建設」，涵蓋研究、應用、人才培育等層面。台灣與英國在科技產業具高度互補優勢，相信在全球AI發展浪潮下，將是彼此密不可分的關鍵夥伴。</p><!--2--><p>\n姚金祥說，英國率歐洲各國之先與台灣建立雙邊經貿制度化架構，意義重大。去年在台英年度經貿對話舉行期間，雙方在ETP架構下，簽署聚焦投資、數位貿易，以及能源和淨零排放等3大重點領域的子協議，展現強化合作的決心。</p><!--3--><p>\n英國是台灣在歐洲的第4大貿易夥伴、第2大投資來源國，以及第3大投資目的地。姚金祥說，期盼英國能公開支持台灣加入「跨太平洋夥伴全面進步協定」（CPTPP），一同維護公平開放的國際自由經貿秩序、打造高標準全球民主韌性供應鏈。</p><!--4--><p>\n英國於2024年12月正式成為CPTPP一員，是率先加入CPTPP的歐洲經濟體。</p><!--5--><p>\n英國商業暨貿易部2月初發布的資料顯示，台英雙邊貨品與服務年貿易額規模達91億英鎊（約新台幣3850億元）。</p><!--6--><p>\n以金額統計，英國出口台灣在貨品和服務貿易領域的前3大品項分別為醫藥產品、飲料和菸品、汽車，以及金融、其他商業服務、旅遊；英國自台灣進口的前3大貨品和服務品項則分別為電信和音訊設備、辦公器械、金屬製品，以及其他商業服務、金融、運輸。</p><!--7--><p>\n英國政府去年6月陸續發布「產業戰略」和「貿易戰略」。其中，「產業戰略」揭示英國8大重點發展領域，分別為先進製造、潔淨能源、創意產業、國防產業、數位與科技產業、金融服務、生命科學，以及專業和商業服務，與台灣推動的「五大信賴產業」（半導體、人工智慧、軍工、安控及次世代通訊）以及台灣產業強項有不少相互呼應之處。</p><!--8--><p>\n此外，在這部英國於2020年脫離歐洲聯盟（EU）後首次發布的「貿易戰略」中，英國政府表態願與台灣進一步發展ETP，並指出英國支持CPTPP「盡速擴張」、納入更多經濟體，包括未與英國簽署自由貿易協定（FTA）的經濟體。</p><!--9--><p>\n儘管根據英國政府去年4月發布的2024-2025年度「英國企業調查」（British Business Survey），認為業務運作未受地緣政治因素（不限於兩岸）影響的在台英國企業占比由62%下降至42%，根據英國出口信貸局（UKEF）近日提供的資訊，UKEF對台灣市場的風險胃納（即願承擔的最高風險限額）為40億至50億英鎊，屬於高區間，金額與美國相當，這顯示英方對台灣的投資環境具一定信心。</p><!--10--><p>\n駐英國代表處經濟組告訴中央社，在全球地緣經濟競爭升溫、供應鏈重組，以及經濟安全議題日益重要的背景下，台英雙邊合作將由政策倡議轉向側重「務實執行與產業落地」。隨著各國強化關鍵產業自主、推動高科技投資及淨零轉型，台英也將在既有制度架構下深化合作，提升雙邊經貿韌性。</p><!--11--><p>\n台灣與英國在經貿、能源、半導體、農業等優先議題領域，已確立定期對話機制。駐英經濟組表示，今年規劃3大工作重點：強化雙邊產業媒合與企業對接、落實ETP的3大重點領域子協議，並加強推動「可於短期內產生成效」的貿易與投資。</p><!--12--><p>\n駐英科技組則指出，今年擬加強推動與英國在高算力、矽光子、量子科技和AI機器人等領域的合作，拓展AI產業生態鏈，並擴展人才培育機制。</p><!--13--><p>\n此外，科技組規劃今年內舉辦台英AI科技論壇，同時期待台英之間能確立制度化的「科技對話」。</p><!--14--><p>\n駐英代表處另向中央社表示，台灣歡迎英國政府官員及各界專家多加利用「全球合作暨訓練架構」（GCTF）平台，透過GCTF與台灣及其他理念相近夥伴交流各領域專業知識、技術與實務經驗。</p><!--15--><p>\n台灣與美國2015年簽署備忘錄成立GCTF，自2019年起，日本、澳洲、加拿大、英國陸續加入成為「正式夥伴」。正式夥伴成員每年召開聯合委員會會議，討論內容包括新年度合作議題。</p><!--16--><p>\n台灣對外貿易發展協會（TAITRA）駐英據點「倫敦台灣貿易中心」則告訴中央社，今年將持續聚焦英國的重點發展產業與台灣的優勢產業，積極邀請買主赴台採購，並推動技術對接，領域涵蓋生技醫療、航太產業、綠色能源、高附加價值汽車零組件、精密加工、高階扣件、電子產業、先進製造等。</p><!--17--><p>\n台貿中心表示，將繼續協助台灣企業掌握英國產業升級與轉型商機，以及赴英參展拓銷。</p><!--18--><p>\n英國智庫「中國戰略風險研究所」（CSRI）執行長安德魯．葉（Andrew Yeh）告訴中央社，台英經貿關係仍有巨大發展潛力；英國在科學以及科技的研究與開發具世界領導地位，但常在「商品化」遭遇困難。相對地，台灣擁有創新、靈活、富含高科技的多樣供應鏈，可以是英國業者進行試作、拓展生產活動的好選擇。<script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--19--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/5612/9348005?from=edn_newestlist_rank",
            "pub_date": "2026-02-27 10:36:47",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "巴基斯坦轟阿富汗喀布爾　防長稱進入公開交戰",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>巴基斯坦今天轟炸阿富汗多座主要城市，包括首都喀布爾。巴基斯坦國防部長宣布，在歷經數個月以牙還牙的衝突後，這兩個鄰國處於「公開交戰」狀態。</p><!--1--><p>\n法新社報導，阿富汗部隊昨晚攻擊巴基斯坦邊界軍隊，塔利班政府表示，這是在報復稍早造成死傷的空襲，派駐喀布爾（Kabul）與坎達哈（Kandahar）的法新社記者聽到爆炸聲響與戰機飛越聲音。</p><!--2--><p>\n近幾個月來，這兩個鄰國的關係跌到冰點，自去年10月發生致命戰鬥，造成雙方超過70人死亡後，陸地邊境口岸大多數處於關閉狀態。</p><!--3--><p>\n伊斯蘭馬巴德指控阿富汗沒有對在巴基斯坦發動攻擊的武裝團體採取行動，但塔利班政府對此予以否認。</p><!--4--><p>\n兩國在卡達與土耳其居中斡旋下曾初步達成停火，隨後也舉行過數輪談判，但始終未能達成持久的協議。</p><!--5--><p>\n最近幾個月，巴基斯坦多次空襲阿富汗，並在邊境地區發生衝突。兩國軍方表示，在最新一輪邊界暴力衝突中，雙方都有數十名官兵死亡。</p><!--6--><p>\n巴基斯坦資訊暨廣播部部長塔拉（Attaullah Tarar）在社群平台X上發文表示：「阿富汗塔利班在喀布爾、帕克提亞省（Paktia）與坎達哈的軍事目標遭鎖定。」國防部長阿瑟夫（Khawaja Asif）宣布與塔利班政府進入「全面對抗」。</p><!--7--><p>\n阿瑟夫在X上發文表示：「我們的耐心已到極限。我們與你們之間現在是公開交戰。」<script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--8--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/5599/9348007?from=edn_newestlist_rank",
            "pub_date": "2026-02-27 10:36:45",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "外溢保單新契約保費衝破400億 磊山保經：保險功能逐漸走向事先預防",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>台灣正式邁入超高齡化社會，國人對健康與退休議題更為關注，根據金管會統計，2025年外溢保單新契約保費，年增率61%，首度突破400億元大關，顯示健康促進型保單已逐漸走入民眾心中。磊山保經指出，這股成長動能背後，來自保障觀念的提升，保險功能也從「事後補償」，逐步走向「事先預防」。</p><!--1--><p>\n</p><p>\r\n磊山保經新竹營運處資深業務副總鄭家袖表示，外溢型保單主要分成以運動習慣折減保費或增加保額的健走型保單、以體況數值折減保費或增加保額的健檢型保單、提供其他非現金方式給付促進健康的保單。她認為，當保險成為促進健康的同行者，其保障功能就自然延伸為守護家庭的基石，這正是外溢保單在超高齡社會中所展現的價值，把日常預防觀念及健康行動，落實於保障之中。</p><!--2--><p>\n</p><p>\r\n外溢型保單適合哪些族群？鄭家袖指出，外溢機制強調長期參與及自我管理，較適合本身已有規律運動習慣、定期健康檢查，並願意持續追蹤健康數據的族群。她表示，外溢設計的核心在於「持續」而非「短期衝刺」，當健康管理成為生活日常，外溢機制便能成為保障的加分項；反之，若不習慣長期健康管理，可能難以發揮其完整效益。她強調，保險規劃的關鍵，不在於商品是否優惠，而在於是否符合個人生活節奏與特質。</p><!--3--><p>\n</p><p>\r\n不過，鄭家袖也說，外溢型保單確實可為保障加分，但真正支撐家庭長期穩定，仍是完整的責任保障與財務規劃。</p><!--4--><p>\n</p><p>\r\n談到責任保障架構，鄭家袖指出，所謂基礎責任保障，是守住家庭最核心且最重要的責任，主要涵蓋三大面向，一是壽險保障，當主要收入者發生變故時，家庭的生活品質不致瞬間失衡；二是重大疾病或重大傷病保障，協助家庭在面對醫療費用增加與收入減少的雙重壓力時，仍能維持基本經濟穩定；三則是長期財務安排，包括退休規劃，確保人生後半段保有穩定現金流，而非依賴他人。</p><!--5--><p>\n</p><p>\r\n為什麼是這三件事？她表示，這三項規劃所對應的正是家庭最難承受的風險，包括收入中斷、醫療負擔加重，以及退休後缺乏穩定財務來源。她提醒，保障規劃應有層次，當責任底盤穩固後，再透過健康促進機制提升保障深度，才能為家庭建立長期且穩健的安全網。</p><!--6--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/5613/9348003?from=edn_newestlist_rank",
            "pub_date": "2026-02-27 10:36:44",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "資安院、中科院簽署 MOU 整合資安與國防科技能量",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>國家資通安全研究院與國家中山科學研究院26日簽署合作備忘錄（MOU），建立制度化合作機制，雙方將整合資安技術、資安治理與國防科研能量，共同強化我國關鍵基礎設施與國防體系之資安防護韌性。</p><!--1--><p>\n</p><p>\r\n資安院指出，本次合作範疇涵蓋關鍵基礎設施資安防護強化、跨國網路攻防演練、資安治理成熟度評估、零信任架構、AI產品與系統安全評測與資安情資分享等面向。AI技術快速發展與新型態攻擊手法持續演進的背景下，雙方將透過制度研析、技術整合與實際場域驗證，提升我國面對新型態攻擊手法與高風險威脅情境之辨識、預警與應處能力。</p><!--2--><p>\n</p><p>\r\n中科院表示，烏俄戰爭引入AI，驅動全球第2次軍事事務革命，推進無人載具系統自主化發展，當前透過軟體運算快速迭代，提升武器精確效能；為使國防科研順遂，確保資通訊安全至為關鍵，結合雙方專業人力和工作經驗，降低AI帶來的弱點風險，讓國防投資更有效率，迅捷達成國軍作戰需求。</p><!--3--><p>\n</p><p>\r\n資安院表示，資安院長期致力於資安技術研發、治理方法研析及演練實務，中科院則具備國防科技研發、系統整合工程與關鍵技術自主化之深厚基礎。本次兩大國家級行政法人建立合作平台，具備國家安全之戰略高度，亦形塑跨行政法人、跨專業領域的長期協作機制，為國家行政法人科研體系在資安與AI安全領域建立穩固基礎。</p><!--4--><p>\n</p><p>\r\n面對組織導入AI技術所衍生之資安風險與治理挑戰，雙方亦將強化可信任AI與安全測試機制之合作，確保技術創新與資安防護同步發展。未來雙方將持續深化技術交流與專業人才培育，整合科研資源與場域驗證能量，為國家安全、科技自主發展與數位韌性環境紮下更穩固的基礎。<script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--5--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/5613/9348015?from=edn_newestlist_rank",
            "pub_date": "2026-02-27 10:36:42",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "228連假首日！ 國道、省道路況一次看",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>和平紀念日連續假期首日，高公局預估27日交通量為115百萬車公里。上午重點壅塞路段為國1南向高架機場系統-楊梅端、楊梅-頭份、彰化系統-埔鹽系統，北向圓山-大華系統；國3南向中和-關西、快官-霧峰、草屯-名間；國5南向南港系統-頭城；國10東向鼎金系統-燕巢等路段。省道部分則是上午接順暢，主要是下午台61線鳳鼻至香山、竹南路段、中彰大橋、台1線水底寮至楓港，銜接國道路段台64線國3中和交流道、台74線快官路段西向、霧峰路段東向、台18線國3中埔交流道、台86線歸仁交流道東向、仁德系統東向將出現短暫車流。</p><!--1--><p>\n</p><p>\r\n高公局指出，目前僅國1高架南向校前路至楊梅休息站路段車多，其餘國道路段大致正常，截至上午7時，交通量為10.4百萬車公里，今日相關疏導措施包括： 0-12時國5石碇、坪林及5-12時國1平鎮系統、埔鹽系統南入匝道封閉，單一費率、國3新竹系統至燕巢系統採單一費率再8折收費、0-5時暫停收費、開放路肩、替代道路、匝道儀控等。</p><!--2--><p>\n</p><p>\r\n高公局預估今日上午重點壅塞路段為國1南向高架機場系統-楊梅端、楊梅-頭份、彰化系統-埔鹽系統，北向圓山-大華系統；國3南向中和-關西、快官-霧峰、草屯-名間；國5南向南港系統-頭城；國10東向鼎金系統-燕巢等路段。建議西部國道南向用路人儘量於12時後出發，國5南向用路人建議於17時後出發，節省寶貴時間。</p><!--3--><p>\n</p><p>\r\n至於省道部分，公路局指出，截至上午9時各省道交通車流順暢，預估下午易壅塞路段部分，主要城際道路台61線鳳鼻至香山、竹南路段、中彰大橋、台1線水底寮至楓港，銜接國道路段台64線國3中和交流道、台74線快官路段西向、霧峰路段東向、台18線國3中埔交流道、台86線歸仁交流道東向、仁德系統東向將出現短暫車流，建議用路人出門前可先至公路局網站查詢路況，或下載「幸福公路」App，以避開塞車路段及時段。</p><!--4--><p>\n</p><p>\r\n另高公局與公路局攜手合作，由高公局於每日的路況預報增加宣導省道及快速公路管制措施、壅塞情形預測、國道客運優惠措施等。跨機關合作整合交通資訊，提升民眾出行便利與安全。</p><!--5--><p>\n</p><p>\r\n交通部呼籲民眾出門務必檢查好車況並養足精神，開車時需繫妥安全帶並手握方向盤，勿倚賴輔助駕駛系統，隨時注意前方動態。另今日部分地區有下雨情形，行車務必開亮頭燈，適度放慢車速並拉長與前車距離，避免任意變換車道，小心駕駛以確保行車安全。</p><!--6--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/5930/9348013?from=edn_newestlist_rank",
            "pub_date": "2026-02-27 10:36:41",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "美國開始調查撤銷中國最惠國待遇的影響 可能提高中國關稅",
            "description": "<section class=\"article-body__editor\" id=\"article_body\">\n<!--0--><p>美國國際貿易委員會（ITC）26日宣布啟動調查，評估六年期間內撤銷中國大陸永久性正常貿易關係地位（PNTR，俗稱「最惠國待遇」）的經濟影響，可能推升中國大陸輸美商品的關稅。</p><!--1--><p>\n</p><p>\r\nITC表示，國會撥款法案已要求該機構啟動調查，評估撤銷中國大陸最惠國待遇對美國經濟、產業及產品上游採購的影響，並將依法在8月21日公布調查結果。</p><!--2--><p>\n</p><p>\r\nITC表示，報告將聚焦於在中國大陸輸美產品關稅上調至高於最惠國稅率的水準時，美國可能遭受直接且最大影響的貿易產業、生產及物價，並將評估另一種情境，在國會撤銷中國大陸永久PNTR時，分五年時間逐步對攸關國安的重要產品課徵關稅。</p><!--3--><p>\n</p><p>\r\nUSITC表示，「由於這項調查的時程加速，IRC不計劃舉行公共聽證會」，公眾能在4月13日工作日結束前，針對提高對陸關稅的影響提交書面意見。</p><!--4--><p>\n</p><p>\r\n若美國撤銷中國大陸的PNTR，將提高中國大陸的基本最惠國稅率，且將疊加在美國總統川普所課徵的所有懲罰性關稅之上。</p><!--5--><p>\n</p><p>\r\n川普2025年1月就職時，便指示貿易和商務主管機關評估撤銷中國大陸PNTR的立法提案，並陸續對中國大陸產品加徵關稅，疊加在常見的約2.5%最惠國稅率之上。<!-- /.photo --><script> $(document).ready(function () {nstockStoryStockInfo();});</script></p><!--6--><!--99--> </section>",
            "link": "https://money.udn.com/money/story/5599/9347979?from=edn_newestlist_rank",
            "pub_date": "2026-02-27 10:26:05",
            "source": "forbes",
            "kind": 1,
            "language": "en"
        }
    ]
}