{
    "data": [
        {
            "id": 161636,
            "title": "美联储戴利：反对先发制人的政策行动，可以慢慢应对特朗普政策",
            "description": "<div><p style=\"text-align: justify;\">2027年FOMC票委、旧金山联储主席戴利周二表示，美国经济状况良好，<strong>美联储无需对特朗普政府引入的政策快速做出反应</strong>。</p>\n<p style=\"text-align: justify;\">“存在很多不确定性，”戴利在加州公共事务委员会主办的小组讨论会上表示。但她补充道，“我们可以花时间看看经济和任何政策变化的进展。”</p>\n<p style=\"text-align: justify;\">戴利说：“我们在决策时<strong>不需要抢先</strong>。”</p>\n<p style=\"text-align: justify;\">戴利还表示，将通胀降低到2%的任务尚未完成，她正在将“100%的精力”投入到这一任务中。</p>\n<p style=\"text-align: justify;\">戴利和其他美联储官员正面临与特朗普政府可能采取的政策相关的极大不确定性，这些政策可能涉及关税、移民、税收和监管，并可能影响美国经济。</p>\n<p style=\"text-align: justify;\">在周二早些时候发布的另一篇采访中，戴利告诉《纽约时报》，她对决策者在12月份的预测仍感到满意，该预测显示今年降息50个基点的可能性得到广泛支持。<strong>戴利反对先发制人的政策行动</strong>，称美联储需要评估特朗普政策的“范围、规模和时间”。</p>\n<p style=\"text-align: justify;\">戴利表示美联储目前<strong>“无需未雨绸缪”</strong>。“我们已经为当前及我们预计的经济制定了政策，现在我们有时间积极观察还会有哪些措施出台。”她说。</p>\n<p style=\"text-align: justify;\">戴利表示，她关注的是特朗普政策的<strong>“净效应”</strong>，而不是单独评估每项政策。“如果一项政策变化将刺激增长，最终降低通胀，而与此同时又有其他因素略微推高通胀，那么在对政策有更多细节之前，你无法知道净效应会是什么，”她说。</p>\n<p style=\"text-align: justify;\">“在我们对范围、规模、时间以及这些特征如何在经济中运作有更多了解之前，我们实际上只是在猜测，”戴利补充道。“政策失误最简单的方法就是臆测。”</p>\n<p style=\"text-align: justify;\">“我认为我们必须对此持非常开放的态度，不管是需要减少降息还是增加降息。”她在提到降息次数时说。</p>\n<p style=\"text-align: justify;\">上一次美联储面对由特朗普主导的贸易战时，它采取了先发行动以防止经济过度疲软。美联储在2019年夏季和秋季的连续会议上三次降低利率，这一行动后来被称为对贸易战经济影响的“保险”。</p>\n<p style=\"text-align: justify;\">“现在的世界已经不同了，”戴利说。“历史是一个数据点，但不是行动指南。” </p>\n<p style=\"text-align: justify;\">在特朗普第一次发起贸易战期间，美国通胀始终低于美联储2%的目标，全球经济增长预测也变得悲观。全美各地的公司也开始收缩，因为不确定性给商业活动带来了寒意。今天最大的对比是美国通胀率仍高于2%。这是一个问题，因为消费者和企业可能对任何可能导致价格再度上涨的风险更加敏感。 </p>\n<p style=\"text-align: justify;\">如果出现迹象表明通胀预期正在失去锚定，美联储可能被迫采取行动。戴利表示，这是需要“关键”考虑的因素。“令人放心的是，我们真正关注的长期通胀预期并没有真正改变，”她说。劳动市场“没有”疲软迹象，这使得美联储有更大的空间维持不变。她补充说：<strong>“经济状况非常好。”</strong> </p>\n<p style=\"text-align: justify;\">美联储将关注周五发布的1月非农就业报告，以寻找任何表明情况正在变化的迹象。经济学家预计就业增长将慢于去年12月增加的25.6万个职位，这部分反映了劳工统计局通过纳入新数据进行的年度修订。</p>\n<p style=\"text-align: justify;\">周二公布的美国12月份职位空缺数降至三个月低点，从11月修订后的816万个减少到760万个，与劳动力市场的逐步放缓趋势一致。这应会继续抑制工资增长，并支持美联储关于就业市场不再是通胀压力来源的说法。</p>\n<p style=\"text-align: justify;\">彭博经济学家表示，“职位总数的下降有些夸大了劳动力市场降温的速度。辞职率的上升、裁员率的稳定以及周期性行业的职位空缺增加表明劳动力市场比总数量变化更加稳定。然而，我们预计未来几个月的劳动力需求将在一个相对缓慢的降温轨道上发展。” </p></div>",
            "image": "https://img.jin10.com/news/25/01/cPP7f1tVAvOeTh4lSU5V-.png/lite",
            "link": "https://xnews.jin10.com/details/161636",
            "pub_date": "2025-02-05 05:44:28",
            "source": "jin10_articles_articles",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 161635,
            "title": "特朗普重新施加对伊“最大压力”，欲将其石油出口降至零",
            "description": "<div><div data-immersive-translate-effect=\"1\" data-immersive_translate_walked=\"d7bcc481-3fd5-4f19-bb4f-2ba27b28a87f\" data-testid=\"paragraph-0\" style=\"text-align: justify;\">美国总统特朗普周二恢复对伊朗的<strong>“最大压力”</strong>政策，其中包括努力使其石油出口降至零，以阻止德黑兰获得核武器。</div>\n<div data-immersive-translate-effect=\"1\" data-immersive_translate_walked=\"d7bcc481-3fd5-4f19-bb4f-2ba27b28a87f\" data-testid=\"paragraph-1\" style=\"text-align: justify;\">\n<p>在与以色列总理内塔尼亚胡会面之前，特朗普签署了总统备忘录，重新施行华盛顿在他第一任期内实行的<strong>对伊朗的强硬政策</strong>。</p>\n</div>\n<div data-immersive-translate-effect=\"1\" data-immersive_translate_walked=\"d7bcc481-3fd5-4f19-bb4f-2ba27b28a87f\" data-testid=\"paragraph-2\" style=\"text-align: justify;\">\n<p>在签署备忘录时，特朗普称其<strong>非常严厉</strong>，并表示是否采取行动让他感到纠结。他说，<strong>伊朗不能拥有核武器</strong>，他希望能够与德黑兰达成协议。特朗普表示，<strong>如果伊朗进行报复并试图对其进行刺杀，伊朗将会被彻底摧毁。</strong></p>\n<p>特朗普表示，<strong>美国有权封锁伊朗的石油</strong>，并警告称，德黑兰正在接近开发自己的核武器能力。他指责前总统拜登未能严格执行石油出口制裁，特朗普表示，这让德黑兰有恃无恐，声称伊朗在拜登任期内无视制裁，使石油出口几乎恢复到满负荷，通过出售石油来资助核武器计划和中东的武装民兵。</p>\n</div>\n<div data-immersive-translate-effect=\"1\" data-immersive_translate_walked=\"d7bcc481-3fd5-4f19-bb4f-2ba27b28a87f\" data-testid=\"paragraph-4\" style=\"text-align: justify;\">\n<p>联合国核监督机构负责人在去年12月告诉路透社，伊朗正在<strong>“显著”加速</strong>将铀浓缩至最高60%的纯度，接近约90%的武器级浓缩水平。伊朗否认有意发展核武器。</p>\n</div>\n<div data-immersive-translate-effect=\"1\" data-immersive_translate_walked=\"d7bcc481-3fd5-4f19-bb4f-2ba27b28a87f\" data-testid=\"paragraph-5\" style=\"text-align: justify;\">\n<p>特朗普的备忘录中要求美国财政部长<strong>对伊朗施加“最大经济压力”</strong>，包括对违反现有制裁的人实施制裁和执行机制。</p>\n</div>\n<div data-immersive-translate-effect=\"1\" data-immersive_translate_walked=\"d7bcc481-3fd5-4f19-bb4f-2ba27b28a87f\" data-testid=\"paragraph-6\" style=\"text-align: justify;\">\n<p>该备忘录还指示财政部和国务院<strong>实施一项旨在“将伊朗石油出口降至零”的行动</strong>。周二，美国油价在特朗普计划签署备忘录的消息传出后缩小跌幅，这抵消了关税纠纷带来的一些疲软。</p>\n</div>\n<div data-immersive-translate-effect=\"1\" data-immersive_translate_walked=\"d7bcc481-3fd5-4f19-bb4f-2ba27b28a87f\" data-testid=\"paragraph-7\" style=\"text-align: justify;\">\n<p>伊朗驻纽约联合国代表团未回应置评请求。</p>\n</div>\n<p style=\"text-align: justify;\">根据美国能源信息署的估计，伊朗的石油出口在2023年带来了530亿美元的收入，前一年为540亿美元。根据欧佩克的数据，2024年伊朗的石油产量达到了自2018年以来的最高水平。在过去四年中，制裁规避和美国执法放松使这个中东国家每天增加大约100万桶的石油出口。</p>\n<p style=\"text-align: justify;\">切断伊朗的石油收入将进一步损害这个已经承受压力的国家的财政状况。该国正在应对由于缺乏投资而导致的电力短缺、货币贬值和产业困境的问题——如果石油收入减少，这些问题可能会恶化。 伊朗总统佩泽希齐扬是一位改革派，他优先考虑解除制裁和关系缓和，以求稳定国家经济。特朗普曾表示，只要伊朗不谋求核武器，他愿意与伊朗打交道。特朗普说：“我们并不想伤害伊朗。”但他警告说：“他们不能拥有核武器。” </p></div>",
            "image": "https://img.jin10.com/gallary/30dc36e3-1986-4cb0-bf83-ed280a7b149c.png/lite",
            "link": "https://xnews.jin10.com/details/161635",
            "pub_date": "2025-02-05 05:15:00",
            "source": "jin10_articles_articles",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 161630,
            "title": "前美联储“三把手”：特朗普的关税政策比想象中还要糟糕！",
            "description": "<div><p><span>前纽约联储主席杜德利（</span>Bill Dudley）表示<span>，</span><span>他</span><span>曾经以为自己对特朗普在对美国贸易伙伴实施进口关税方面持悲观态度，<strong>但实际情况竟然比他想的还要糟糕。</strong>以下是他的观点。</span></p>\n<p><span>上个月，我（即杜德利）推测特朗普将大幅提高关税，幅度超过他的第一个任期</span><span>——从</span><span>3%</span><span>增加到进口总额的</span><span>10%</span><span>。尽管有临时的缓和措施，<strong>但随着即将对加拿大和墨西哥实施的</strong></span><strong>25%关税，以及对中国实施的10%关税，他已经超出了我的预期，并且看起来还没有结束。</strong></p>\n<p><span>他承诺如果有人报复，他会走得更远。<strong>他还表示，欧洲等其他地区将是下一个目标。</strong></span></p>\n<p><span>在某些特定情况下，关税是有意义的：保护提供关键投入（如稀土金属）的国内供应商，这些资源仅能从少数几个非美国盟友的国家获得；帮助新兴行业获得国际竞争所需的规模；向其他国家施压以结束不公平的贸易行为，如补贴和货币操纵。</span></p>\n<p><span><strong>然而，对加拿大和墨西哥实施关税并不符合这些目的。</strong>相反，这将严重损害一个有助于美国保持全球竞争力的经济生态系统。</span></p>\n<p><span>美加墨三国形成了互利的自由贸易区。总的来说，加拿大提供了大量的商品投入，墨西哥提供了低成本劳动力，而美国公司则协调跨越两国边界的复杂活动网络。<strong>关税会给这一增长引擎带来阻碍。</strong>在微观层面上，它们将扰乱供应链，改变北美各行业和公司的相对竞争力。在宏观层面上，它们将推高美国的通胀，抑制消费并限制投资。</span></p>\n<p><span>具体来说，假设</span><span>25%</span><span>的关税生效，<strong>我预计美国消费者价格将额外上涨约一个百分点。</strong>在过去四年中，通胀顽固地高于美联储</span><span>2%</span><span>的目标，这种情况尤其成问题。对于经济增长的影响较难评估，它取决于多种因素，包括减税是否能够抵消财政紧缩的影响，以及企业在试图理解关税将持续多久时减少投资的程度。</span></p>\n<p><span>金融市场将受到影响。更高的通胀率和更慢的增长率应该会损害股票估值。投资者将要求更多的风险补偿：这是一个危险的游戏，没人知道它将走向何方。迄今为止股市的反应暗示着一些人希望特朗普只是虚张声势。我认为这是错误的。特朗普真诚地相信关税将增强美国的竞争力并产生显著的收入。</span></p>\n<p><span><strong>美债的前景更加复杂，很大程度上取决于美联储如何应对。</strong>如果通胀预期逐渐上升，美联储将不得不将利率维持在较高水平更长时间。如果他们不这样做</span><span>——即，如果家庭和企业将价格上涨视为一次性波动——美联储仍然可以降低利率以支持增长。在特朗普的第一个任期内，“一次性波动”观点占主导地位。但当时的情况不同：关税增幅要小得多，而且通胀总体上低于美联储的目标。</span></p>\n<p><span>为了评估潜在影响，我将关注两件事。<strong>首先，特朗普的决心</strong>：他在与加拿大、墨西哥和中国的针锋相对的关税冲突中会走多远？<strong>其次，关于长期通胀预期的衡量指标</strong></span><span>——包括密歇根大学和纽约联邦储备银行的家庭调查，以及市场指标如相同期限的常规国债与通胀保值国债之间的收益率差。</span></p>\n<p><span>看到特朗普愿意拿《北美自由贸易协定》及其后续条约《美墨加协定》（特朗普在其第一个任期内谈判达成）所取得进展来冒险，真是令人沮丧。这对美国的经济或金融市场来说都不是好兆头。</span></p></div>",
            "image": "https://img.jin10.com/news/24/07/Ee-3UG6lxPoXetwPyvBKj.png/lite",
            "link": "https://xnews.jin10.com/details/161630",
            "pub_date": "2025-02-04 21:55:28",
            "source": "jin10_articles_articles",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 161621,
            "title": "特朗普与内塔尼亚胡举行关键会谈，首要议题将是伊朗！",
            "description": "<div><p>当内塔尼亚胡于周二会见特朗普时，这位以色列总理预计将尝试改善与拜登白宫有时紧张的关系，两位领导人将讨论加沙停火的未来及对抗伊朗的方法。</p>\n<p>然而，作为特朗普自1月20日就职以来接待的第一位外国领导人，<strong>内塔尼亚胡也可能面临来自特朗普的压力</strong>，特朗普的中东政策目标并不总是与内塔尼亚胡的利益一致。</p>\n<p>他们将在以色列和哈马斯之间关于停火协议第二阶段和人质释放的间接谈判恢复之际会面，并预计举行联合新闻发布会。特朗普上周日告诉记者，与以色列及其他国家关于中东问题的讨论正在“取得进展”，但未提供具体细节。</p>\n<p>该地区正处于关键时刻，加沙停火脆弱，以色列与真主党在黎巴嫩达成的平行且不稳定的停火协议可能在未来几周到期，同时尽管伊朗处于弱势状态，对其核野心的关注仍在持续。</p>\n<p><strong>特朗普在其首个任期内为内塔尼亚胡带来了一系列成功</strong>，包括将美国大使馆从特拉维夫迁至耶路撒冷，以及促成阿布拉罕协议的签署，使以色列与几个阿拉伯国家实现了关系正常化。他仍然是以色列这个美国盟友的坚定支持者，并声称帮助促成了以色列与哈马斯之间的加沙停火协议，甚至在他重返办公室之前就已开始行动，同时坚持表示希望结束中东地区的冲突。</p>\n<p>特朗普表示希望能重启努力，实现以色列与阿拉伯大国沙特间的历史性关系正常化。这造成了关于特朗普会给内塔尼亚胡多少回旋余地的不确定性，因为内塔尼亚胡面临着来自其联盟中极右成员的要求，除非他重新发动对加沙的攻击以兑现摧毁伊朗支持的哈马斯的承诺，否则将推翻他的政府。</p>\n<p>即便如此，内塔尼亚胡这次几乎肯定会比他在拜登手下得到更好的接待。虽然拜登在哈马斯于2023年10月7日发动袭击后维持了对以色列的军事支持，但由于高比例的巴人死亡和内塔尼亚胡对一些美国要求的蔑视，双方关系时有紧张。</p>\n<p>周一，<strong>特朗普承认无法保证停火能够持续</strong>，尽管其特使威特科夫补充道：“我们当然抱有希望。”</p>\n<p>特朗普和内塔尼亚胡都表示希望将沙特纳入基于阿布拉罕协议的新区域安排，这一努力可能会形成对抗伊朗的堡垒。</p>\n<p>但是，内塔尼亚胡坚决反对任何迈向建立巴勒斯坦国的举动，这一立场得到了越来越多以色列人的支持，特别是在加沙冲突之后，这成为与沙特达成协议的潜在障碍，沙特此前坚持至少就通往独立的巴勒斯坦的道路达成协议。</p>\n<p>自从上任以来，特朗普提出加沙居民应被迁移至如埃及和约旦等邻国的建议引发了争议，这反映了以色列极右翼的愿望，同时也违背了拜登反对大规模流离失所巴勒斯坦人的承诺。埃及、约旦政府及其他阿拉伯国家均拒绝了这一想法。</p>\n<p>对于内塔尼亚胡而言，国际刑事法院因涉嫌冲突罪发出的逮捕令突显了他在加沙冲突中的国际孤立地位，<strong>这次访问为他在华盛顿重塑外交形象提供了机会</strong>，而华盛顿强烈反对国际刑事法院。亲巴勒斯坦活动人士以及呼吁释放被哈马斯扣押的人质的人士计划在内塔尼亚胡访问华盛顿期间分别举行抗议活动。</p>\n<p>内塔尼亚胡还将与其他高级特朗普助手、国会领导人会面，<strong>并预计寻求继续供应美国武器的保证。</strong>重返白宫数日后，特朗普批准向以色列运送了2000磅炸弹，这批物资是拜登政府曾阻止的。</p>\n<p>离开以色列时，内塔尼亚胡告诉记者，他希望通过与特朗普的会谈进一步重绘该地区的版图。加沙冲突颠覆了中东局势，专家们看到了更多变化的可能性。</p>\n<p><strong>会谈的首要议题将是伊朗</strong>，去年它向以色列发射了数百枚导弹和无人机，引发了以色列的报复，据说这严重削弱了德黑兰的防空能力。特朗普于2018年退出了与德黑兰的国际核协议，他和内塔尼亚胡都誓言阻止伊朗发展核武器。与此同时，伊朗内部对特朗普可能给内塔尼亚胡开绿灯去打击伊朗核设施的担忧日益增加。</p></div>",
            "image": "https://img.jin10.com/gallary/5455a6d1-46eb-489e-8b76-03105f9999be.png/lite",
            "link": "https://xnews.jin10.com/details/161621",
            "pub_date": "2025-02-04 17:44:09",
            "source": "jin10_articles_articles",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 161620,
            "title": "在与美联储的斗争中，特朗普最大的敌人将是他自己！",
            "description": "<div><p><span>在美联储的政策会议之后，特朗普总统呼吁降低利率，并加大了对美联储主席鲍威尔的批评。</span><span>但特朗普本人可能是降低借贷成本的最大障碍，因为他的政策可能会加剧他竞选时所解决的一个问题：物价上涨。</span></p>\n<p><span>鲍威尔本周发出了一个明确的信息，即美联储员并不急于降息，他们选择在今年的第一次政策会议上暂停降息。</span></p>\n<p><span>这似乎无视特朗普的压力，特朗普上周在世界经济论坛上发表讲话时表示，他将要求</span><span>“立即”降低利率。</span></p>\n<p><span>“<strong>因为鲍威尔和美联储没能阻止他们制造的通胀问题</strong>，我将通过释放美国能源生产、削减监管、重新平衡国际贸易和重新点燃美国制造业来做到这一点，”特朗普在上周的利率决定后在</span><span>Truth Social</span><span>上写道。</span></p>\n<p><span>他认为，他的政策</span><span>——包括对来自中国、加拿大和墨西哥的进口产品征收高额关税的计划——可能有助于重振美国经济。</span></p>\n<p><span>但华尔街预测人士说，这些计划最终可能成为美联储今年在决定如何处理利率时必须克服的障碍，它们很可能是美联储在形势变得更加明朗之前暂停降息的原因。</span></p>\n<p><span>信安资产管理公司（</span><span>Principal Asset Management</span><span>）首席全球策略师西马·沙阿（</span><span>Seema Shah</span><span>）在一份报告中表示：“现实情况是，美联储只是在努力对数据和新政府出台的政策做出回应。在这样的时候，政府的政策，特别是关税政策，是如此不确定，他们没有预测的优势。在明确的方向开始出现之前，保持政策利率不变是明智的。”</span></p>\n<p><span>其他人则表示，尽管特朗普坚持要迅速降息，但美联储在</span><span>2024</span><span>年最后一段时间大幅降息后，可以从容应对。</span></p>\n<p><span>“在去年降息</span><span>100</span><span>个基点之后，尽管经济总体状况良好，但美联储现在可以在评估特朗普政府政策变化对经济的影响时保持耐心，”</span><span>Brandywine global</span><span>全球宏观策略主管保罗·米尔扎斯基（</span><span>Paul Mielczarski</span><span>）说。“与此同时，在核心通胀率仍高于</span><span>2%</span><span>的情况下，广泛的关税将对商品通胀产生重大影响。”</span></p>\n<p><span>经济学家警告称，特朗普的关税计划可能会引发通胀，特朗普驳斥了这一观点。特朗普表示，他将降低价格，他在第一个任期内实施了关税，但没有导致通胀大幅上升。</span></p>\n<p><span>不过，这一次他的关税计划影响范围要广得多，预测人士更担心他的第二个任期内通胀会卷土重来。</span></p>\n<p><span><strong>美联储也在强劲的经济环境下运作，政府也在制定更多促进增长的计划。</strong>在经济高增长的情况下降低利率也有可能引发新的通胀压力。</span></p>\n<p><span>在特朗普就职典礼之前，债券收益率飙升，这表明投资者正在权衡与总统经济计划相关的通胀风险，并预期利率会上升。</span></p>\n<p><span>随着特朗普的促增长议程引发更多风险偏好，收益率回落，但通胀预期仍在上升。克利夫兰联储的数据显示，自去年</span><span>10</span><span>月以来，一年期预期通胀率攀升了</span><span>40</span><span>个基点。</span></p>\n<p><span>市场对美联储降息的预期也变得黯淡。</span><span>CME</span><span>美联储观察工具显示，投资者预计美联储</span><span>3</span><span>月份维持利率不变的可能性为</span><span>82%</span><span>，高于一个月前的</span><span>48%</span><span>。</span></p>\n<p><span>投资者还预计，整个</span><span>5</span><span>月份利率保持不变的可能性为</span><span>57%</span><span>，高于上月的</span><span>37%</span><span>。</span></p>\n<p><span>Trade Nation</span><span>高级市场分析师戴维•莫里森（</span><span>David Morrison</span><span>）在一份报告中写道：“鲍威尔在发布会期间以各种形式重复了这一底线。<strong>结论是：美联储并不急于进一步降息。</strong>”</span></p>\n<p><span>市场质疑特朗普是否会试图影响美联储未来的利率决定。<strong>特朗普声称他比美联储</strong></span><strong>“更了解”利率。</strong></p>\n<p><span>在大选之前，据说特朗普的盟友制定了一项削弱美联储独立性的计划。特朗普提名的财政部长斯科特</span><span>·贝森特（</span><span>Scott Bessent</span><span>）也提出设立一个“影子美联储主席”，尽管特朗普尚未承认这种可能性。</span></p></div>",
            "image": "https://img.jin10.com/gallary/25/02/NFXdqhk4K5fH9C1UTWtGK.png/lite",
            "link": "https://xnews.jin10.com/details/161620",
            "pub_date": "2025-02-04 17:00:47",
            "source": "jin10_articles_articles",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 161606,
            "title": "华尔街知名大空头不死心：标普500跌至4000点也是有可能的！",
            "description": "<div><p>自科拉诺维奇（Marko Kolanovic）去年夏天突然从摩根大通离职的消息震惊华尔街以来，各类重磅新闻轮番轰炸：美联储四年来首次降息、特朗普当选美国总统、标普500指数又上涨了9%。他的前同事们也放弃了对美股的悲观看法。</p>\n<p>然而，在这位著名策略师看来，情况并没有太大变化。去年，当他离开这个行业时，他是最后一批坚决不看好牛市的悲观主义者之一。</p>\n<p>他表示，美股面临高度集中化和地缘政治动荡等诸多风险，因此仍有大幅下跌的风险。标普500指数目前在6000点上方交投，两周前触及新高，但<strong>科拉诺维奇预计该指数将下跌1000点或更多。</strong></p>\n<p data-component=\"paragraph\">“我确实认为标普500指数今年会<strong>回到5000点左右</strong>，”科拉诺维奇在彭博社的Odd Lots播客上说。<strong>新政治气候带来的潜在动荡可能会使该指数“大幅下降至4000点——我认为这也是有可能的”。</strong></p>\n<p data-component=\"paragraph\">这位策略师尚未宣布他下一步的计划。但他在投资者群体中仍然有大量的追随者。离开摩根大通后，他入驻了社交媒体平台，包括马斯克（Elon Musk）的X。</p>\n<p data-component=\"paragraph\">虽然科拉诺维奇一直以来都是这样的论调，但这一悲观的预测看起来很及时，因为大型科技股在过去六周基本持平，人们对美国在人工智能（AI）领域的主导地位产生了强烈的质疑。人们还担心，棘手的通胀可能迫使美联储官员将利率维持在高于最初预期的水平。</p>\n<p data-component=\"paragraph\">特朗普的贸易战增加了新的不确定性。美国股指周一下跌，此前特朗普宣布对来自墨西哥、加拿大和中国的商品加征关税，此举可能会颠覆全球贸易。</p>\n<h2 data-component=\"paragraph\">未来的动荡</h2>\n<p>上周，中国初创公司DeepSeek的廉价AI模型导致美股市值蒸发了1万亿美元，英伟达公司在一个交易日内损失了5930亿美元的市值，创下美股历史上的最大单日市值跌幅。此后，美股基准股指已经收复了大部分失地，但科拉诺维奇怀疑未来还会有更多的动荡。</p>\n<p>“也许还没有结束，”科拉诺维奇说。“我们还在等待一些重要的财报，所以会发生什么还有待观察，<strong>也许哪一周的财报会引发任何形式的后续动荡。</strong>”</p>\n<p>在离开摩根大通之前，科拉诺维奇是为数不多的对股市本轮牛市持怀疑态度的人之一。他一直警告风险不断增加，包括经济放缓和地缘政治紧张局势，以及刺激市场上涨的昂贵股票的上涨势头放缓。</p>\n<p><strong>这些不利因素仍然存在。</strong>科拉诺维奇警告说，从技术角度来看，历史上的高集中度使股票容易出现急剧反转。他说，标普500指数的前10家成分股公司与股市其他公司之间前所未有的不平衡已经无法维持，因此可能会出现周期性衰退，以“净化和正常化”飙升的估值。</p>\n<p>“在2000年，股票股指也是如此之高，我们知道它是如何结束的，”科拉诺维奇说。</p>\n<p>他还在X的一则帖子上写道，“贸易战将我们置于2018年的环境中（当时波动性更高，估值更低）。<strong>那些认为特朗普关心股市的人应该记住，即便在当时，他也直到股市下跌5%才做出反应。现在他对下跌的容忍度可能更高，而市场正处于高位。</strong>”</p>\n<figure class=\"image\" style=\"text-align: center; margin-bottom: 16px;\"><img src=\"https://img.jin10.com/news/25/02/rEruVzKH8kRfFTDGn4Jna.png\"/>\n<figcaption style=\"font-size: 12px; margin-top: -16px;\"></figcaption>\n</figure>\n<p>当然，准确判断这些风险何时开始产生影响是一件棘手的事情，科拉诺维奇承认自己在股市上涨时站在了错误一边。“很多人都受到了伤害，包括我自己，”他说。“去年我们更悲观，基本上市场势头强劲，所以时机将是一个挑战。”</p>\n<h2>痛苦的经历</h2>\n<p>从上周DeepSeek横空出世以及去年8月份短期日元套利交易平仓引发的抛售，交易员已经看到了此类事件可能引发的痛苦。</p>\n<p>科拉诺维奇之前曾在贝尔斯登（Bear Stearns）工作，2008年摩根大通收购贝尔斯登时，他加入了摩根大通。这位策略师于上世纪90年代从克罗地亚来到美国，在纽约大学学习，并于2003年获得理论物理学博士学位，这是他在定量分析方面能力的基础。</p>\n<p>他说：“我们写了很多代码，做了很多建模，做了很多努力去理解为什么一件事会导致另一件事......我真的从未在金融领域使用过任何物理公式，但思维方式是相似的。”</p>\n<p>科拉诺维奇成功得预言了2015年股市暴跌、2018年波动性末日（Volmageddon）以及新冠疫情后市场复苏反弹，这些先见之明赢得了“甘道夫”（Gandalf）的称号。他因其有先见之明的预测而被昵称为“甘道夫”。</p>\n<p>然而，在他离开摩根大通之前的两年时间里，他的远见卓识似乎消失了。在2022年的大部分时间里，当标普500指数下跌19%、华尔街策略师纷纷下调对股市的预期时，他坚定地看多，而在2023年和2024年股市出现两位数的反弹时保持看空。</p>\n<p>华尔街其他过去离职的著名策略师也开始开设了自己的公司，包括前美林公司的预测者查尔斯·克拉夫（Charles Clough）、理查德·伯恩斯坦（Richard Bernstein）和大卫·罗塞布纳格（David roseberg），以及前摩根士丹利股票策略师亚当·帕克（Adam Parker）。</p></div>",
            "image": "https://img.jin10.com/news/25/01/nSF4vmy-ey0uBP2XKvlaj.png/lite",
            "link": "https://xnews.jin10.com/details/161606",
            "pub_date": "2025-02-04 13:54:23",
            "source": "jin10_articles_articles",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 161596,
            "title": "特朗普下令成立美国主权财富基金，币圈好事将近？",
            "description": "<div><p>美国总统特朗普周一签署了一项行政命令，要求在未来一年成立一个主权财富基金。许多其他国家已经推出了类似的基金，尤其是中东和亚洲国家，以利用政府资金进行直接投资。</p>\n<p>该行政命令的文本细节很少，只是指示财政部和商务部在<strong>90天内提交此类基金的计划</strong>，包括关于“融资机制、投资策略、基金结构和治理模式”的建议。</p>\n<p>但比特币的支持者们热情高涨，认为这一消息表明<strong>美国正在采取积极措施直接投资世界顶级加密货币</strong>。最值得注意的是，著名的比特币倡导者、参议员辛西娅·卢米斯（Cynthia Lummis）在回应这一消息时提到了比特币。“这是一笔大交易，”她在X上发帖说，并使用了比特币的符号，这令加密货币爱好者兴奋不已。比特币闻讯将日内涨幅扩大至5%，至10.2万美元上方。</p>\n<figure class=\"image\" style=\"text-align: center; margin-bottom: 16px;\"><img src=\"https://img.jin10.com/news/25/02/Zp1pmTnIUrtkoUu4j6JAL.png\"/>\n<figcaption style=\"font-size: 12px; margin-top: -16px;\"></figcaption>\n</figure>\n<p>主权财富基金是一种国有投资基金，<strong>它将政府收入——通常来自出口自然资源——再投资于可持续盈利的资产，如股票、债券和房地产</strong>。<strong>世界上一些顶级的主权财富基金确实普遍持有大量加密货币，尤其是比特币。</strong></p>\n<p>据K33 Research称，作为世界上最大的主权财富基金，挪威的主权财富基金间接持有价值近4亿美元的比特币。阿布扎比的主权财富基金也经常投资于加密项目和数字资产。</p>\n<p>也许像卢米斯这样的政策领导人有充分的理由相信比特币可能成为美国主权财富基金的主要投资重点，或者就像加密行业的许多其他人一样，他们只是在努力将他们深深渴望的未来变成现实。</p>\n<h2>美国建立主权财富基金的方式仍未知</h2>\n<p><strong>通常，主权财富基金依靠一国的预算盈余进行投资，但美国处于赤字状态。它的成立也可能需要国会的批准。</strong></p>\n<p>“我们将为该基金创造大量财富，”特朗普对记者说。“我认为我们的国家是时候建立一个主权财富基金了。”</p>\n<p>特朗普此前曾作为总统候选人推出过这样一个政府投资工具，称它可以为“伟大的国家事业”提供资金，例如高速公路和机场等基础设施项目、制造业和医学研究。</p>\n<p>政府官员没有透露该基金将如何运作或如何筹集资金，但特朗普此前曾表示，它可以由“关税和其他明智的事情”提供资金。</p>\n<p>财政部长斯科特·贝森特（Scott Bessent）告诉记者，<strong>该基金将在未来12个月内成立</strong>。</p>\n<p>“我们将把美国资产负债表的资产部分货币化，以惠及美国民众”贝森特说。“这将包括流动资产，以及我们目前在国内持有的各类资产，我们将努力将其释放出来，为美国人民创造价值。 ”</p>\n<p>据彭博新闻社报道，<strong>一种方法是转变美国国际开发金融公司（DFC）的职能。</strong>报道称，特朗普政府最近几个月曾考虑过这样做。DFC是一个政府机构，目前与私人团体合作，为发展中国家的项目提供资金。</p>\n<p>特朗普上周五宣布，他提名本杰明·布莱克（Benjamin Black）领导该机构。布莱克是投资公司Fortinbras Enterprises的管理合伙人，他的父亲莱昂·布莱克（Leon Black ）是资产管理公司阿波罗全球管理公司（Apollo Global management）的联合创始人。</p>\n<p>据《纽约时报》和《金融时报》报道，去年11月，拜登政府在特朗普当选之前也曾考虑设立这样一个基金。</p>\n<p>但目前尚不清楚将如何构建和资助美国的主权财富基金。几位专家表示，<strong>鉴于目前没有盈余可供动用，国会可能需要批准新的资金。</strong>特朗普签署的行政命令指示官员审查任何立法的必要性。</p>\n<p>前财政部官员、现供职于全球发展中心（Center for Global Development）的克莱门斯·兰德斯（Clemence Landers）表示，有关重新调整DFC用途的讨论一直在进行，但设立这样一个基金需要国会的支持。</p>\n<p>她说：“显然，你不能通过行政命令建立一个机构，更重要的是，你不能通过行政命令为一个机构提供资金。”</p>\n<p>投资者表示，这一消息令人意外。</p>\n<p>伦敦Robeco多资产策略主管科林·格雷厄姆（Colin Graham）表示：“创建一只主权财富基金表明，一个国家的储蓄有所增加，可以配置到这只基金中......根据经济上的经验法则，这行不通。”</p>\n<p>根据主权财富基金国际论坛（International Forum of Sovereign Wealth Funds）的数据，全球有超过90家这样的基金，管理着超过8万亿美元的资产。</p>\n<p>美国包括阿拉斯加州、德克萨斯州和新墨西哥州在内的许多州也拥有自己的财富基金，为各种优先事项提供资金，包括教育和税收减免。它们通常依赖石油或土地等自然资源带来的收入。但美国并未运营过自己的主权财富基金。</p>\n<p>根据主权财富基金研究所的数据，挪威拥有最大的主权财富基金，资产超过1.7万亿美元。中国投资有限责任公司管理的资产以1.3万亿美元紧随其后。</p></div>",
            "image": "https://img.jin10.com/news/25/01/u0ia6KDKoyCERytQy8eTx.png/lite",
            "link": "https://xnews.jin10.com/details/161596",
            "pub_date": "2025-02-04 12:07:45",
            "source": "jin10_articles_articles",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 161591,
            "title": "若特朗普一意孤行，美联储今年的降息窗口或关闭",
            "description": "<div><p>经济学家表示，美国原本定于周二生效的新关税可能意味着消费者今年将无法从高额借贷成本中得到缓解。</p>\n<p>特朗普上周六签署命令，对美国三个最大的贸易伙伴征收关税：对来自加拿大和墨西哥的进口商品加征25%的关税，对来自中国的进口商品加征10%的关税。</p>\n<p>周一，在与加拿大总理和墨西哥总统通话后，美国宣布将加征关税的措施立即暂缓一个月执行。</p>\n<p>然而，经济学家预计，如果美国最终实施并维持此类关税，美国消费者价格将被推高。</p>\n<p>经济学家表示，<strong>在通胀尚未回落到目标水平的之际，通胀的上行压力可能会促使美联储在可预见的未来暂停降息行动。</strong></p>\n<p>美联储的基准利率会影响消费者信用卡和其他类型债务的借贷成本。</p>\n<p>“在这种情况下，美联储在未来12到18个月内随时恢复降息的窗口就这样关上了，”凯投宏观（Capital Economics）首席北美经济学家保罗·阿什沃思（Paul Ashworth）上周六在特朗普签署关税令后的一份报告中写道。</p>\n<p>当然，经济学家表示，情况是多变的，因此几乎不可能进行精确评估，正如美国和墨西哥、加拿大最新达成的协议所显示的那样。</p>\n<p>目前看来，美国对中国的关税将按计划于周二生效。</p>\n<p>“政策如何展开存在很多不确定性，”波士顿联储主席苏珊·柯林斯（Susan Collins）周一告诉CNBC。</p>\n<h2>关税如何影响通胀和利率？</h2>\n<p>摩根大通私人银行高级市场经济学家乔·塞德尔（Joe Seydl）表示，<strong>如果美国对加拿大、中国和墨西哥征收长期关税，预计到2026年美国的通胀率将上升0.5至1个百分点。</strong></p>\n<p>这些预估针对的是“核心”通胀（剔除能源和食品成本），该指数由美联储首选的通胀指标个人消费支出价格指数（PCE）衡量。</p>\n<p>这一点意义重大，因为美联储使用利率政策来控制通胀和劳动力市场。在其他条件相同的情况下，预计高通胀将使利率在更长时间内保持在较高水平。</p>\n<p>根据Evercore ISI周二发布的一份报告，相对于无关税的基线情景，对加拿大、中国和墨西哥的关税“将把PCE通胀率推高”约0.7个百分点，到2025年第四季度达到2.8%左右。</p>\n<p>Evercore的报告称：“这将使美联储今年至少一次、甚至可能两次降息的可能性消失。”</p>\n<p>去年12月，美联储官员预测他们将在2025年降息两次。</p>\n<p>“鉴于对墨西哥和加拿大的关税暂缓了一个月，这些关税是否会继续实施存在一些不确定性，”凯投宏观北美经济学家副首席斯蒂芬·布朗（Stephen Brown）在一封电子邮件中写道。“<strong>如果关税继续实施，美联储不太可能再次降息。</strong>”</p>\n<p>虽然有些人认为关税可能会促使美联储再次转向你加息，但布朗认为这不太可能。他说，关税可能会拖累美国经济。</p>\n<p>同样，塞德尔表示，摩根大通预计，<strong>到2026年，拟议关税将使美国国内生产总值（衡量经济产出的指标）减少0.5至1个百分点。</strong></p>\n<p>在他看来，这种对经济的拖累可能会抵消关税对通胀的影响，并最终导致美联储降息。</p></div>",
            "image": "https://img.jin10.com/news/24/08/bHUgnm6LPZgTNQKaK7xoS.png/lite",
            "link": "https://xnews.jin10.com/details/161591",
            "pub_date": "2025-02-04 11:05:12",
            "source": "jin10_articles_articles",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 161579,
            "title": "现货黄金、WTI原油、NYMEX天然气大变样，假期发生了什么？",
            "description": "<div><h2><span class=\"market-item\" data-code=\"XAUUSD\" data-ex=\"GOODS\">现货黄金</span></h2>\n<p align=\"justify\" style=\"text-align: justify;\">近期现货黄金创历史新高2830美元/盎司，上破历史高点2790美元/盎司。</p>\n<figure class=\"image\" style=\"text-align: center; margin-bottom: 16px;\"><img src=\"https://img.jin10.com/news/25/02/q6DIpaVMr25-YzQzK7HbJ.png\"/>\n<figcaption style=\"font-size: 12px; margin-top: -16px;\">现货黄金-行情</figcaption>\n</figure>\n<p align=\"justify\" style=\"text-align: justify;\">1月30日，<strong><span style=\"font-weight: bold;\">美联储利率决议如市场预期维持4.5%的利率上限</span></strong>，随后的新闻发布会上，鲍威尔发表了较平衡的讲话，他指出，不需要急于调整美联储的政策立场，在<strong><span style=\"font-weight: bold;\">通胀和就业数据变得更加合适之前，不会急于再次降息</span></strong>。</p>\n<p align=\"justify\" style=\"text-align: justify;\">相较于美联储，市场似乎对特朗普2.0的反应更大。特朗普对各国的关税措施仍在不断变化，WisdomTree的商品策略师Nitesh Shah表示，“<strong><span style=\"font-weight: bold;\">只要市场存在不确定性，这一涨势就可能持续</span></strong>。如今许多不确定性源于不确定关税是否以及如何实施。”</p>\n<p align=\"justify\" style=\"text-align: justify;\">此外，<strong><span style=\"font-weight: bold;\">央行稳定的购买需求是支持黄金的关键因素</span></strong>。Julius Baer的分析师Carsten Menke说道：“我们认为中央银行的购买是黄金市场上最强劲的结构性力量。”</p>\n<p align=\"justify\" style=\"text-align: justify;\">通过<strong><span style=\"font-weight: bold;\">期货盯盘神器-外盘期货热力图</span></strong>（<a href=\"https://qihuo.jin10.com/vip/watch/index.html?from=qihuoWeb&amp;group_id=qh_sa_monitor#/intro\" rel=\"noopener\" target=\"_blank\">点击体验</a>）我们发现，目前现货黄金多个周期均显示红色，说明周期共振的角度来看多头比较强势。</p>\n<figure class=\"image\" style=\"text-align: center; margin-bottom: 16px;\"><img src=\"https://img.jin10.com/news/25/02/XPgasnZfxzapM4gXHIDwP.png\"/>\n<figcaption style=\"font-size: 12px; margin-top: -16px;\">期货盯盘神器-外盘期货热力图</figcaption>\n</figure>\n<h2 align=\"justify\" style=\"text-align: justify;\"><span class=\"market-item\" data-code=\"USOIL\" data-ex=\"GOODS\">WTI原油</span></h2>\n<p style=\"text-align: left;\">WTI原油持续走弱，自1月中旬高点80.77跌近10%。</p>\n<figure class=\"image\" style=\"text-align: center; margin-bottom: 16px;\"><img src=\"https://img.jin10.com/news/25/02/azl6_4iBchk7e9vUgfnFL.png\"/>\n<figcaption style=\"font-size: 12px; margin-top: -16px;\">WTI原油-行情</figcaption>\n</figure>\n<p align=\"justify\" style=\"text-align: justify;\">特朗普本月1日签署行政令，<strong><span style=\"font-weight: bold;\">将对进口自墨西哥、加拿大两国的商品加征25%的关税</span></strong>。当地时间2月3日早些时候，特朗普与墨西哥总统辛鲍姆通话。两人在通话后都宣布，美国和墨西哥同意将<strong><span style=\"font-weight: bold;\">加征关税的措施立即暂缓一个月执行</span></strong>，并继续进行谈判。</p>\n<p align=\"justify\" style=\"text-align: justify;\">2月3日高盛表示，中期内油价面临的风险偏向下行，因为<strong><span style=\"font-weight: bold;\">持续的广泛关税将对全球GDP和石油需求造成压力</span></strong>。</p>\n<p align=\"justify\" style=\"text-align: justify;\">我们可以通过<strong><span style=\"font-weight: bold;\">SC原油盯盘神器-大事</span></strong>功能（<a href=\"https://qihuo.jin10.com/vip/watch/index.html?from=qihuoWeb&amp;group_id=qh_sc_monitor#/desktop\" rel=\"noopener\" target=\"_blank\">点击体验</a>），关注美联储态度和特朗普关税政策的变化情况。</p>\n<figure class=\"image\" style=\"text-align: center; margin-bottom: 16px;\"><img src=\"https://img.jin10.com/news/25/02/RJhJdoqfPi-a-qMKbUeIx.png\"/>\n<figcaption style=\"font-size: 12px; margin-top: -16px;\">SC原油盯盘神器-大事</figcaption>\n</figure>\n<h2 align=\"justify\" style=\"text-align: justify;\">NYMEX<span class=\"market-item\" data-code=\"NGAS\" data-ex=\"GOODS\">天然气</span></h2>\n<p align=\"justify\" style=\"text-align: justify;\">NYMEX天然气昨日强势反弹，涨幅超7%。</p>\n<figure class=\"image\" style=\"text-align: center; margin-bottom: 16px;\"><img src=\"https://img.jin10.com/news/25/02/h_KcDXVtKMTETZfuz8Qw8.png\"/>\n<figcaption style=\"font-size: 12px; margin-top: -16px;\">NYMEX天然气-行情</figcaption>\n</figure>\n<p align=\"justify\" style=\"text-align: justify;\">2月3日消息显示，因<strong><span style=\"font-weight: bold;\">天气预报显示美国气温将变得更加寒冷</span></strong>，提振美国天然气价格。</p>\n<p align=\"justify\" style=\"text-align: justify;\">2月3日高盛表示，由于美国对加拿大征收的关税，<strong><span style=\"font-weight: bold;\">美国从加拿大进口的天然气可能因关税而减少</span></strong>。</p></div>",
            "image": "https://img.jin10.com/gallary/c3a6f4b0-f220-408f-af00-6f83d134663e.png/lite",
            "link": "https://xnews.jin10.com/details/161579",
            "pub_date": "2025-02-04 10:15:56",
            "source": "jin10_articles_articles",
            "kind": 1,
            "language": "zh-CN"
        },
        {
            "id": 161574,
            "title": "美联储官员齐谈关税：可能引发通胀反扑风险",
            "description": "<div><p>三名美联储官员周一警告称，特朗普政府的关税计划存在通胀风险，其中一名官员认为，通胀前景的不确定性要求降息速度放缓。</p>\n<p>特朗普上周六对美国三个最大的贸易伙伴全面征收关税，但到周一晚些时候，墨西哥和加拿大的领导人在同意加大力度遏制毒品贩运后赢得了30天的暂缓期。对中国的关税将于周二开始生效，特朗普已暗示他也将对其他贸易伙伴征收关税。</p>\n<p><strong>波士顿联储主席柯林斯</strong>在接受CNBC采访时表示：“上周末宣布的这种广泛的关税，预计会对价格产生影响。”她补充说，“如果征收广泛的关税，你实际上不仅会看到最终产品的价格上涨，还会看到一些中间产品的价格上涨。”</p>\n<p>她说，关于巨额关税如何影响经济的现代经验很少，这使得美联储很难确切知道影响会有多大或多持久，并指出美联储甚至有可能对与关税相关的通胀一次性上升置之不理。</p>\n<p><strong>芝加哥联储主席古尔斯比</strong>则当天晚些时候在Marketplace Radio上表示，由于缺乏明确性，降息步伐需要放慢。</p>\n<p>“现在我们必须更加小心和谨慎地考虑利率下降的速度，因为存在通胀即将再次开始回升的风险，”古尔斯比说。</p>\n<p>他没有重复他最近的口头禅。就在上周，古尔斯比还说，鉴于在降低通胀和保持经济充分就业的目标方面取得进展，利率需要在未来一年大幅下调。</p>\n<p>当天早些时候，<strong>亚特兰大联储主席博斯蒂克</strong>警告说，他的企业联系人正计划转嫁关税带来的任何上涨成本。</p>\n<p>“关于关税是否严重导致通胀的最终问题取决于它究竟如何发展，”因为在某些情况下，美联储可能能够对这些措施不屑一顾，而在某些情况下则可能无法。“在一定程度上，如果影响通胀预期等因素，你就必须采取行动，”博斯蒂克在演讲后告诉记者。</p>\n<p>彼得森国际经济研究所（Peterson Institute for International Economics）的分析师周一表示，如果美国对三大贸易伙伴征收全面关税，普通美国家庭每年将额外花费1200美元。</p>\n<p>荷兰国际集团首席国际经济学家詹姆斯·奈特利（James Knightley）说：“相对于高收入家庭，这种负担将不成比例地落在低收入家庭身上，后者将更多的收入花在实物商品上，”他指出，关税实际上是对美国公民的增税，因为它们是由进口国的公民支付的。</p>\n<h2>降息没有紧迫性</h2>\n<p>美联储去年将利率下调了整整一个百分点，但在上周维持政策利率不变，表明经济前景存在不确定性。美联储主席鲍威尔在会后表示，在关税方面，“我们需要了解清楚这些政策，然后才能开始合理评估它们对经济的影响。”</p>\n<p>柯林斯是今年美联储利率制定委员会的投票成员，她告诉CNBC，美联储的政策处于有利地位。她指出，“就政策而言，保持耐心、谨慎是非常合适的，而且没有进行额外调整的紧迫性，在考虑到所有不确定性的情况下尤其如此，尽管我们对目前的利率立场仍然有些限制性”。</p>\n<p>博斯蒂克还表示，他准备暂时保持观望。博斯蒂克在亚特兰大扶轮社（Rotary Club of Atlanta）会议上说，“在很大的空间里存在大量的不确定性”，并补充说“有很多事情我将拭目以待......在目前的利率水平下，我很乐意再等一段时间。”</p>\n<p>柯林斯为进一步降息敞开了大门，她说：“就政策立场而言，我肯定支持更多正常化“，但她没有提供时间框架。</p>\n<p>金融市场目前押注美联储将至少等到6月才能再次降息。</p>\n</div>",
            "image": "https://img.jin10.com/news/25/01/A9Xpy-qlKCNbwO6GSGuLl.png/lite",
            "link": "https://xnews.jin10.com/details/161574",
            "pub_date": "2025-02-04 09:33:38",
            "source": "jin10_articles_articles",
            "kind": 1,
            "language": "zh-CN"
        }
    ]
}