{
    "data": [
        {
            "id": "entity:node/5958556:en",
            "title": "US stock futures falter on AI jitters, Nasdaq braces for steep monthly fall",
            "description": "Feb 27 : U.S. stock index futures slid on Friday as growing AI unease weighed on technology stocks, with the Nasdaq staring at its steepest monthly drop since March 2025, and investors awaited key inflation data later in the day. Technology stocks saw immense turbulence this month due to AI concerns, even as investors fretted about the payoff from massive planning spending on artificial-intelligence technology. Brewing tariff uncertainty also stoked volatility after the U.S. Supreme Court last week voided most of the duties U.S. President Donald Trump imposed last year. In response, Trump announced a temporary global tariff of 10 per cent that came into effect on Tuesday. Nvidia inched up 0.4 per cent in premarket trading after sliding more than 5 per cent in the previous session despite strong earnings, a sign that risk sentiment for all things AI remained shaky. Zscaler lost 9.1 per cent after the cloud security firm reported a wider net loss in the second quarter, while Intuit dipped 3.6 per cent after the financial software company forecast third-quarter profit below estimates. Software shares were rocked earlier this year on fears of industrywide AI-led disruptions. Financial brokerages, data analytics and legal services, real estate services and trucking are also hit hard by brewing AI concerns. The S&P 500 and the Nasdaq clocked losses in the last session, with the Nasdaq closing below its 50-day moving average for the 17th straight session. The closely followed moving average is seen as a proxy for the intermediate-term trend. In economic data, a January producer prices reading due before the bell could offer insights into the U.S. Federal Reserve's interest rate path. At 06:00 a.m. ET, Dow E-minis fell 271 points, or 0.55 per cent, S&P 500 E-minis shed 24.75 points, or 0.36 per cent, and Nasdaq 100 E-minis lost 78 points, or 0.31 per cent. Most megacap and growth stocks inched lower. Chip stocks including AMD and Broadcom also declined. Netflix added 7.4 per cent as investors cheered its decision to exit the fight for Warner Bros Discovery, which fell 2 per cent, while Paramount Skydance advanced 7.8 per cent after it won the race for some of the world's most prized TV and film assets. Block surged nearly 19 per cent after the payments firm said it will cut over 4,000 jobs, nearly half its workforce, as part of an overhaul to embed artificial intelligence across its operation. Dell climbed 10.6 per cent after the PC-maker said it expects revenue from its key AI-optimized servers business to double in fiscal year 2027 and promised to return more cash to shareholders. Duolingo dropped almost 25 per cent after the language-learning app forecast first-quarter and 2026 bookings below expectations.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/us-stock-futures-falter-ai-jitters-nasdaq-braces-steep-monthly-fall-5958556",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5958101:en",
            "title": "Insta360 maker says it will import, sell products in US 'without restrictions' after USITC ruling",
            "description": "BEIJING, Feb 27 : Shenzhen-based Arashi Vision, which makes the Insta360 line of camera products, on Friday said it \"will continue to import and sell existing products in the U.S. without restrictions\" after a final ruling by USITC. California-based action camera maker GoPro had in 2024 claimed patents for its cameras, systems and accessories are being violated by Arashi Vision importing similar products into the United States. The U.S. International Trade Commission then launched an investigation under Section 337 of the Trade Act of 1930 into Arashi Vision and its U.S. subsidiary. The USITC published its final ruling on Thursday. The probe has concluded and has caused \"no substantial impact on the company's production and operations,\" Arashi Vision said in a filing to the Shanghai stock exchange on Friday.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/insta360-maker-says-it-will-import-sell-products-in-us-without-restrictions-after-usitc-ruling-5958101",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5958111:en",
            "title": "Exclusive-Indonesia bourse to phase in 15% free-float rule, may batch firms by readiness",
            "description": "JAKARTA, Feb 27 : The Indonesia Stock Exchange will implement in stages an upcoming requirement for companies to double their minimum free float, or freely tradable stocks, to 15 per cent, its interim chief executive told Reuters on Friday. The bourse may divide companies into batches according to their readiness to offer more stocks, giving each batch a year to comply with the minimum free float level, Jeffrey Hendrik said in an interview, adding the details were still subject to approval by the Financial Services Authority. The comments are the clearest details authorities have given about the plan to increase the mandatory free float, among a raft of capital‑market reforms pledged since MSCI in late January warned Indonesia risked being downgraded to frontier market status as early as May over limited transparency that may have enabled price manipulation.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/exclusive-indonesia-bourse-phase-in-15-free-float-rule-may-batch-firms-readiness-5958111",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5958471:en",
            "title": "AI disruption looms over markets with US jobs data on tap",
            "description": "NEW YORK, Feb 27 : Prospects for artificial intelligence to disrupt business sectors should keep the U.S. stock market on edge in the coming week, as Wall Street looks for more insight into how the emerging technology will reverberate through the economy. The monthly U.S. jobs report headlines economic data due next week, while major semiconductor player Broadcom is among the remaining reports that will close out the fourth-quarter earnings season. The disruptive potential of AI has consumed investors in recent weeks, with shares in industries such as software, wealth management and real estate services pummeled by concerns about business upheaval. \"There continues to be this...back and forth about who might be the victim and those that will actually emerge winners because they are harnessing AI as opposed to being replaced by it,\" said Kristina Hooper, chief market strategist at Man Group. \"There is very little definitive right now about that, and so I think that will continue to be a concern.\" Stock prices in areas such as software remain acutely sensitive to AI-related developments. AI bellwether Nvidia's highly anticipated quarterly report failed to calm nerves, with the semiconductor giant's shares falling over 5 per cent on Thursday and weighing on the technology sector. Investors are concerned about whether Nvidia's \"hyperscaler\" customers will garner sufficient returns to justify their massive spending on data centers and other infrastructure. Despite the tech sector's struggles, gains this year in other areas such as industrials and consumer staples have helped buoy major equity indexes. The benchmark S&P 500 was up 0.9 per cent in 2026 as of Thursday. \"The U.S. equity market is sort of in its late cycle, trying to find the winners and losers of this new disruptive technology and pretty much treading water,\" said John Velis, Americas macro strategist at BNY. WILL FEBRUARY JOBS BACK JANUARY'S STRENGTH? The U.S. jobs report for February, due on March 6, is expected to show an increase of 60,000 jobs, according to a Reuters poll. It comes after January's surprisingly robust report, with an increase of 130,000 jobs and the unemployment rate falling to 4.3 per cent. The January report allayed worries about a weakening labor market, but \"the concern is that January is a one-off,\" said Paul Nolte, senior wealth adviser and market strategist at Murphy & Sylvest Wealth Management. \"We saw a good January jobs report, but we also have seen a really weak 2025 for the job market,\" Hooper said. \"And so the question becomes, where do we go from here?\" Investors will also seek clues from the report about when the Federal Reserve may next cut interest rates. Fed funds futures suggest the next reduction will come in June or July, after Fed Chair Jerome Powell's term ends in May and his nominated replacement Kevin Warsh could be in charge. The Fed cut rates last year in the face of a weakening employment backdrop but paused the easing cycle in January, and solid jobs data could prompt investors to push back their expectations for further cuts. Investors generally associate lower interest rates with higher prices for stocks and other assets. BNY's Velis said the market's reaction to the jobs data will be telling for which factors are prominent for equity investors. For example, strong data followed by weak stock performance is \"going to be a sign that the rate argument is important,\" Velis said. RETAIL SALES, BROADCOM EARNINGS ALSO UP NEXT Other economic releases due in the coming week include reports on manufacturing and services sector activity. The retail sales report for January is expected on March 6. Aside from Broadcom's quarterly report on Wednesday, results are expected from retailers Best Buy and Target. Wall Street is eager for any evidence of AI's impact on the economy, both positive and negative. In an interview with Reuters this week, outgoing Atlanta Fed President Raphael Bostic said the U.S. may be entering a period of structurally higher unemployment as firms deploy AI tools to save labor. \"Major technological shifts provoke both excitement and anxiety,\" Keith Lerner, chief investment officer at Truist Advisory Services, said in a research note on Thursday. \"More recently... optimism has begun to give way to heightened anxiety and increasingly bleak narratives about AI’s impact on work, productivity, and economic outcomes.\"",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/ai-disruption-looms-over-markets-us-jobs-data-tap-5958471",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5958466:en",
            "title": "Pentagon Anthropic feud has sales and AI warfare at stake as Friday deadline looms",
            "description": "NEW YORK, Feb 27 : An explosive feud between the Pentagon and top artificial intelligence lab Anthropic is set to come to a head by 5:01 p.m. (2201 GMT) on Friday over concerns about how the military could use AI at war. The dispute, barreling toward a deadline set by the Pentagon for resolution, is widely seen as a referendum on how powerful AI could be deployed by the military and how its risks are managed. The Pentagon wants any lawful use to be allowed and has threatened Anthropic’s business if the startup does not scrap additional guardrails. “It’s a shot across the bow about the future of artificial intelligence and its use on the battlefield,” Chris Miller, the former acting secretary of defense, told Reuters. He added that the outcome will “be an acid test for those companies that claim to want to use AI humanely.” The months-long spat has divided some industry leaders, military officials and lawmakers over whether AI should be wielded without constraints when its creator Anthropic said the technology was not yet reliable for fully autonomous weapons. Democratic Senator Elissa Slotkin weighed in on Thursday: “The average person does not think we should allow weapons systems to get into war and kill people without a human being overseeing that in some way.” Speaking at a confirmation hearing for two assistant defense secretary nominees, Slotkin added: “I certainly don’t think any American, Democrat or Republican, wants mass surveillance on the American people.” The Pentagon, which the Trump administration renamed the Department of War, has pushed back on the dilemma as a false choice “peddled by leftists in the media.” “The Department of War has no interest in using AI to conduct mass surveillance of Americans (which is illegal) nor do we want to use AI to develop autonomous weapons that operate without human involvement,” Pentagon chief spokesperson Sean Parnell posted on X Thursday. NEGOTIATIONS FALTER The Pentagon has signed $200-million ceiling agreements with major AI labs in the past year, including Anthropic, OpenAI and Google. It is pushing companies to agree to scrap their usage policies in favor of abiding by an all-lawful use clause. Anthropic, continuing these talks, has maintained red lines over the military’s use of its Claude AI models for autonomous weapons and domestic surveillance. Anthropic was first among these AI companies to work with classified information, through a supply deal via cloud provider Amazon. Anthropic CEO Dario Amodei, famous for quitting OpenAI in 2020 over concerns about AI technology’s stewardship, has warned that AI has advanced faster than the law. Powerful technology could hoover up disparate material to gather intelligence on unwitting civilians, he said in a Thursday blog post, a prospect that critics view as a legal loophole. “Anthropic understands that the Department of War, not private companies, makes military decisions,” but AI in narrow cases “can undermine, rather than defend, democratic values,” Amodei said. Amodei met with Defense Secretary Pete Hegseth this week. Afterward, the Pentagon gestured toward compromise and sent the startup revised contract language. But the two parties remained at an apparent impasse. An Anthropic spokesperson said on Thursday, “The contract language we received overnight from the Department of War made virtually no progress” and would allow “safeguards to be disregarded at will.” BUSINESS THREATS Key business for Anthropic is at stake. The Pentagon warned it would terminate its work with the startup and declare it a supply-chain risk if Anthropic did not accede to the department’s demand for all-lawful use of AI. The designation, reserved typically for suppliers in adversary nations, means that defense contractors could be barred from deploying Anthropic's AI during work for the Pentagon. The setback comes as Anthropic races to win sales to businesses and government, with national security an area of focus. The Pentagon has asked contractors including Lockheed Martin to give an appraisal of their reliance on Anthropic ahead of the risk designation, Reuters reported on Wednesday. The defense industrial base totaled around 60,000 contractors including major public companies as of 2021. The Pentagon made a second threat, the legality of which some experts have questioned. “If they don’t get on board, SecWar will ensure the Defense Production Act is invoked on Anthropic,” a senior Pentagon official told Reuters, “compelling them to be used by the Pentagon regardless of if they want to or not.”",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/pentagon-anthropic-feud-has-sales-and-ai-warfare-stake-friday-deadline-looms-5958466",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5957821:en",
            "title": "Poland plans social-media ban for children under 15, Bloomberg News reports",
            "description": "Feb 27 : Poland plans to introduce new legislation to ban social media for children under 15 years of age and will hold platforms responsible for age verification, Education Minister Barbara Nowacka told Bloomberg News in an interview published on Friday. The ruling Civic Coalition will present the draft outline on Friday, with fines planned for platforms that remain accessible to younger users, Nowacka said, adding that the law could take effect by early 2027. \"We see the mental health of children and young people, we see a decline in their intellectual competence,\" said Nowacka adding that the size of penalties that companies would have to pay is still under discussion. Several European governments including Denmark, Greece, France, Spain and Britain have explored similar restrictions amid claims that social-media services are harmful or addictive for minors. The British government said in January it was considering restrictions to protect children online, after Australia implemented similar laws in December. The initiative could put Warsaw at odds with U.S. tech firms such as Meta and Elon Musk's X, some of which have pushed back against restrictions following Australia's ban last year.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/poland-plans-social-media-ban-children-under-15-bloomberg-news-reports-5957821",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5958061:en",
            "title": "Kia America to recall about 85,000 US vehicles over seat back frame issue",
            "description": "Feb 27 : Kia America is recalling 85,448 vehicles in the U.S. over failure of a seat back frame failing to properly restrain an occupant during a crash, the U.S. National Highway Traffic Safety Administration said on Friday.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/kia-america-recall-about-85000-us-vehicles-over-seat-back-frame-issue-5958061",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5957746:en",
            "title": "Indonesian trade surplus widened in Jan to $2.76 billion, Reuters poll shows",
            "description": "JAKARTA, Feb 27 : Indonesia's trade surplus is expected to have widened in January from a month earlier as double-digit growth in exports offset higher imports, a Reuters poll showed on Friday. A dozen economists surveyed by Reuters between February 23 and February 27 forecast a median January trade surplus of $2.76 billion, up from $2.52 billion in December, but down from $3.45 billion in January 2025. The largest economy in Southeast Asia has posted monthly trade surpluses since mid-2020, reaching a peak in April 2022 during a commodities boom. Exports in the first month of 2026 were estimated to have risen 11.07 per cent from a year earlier, a slightly slower pace compared with 11.64 per cent in December. January imports were projected to be 13.23 per cent higher than a year earlier, compared with 10.81 per cent growth in December. On Monday, the government's statistics office will also release consumer price data for February. The poll produced a median forecast for headline inflation of 4.31 per cent, picking up from 3.55 per cent in January. The central bank is targeting an inflation rate of 1.5 per cent to 3.5 per cent in 2026 and 2027. Annual core inflation, which strips out government-controlled and volatile food prices, was estimated at 2.48 per cent in February, up from 2.45 per cent in January, the poll showed. (Polling by Devayani Sathyan; Writing by Stefanno Sulaiman; Editing by Neil Fullick)",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/indonesian-trade-surplus-widened-in-jan-276-billion-reuters-poll-shows-5957746",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5958406:en",
            "title": "India's GDP growth estimated at 7.8% in Oct-Dec following data revamp",
            "description": "NEW DELHI, Feb 27 : India's economy grew 7.8 per cent in October-December from the same period a year earlier, after posting 8.4 per cent growth in the previous quarter, the government said on Friday, as it unveiled a revised series of national output data. For the full fiscal year ending in March, the government expects the South Asian economy to have grown by 7.6 per cent, the National Statistics Office said. It had been forecast to grow by 7.4 per cent under the old data series. Prime Minister Narendra Modi's government has undertaken to revamp economic data, including for inflation and gross domestic product, by expanding the sources of information and updating the base year to 2022-23, among other changes. The adjustments aim to address criticism of outdated data practices and enhance accuracy.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/indias-gdp-growth-estimated-78-in-oct-dec-following-data-revamp-5958406",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5958371:en",
            "title": "Dyson settles Malaysian workers' UK lawsuit",
            "description": "LONDON, Feb 27 : Two dozen migrant workers who alleged they were subjected to forced labour at a Malaysian factory while making parts for British vacuum cleaner manufacturer Dyson have settled their London lawsuit, their lawyers said on Friday. The 24 workers from Nepal and Bangladesh, one of whom has died and whose estate brought the case, sued Dyson Technology Ltd, Dyson Ltd and a Malaysian subsidiary in 2022. The claimants were workers for Malaysian firm ATA Industrial or its sister company and made components for Dyson products. Their lawyers previously said the workers had money unlawfully deducted from their wages and were sometimes beaten for not meeting onerous targets, alleging the Dyson companies were ultimately responsible. Dyson, whose Malaysian subsidiary cancelled its contract with ATA in 2021, denied the claimants' allegations. The lawsuit at London's High Court was settled, the claimants' law firm Leigh Day said in a statement, with no admission of liability by the defendants. \"This resolution was reached in recognition of the expenses of litigation and the benefits of settlement,\" a statement on Leigh Day's website said. \"The defendants deny and have always denied all liability in respect of the claimants, who were employed by a third-party supplier, at factories in Malaysia which were owned and operated by ATA Industrial (M) Sdn Bhd and its related entities.\"",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/dyson-settles-malaysian-workers-uk-lawsuit-5958371",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5958316:en",
            "title": "Netflix, Paramount shares jump as months-long fight for Warner Bros ends",
            "description": "Feb 27 : Netflix jumped more than 9 per cent premarket on Friday as investors cheered its decision to exit the fight for Warner Bros Discovery, while Paramount rose about 10 per cent on winning the race for some of the world's most prized TV and film assets. The end of the months-long bidding war put the focus back on the significant antitrust scrutiny that the Paramount-Warner Bros tie-up would face in the U.S. and Europe, including an active investigation in California. Warner Bros shares were marginally lower. Paramount Skydance maintained its dogged pursuit of Warner Bros, launching a hostile campaign to wrest the prize from Netflix. It managed to lure Warner Bros back to the bargaining table last week, with a revised $31-a-share bid that topped Netflix's $27.75 offer for the studio and streaming assets. Netflix said the price required to stay in the contest had climbed beyond what it considered financially sound, confirming to Reuters that it would withdraw from the takeover battle. \"We've always been disciplined… the deal is no longer financially attractive,\" the company said. \"The bid always looked like a mix of offence and defence – shoring up content and scale, while keeping competition from gaining any edge, but at a very high price,\" said Matt Britzman, senior equity analyst, Hargreaves Lansdown. \"For now, at least, the market seems to be pricing this as a win for everyone.\" In the fight for Warner Bros, the Paramount consortium backed by billionaire Larry Ellison and led by his son, Paramount CEO David Ellison, also boosted its termination fee to $7 billion and expanded its financing commitments, including $45.7 billion in equity. \"In the U.S., we believe Paramount has a good enough relationship with the presidential administration to ease concerns, and the Department of Justice has set a precedent in overlooking the merger of major studios when Disney bought Fox,\" analysts at Morningstar said.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/netflix-paramount-shares-jump-months-long-fight-warner-bros-ends-5958316",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5957101:en",
            "title": "Global shares inch higher, on track for monthly gain despite AI, Iran jitters",
            "description": "TOKYO/LONDON, Feb 27 : Global shares edged up on Friday to within a fraction of a fresh record high, and were set for a monthly gain, even as geopolitical tensions and persistent concerns about AI caused wild swings under the surface. Manish Kabra, head of U.S. equity strategy at SocGen, said in the absence of any major news, the market is refocusing on fundamentals which he described as \"rock solid.\" \"This is on a global basis. When I say fundamental, this is the profit cycle, the growth cycle, the broadening of the growth,\" said Kabra. Global shares rose 0.2 per cent, while Europe's STOXX 600 was up 0.4 per cent, buoyed by positive earnings. Nevertheless, jitters around AI spending and fears about the technology's broader business disruptions, as well as U.S.-Iran tensions, have weighed on sentiment this week. U.S. stock market futures were flashing red during early European trading, with S&P futures off 0.2 per cent while the tech-heavy Nasdaq futures were flat. Tech shares fell on Thursday even as Nvidia posted better-than-expected results for the January quarter and forecast current-quarter revenue above market estimates. \"It seems 'the Street' simply wanted more, or perhaps just isn't prepared to chase the stock at its current lofty valuation,\" IG market analyst Tony Sycamore said about Nvidia's results in a note. Shares in Nvidia down over 5 per cent ended Thursday. IRAN TENSIONS SIMMER Markets were also closely watching the latest developments in U.S. and Iran nuclear talks, as Washington amassed more military resources in the Middle East. An Omani mediator of U.S. and Iran nuclear talks gave an optimistic summary of the latest round of negotiations, but signs of a breakthrough that would avert potential U.S. strikes remained elusive. \"With no major breakthroughs announced in the U.S.–Iran talks, crude markets remained in wait-and-see mode, continuing to price in a significant risk of military escalation between the two countries,\" said Mantas Vanagas, senior economist at Westpac Group. U.S. crude rose 1.4 per cent to $66.16 a barrel, and Brent rose to $71.65, up 1.3 per cent. Spot gold shed 0.15 per cent to $5,178.29 an ounce.  The U.S. and Iran plan to resume negotiations over Tehran's nuclear programme after consultations in their countries' capitals, Omani Foreign Minister Sayyid Badr Albusaidi said in a post on X after the day's meetings in Switzerland.  Any substantial move forward could curb chances for U.S. President Donald Trump to carry out a threatened attack on Iran that many fear could escalate into a wider war. POLITICS ALSO IN FOCUS FOR CURRENCIES The dollar index, which measures the greenback against a basket of currencies, was flat at 97.73, with the euro up 0.07 per cent at $1.1805. The yen was flat 156.16 per dollar. Sterling rose 0.1 per cent to $1.349 after British Prime Minister Keir Starmer's Labour Party suffered an election defeat in an area of Greater Manchester that it had dominated for almost a century. The yield on benchmark U.S. 10-year notes fell 2.6 basis points to 3.99 per cent. Data in Japan showed cooling inflation in Tokyo and weaker-than-expected factory output, complicating the case for policy rate increases by the central bank. The data came on the heels of Prime Minister Sanae Takaichi putting forward two Bank of Japan board nominees who share her dovish mindset.  Japanese Finance Minister Satsuki Katayama signalled heightened vigilance over currency moves, telling parliament the government is monitoring the yen's recent drop with a strong sense of urgency.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/global-shares-inch-higher-track-monthly-gain-despite-ai-iran-jitters-5957101",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5957401:en",
            "title": "Japan finance minister signals greater vigilance over the yen's weakness",
            "description": "TOKYO, Feb 27 : Japanese Finance Minister Satsuki Katayama on Friday signalled heightened vigilance over currency moves, telling parliament the government is monitoring the yen's recent slide with a strong sense of urgency. \"We are watching recent movements very closely, with a strong sense of urgency,\" Katayama told parliament, when asked if the yen's depreciation may be hampering wage growth by pushing up import costs. \"We are also maintaining extremely close communication with the United States, and will continue engaging in dialogue to ensure that the concerns you raise do not materialise,\" she said.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/japan-finance-minister-signals-greater-vigilance-over-yens-weakness-5957401",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5958276:en",
            "title": "Petronas sees profit slide for third straight year as oil prices weigh on margins",
            "description": "KUALA LUMPUR, Feb 27 : Malaysian state energy firm Petroliam Nasional Bhd , on Friday warned of eroding margins amid persistent geopolitical and economic risks, as subdued oil prices saw its profits decline for the third straight year. Petroliam Nasional, or Petronas, reported a profit after tax of 45.4 billion ringgit  ($11.68 billion) in 2025 compared to 55.1 billion ringgit in 2024, while revenue fell to 266.1 billion ringgit ($68.44 billion) from 320 billion ringgit over the same period. Chief Executive Officer Tengku Muhammad Taufik Tengku Aziz said the decline was in line with industry peers, with oil prices falling amid oversupply concerns and macroeconomic challenges.  \"We have seen margin erosion manifest in our results, but we will see this come under more pressure as cost inflation converges with prices softening,\" he told a press conference.   PETRONAS TO FOCUS ON RESILIENCE The firm would focus on building resilience by strengthening its core hydrocarbons portfolio, as well as grow new businesses and manage emissions moving forward, he said. Petronas is a significant source of revenue for Malaysia's government, its sole shareholder, contributing billions to public coffers annually.  The company paid the government 32 billion ringgit in dividends last year. Muhammad Taufik said Petronas expects to pay 20 billion ringgit this year - the lowest since 2017 - reflecting a need for the firm to ensure sufficient cash flow.  \"(The dividend) is always going to be governed by our affordability,\" he said. Petronas last year embarked on a \"right-sizing\" exercise, aiming to cut about 5,000 employees to ensure its long-term survival. Muhammad Taufik said on Friday the process was expected to conclude by August.  Crude oil prices were expected to trade rangebound between $65-$70 per barrel over the next five years, with the firm allocating 2 billion ringgit annually for exploration in the same period, Petronas said.    Capital investments slipped to 41.6 billion ringgit in 2025 compared to 54.2 billion ringgit in 2024, the company said. Petronas' upstream business saw a decline in post-tax profit to 26.2 billion ringgit in 2025. Its gas and maritime business saw profit rise to 20.9 billion ringgit, while its downstream segment posted a loss after tax of 1.9 billion ringgit. Petronas reported a 2.2 per cent increase in carbon emissions in 2025 to 56.95 million tons of carbon dioxide equivalent emissions, attributed mainly to the transfer of operations for two production sharing contracts. The firm also reported a 72 per cent reduction in methane emissions, exceeding its target of 50 per cent.  ($1 = 3.8880 ringgit)",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/petronas-sees-profit-slide-third-straight-year-oil-prices-weigh-margins-5958276",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5957651:en",
            "title": "What AI windfall? Debt will still weigh on big economies",
            "description": "LONDON, Feb 27 : An AI productivity boom, if it materialises, may help buy major economies more time to clean up their strained public finances, economists say, although it won't do the heavy lifting. The stakes couldn't be higher. Debt is above 100 per cent of output across most rich economies and set to rise given ageing population costs, interest bills and pressure to spend more on defence and climate change. U.S. policymakers are already optimistic on AI-driven growth and economists say the technology has the potential to shake the world out of a post-2008 productivity slump by boosting workers' efficiency and freeing them to focus on more productive tasks. Higher economic growth would make government spending and debt loads potentially more manageable and help fend off scrutiny from bond vigilantes. To sketch the impact on public finances if AI does boost labour productivity over the long term, the OECD and three high- profile economists shared early estimates with Reuters. Filiz Unsal, the OECD's deputy director of economic policy and research, said an AI productivity surge, were it to increase employment, would lower debt across OECD countries, from the U.S. to Germany and Japan, by 10 per centage points from the roughly 150 per cent of output the organisation expects in 2036. That would still be a sharp rise from 110 per cent currently. Much will depend on whether job creation eventually outweighs any job losses from automation, as well as whether firms pass on higher profits by raising wages and how governments manage their overall spending. In the United States, two of the other economists projected debt rising more slowly to roughly 120 per cent over the next decade from around 100 per cent of output now in their best-case scenarios. One saw little change. \"Productivity is like magic... It helps the fiscal dynamics dramatically,\" said Idanna Appio, one of the economists, who was previously at the New York Federal Reserve and is now a fund manager at First Eagle Investment Management. \"But our fiscal problems are well beyond what productivity can fix,\" Appio said. DEMOGRAPHICS TO LIMIT AI IMPACT For now, ratings agency S&P assumes no major public finance impact by the end of the decade. \"The one (path) that the (U.S.) administration is hoping for would be you get saved by the bell,\" said Mark Patrick, head of macro and country risk at Teachers Insurance and Annuity Association of America, but added: that isn't \"something we can set our clocks by.\" The economists did not provide estimates for other countries. However, AI could boost productivity in Britain in line with the U.S., but by half as much in Italy and Japan due to lower adoption rates and smaller sectors that could benefit from AI, OECD research has found. Ultimately, fiscal dynamics will determine how much AI-driven productivity can counterbalance rising debt. Demographics is the biggest challenge. \"The root of the debt issue is with ageing demographics and the entitlements that are tied to that,\" said Kevin Khang, who heads global economic research at Vanguard, the world's second- largest asset manager. Addressing it \"requires getting the fiscal house in order and (AI is) just buying us the time,\" he said. Khang sees a scenario where AI boosts U.S. growth to average 3 per cent through 2040 as most likely. The Fed sees potential growth around 2 per cent. He estimates higher growth and tax revenues would slow U.S. debt growth to around 120 per cent of output by the late 2030s. That's much lower than the 180 per cent he foresees - higher than others - if AI disappoints, growth slows and market pressure raises borrowing costs. Bond investors have been quick to punish governments for fiscal largesse ever since bond yields rose sharply after the pandemic across rich economies. Appio said declining U.S. immigration added to the demographic challenge. \"The labour shock offsets any (AI) productivity growth,\" she said, but added she would be much more worried without AI. UNCERTAINTY AROUND TAX, SPENDING Economy-wide productivity gains should raise revenues. But if AI reduces employment or competition, and profits and capital - often taxed less than labour - see most benefit, revenues could disappoint. On the spending side, public sector efficiency gains could help costs, but the risk is spending rising alongside growth. That's why Kent Smetters, director of the University of Pennsylvania's Penn Wharton Budget Model analysis group, expects a tiny impact on U.S. debt in a decade. Even if growth is higher than he currently expects, that would still have little impact on curbing social security, which makes up a fifth of federal spending, because claims are indexed to average wages, Smetters said. Other labour costs the government covers would also rise if productivity raises private sector wages, he added. \"It's very important to see whether wages are going to increase,\" the OECD's Unsal said, adding that wage growth was more likely if AI doesn't increase employment. There are of course debt costs, which will depend on whether productivity raises real interest rates, a debate already emerging at the Fed, and how long growth outpaces any rise, economists said. Clearly, they don't have crystal balls. A shock could quickly upend this debate. A recession could mean \"the AI boom may not come quick enough before the market gets nervous about the fiscal trajectory,\" said Barclays' global head of economics research Christian Keller.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/what-ai-windfall-debt-will-still-weigh-big-economies-5957651",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        }
    ]
}