{
    "data": [
        {
            "id": "entity:node/5957361:en",
            "title": "Exclusive-Nintendo plans around $1.9 billion share sale by Kyoto bank and others, sources say",
            "description": "TOKYO, Feb 27 : Nintendo plans an unwinding of strategic shareholdings that would see companies including MUFG Bank and the Bank of Kyoto selling shares of the \"Super Mario\" maker, according to three sources familiar with the situation. The sale is expected to total roughly 300 billion yen ($1.9 billion) and Nintendo could make a decision as soon as Friday, two of the sources said. The Kyoto-based gaming company also plans a buyback, the sources said. Reuters is reporting Nintendo's plan for the first time. Nintendo did not respond to a request for comment. The sources declined to be identified as the information is not public. Both banks have set out policies to reduce cross-shareholdings. A 2019 sale of Nintendo's shares, in which they and others participated, totalled some 71 billion yen. The Bank of Kyoto, a regional lender, held a 4.19 per cent stake in Nintendo as of September last year. MUFG Bank, Japan's largest, had a 3.62 per cent stake, which is held by a trust bank. Mitsubishi UFJ Financial Group declined to comment and Kyoto Financial Group did not respond to a request for comment. Regulators and the Tokyo Stock Exchange have been encouraging Japanese companies to unwind their cross-shareholdings. Toyota is planning an unwinding of strategic shareholdings that would involve banks and insurers selling around $19 billion of its shares, Reuters reported on Thursday. The practice, which involves firms holding shares in each other to cement business ties, has been criticised by governance experts and overseas investors as insulating management from shareholders. Although the practice has been widespread in Japan for decades, it is less common in the West.    ($1 = 156.0200 yen)",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/exclusive-nintendo-plans-around-19-billion-share-sale-kyoto-bank-and-others-sources-say-5957361",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956891:en",
            "title": "Tokyo Feb core CPI rises 1.8% yr/yr",
            "description": "TOKYO, Feb 27 : Core consumer prices in Tokyo rose 1.8 per cent in February from a year earlier, government data showed on Friday. The core consumer price index for Japan’s capital, which includes oil products but excludes fresh food prices, compared with economists' median estimate for a 1.7 per cent annual rise.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/tokyo-feb-core-cpi-rises-18-yryr-5956891",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956911:en",
            "title": "Core inflation in Japan's capital slows below BOJ's 2% target in test for policy",
            "description": "TOKYO, Feb 27 : Annual core inflation in Tokyo slowed in February, running below the Bank of Japan's 2 per cent target for the first time in 16 months, data showed on Friday, potentially heightening friction between the central bank and the government on the future path of rate hikes. The data is in line with the BOJ's projection that consumer inflation will temporarily slow due to the impact of fuel subsidies and the base effect of last year's spike, before reaccelerating on steady wage gains. The Tokyo core consumer price index, which excludes volatile costs of fresh food, rose 1.8 per cent in the year to February after a 2.0 per cent gain in January, data showed, falling below the 2 per cent target for the first time since October 2024. It compared with a median market forecast for a 1.7 per cent gain. The slowdown reflected the effect of fuel subsidies and the abolition of gasoline tax surcharges, while a wave of food price hikes has also run its course. An index stripping away the effect of fresh food and fuel, which is closely watched by the BOJ as a better gauge of trend inflation, rose 2.5 per cent in February from a year earlier, picking up from a 2.4 per cent gain in January. \"I don't think this result alone would affect the Bank of Japan's stance of keeping to its commitment to raise interest rates,\" said Kanako Nakamura, an economist at Daiwa Institute of Research, noting the slowdown in core inflation was expected. But some analysts say the easing core inflationary impulse could give dovish Prime Minister Sanae Takaichi a reason to push the BOJ to go slow on its rate hikes. In a potential sign of friction over monetary policy, the Mainichi daily reported this week that Takaichi had expressed reservations about additional interest rate hikes during her meeting with BOJ Governor Kazuo Ueda last week. \"If, going forward, the BOJ were to step back from its rate-hike stance, it would be easier to explain that shift not as pressure from the government but as a change in judgment strictly driven by data, namely, weakness in GDP and CPI,\" said Masato Koike, a senior economist at Sompo Institute Plus. Separate government data showed on Friday that Japan's factory output rose 2.2 per cent, the first gain in three months driven by double-digit car output growth. But the increase undershot even the most bearish economist forecast, with the median forecasting a 5.3 per cent jump. Japanese manufacturers expect their output to fall again in February and March. The BOJ raised interest rates to a 30-year high of 0.75 per cent in December, taking another landmark step in ending decades of huge monetary support in a sign of its conviction that Japan is progressing toward durably hitting its 2 per cent inflation target. The central bank has signalled its readiness to continue raising interest rates if its economic and price forecasts materialise.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/core-inflation-in-japans-capital-slows-below-bojs-2-target-in-test-policy-5956911",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5957081:en",
            "title": "Oil prices edge lower after US, Iran extend talks",
            "description": "(Corrects to add keywords for media subscribers) By Nicole Jao Feb 26 : Oil prices fell on Friday and were on track for a weekly decline after the United States and Iran extended talks over the OPEC member's nuclear programme, easing concerns about potential hostilities that could disrupt supply. Brent crude futures lost 28 cents, or 0.4 per cent, to $70.47 a barrel. WTI futures fell 29 cents, or 0.44 per cent, to $64.92. For the week, Brent was heading for a 1.8 per cent decline, while WTI was set to fall around 2.2 per cent, reversing some of the previous week's gains. The United States and Iran held indirect talks in Geneva on Thursday over their long-running nuclear dispute to avert a conflict after U.S. President Donald Trump ordered a military build-up in the region. During the talks, oil prices gained more than a dollar a barrel after media reports indicated the discussions had stalled over U.S. insistence on zero enrichment of uranium by Iran, as well as a demand for the delivery of all 60 per cent enriched uranium to the United States. However, prices eased after the Omani mediator said the two sides had made progress in their talks. They plan to resume negotiations with technical-level discussions scheduled to take place next week in Vienna, Omani Foreign Minister Sayyid Badr Albusaidi said in a post on X after the meetings in Geneva. \"While this initially allayed concerns of imminent U.S. military action, it leaves little time to reach a deal before President Trump’s deadline of 1–6 March,\" said Daniel Hynes, an analyst at ANZ.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/oil-prices-edge-lower-after-us-iran-extend-talks-5957081",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5957061:en",
            "title": "Panama officials search CK Hutchison's subsidiary office, source says",
            "description": "Feb 26 : Panamanian authorities conducted a search of a local office belonging to a unit of Hong Kong conglomerate CK Hutchison office, a source familiar with operation told Reuters on Thursday. The person said the search was not related to the current dispute over the Panama Canal ports. Panama's government recently annulled CK Hutchison's contracts to operate two port terminals at either end of the Panama Canal, a move that the company has disputed.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/panama-officials-search-ck-hutchisons-subsidiary-office-source-says-5957061",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5957001:en",
            "title": "Zscaler posts wider quarterly loss on higher spending; shares down 9%",
            "description": "Feb 26 : Zscaler on Thursday posted a wider net loss in the second quarter, citing higher spending on sales, marketing, and research and development in a competitive market, sending shares of the cloud security firm down roughly 9 per cent in extended trading. The results come when IT budgets remain tight and clients spend cautiously on large deals amid economic uncertainty, even though cybersecurity budgets face less pressure than general capital outlays. Zscaler provides cloud-based zero trust security, which is designed to eliminate the need for legacy firewalls and virtual private networks (VPNs) by authenticating each connection rather than granting broader network access. Shares of cybersecurity companies, including CrowdStrike and Zscaler, have fallen in recent days as investors assessed the potential impact of AI startup Anthropic's Claude Code Security tool on the industry. Zscaler, which competes with Palo Alto Networks and Cloudflare, reported a net loss of $34.3 million in the quarter ended January 31, widening sharply from a net loss of $7.7 million a year earlier. Total operating expenses rose to $676.3 million in the second quarter, compared with $539.5 million in the year-ago period, driven by sales, marketing and research and development expenses. \"While CIOs (chief information officers) care about the budget, but they're doing two things: they do want to embrace AI and they want to do it securely. So, AI is driving demand for security,\" Zscaler CEO Jay Chaudhry said. Businesses spend on tools offered by companies such as Zscaler amid a wave of high-profile cyberattacks that has hit companies, including F5. Zscaler said its second-quarter revenue rose 26 per cent to $815.8 million, beating analysts' average estimate of $798.8 million, according to LSEG-compiled data. Its adjusted profit per share of $1.01 exceeded estimate of 90 cents. The company forecast third-quarter adjusted earnings per share of $1.00 to $1.01, above analysts' estimates of 95 cents, and revenue of $834 million to $836 million, topping expectations of $831.9 million.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/zscaler-posts-wider-quarterly-loss-higher-spending-shares-down-9-5957001",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956841:en",
            "title": "Netflix declines to raise offer for Warner Bros",
            "description": "Feb 26 : Netflix said on Thursday it will not raise its offer for Warner Bros Discovery after the HBO Max owner's board determined that Paramount Skydance's latest proposal was a \"Superior Proposal\" to the streaming pioneer's existing merger agreement.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/netflix-declines-raise-offer-warner-bros-5956841",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956836:en",
            "title": "Anthropic cannot accede to Pentagon's request in AI safeguards dispute, CEO says",
            "description": "Feb 26 : Anthropic cannot accede to the Pentagon's request in an AI safeguards dispute despite threats to remove the company from the Department of Defense's systems, the AI firm's CEO, Dario Amodei, said on Thursday. The Pentagon's dispute with Anthropic stems from the AI startup's refusal to remove safeguards that would prevent its technology from being used to target weapons autonomously and conduct surveillance in the United States. Anthropic, backed by Google and Amazon, has a contract with the department worth up to $200 million. The department has said it will contract only with AI companies that accede to \"any lawful use\" and remove safeguards, Amodei said on Thursday. Use cases for its AI such as mass domestic surveillance and fully autonomous weapons have never been included in Anthropic's contracts with the department and \"we believe they should not be included now,\" Amodei said. Amodei added that the department threatened to remove Anthropic from its systems if the company maintained the safeguards and threatened to designate it a \"supply chain risk and to invoke the Defense Production Act to force the safeguards' removal\". \"Regardless, these threats do not change our position: we cannot in good conscience accede to their request,\" Amodei said. Earlier in the day, Pentagon spokesperson Sean Parnell said on X that the department has no interest in using AI to conduct mass surveillance of Americans nor does it want to use AI to develop autonomous weapons that operate without human involvement. \"Here's what we're asking: Allow the Pentagon to use Anthropic's model for all lawful purposes,\" Parnell said. The Pentagon did not immediately respond to a request for comment on Anthropic's statement. \"It is the Department's prerogative to select contractors most aligned with their vision. But given the substantial value that Anthropic's technology provides to our armed forces, we hope they reconsider,\" Amodei said. \"Should the Department choose to offboard Anthropic, we will work to enable a smooth transition to another provider,\" he added. An Anthropic spokesperson said the company remains \"ready to continue talks and committed to operational continuity for the Department and America's warfighters.\"",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/anthropic-cannot-accede-pentagons-request-in-ai-safeguards-dispute-ceo-says-5956836",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956886:en",
            "title": "Meta signs multi-billion-dollar deal to rent Google AI chips, The Information reports",
            "description": "Feb 26 : Meta Platforms has signed a multi-billion dollar deal to rent artificial intelligence chips from Google to develop new AI models, The Information reported on Thursday, citing a person involved in the talks. The report of the multi-year deal comes as companies pour billions into chips and AI infrastructure to meet demand for artificial intelligence. Reuters could not immediately verify the report. Meta is also in talks with Google to buy the chips, known as tensor processing units, for its data centers as early as next year, though the status of those discussions could not be determined, The Information said. Google has also signed an agreement with an unidentified large investment firm to fund a joint venture that would lease TPUs to other customers, the report added. Meta and Google declined to Reuters' request for a comment.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/meta-signs-multi-billion-dollar-deal-rent-google-ai-chips-information-reports-5956886",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956956:en",
            "title": "Venture Global signs 20-year LNG supply deal with Korea's Hanwha Aerospace",
            "description": "Feb 26 : U.S.-based LNG company Venture Global said on Thursday it had signed a 20-year sales and purchase agreement with Korea's Hanwha Aerospace for 1.5 million metric tons per annum (mtpa) of liquefied natural gas starting in 2030. The agreement brings Venture Global's total long-term contracted portfolio to more than 46 million tons per annum, the company said in a press release. In late November, Venture Global signed a separate 20-year agreement to supply Japan’s top city gas provider Tokyo Gas with 1 million metric tons per annum of LNG beginning in 2030. Venture Global is the second-largest LNG exporter in the U.S., the leading nation for LNG exports.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/venture-global-signs-20-year-lng-supply-deal-koreas-hanwha-aerospace-5956956",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956806:en",
            "title": "OpenAI outlines steps to boost safety measures in response to Canada school shooting",
            "description": "TORONTO, Feb 26 : OpenAI said on Thursday that it will set up a direct point of contact with Canadian law enforcement and improve detection of repeat policy violators, among steps to boost its safety protocols in the wake of a recent school shooting in Canada. The ChatGPT maker detailed the steps in a letter to Canada's minister in charge of artificial intelligence, Evan Solomon.  Ann O’Leary, OpenAI’s vice president of global policy, wrote the letter after Canadian ministers this week urged the ChatGPT maker to boost its safety protocols quickly and warned Ottawa would effect change through legislation if the company did not. \"We remain committed to cooperating with law enforcement authorities on the investigation into the Tumbler Ridge tragedy, and we are committed to an ongoing partnership with federal and provincial governments,\" O’Leary said, referring to the town in British Columbia where the shooting occurred. Ottawa summoned OpenAI's safety team for talks this week after the company said it had not contacted police about an account that it banned belonging to the alleged shooter, Jesse Van Rootselaar. Van Rootselaar, 18, is suspected of killing eight people on February 10 before taking her own life in Tumbler Ridge. OpenAI said it banned her ChatGPT account last year for policy violations, which it did not specify. It said the issues did not meet its internal criteria for reporting to law enforcement. Police said Van Rootselaar had a history of mental health problems. ",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/openai-outlines-steps-boost-safety-measures-in-response-canada-school-shooting-5956806",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956931:en",
            "title": "UK activists plan protests over climate, social impacts of AI data centres",
            "description": "LONDON, Feb 27 : Activists are set to take to British streets on Friday for two days of protests against the expansion of data centres to serve booming demand for artificial intelligence, and the impact of the facilities on communities and the environment. The protests, coordinated by environmental charity Global Action Plan, are part of a growing international backlash against the power- and water-hungry sites needed to meet surging demand for AI computing power. \"Big Tech's unchecked construction of hyperscale AI data centres is putting the UK's climate targets at risk,\" said Oliver Hayes, Head of Campaigns at Global Action Plan, in a statement. Among the biggest is set to be the 'March Against The Machines' event starting outside the offices of OpenAI on Saturday at midday. While there is no formal definition of what a data centre is in Britain or how many there are, a techUK report from November 2024 put the number at around 450. The British energy regulator said 140 data centres had signalled they wanted to plug into the grid and could require 50 gigawatts of power. By comparison, it said peak British electricity demand on February 11 was 45 GW. OpenAI said in January it would create a community plan for each of the sites in its Stargate operation, a $500 billion initiative to build AI data centres for training and inference. Tech companies are investing directly in power infrastructure as energy access becomes a critical constraint on AI expansion, with the push for larger and more numerous data centres driving electricity demand higher. In Havering, east London, Ian Pirie, Coordinator Friends of the Earth Havering, said plans to build locally were \"completely inappropriate in a semi-rural Green Belt area\", citing what he called its power and water needs and the destruction of farmland. Leigh Tugwood, Co-chair of Iver Heath Residents Association, protesting against a build in Buckinghamshire, said he was concerned that datacentre development was being fast-tracked at the expense of local communities. \"We are, therefore, in support of a moratorium on all future hyperscale data centre development unless and until there is informed debate, a public inquiry and a meaningful community-designed engagement framework that ensures ownership of the process by those most likely to be impacted,\" he said.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/uk-activists-plan-protests-over-climate-social-impacts-ai-data-centres-5956931",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956756:en",
            "title": "Betting giant Flutter forecasts 2026 profit far below estimates on US challenges",
            "description": "DUBLIN, Feb 26 : FanDuel-owner Flutter forecast modest profit growth for 2026 far below analyst expectations due to challenges in the betting giant's main U.S. market compounded by its misfiring attempts to win customers over with promotions and bonuses.  The world's largest online betting company reported a 21 per cent jump in 2025 core profit on Thursday but expected growth of just 4 per cent this year to $2.97 billion, significantly below the $3.5 billion expected by analysts polled by LSEG SmartEstimate. The company's shares fell more than 9 per cent in after-hours trading. Flutter said the guidance largely reflected lower levels of U.S. customer engagement in the fourth quarter and into 2026 after it took more money from American football gamblers than its rivals during a run of favourable sports results.  While bookmakers tend to make more money when favourites lose, Flutter said the lack of marquee names in the closing stages of the NFL season meant customers were less interested in gambling during the key playoff games. \"We just didn't execute our generosity strategy as well as we should have done in the face of those results,\" Flutter CEO Peter Jackson told Reuters, referring to the promotions and bonuses gambling companies offer customers to keep them betting. Jackson said FanDuel, which has a leading 41 per cent share of the U.S. market, plans to improve how it rewards customers to be \"better positioned\" for the 2026/27 NFL season, including by launching a loyalty programme in the second quarter. Flutter also intends to increase planned investment in its new prediction markets platform launched in late December with derivatives exchange CME Group. Prediction markets, which allow users to win money on the likelihood of specific events occurring, from sports and entertainment to politics and the economy, have surged into the mainstream in the U.S. With FanDuel Predicts now offering non-sports markets in all 50 states and sports markets in 18 states including California, Texas and Florida where sports betting is illegal, Flutter expects investment to reduce 2026 core profit by the upper end of its previous $200 million to $300 million estimate.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/betting-giant-flutter-forecasts-2026-profit-far-below-estimates-us-challenges-5956756",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956746:en",
            "title": "Exclusive-ASML says next-gen EUV tools ready to mass-produce chips, marking key shift for AI chip production  ",
            "description": "SAN JOSE, California, Feb 26 : ASML Holding's next-generation chipmaking machine is ready for manufacturers to start bringing it into use for production at high volumes, a senior executive told Reuters, a big step for the chip industry. The Dutch company produces the world's only commercial extreme ultraviolet lithography (EUV) tools, which are a critical piece of equipment for chipmakers. This new tool will help chipmakers such as Taiwan Semiconductor Manufacturing  and Intel produce more powerful and efficient chips, by eliminating several costly and complex steps from the chip-manufacturing process, data from ASML shows. ASML plans to release this data, which represents a key milestone, at a technical conference in San Jose on Thursday, the company's chief technology officer, Marco Pieters, told Reuters on Wednesday. It has taken ASML years to develop the costly, next-generation tools as chipmakers have attempted to determine at what point it makes economic sense to begin to use them for mass production. But given that the current generation of EUV tools is approaching the technical limit of their ability to make complex AI chips, the next-generation machines - called High-NA EUV tools - are key for the AI industry to improve chatbots like OpenAI's ChatGPT and help chipmakers deliver their AI chip roadmaps on time to meet surging demand. The new tools cost roughly $400 million, twice the cost of the original EUV machines. The High-NA EUV tools now experience limited downtime, have produced 500,000 dinner-plate-sized silicon wafers and can draw sufficiently precise patterns that make up the circuits on the chip, the ASML data shows, Pieters said. In combination, the three data points indicate the tools are ready for manufacturers. \"I think that it's at a critical point to look at the amount of learning cycles that have happened,\" he said, referring to the number of tests that have been conducted on the machines by customers. Despite their technical readiness, it will take two to three years for companies to conduct enough testing and development to integrate them into manufacturing. \"(Chipmakers) have all the knowledge to qualify these tools,\" Pieters said. Pieters also said the company has achieved roughly 80 per cent uptime at the moment and plans to achieve 90 per cent by the end of the year. The imaging data ASML plans to release is enough to convince customers to replace multiple steps with the older-generation tools with a single High-NA step, Pieters said. The 500,000 wafers the machines have processed have allowed the company to work out many of the kinks.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/exclusive-asml-says-next-gen-euv-tools-ready-mass-produce-chips-marking-key-shift-ai-chip-production-5956746",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956911:en",
            "title": "Core inflation in Japan's capital slows, falling below central bank's 2% target",
            "description": "TOKYO, Feb 27 : Annual core inflation in Japan's capital slowed in February as food price hikes run their course, data showed on Friday, offering consumers some relief but complicating the central bank's communication in justifying further rate hikes. The data is in line with the Bank of Japan's projection that consumer inflation will temporarily slow due to the impact of fuel subsidies and the base effect of last year's spike, before reaccelerating on steady wage gains. The Tokyo core consumer price index, which excludes volatile costs of fresh food, rose 1.8 per cent in the year to February after a 2.0 per cent gain in January, data showed, falling below the central bank's 2 per cent target for the first time since October 2024. It compared with a median market forecast for a 1.7 per cent gain. An index stripping away the effect of fresh food and fuel, which is seen as a better gauge of trend inflation, rose 2.5 per cent in February from a year earlier after a 2.4 per cent gain in January. The BOJ raised interest rates to a 30-year high of 0.75 per cent in December, taking another landmark step in ending decades of huge monetary support in a sign of its conviction that Japan is progressing toward durably hitting its 2 per cent inflation target. The central bank has signalled its readiness to continue raising interest rates if its economic and price forecasts materialise.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/core-inflation-in-japans-capital-slows-falling-below-central-banks-2-target-5956911",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        }
    ]
}