{
    "data": [
        {
            "id": "entity:node/5961266:en",
            "title": "South Korea Feb exports beat forecasts, rise for ninth month",
            "description": "SEOUL, March 1 : South Korea's exports extended their growth streak to a ninth month in February as strong chip sales continued to underpin overall shipments even as uncertainties regarding U.S. tariffs cloud the outlook. Exports from Asia's fourth-largest economy, a bellwether for global trade, increased 29.0 per cent in February from a year earlier to $67.45 billion, trade data showed, beating the median forecast of a 24.0 per cent gain in a Reuters poll of economists. Imports gained 7.5 per cent, slower than the 13.0 per cent estimated in the poll. The preliminary trade balance stood at $15.51 billion in February. \"Semiconductor exports jumped 160.9 per cent to again record their highest monthly performance ever and exceeded $20 billion in value for three consecutive months, driven by strong demand thanks to AI investment and a surge in memory prices,\" the trade ministry said in a statement.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/south-korea-feb-exports-beat-forecasts-rise-ninth-month-5961266",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5961201:en",
            "title": "OpenAI details layered protections in US defense department pact",
            "description": "Feb 28 : OpenAI said on Saturday that the agreement it struck a day ago with the Pentagon to deploy technology on the U.S. defense department's classified network includes additional safeguards to protect its use cases. U.S. President Donald Trump on Friday directed the government to stop working with Anthropic, and the Pentagon said it would declare the startup a supply-chain risk, dealing a major blow to the artificial intelligence lab after a showdown about technology guardrails. Anthropic said it would challenge any risk designation in court. Soon after, rival OpenAI, which is backed by Microsoft, Amazon, SoftBank and others, announced its own deal late on Friday. \"We think our agreement has more guardrails than any previous agreement for classified AI deployments, including Anthropic's,\" OpenAI said on Saturday. The AI firm said that the contract with the Department of Defense, which the Trump administration has renamed the Department of War, enforces three red lines: OpenAI technology cannot be used for mass domestic surveillance, to direct autonomous weapons systems, or for any high-stakes automated decisions. \"In our agreement, we protect our red lines through a more expansive, multi-layered approach. We retain full discretion over our safety stack, we deploy via cloud, cleared OpenAI personnel are in the loop, and we have strong contractual protections,\" OpenAI said. The Pentagon signed agreements worth up to $200 million each with major AI labs in the past year, including Anthropic, OpenAI and Google. The Pentagon is seeking to preserve all flexibility in defense and not be limited by warnings from the technology's creators against powering weapons with unreliable AI. OpenAI cautioned that any breach of its contract by the U.S. government could trigger a termination, though it added, \"We don't expect that to happen.\" The company also said rival Anthropic should not be labeled a “supply-chain risk,” noting, \"We have made our position on this clear to the government.\"",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/openai-details-layered-protections-in-us-defense-department-pact-5961201",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5958086:en",
            "title": "Commentary: Does ‘free’ shipping really exist? Here are the marketing tricks you need to know",
            "description": "SYDNEY: You’re scrolling through an online retailer, like Amazon, Shein or eBay, and spot a shirt on sale for $40. You add it to your cart, but at checkout, a $10 shipping fee suddenly appears. Frustrated, you close the tab. But what if that same shirt was priced at $50 with “free” shipping? The likelihood that you would have bought it without a second thought is much higher. COVID-19 changed the way we shop and accelerated our reliance on e-commerce. But as online sales have grown, so has the expectation of free delivery. The reality, however, is that shipping physical goods is never actually free. Retailers use subtle marketing strategies and psychological hacks to mask these costs. As a result, consumers are often the ones footing the bill. THE MAGIC OF ZERO There is something uniquely attractive about the concept “free”. In behavioural economics, zero is not just a lower price; it flips a psychological switch. When a transaction involves a cost, we instinctively weigh the downside. But when something is entirely free, we experience a positive emotion and perceive the offer as more valuable than it is mathematically. Retailers no doubt realise that offering free delivery is one of the most effective ways to stop a consumer from abandoning a digital shopping cart.THE MINIMUM SPEND TRAP Perhaps the most common marketing tactic is the free shipping threshold. Sometimes this is phrased as “spend $55 to qualify for free shipping”. If your shopping cart is sitting at $40, you face a dilemma. You can pay $10 for postage, or you can find a $15 item to reach the threshold. Many of us choose the latter, reasoning it is better to get a tangible product, such as a pair of socks, than to “waste” money on shipping. This tactic uses the “goal gradient effect”, which describes the tendency to put in more effort the closer we get to a goal. It also works incredibly well for the retailer. Research shows that free shipping increases both purchase frequency and overall order size. Policies with a threshold for free shipping often prompt this exact “topping up” behaviour. The consumer ends up buying things they did not initially want, thus boosting the retailer’s sales. BAKED-IN COSTS AND THE REALITY OF ‘FREE’ RETURNS Another strategy is unconditional free shipping, where the delivery cost is simply baked into the product’s base price. This allows consumers to avoid the “pain of paying” a separate fee at checkout. However, we are still paying for the postage through higher item costs.For retailers, offering unconditional free shipping without a markup can be difficult to sustain profitably. The bump in sales usually does not offset the lost fee revenue and the costs of fulfilment. A major reason for this lack of profitability is that free shipping leads to significantly higher product return rates. Consumers tend to make riskier purchases if the appearance of waived fees lowers the perceived financial risk of the transaction. For example, you might order the same shirt in two different sizes, knowing you can just send one back for free. Who pays for that added convenience? The retailer, who now has to cover the courier fees twice. The retailer usually won’t simply absorb this cost, but will have to pass it on in other ways. THE SUBSCRIPTION ILLUSION To combat these unpredictable costs, many businesses are turning to membership, loyalty or subscription models such as Amazon Prime. Consumers pay an upfront annual fee in exchange for “free” expedited shipping year-round. Membership-based programs successfully increase customer loyalty and purchase frequency, and allow for better customer segmentation. But in the long run, they may actually hurt a retailer’s profit margins. While loyalty rises, the operational costs of fulfilling many smaller, free-shipped orders can potentially outweigh the benefits if not strictly managed. For the consumer, this model manipulates our “mental accounting”. Because we view the upfront fee as money already spent, every additional purchase feels like it comes with a free perk. We end up shopping more frequently on that specific platform just to “get our money’s worth”.DON’T BUY THE ILLUSION The age of limitless free shipping may be coming to an end. As global supply chain costs remain volatile, we are likely to see retailers raising their minimum spend thresholds, removing offers, or increasing base product prices to compensate. The next time you are shopping online, resist the urge for instant gratification. If you are about to add a $15 pair of novelty avocado socks to your cart, just to save $10 on shipping, take a step back. Ask yourself if you truly need that purchase to arrive this week. Instead of rushing to checkout, let your digital basket fill up naturally over time with items you actually need. You will eventually hit the threshold, but on your own terms. “Free” delivery is just a clever psychological illusion. The cost is rarely eliminated; it is simply redistributed into higher product prices or reframed as a loyalty perk. Don’t let the allure of “free” shipping trick you into paying for more than you intended. Adrian R Camilleri is Associate Professor of Marketing at the University of Technology Sydney. This commentary first appeared on The Conversation.",
            "image": "",
            "link": "https://www.channelnewsasia.com/commentary/free-shipping-online-shopping-retailer-consumer-marketing-5958086",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5960421:en",
            "title": "How will US, Israeli strikes on Iran affect oil markets?",
            "description": "LONDON: The US strikes against Iran could severely disrupt the global supply of crude oil and send prices soaring to levels not seen in years. AFP looks at the risks. MAJOR PRODUCER Iran remains just inside the world's top 10 oil producers even though its output has fallen sharply since the 1970s, hit in particular by rounds of US sanctions. \"In 1974, Iran was the third-biggest producer in the world after the US and Saudi Arabia, and ahead of Russia, producing some six million barrels per day,\" Arne Lohmann Rasmussen, chief analyst at Global Risk Management, told AFP. Today, Iran produces about 3.1 million barrels per day, according to the oil-producing cartel OPEC, of which Iran is a member. This remains a significant amount, and the Islamic republic is believed to hold the world's third-largest crude reserves, cementing its strategic importance. Additionally, Iran's oil industry is in far better shape than that of Venezuela, another country hit by years of US sanctions. STRAIT OF HORMUZ The main risk to the oil market remains a blockade of the Strait of Hormuz, which connects the Gulf to the Gulf of Oman and which Iran has frequently threatened to paralyse. This waterway is by far the main shipping route connecting the wealthy oil-producing countries of the Middle East to the rest of the world. Approximately 20 million barrels of crude oil passed through it daily in 2024, equivalent to nearly 20 per cent of global liquid oil consumption, according to the US Energy Information Administration (EIA). The strait is particularly vulnerable owing to its narrow width, around 50km, and its shallow depth, which does not exceed 60m. \"Even a doubt about security in the Strait would prompt many vessels, for insurance reasons, to face difficulties transiting, as premiums would rise sharply,\" said Rasmussen. According to Saxo Bank analyst Ole Hansen, \"only Saudi Arabia and the United Arab Emirates possess meaningful bypass infrastructure\". The route could transport a maximum of 2.6 million barrels daily, noted the EIA.HIGHLY PROFITABLE OIL Iranian crude is relatively easy and cheap to extract, with production costs as little as US$10 per barrel, making it particularly profitable, Rasmussen said. Only Saudi Arabia, Iraq, Kuwait and the United Arab Emirates enjoy similarly low production costs. By comparison, major Western producers like Canada and the United States typically face costs of US$40 to US$60 per barrel. With such low costs, Iran gains disproportionately from high global prices, a crucial factor for an economy heavily reliant on oil revenues. US sanctions imposed since the 1979 Islamic Revolution have left Iran with few export options - especially after Trump revived a \"maximum pressure\" policy on Tehran upon his return to the White House. Last year, Washington targeted Chinese \"teapot\" refineries, which operate independently of state-owned oil companies, accusing them of buying Iranian crude. China, however, continues to buy Iranian oil at below-market prices. Iran exports between 1.3 and 1.5 million barrels daily, with more than 80 per cent of the total bound for Chinese refineries owing to US sanctions, according to Hansen. IMPACT ON IRAN NEIGHBOURS Iran's neighbours, from Gulf states to Turkey and Pakistan, fear an Iranian response since their hosting of US military sites places them in the firing line. They \"know they are vulnerable because the Iranians have enough basic intermediate-range missiles that allow them to strike vital points\" in the worst-case scenario, noted Pierre Razoux, director of studies at the Mediterranean Foundation for Strategic Studies. At-risk infrastructure includes hydrocarbon hubs as well as electrical power and seawater desalination plants, he added. Soaring oil prices meanwhile risk a return to soaring inflation, hurting the global economy. Crude reaching US$100 per barrel for the first time since the start of Russia's invasion of Ukraine in February 2022 could also hurt Trump in the midterm elections at the end of the year, especially as he has promised American voters cheap energy.",
            "image": "",
            "link": "https://www.channelnewsasia.com/world/israel-us-strikes-iran-oil-prices-strait-hormuz-5960421",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5960471:en",
            "title": "Dramatic changes observed in one of universe's biggest stars",
            "description": "WASHINGTON, Feb 28 : The largest stars in the universe live the life of a rock star - they are born brilliant, live fast and die young. If that is the case, the one named WOH G64 might be considered the stellar equivalent of Jimi Hendrix. WOH G64, which is 28 times the mass of the sun and resides in a satellite galaxy to the Milky Way called the Large Magellanic Cloud, is one of a handful of the biggest stars known, just like Hendrix was in rock 'n' roll. And observations spanning more than three decades show it is behaving unlike any star seen before. Astronomers have only an incomplete understanding of the life history of the largest stars, and the WOH G64 observations are providing new insight. Researchers observed a change that occurred in 2014 in the star's color, corresponding to an increase in its surface temperature, as it evolved from red to yellow. The star had been classified as an extreme red supergiant but rapidly became a yellow hypergiant. This transition happened quickly, in cosmic terms, and with no evidence of an eruption or explosion. \"Typically the evolution of a star takes place on timescales of billions of years. On human timescales, we only observe more abrupt and violent events, such as eruptions, the merger of two stars or their explosive deaths,\" said astronomer Gonzalo Muñoz-Sanchez, lead author of the research published this week in the journal Nature Astronomy. \"No current stellar models can fully explain this transformation\" in WOH G64, said Muñoz-Sanchez, who worked on the study at the National Observatory of Athens. Compared to the sun, its luminosity is about 300,000 times greater and its diameter about 1,500 times greater. If it were in the place of the sun, its surface would extend to a distance between the orbits of Jupiter and Saturn, our solar system's fifth and sixth planets. Traveling at the speed of light would take six hours to circumnavigate the star's surface. WOH G64, around 10 million years old, appears to be near the end of its lifespan. In contrast, the sun is about 4.5 billion years old and has an estimated 5 billion more years left. WOH G64 is located about 160,000 light-years from Earth. A light-year is the distance light travels in a year, 5.9 trillion miles (9.5 trillion km). \"WOH G64 is a massive star and very different from the sun,\" Muñoz-Sanchez said. Stars between about eight and 23 times the sun's mass are expected to evolve into red supergiants and eventually explode as a supernova. For stars in the range of 23 to 30 times the sun's mass, their fate is less certain. It remains unclear whether they go boom as a supernova, collapse directly into forming a black hole or evolve from a red supergiant phase into a yellow hypergiant stage before ending their lives. Black holes are exceptionally dense objects with gravity so strong not even light can escape. \"Hence, WOH G64 might be the solution to this question,\" Muñoz-Sanchez said. Adding another layer of complexity to understanding WOH G64 is the fact that the observations indicated it is gravitationally bound to another star in what is called a binary system. The researchers were unable to determine the size or characteristics of the stellar companion, but said the two might at some point merge. The researchers have come up with hypotheses concerning WOH G64's recent changes. They said it may have experienced a violent episode predating the observational data that turned it red and is now returning to its usual yellow quiescent state. They said it also is possible that an interaction between WOH G64 and its companion had temporarily mimicked the appearance of a red supergiant. \"As astronomers continue to monitor this remarkable system, WOH G64 is poised to reshape our understanding of how the most massive stars live and die,\" Muñoz-Sanchez said.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/dramatic-changes-observed-in-one-universes-biggest-stars-5960471",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5959981:en",
            "title": "Nvidia plans new chip to speed AI processing, WSJ reports",
            "description": "Feb 27 : Nvidia plans to launch a new processor designed to help OpenAI and other customers build faster, more efficient AI systems, the Wall Street Journal reported on Friday, citing people familiar with the matter. Reuters could not immediately verify the report.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/nvidia-plans-new-chip-speed-ai-processing-wsj-reports-5959981",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5959976:en",
            "title": "OpenAI reaches deal to deploy AI models on US Department of War classified network",
            "description": "Feb 27 : OpenAI CEO Sam Altman said on Friday it has reached an agreement with the U.S. Department of War to deploy its AI models on classified cloud networks. \"In all of our interactions, the DoW displayed a deep respect for safety and a desire to partner to achieve the best possible outcome,\" Altman said in a post on X.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/openai-reaches-deal-deploy-ai-models-us-department-war-classified-network-5959976",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5959916:en",
            "title": "Anthropic says it will challenge Pentagon's supply chain risk designation in court",
            "description": "Feb 27 : Anthropic said on Friday it will challenge in court the Pentagon's decision to declare the AI firm a supply-chain risk, hours after U.S. President Donald Trump also directed every federal agency to stop work with the company.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/anthropic-says-it-will-challenge-pentagons-supply-chain-risk-designation-in-court-5959916",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5959506:en",
            "title": "Trump Media considers spinning off Truth Social into public company, reports wider annual loss",
            "description": "Feb 27 : Trump Media & Technology Group, founded by U.S. President Donald Trump, is considering spinning off its social media platform Truth Social into a publicly traded company. The company is in discussions with TAE Technologies and Texas Ventures Acquisition III about the proposed transaction, the company said on Friday. Under the proposal, shares in the spun-off company would be distributed to eligible TMTG shareholders, after which the new entity would merge with a special purpose acquisition company. This would separate TMTG's social media and digital media assets from its recently announced fusion energy venture, effectively splitting the company into two publicly traded businesses with distinct strategies. The Truth Social-parent's net loss widened to $712.3 million in 2025 from $400.9 million a year earlier, mostly reflecting unrealized losses from the company's purchase of bitcoin and Cronos. TMTG ended 2025 with about $2.5 billion in financial assets, more than triple the $776.8 million it had a year earlier, the company said. Net sales edged up to $3.68 million from $3.62 million in 2024. Founded by Trump and known for its Truth Social platform aimed at conservative audiences, TMTG has faced challenges scaling its media business amid competition from larger social networks and uneven user growth. It is now seeking to reposition itself beyond its core Truth Social platform and tap investor interest in emerging energy technologies. TMTG said no definitive agreement has been reached on the spin-off and discussions are ongoing. In December, TMTG agreed to merge with TAE in an all-stock deal valued at more than $6 billion, marking a pivot toward fusion energy and the creation of a publicly traded company focused on developing utility-scale power plants to help meet rising electricity demand, including from AI data centers. TAE Technologies is a California-based private company developing advanced nuclear fusion technology that has raised more than $1 billion from investors, including Alphabet's Google and Chevron. The startup focuses on a form of fusion designed to produce electricity without releasing large amounts of neutron radiation, reducing radioactive waste.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/trump-media-considers-spinning-truth-social-public-company-reports-wider-annual-loss-5959506",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5959641:en",
            "title": "Trump directs US agencies to toss Anthropic's AI as Pentagon calls startup a supply risk",
            "description": "WASHINGTON, Feb 27 : U.S. President Donald Trump said on Friday he is directing every federal agency to stop work with artificial intelligence lab Anthropic while the Pentagon declared it a supply-chain risk, capping a weeks-long fight over technology guardrails in an apparent blow to the startup's business. In a post on Truth Social, Trump said, \"I am directing EVERY Federal Agency in the United States Government to IMMEDIATELY CEASE all use of Anthropic’s technology. We don’t need it, we don’t want it, and will not do business with them again!\" He added there would be a six-month phaseout for the Defense Department and other agencies that use the company's products. Meanwhile, the Pentagon's supply-chain risk designation, typically reserved for companies in adversary nations, means that defense contractors could be barred from deploying Anthropic's AI as part of work for the Pentagon. The defense industrial base includes tens of thousands of contractors, including major public companies. The actions were pegged to a Friday deadline that the Pentagon set to resolve an escalating feud with San Francisco-based Anthropic, over concerns about how the military could use AI at war. Spokespeople for Anthropic, which won a $200 million ceiling Pentagon contract last year, did not immediately respond to a request for comment. Trump's announcement stopped short of the Pentagon's threat that it could invoke the Defense Production Act to require Anthropic's compliance. But the U.S. president vowed further action if Anthropic did not cooperate going forward. Trump warned he would use \"the Full Power of the Presidency to make them comply, with major civil and criminal consequences to follow\" if Anthropic did not help with the phaseout of its technology. WEAPONS, SURVEILLANCE CONCERNS The setback comes as AI leader Anthropic raced to win a fierce competition selling novel technology to businesses and government, particularly for national security, ahead of its widely expected initial public offering. The company has said it has not finalized an IPO decision. At the same time, the battle over technological guardrails had raised concerns that the Department of Defense would follow U.S. law but little other constraint when deploying AI for national-security missions, regardless of safety or ethics service terms embraced by the technology's developers. Anthropic had sought guarantees that its AI would not be used for fully autonomous weapons or for mass domestic surveillance - applications in which the Pentagon has said it had no interest.  Anthropic was the first frontier AI lab to put its models on classified networks via cloud provider Amazon.com and the first to build customized models for national security customers, the startup has said. Its product Claude is in use across the intelligence community and armed services. U.S. Senator Mark Warner, a Democrat and vice chairman of the Select Committee on Intelligence, criticized the action taken by Trump, a Republican. “The president’s directive to halt the use of a leading American AI company across the federal government, combined with inflammatory rhetoric attacking that company, raises serious concerns about whether national security decisions are being driven by careful analysis or political considerations.\" The conflict is the latest eruption in a saga that dates back at least to 2018. That year, employees at Alphabet's Google protested the Pentagon's use of the company's AI to analyze drone footage, straining relations between Silicon Valley and Washington. A rapprochement ensued, with companies including Amazon and Microsoft jousting for defense business, and still more CEOs pledging cooperation last year with the Trump administration. But theoretical \"killer robots\" have remained a concern held by human-rights and technology activists. At the same time, Ukraine and Gaza have become theaters for increasingly automated systems on the battlefield. ",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/trump-directs-us-agencies-toss-anthropics-ai-pentagon-calls-startup-supply-risk-5959641",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5959776:en",
            "title": "Judge blocks Virginia law restricting social media for children",
            "description": "Feb 27 : A federal judge on Friday blocked Virginia from enforcing a new law that aimed to protect children from being addicted to social media by requiring age verification and limiting use by those under 16 to one hour per day. U.S. District Judge Patricia Tolliver Giles in Alexandria, Virginia, said the technology trade group NetChoice was likely to establish that the law unconstitutionally infringed the free speech rights of adults, children and its dozens of members, including Google, Meta Platforms, Netflix, Reddit and Elon Musk's X. The judge issued a preliminary injunction against the law known as Senate Bill 854, which had been signed last May by then-Governor Glenn Youngkin, a Republican, and took effect on January 1, 2026. NetChoice has also challenged similar laws in states, including California. Virginia argued that the law was reasonably tailored to protect children from the \"addictive features\" of social media, and address a mental health crisis among youth. But the judge said that notwithstanding Virginia's interest in protecting children, the law was both overinclusive by requiring everyone, including adults, to verify their age, and underinclusive by exempting potentially addictive interactive gaming from coverage. She also said the law treats \"functionally equivalent\" speech differently by preventing children from watching, for example, science, history and church programming lasting more than an hour that they could watch elsewhere, including streaming platforms.   \"The court recognizes the Commonwealth’s compelling interest in protecting its youth from the harms associated with the addictive aspects of social media,\" wrote Giles, an appointee of former Democratic President Joe Biden. \"However, it cannot infringe on First Amendment rights, including those of the same youth it aims to protect.\" Rae Pickett, a spokesperson for Virginia's Democratic Attorney General Jay Jones, said after the decision: \"We look forward to continuing to enforce laws that empower parents to protect their children from the proven harms that can come through social media.\" Paul Taske, co-director of the NetChoice Litigation Center, welcomed the decision. \"This ruling reaffirms that the government cannot ration access to lawful speech - even if it has noble intentions,\" he said in a statement. \"Fundamentally, parents must stay in the driver’s seat when it comes to decisions about their families.\"",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/judge-blocks-virginia-law-restricting-social-media-children-5959776",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5959701:en",
            "title": "Canadian minister to meet with OpenAI's Altman to discuss safety measures after shooting",
            "description": "OTTAWA, Feb 27 : Canada's minister in charge of artificial intelligence said on Friday he will meet with OpenAI CEO Sam Altman next week to discuss how the ChatGPT maker plans to boost safety protocols after a recent school shooting in British Columbia. The Canadian government has urged OpenAI to boost its safety protocols quickly and warned Ottawa could effect change through legislation after the company said it had not contacted police about an account belonging to the alleged shooter, Jesse Van Rootselaar, that it had banned. \"While we note their willingness to strengthen law enforcement referral protocols, establish direct points of contact with Canadian authorities, and enhance safeguards, we have not yet seen a detailed plan for how these commitments will be implemented in practice,\" Minister Evan Solomon said in a statement. Solomon was responding to a letter he received from OpenAI’s vice president of global policy on Thursday in which the firm said it will set up a direct point of contact with Canadian law enforcement and improve detection of repeat violators of its \"violent activities\" policy to boost safety protocols. Solomon said he will meet with Altman \"to seek further clarity and to ensure that the commitments made are translated into concrete action.\" Van Rootselaar, 18, is suspected of killing eight people on February 10 before taking her own life in Tumbler Ridge. OpenAI said it banned her ChatGPT account last year for policy violations. Solomon said he will also meet with other major platforms in Canada in the coming weeks. \"All options remain on the table as we assess what further steps may be necessary,\" he added.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/canadian-minister-meet-openais-altman-discuss-safety-measures-after-shooting-5959701",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5959701:en",
            "title": "Canada minister to meet with OpenAI's Altman to discuss safety measures after shooting",
            "description": "OTTAWA, Feb 27 : Canada's minister in charge of artificial intelligence said on Friday that he will meet with OpenAI Chief Executive Sam Altman next week to discuss how the ChatGPT maker plans to boost safety protocols in the wake of a recent school shooting in the Canadian province of British Columbia. \"While we note their willingness to strengthen law enforcement referral protocols, establish direct points of contact with Canadian authorities, and enhance safeguards, we have not yet seen a detailed plan for how these commitments will be implemented in practice,\" minister Evan Solomon, said in a statement.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/canada-minister-meet-openais-altman-discuss-safety-measures-after-shooting-5959701",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5959641:en",
            "title": "Trump says he is directing federal agencies to cease use of Anthropic technology",
            "description": "WASHINGTON, Feb 27 : U.S. President Donald Trump on Friday said he was directing every federal agency to immediately cease all use of Anthropic's technology, adding there would be a six-month phase out for agencies such as the Defense Department who use the company's products. \"I am directing EVERY Federal Agency in the United States Government to IMMEDIATELY CEASE all use of Anthropic’s technology. We don’t need it, we don’t want it, and will not do business with them again!\" Trump said in a post on Truth Social. Trump's directive comes amid a feud between the Pentagon and top artificial intelligence lab Anthropic over concerns about how the military could use AI at war.Spokespeople for Anthropic did not immediately respond to a request for comment.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/trump-says-he-directing-federal-agencies-cease-use-anthropic-technology-5959641",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5959596:en",
            "title": "Goldman bucks private credit redemption trend as AI disruption fears mount",
            "description": "Feb 27 : Goldman Sachs' asset management arm has assured investors that the redemption rate at GS Credit remains well below that of its peers, setting it apart from turbulence in private credit sparked by concerns that AI could disrupt software companies. In a letter to investors seen by Reuters on Friday, the Wall Street firm added that Goldman Sachs Private Credit Corp continued to see strong appetite, with December inflows 11 per cent above the year-to-date average and a fourth-quarter redemption rate of 3.5 per cent, compared with more than 5 per cent for peers. Fears that AI could erode the earnings power of software companies and weaken their ability to repay loans are rippling through private credit, a key lender to the technology sector, prompting investors to reassess exposure, redemption risks and fundraising prospects, analysts have said. Concerns have been compounded by renewed troubles at Blue Owl over asset sales, triggering a sharp selloff in shares of alternative asset managers with a footprint in the private credit market. The shift in sentiment is testing a corner of the alternatives market that has swelled into a roughly $2 trillion juggernaut in recent years. \"As we enter 2026, the private credit landscape is facing volatile macroeconomic conditions, shifting flows in the traded and non-traded BDC (Business Development Company) market, and accelerating technological change - particularly around AI,\" Goldman said. ASSESSING AI IMPACT The firm disclosed that GS Credit's exposure to enterprise software credit was about 15.5 per cent at the end of the third quarter, toward the low end of the range reported by its peers. Investors have been grappling with the prospect of AI disruption for weeks, with many increasingly concerned that the technology has shifted from an efficiency and productivity tailwind for the software sector to a potential existential threat. Goldman said it has been assessing the impact of AI on the software space for years and passed on its first deal due to AI concerns in October 2023. \"We agree with the perspective that AI is significantly lowering development costs which will lead to increased competitive intensity for incumbent software companies,\" it said in the letter. Goldman added that it invests in businesses that show \"structural advantages and incumbency moats\" that may be difficult for new entrants to displace. The company said it rolled its first internal framework to evaluate AI disruption risk in early 2025. \"We do not underestimate the risk of AI disruption,\" it added.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/goldman-bucks-private-credit-redemption-trend-ai-disruption-fears-mount-5959596",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        }
    ]
}