{
    "data": [
        {
            "id": "entity:node/5955941:en",
            "title": "Nvidia shares fall as upbeat forecasts fail to excite investors ",
            "description": "Feb 26 : Nvidia's shares fell on Thursday despite the AI chip giant better-than-expected quarterly results and upbeat forecasts, as that was not enough for investors used to solid revenue beats from the company for 14 straight quarters. Its shares slid 3.1 per cent to $189.67 in early morning trading weighing on the main U.S. indexes.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/nvidia-shares-fall-upbeat-forecasts-fail-excite-investors-5955941",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5955846:en",
            "title": "Hacking group begins leaking customer data in Dutch telecom Odido hack",
            "description": "AMSTERDAM, Feb 26 : The criminal group behind a hack at Dutch telecom Odido, one of the largest carried out in the Netherlands, has begun publishing customer information on the dark web, the company said on Thursday. The theft of personal data of 6 million customers from the firm, T-Mobile's former Dutch operations, included names, telephone numbers, e-mail addresses, bank account numbers, birth dates and passport numbers. Odido said it believes the claim of the group \"ShinyHunters\" that it carried out the hack. \"Odido came to the decision not to engage in negotiations with these criminals or submit to their attempts at blackmail,\" the company said in a statement, saying it had taken advice from cybersecurity firms and the police. National broadcaster NOS, which has communicated with the hacking group, reported on Thursday that it has threatened to publish a million lines worth of customer data per day unless the company pays an unspecified amount. \"Our advice to victims of ransomware is not to pay,\" Stan Duijf of the country's national police, which is investigating the hack, said in a statement. He said paying the ransom could finance future attacks on new victims, and there was no guarantee thieves would follow through on promises to delete sensitive data.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/hacking-group-begins-leaking-customer-data-in-dutch-telecom-odido-hack-5955846",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5955816:en",
            "title": "Syngenta plans to launch up to $10 billion Hong Kong IPO in second quarter, sources say",
            "description": "ZURICH/HONG KONG, Feb 26 : Syngenta Group plans to launch an up to $10 billion stock market listing in Hong Kong in the second quarter of this year and has hired banks to manage the initial public offering, two people with knowledge of the matter told Reuters. Reuters reported this month that Basel-based Syngenta, which is controlled by state-owned Chinese company Sinochem, could sell up to 20 per cent of its shares in the IPO but the size and timing of the offering was not final and could change depending on market conditions. Syngenta declined to comment on possible timeline for the prospectus filing or when the IPO itself would take place.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/syngenta-plans-launch-up-10-billion-hong-kong-ipo-in-second-quarter-sources-say-5955816",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5955771:en",
            "title": "Exclusive-Broadcom expects to sell 1 million 3D stacked chips by 2027",
            "description": "SAN JOSE, California, Feb 26 : Artificial intelligence chip designer Broadcom said that it expects to sell at least 1 million chips by 2027 based on its stacked design tech, an executive told Reuters on Wednesday. The forecast, which Reuters is the first to report, marks a new product and sales target for Broadcom that could represent a revenue stream potentially worth billions of dollars. Harish Bharadwaj, vice president of product marketing, said the 1 million chips the company projects it will sell are based on an approach Broadcom developed that stacks two chips on top of one another, allowing the distinct pieces of silicon to be tightly bound to improve the speed at which data can flow from one chip to another. The company has refined the technology over five years to the point where its first customer, Fujitsu, is making engineering samples to test the design. Fujitsu plans to produce the stacked, or 3D, chips later this year.  The million-chip figure includes several additional designs beyond the Fujitsu chip. The company's stacking approach gives its customers the ability to build chips that have more horsepower and use less energy to tackle the rapidly growing computing requirements AI software presents, Bharadwaj said. \"Now, pretty much all of our customers are adopting this technology,\" he said. Broadcom does not typically design entire AI chips itself. It works with companies such as Google for its tensor processing units (TPUs) and ChatGPT maker OpenAI for its in-house custom processors. The Broadcom engineers help translate an early design into the physical layout of a chip that can be fabricated by manufacturers such as TSMC. The company's chip business has grown significantly because of the custom deals with companies such as Google. Broadcom projected that its AI chip revenue would double year-over-year to $8.2 billion in its first fiscal quarter.  As a result, Broadcom has emerged as one of the most significant competitors to Nvidia and Advanced Micro Devices, as it races to produce silicon that competes with the chip giants. Fujitsu is using the new tech for a data center chip. Taiwan Semiconductor Manufacturing Co is fabricating the chip using its cutting-edge 2-nanometer process and fusing it with a 5-nanometer chip. Companies can mix and match which manufacturing process TSMC uses with the Broadcom technology. TSMC fuses the top and bottom chip during the fabrication process.  Broadcom has several more designs in the works and expects to ship two more products based on the stacking tech in the second half of this year and to sample an additional three in 2027. The company spent roughly five years developing the groundwork for the stacked chip tech and testing various designs to come up with a commercial product. Engineers are working to make chips that have as many as eight stacks of two chips each.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/exclusive-broadcom-expects-sell-1-million-3d-stacked-chips-2027-5955771",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5955766:en",
            "title": "OpenAI to make London its biggest research hub outside US",
            "description": "LONDON, Feb 26 : ChatGPT maker OpenAI said on Thursday that it would make London its largest research hub outside the United States, citing Britain's technology ecosystem as an ideal environment to invest in and develop new artificial intelligence systems. The move feeds into Britain's push to cast itself as an \"AI superpower\" and a home for cutting-edge research at a time when governments are vying for investment from major model developers. Mark Chen, OpenAI's research chief, said the country's mix of talent, leading universities and globally respected scientific institutions gives it leverage in a sector governments worldwide view as strategically important. Technology minister Liz Kendall said OpenAI's expansion in London was a \"huge vote of confidence.\" \"It also reaffirms the UK's global leadership as the place to pursue AI innovation that is both safe and transformative,\" Kendall said in a statement. OpenAI did not set out specific details on the plan, such as the size of any investment or the number of jobs it would involve. The company, whose European headquarters are in Dublin, opened its first international office in London in 2023, with its teams working on the software and infrastructure needed to develop and run its AI models.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/openai-make-london-its-biggest-research-hub-outside-us-5955766",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5955606:en",
            "title": "Contract manufacturer Flex seeks to overturn Indian tribunal ruling in Xiaomi tax case, court filing shows",
            "description": "NEW DELHI, Feb 26 : Contract manufacturer Flex is asking India's Supreme Court to overturn an Indian Tax Tribunal order relating to the tax authorities payment dispute with Chinese smartphone maker Xiaomi, a court filing from Flex, seen by Reuters, showed. Xiaomi has been asked to pay $72 million in unpaid taxes on royalties, but it has challenged this at the Supreme Court in a case seen as a test of the country's legal framework for contract manufacturing. Flex is asking the Supreme Court to strike down the Indian Tax Tribunal order, which said Xiaomi's contract manufacturers \"willingly participated in the layering of transactions facilitating the evasion of taxes,\" Flex's court filing showed. U.S.-listed Flex told India's Supreme Court it did not help Chinese smartphone maker Xiaomi to undervalue certain imports into India, the court filing showed. Flex's court filing said the Indian Tax Tribunal ruling could expose the contract manufacturer to \"extremely harsh penalties.\" Flex in India and Xiaomi did not immediately respond to requests for comment. India's customs authorities did not respond to requests for comment. Flextronics Technologies India, a subsidiary of Flex, was not \"involved in any manner in the transaction pertaining to royalty,\" the company told the court in its January 16 filing, which is not public but has been reviewed by Reuters. Xiaomi has said the implications of the tribunal's ruling are far-reaching as they indicate \"an implicit mistrust of the entire contract manufacturing industry\" in the country. In its Supreme Court challenge, Xiaomi argued that the tax tribunal erred by saying it was the \"beneficial owner\" of the components while requiring it to pay tax on the royalties. The Supreme Court on Monday asked the Indian government to respond to the legal challenges and it will take up the case next in April.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/contract-manufacturer-flex-seeks-overturn-indian-tribunal-ruling-in-xiaomi-tax-case-court-filing-shows-5955606",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5955536:en",
            "title": "Trump brothers-backed American Bitcoin swings to quarterly loss amid crypto selloff",
            "description": "Feb 26 : American Bitcoin, backed by two of U.S. President Donald Trump's sons, swung to a fourth-quarter loss on Thursday amid a weakness in the digital assets space. Concerns over stretched valuations in artificial-intelligence stocks and uncertainty around the timing and scale of U.S. Federal Reserve rate cuts have pressured risk assets, dragging bitcoin to quarterly lows and leaving many so-called digital asset treasury (DAT) companies on an unsteady footing. American Bitcoin, a miner of the world's largest cryptocurrency, sells it at a premium or holds for a surge in the price. However, in the reported quarter the sector saw a selloff with bitcoin tumbling nearly 23 per cent in the three months. The company runs industrial-scale mining operations, relying largely on infrastructure provided by Hut 8 to produce bitcoin at costs below prevailing market prices. Stocks of crypto treasury companies typically move in line with the token's price as shifts in prices directly affect the value of reserves. Shares of American Bitcoin, which was co-founded by Eric Trump and where Donald Trump is a stockholder, have lost nearly 22 per cent in the past twelve months. Sustained pressure on the shares of crypto treasury companies could complicate the ability of these firms to raise additional capital to mine more crypto tokens at an industrial scale, the crux of their business model. The company, however, holds over 6,000 bitcoin presently, up from the 5,401 they held at 2025 year-end, Eric Trump said in a statement. The company posted a net loss of $59.45 million in the fourth quarter, compared with a $3.48 million profit in the year ago period. The company had also reported a profit in the previous quarter. American Bitcoin reported revenue of $78.3 million in the three months ended December 31, compared with $64.2 million in the prior-year period. Analysts were expecting revenue of $79.6 million.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/trump-brothers-backed-american-bitcoin-swings-quarterly-loss-amid-crypto-selloff-5955536",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5955496:en",
            "title": "Equinix, Canada's CPPIB near deal to buy Nordic data-center operator atNorth, Bloomberg News reports",
            "description": "Feb 26 : Equinix and Canada Pension Plan Investment Board are close to reaching a deal to acquire atNorth, a pan-Nordic data-center operator backed by Partners Group, Bloomberg News reported on Thursday, citing people familiar with the matter. The deal, which may be announced in the coming days, could value atNorth at about $4 billion including debt, according to the report. CPPIB and Partners Group declined Reuters requests for comment, while Equinix did not immediately respond. Data-centre operator Equinix has been expanding aggressively to capture rising demand for digital infrastructure, while pension funds have been increasing exposure to data-center assets. Iceland-based atNorth operates data centres across Iceland, Denmark, Sweden and Finland, catering to hyperscale cloud, AI and high-performance computing customers. Private equity firm Partners Group acquired the business in 2022 for an undisclosed amount and has since supported its regional expansion.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/equinix-canadas-cppib-near-deal-buy-nordic-data-center-operator-atnorth-bloomberg-news-reports-5955496",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5955461:en",
            "title": "Instagram to alert parents on teen suicide searches as UK weighs social media ban ",
            "description": "LONDON, Feb 26 : Instagram said it would notify parents if their teenager repeatedly searches for terms related to suicide or self-harm within a short period, as pressure grows for governments to follow Australia's ban on the use of social media for under 16s. Britain said in January it was considering restrictions to protect children online, after Australia's move in December. Spain, Greece, and Slovenia have in recent weeks said they are also looking at limiting access. Instagram, owned by Meta Platforms Inc, said on Thursday it would start alerting parents who are signed up to its optional supervision setting if their children try to access suicide or self-harm content. \"These alerts build on our existing work to help protect teens from potentially harmful content on Instagram,\" the platform said in a statement. \"We have strict policies against content that promotes or glorifies suicide or self-harm.\" Its existing policy is to block such searches and redirect people to support resources, Instagram said, adding that it would begin the alerts from next week for those signed up in the United States, Britain, Australia and Canada. Governments are increasingly seeking to protect children from harm online, particularly after worries over the AI chatbot Grok which has generated non-consensual sexualised images. In Britain, measures designed to stop access to pornography sites for children have had implications for adults' privacy, and have led to tension with the U.S. over limits on free speech and regulatory reach. Instagram's \"teen accounts\" for under 16s need a parent's permission to change settings, while parents can select an extra layer of monitoring with the agreement of their teenager.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/instagram-alert-parents-teen-suicide-searches-uk-weighs-social-media-ban-5955461",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5955306:en",
            "title": "Norway's wealth fund using AI to screen for ESG risks",
            "description": "OSLO, Feb 26 : Norway's $2.2 trillion sovereign wealth fund, the world's largest, is using AI to screen companies for risks such as potential links to forced labour and corruption, and help avoid financial losses as a result, it said on Thursday. One of the world's largest investors, the fund holds stakes in around 7,200 companies globally, owning about 1.5 per cent of all listed stocks. It has often set the pace on environmental, social and governance issues. The fund's investments are measured against a benchmark index set by the finance ministry, with equities tracked against the FTSE Global All Cap index. Each time that index includes new companies, the fund's operator, Norges Bank Investment Management (NBIM), must screen them before they enter the portfolio. Since 2025, NBIM has used large language models to screen all companies on the day they enter the equity portfolio, rapidly scanning for public information that data vendors typically do not provide. \"Within 24 hours of our investment, the AI tools flag new companies in the fund's equity portfolio with potential links to, for example, forced labour, corruption or fraud,\" NBIM said in its annual responsible investment report, published on Thursday. \"In multiple instances, we identified and sold these investments before the broader market reacted to the risks, avoiding potential losses.\" AI is especially useful for researching smaller companies in emerging markets, NBIM said, noting that data vendors often offer limited coverage and international media may not report on them. \"News may be limited to small media outlets in local languages, and controversies suggesting systemic failures in risk management may go unreported in international media,\" it said.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/norways-wealth-fund-using-ai-screen-esg-risks-5955306",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5955246:en",
            "title": "Musk touts California robotaxis but Tesla does nothing to get permits",
            "description": "LOS ANGELES, Feb 26 : For more than a year, Elon Musk has repeatedly said Tesla is months away from launching a driverless robotaxi service in California – once state regulators give their blessing. Tesla did nothing to secure that approval in 2025, according to previously unreported state Department of Motor Vehicles records and a state spokesperson. Tesla logged zero miles of autonomous test driving on California roads last year for the sixth year in a row, the records show. Documenting test miles is critical in California’s regulatory system for robotaxis, which requires companies to progress through a series of permits before being allowed to operate a driverless ride-hailing service such as Alphabet's Waymo. Much of Tesla’s $1.5 trillion market value is tied to investors’ belief that it will soon operate a vast fleet of robotaxis and sell millions of autonomous-driving software subscriptions. Operating driverless vehicles in California – the largest U.S. auto market – is a linchpin of those ambitions. Bryant Walker Smith, a University of South Carolina law professor and autonomous-driving expert who has consulted for the California DMV, said Tesla is implying that “they are ready and regulators are not,” while the reality is that “regulators are ready, and they are not.” Tesla did not respond to requests for comment. On an earnings call in October, Musk told analysts that the company is \"paranoid about safety\" and that it takes a \"cautious approach\" to new markets. \"We probably could just let it loose in these cities,\" he said, \"but we just don't want to take a chance.\" So far, Tesla operates only a small pilot robotaxi service in Austin, Texas, which has far fewer regulatory barriers than California. In the San Francisco Bay Area, the company last July started operating what it called a “robotaxi” service that was not a robotaxi service at all. Instead, it is a chauffeur service with human drivers who use Tesla’s “Full Self-Driving” driver-assistance software, which is not fully autonomous, according to the state regulator authorizing the service and Tesla’s disclosures to customers. In order to operate fully self-driving vehicles in California, like Waymo, Tesla would first need to obtain permits to test and operate driverless vehicles from the state's DMV and Public Utilities Commission, which regulates commercial ride-hailing. Tesla so far has only the entry-level DMV permit, which allows testing driverless vehicles only with a human safety monitor in the driver’s seat. A DMV spokesperson said Tesla has not applied for any additional permits. Tesla would need to log at least 50,000 miles (80,467 km) of autonomous driving on public roads in California with a safety driver before applying for a different permit allowing testing without one, according to proposed DMV regulations expected to be finalized later this year. Tesla has not logged any miles with state regulators since 2019 and has documented only 562 miles in total since 2016.  Waymo, by comparison, logged more than 13 million testing miles and secured seven different regulatory approvals between 2014 and 2023, when it received approval to charge passengers for rides in driverless robotaxis. Waymo is one of three companies with California permits to commercially operate driverless vehicles and the only one approved to operate a robotaxi fleet anything like what Musk envisions. In written comments last year, Tesla criticized some of the California DMV's proposed revisions to autonomous-driving rules, questioning the need for testing on state roads and minimum-mile requirements. The company also complained about \"overly burdensome reporting requirements\" for crashes and other system failures. Musk has often suggested California regulations are the main impediment to deploying robotaxis there. On an October 2024 earnings call, he said California has “quite a long regulatory approval process.” “I’d be shocked if we don’t get approved next year,” he added, “but it’s just not something we totally control.”",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/musk-touts-california-robotaxis-tesla-does-nothing-get-permits-5955246",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5955271:en",
            "title": "Amazon refused permission to appeal go-ahead for UK lawsuits from retailers, consumers",
            "description": "LONDON, Feb 26 : Amazon on Thursday lost its latest bid to try to throw out two mass lawsuits from retailers and consumers worth up to 4 billion pounds ($5.41 billion) for allegedly abusing its dominant position. Andreas Stephan, a competition law academic, brought one of the cases on behalf of over 200,000 third-party retailers, worth up to 2.7 billion pounds. His lawyers allege that Amazon manipulates the \"Buy Box\" feature on its website to its own advantage and favours products that use Amazon's own logistics centres and delivery network. Consumer advocate Robert Hammond separately brought a case valued at up to 1.3 billion pounds on behalf of millions of Amazon customers for similar alleged abuses of dominance. Amazon has previously said the claims are without merit. It had argued the cases should not be certified to proceed, an early step in the proceedings, including because the economic methodology for proving the cases was flawed. The Competition Appeal Tribunal last year certified both cases on an opt-out basis, meaning members of the claimant class would be part of the case unless they decide otherwise. Amazon sought permission to appeal against that decision, but the Court of Appeal refused permission on Thursday. Amazon did not immediately respond to a request for comment. ($1 = 0.7390 pounds)",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/amazon-refused-permission-appeal-go-ahead-uk-lawsuits-retailers-consumers-5955271",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5955266:en",
            "title": "US stock futures waver as Nvidia's blockbuster results draw muted response",
            "description": "Feb 26 : U.S. stock index futures were muted on Thursday as Nvidia's stellar quarterly results garnered a lukewarm response from investors and downbeat earnings from software company Salesforce weighed on sentiment. Nvidia inched 0.6 per cent higher in premarket trading after the chipmaker posted better-than-expected results for the January quarter and forecast current-quarter revenue above market estimates. \"The needle has clearly shifted when it comes to what its going to take to convince investors that the billions being poured into AI infrastructure will pay off,\" said Raffi Boyadjian, lead market analyst at Trading Point. \"Markets are now moving into a phase where they want to see tangible results of AI monetization before pushing AI stocks above their recent ranges.\" Most megacap and growth stocks including Apple and Microsoft were trading in the flat-to-lower band. At 05:51 a.m. ET, Dow E-minis were down 53 points, or 0.11 per cent, S&P 500 E-minis were down 6.25 points, or 0.09 per cent, and Nasdaq 100 E-minis were down 27 points, or 0.11 per cent. Salesforce shed 3.1 per cent after the cloud software provider forecast fiscal 2027 revenue below expectations, signaling sluggish spending on enterprise business software. Results from software-related companies could garner extra attention this earnings season given the S&P 500 software and services index has dropped nearly 21 per cent so far this year as concerns of AI-related disruptions hit the sector. While software has been one of the worst hit, financial brokerage, data analytics and legal services, real estate services and trucking are some other sectors that clocked heavy losses amid growing AI disruption fears earlier this year. February has been a choppy month for U.S. equities, with the main indexes swinging sharply between gains and losses as sentiment towards AI and technology stocks waver, with investors questioning if massive planned AI spending is actually paying off. The S&P 500 and the Nasdaq closed at two-week highs on Wednesday, fueled by a rally in heavyweight technology stocks. Media company Warner Bros Discovery, Skippy peanut butter maker Hormel Foods and utility Vistra are some of the prominent companies reporting earnings before the bell on Thursday. A weekly jobless claims reading is due later in the day and January producer prices data is scheduled for release on Friday. Among other stocks, Trade Desk dropped 16.9 per cent after the advertising technology firm forecast first-quarter revenue below estimates amid mounting pressure from larger rivals. C3.ai slipped 22.7 per cent after the software provider forecast current-quarter sales below estimates and said it was cutting 26 per cent of its global workforce. Shares of energy companies including Exxon Mobil and Chevron were down around 0.4 per cent each, tracking lower crude oil prices as investors assessed whether U.S.-Iran talks could avert a military conflict that risks supply disruptions.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/us-stock-futures-waver-nvidias-blockbuster-results-draw-muted-response-5955266",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5955261:en",
            "title": "Deutsche Telekom CEO criticises EU telecom rules overhaul",
            "description": "Feb 26 : Deutsche Telekom chief executive Timotheus Hoettges expressed dissatisfaction with how the European Union is handling the reform of telecommunication sector rules and called for more deregulation. \"We're seeing more and more red tape, more requirements,\" he said during a press conference after the publication of the company's fourth-quarter results. Following several months of pressure from European telecom companies, the European Commission unveiled in January a major revamp of the sector rules known as the Digital Networks Act. The proposal would allow operators to use radio spectrum for an unlimited duration, a move which would increase predictability and favour investments, the Commission said. However, it did not meet the European operators' call for U.S. tech giants such as Google, Netflix and Meta to pay a network fee in light of their massive traffic, opting for a voluntary cooperation mechanism.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/deutsche-telekom-ceo-criticises-eu-telecom-rules-overhaul-5955261",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5954381:en",
            "title": "Nvidia's CEO prepares investors for a renewed battle with Intel, AMD ",
            "description": "SAN FRANCISCO, Feb 25 : Nvidia may have made its immense fortune on the back of specialized graphics processing units (GPUs) used to power artificial intelligence servers, but CEO Jensen Huang is increasingly professing his love for the more generalist CPU. The CPU, or central processing unit, was for decades traditionally viewed as the main brain of a computer - a product most associated with Intel or sometimes Advanced Micro Devices. Huang is fond of saying that where once 90 per cent of computing used to happen on CPUs and 10 per cent on chips like his, the ratio had flipped in recent years. But the CPU is now making a comeback - increasingly seen as an equivalent if not better option as AI companies shift from training their models to deploying them - a shift that Nvidia plans to be a big part of. \"We love CPUs as well as GPUs,\" Huang said on a call with analysts on Wednesday for the company's fourth-quarter results. He assured them that Nvidia was not only ready for the CPU's return to the spotlight, but also that Nvidia's own CPU offerings for data centers, first released in 2023, would outcompete rivals. Last month, at the Consumer Electronics Show in Las Vegas in January, Huang also said the number of high-performance Nvidia CPUs being used in data centers would explode and that he wouldn't be surprised \"if Nvidia becomes one of the largest CPU makers in the world.\" THE CPU VERSUS THE GPU CPUs and GPUs have served different computing tasks for decades. CPUs are generalist chips designed to handle any mathematical task a software programmer might throw at the chip at reasonable speed, given the variety of work. GPUs, by contrast, specialize in carrying out a simpler set of mathematical tasks, but doing those simple calculations in parallel thousands of times at once. In video games that meant calculating the value of thousands of pixels on a screen many times a second, and in AI work that means multiplying and adding large matrices of numbers that developers use to represent real-world data such as words and images. AI companies are increasingly deploying \"agents\" that can independently carry out tasks such as writing code, sifting through documents and writing research reports - and that sort of computing \"is happening more and more, and sometimes primarily, on the CPU,\" said Ben Bajarin, an analyst at Creative Strategies. Nvidia's current flagship AI server - called the NVL72 - contains 36 of its CPUs and 72 of its GPUs. Bajarin thinks that could change to a 1 to 1 ratio for so-called agentic work or even that the GPU could be skipped altogether. NVIDIA OUT TO PROVE A POINT Underscoring its CPU ambitions, Nvidia recently announced a deal with Meta Platforms that will see the Facebook owner use large volumes of its Grace and Vera CPU chips on a standalone basis. That's a relatively new development compared to Nvidia's current AI servers where each CPU is accompanied by multiple GPUs. Though it's not that Meta has switched vendors for CPUs - it's just securing more suppliers. Days later, AMD also announced a large deal with Meta that also included its CPUs, which Meta has been buying for years. On the call with analysts, Huang argued that Nvidia had taken a fundamentally different approach to CPUs. He outlined why Nvidia had minimized an approach to breaking up chips into smaller parts that Intel and AMD have used, saying the Nvidia CPU was able to carry out many simple tasks in a row with good access to a lot of computer memory. \"It is designed to be focused on very high data processing capabilities,\" Huang said on the call. \"And the reason for that is because most of the computing problems that we're interested in are data driven - artificial intelligence being one.\" Dave Altavilla, principal analyst at HotTech Vision and Analysis, said Nvidia is aiming to prove that the CPU type once supplied primarily by Intel \"is no longer the assumed default foundation of modern compute infrastructure. Instead, it becomes just one architectural option among several.\" Huang said that Nvidia would have more to disclose about its CPUs at the company's annual developer conference in Silicon Valley next month. ",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/nvidias-ceo-prepares-investors-renewed-battle-intel-amd-5954381",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        }
    ]
}