{
    "data": [
        {
            "id": "entity:node/5956756:en",
            "title": "Betting giant Flutter forecasts 2026 profit far below estimates on US challenges",
            "description": "DUBLIN, Feb 26 : FanDuel-owner Flutter forecast modest profit growth for 2026 far below analyst expectations due to challenges in the betting giant's main U.S. market compounded by its misfiring attempts to win customers over with promotions and bonuses.  The world's largest online betting company reported a 21 per cent jump in 2025 core profit on Thursday but expected growth of just 4 per cent this year to $2.97 billion, significantly below the $3.5 billion expected by analysts polled by LSEG SmartEstimate. The company's shares fell more than 9 per cent in after-hours trading. Flutter said the guidance largely reflected lower levels of U.S. customer engagement in the fourth quarter and into 2026 after it took more money from American football gamblers than its rivals during a run of favourable sports results.  While bookmakers tend to make more money when favourites lose, Flutter said the lack of marquee names in the closing stages of the NFL season meant customers were less interested in gambling during the key playoff games. \"We just didn't execute our generosity strategy as well as we should have done in the face of those results,\" Flutter CEO Peter Jackson told Reuters, referring to the promotions and bonuses gambling companies offer customers to keep them betting. Jackson said FanDuel, which has a leading 41 per cent share of the U.S. market, plans to improve how it rewards customers to be \"better positioned\" for the 2026/27 NFL season, including by launching a loyalty programme in the second quarter. Flutter also intends to increase planned investment in its new prediction markets platform launched in late December with derivatives exchange CME Group. Prediction markets, which allow users to win money on the likelihood of specific events occurring, from sports and entertainment to politics and the economy, have surged into the mainstream in the U.S. With FanDuel Predicts now offering non-sports markets in all 50 states and sports markets in 18 states including California, Texas and Florida where sports betting is illegal, Flutter expects investment to reduce 2026 core profit by the upper end of its previous $200 million to $300 million estimate.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/betting-giant-flutter-forecasts-2026-profit-far-below-estimates-us-challenges-5956756",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956746:en",
            "title": "Exclusive-ASML says next-gen EUV tools ready to mass-produce chips, marking key shift for AI chip production  ",
            "description": "SAN JOSE, California, Feb 26 : ASML Holding's next-generation chipmaking machine is ready for manufacturers to start bringing it into use for production at high volumes, a senior executive told Reuters, a big step for the chip industry. The Dutch company produces the world's only commercial extreme ultraviolet lithography (EUV) tools, which are a critical piece of equipment for chipmakers. This new tool will help chipmakers such as Taiwan Semiconductor Manufacturing  and Intel produce more powerful and efficient chips, by eliminating several costly and complex steps from the chip-manufacturing process, data from ASML shows. ASML plans to release this data, which represents a key milestone, at a technical conference in San Jose on Thursday, the company's chief technology officer, Marco Pieters, told Reuters on Wednesday. It has taken ASML years to develop the costly, next-generation tools as chipmakers have attempted to determine at what point it makes economic sense to begin to use them for mass production. But given that the current generation of EUV tools is approaching the technical limit of their ability to make complex AI chips, the next-generation machines - called High-NA EUV tools - are key for the AI industry to improve chatbots like OpenAI's ChatGPT and help chipmakers deliver their AI chip roadmaps on time to meet surging demand. The new tools cost roughly $400 million, twice the cost of the original EUV machines. The High-NA EUV tools now experience limited downtime, have produced 500,000 dinner-plate-sized silicon wafers and can draw sufficiently precise patterns that make up the circuits on the chip, the ASML data shows, Pieters said. In combination, the three data points indicate the tools are ready for manufacturers. \"I think that it's at a critical point to look at the amount of learning cycles that have happened,\" he said, referring to the number of tests that have been conducted on the machines by customers. Despite their technical readiness, it will take two to three years for companies to conduct enough testing and development to integrate them into manufacturing. \"(Chipmakers) have all the knowledge to qualify these tools,\" Pieters said. Pieters also said the company has achieved roughly 80 per cent uptime at the moment and plans to achieve 90 per cent by the end of the year. The imaging data ASML plans to release is enough to convince customers to replace multiple steps with the older-generation tools with a single High-NA step, Pieters said. The 500,000 wafers the machines have processed have allowed the company to work out many of the kinks.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/exclusive-asml-says-next-gen-euv-tools-ready-mass-produce-chips-marking-key-shift-ai-chip-production-5956746",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956911:en",
            "title": "Core inflation in Japan's capital slows, falling below central bank's 2% target",
            "description": "TOKYO, Feb 27 : Annual core inflation in Japan's capital slowed in February as food price hikes run their course, data showed on Friday, offering consumers some relief but complicating the central bank's communication in justifying further rate hikes. The data is in line with the Bank of Japan's projection that consumer inflation will temporarily slow due to the impact of fuel subsidies and the base effect of last year's spike, before reaccelerating on steady wage gains. The Tokyo core consumer price index, which excludes volatile costs of fresh food, rose 1.8 per cent in the year to February after a 2.0 per cent gain in January, data showed, falling below the central bank's 2 per cent target for the first time since October 2024. It compared with a median market forecast for a 1.7 per cent gain. An index stripping away the effect of fresh food and fuel, which is seen as a better gauge of trend inflation, rose 2.5 per cent in February from a year earlier after a 2.4 per cent gain in January. The BOJ raised interest rates to a 30-year high of 0.75 per cent in December, taking another landmark step in ending decades of huge monetary support in a sign of its conviction that Japan is progressing toward durably hitting its 2 per cent inflation target. The central bank has signalled its readiness to continue raising interest rates if its economic and price forecasts materialise.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/core-inflation-in-japans-capital-slows-falling-below-central-banks-2-target-5956911",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956901:en",
            "title": "Binance cannot arbitrate customer claims over crypto losses, US judge rules",
            "description": "NEW YORK, Feb 26 : A federal judge on Thursday rejected Binance's request that customers who accused the world's largest cryptocurrency exchange of illegally selling unregistered tokens that lost much of their value arbitrate their claims. U.S. District Judge Andrew Carter in Manhattan said customers could pursue claims that arose by February 20, 2019 in court, because Binance did not sufficiently notify them that it modified their terms of use to require arbitration and waive the right to sue in a class action. Carter said there was no evidence that Binance \"announced\" an arbitration provision, or told customers in the terms of use where they might look for one. He also said the alleged class-action waiver in Binance's 2019 terms of use was ambiguous and unenforceable. Binance founder and former chief executive Changpeng Zhao is also a defendant. Lawyers for Binance and Zhao did not immediately respond to requests for comment. Some defendants prefer arbitration to litigation because arbitration can remain confidential, make gathering evidence more difficult, and cost less. Customers who suffered losses on seven tokens - ELF, EOS, FUN, ICX, OMG, QSP and TRX - accused Binance of failing to warn that purchases carried \"significant risks,\" as required under federal and state securities laws, and sought to recoup what they paid. Carter dismissed the lawsuit in 2022, but a federal appeals court revived it two years later.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/binance-cannot-arbitrate-customer-claims-over-crypto-losses-us-judge-rules-5956901",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956671:en",
            "title": "Brinks to acquire NCR Atleos in $6.6 billion deal",
            "description": "Feb 26 : Brinks Co on Thursday said it will acquire NCR Atleos in a cash-and-stock deal valued at about $6.6 billion including debt, sending the cash management and logistics provider's shares down 6 per cent in after-hours trading to $126.90. NCR Atleos provides operational efficiency solutions for financial institutions and retailers, alongside digital-first financial self-service experiences for consumers. Brinks will acquire each outstanding share of NCR Atleos for $30 in cash and 0.1574 shares of its common stock.  The implied $50.40 value of the per-share merger consideration represents a premium of approximately 20.4 per cent over NCR Atleos’ closing share price on February 26, 2026. The deal has been approved by the boards of directors of both companies and is expected to close in the first quarter of 2027. Brinks CEO Mark Eubanks and chief financial officer Kurt McMaken will be appointed to the same roles in the combined company. Sidley Austin is serving as Brinks' legal advisor for the transaction. Meanwhile, Brinks also forecast first-quarter adjusted profit per share of $1.50 to $1.90, the midpoint of which is in line with analysts' estimates of $1.7, according to data compiled by LSEG.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/brinks-acquire-ncr-atleos-in-66-billion-deal-5956671",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956836:en",
            "title": "Anthropic CEO says company cannot accede to Pentagon's request in AI safeguards dispute",
            "description": "Feb 26 : Anthropic cannot accede to the Pentagon's request in an AI safeguards dispute despite threats to remove the company from the Department of Defense's systems, the AI firm's CEO, Dario Amodei, said on Thursday. The Pentagon's dispute with Anthropic stems from the AI startup's refusal to remove safeguards that would prevent its technology from being used to target weapons autonomously and conduct surveillance in the United States. Amodei said on Thursday that the Defense Department will contract only with AI companies that accede to \"any lawful use\" and remove safeguards. The department threatened to remove Anthropic from its  systems if the company maintained these safeguards and threatened to designate it a \"supply chain risk and to invoke the Defense Production Act to force the safeguards' removal,\" Amodei added. \"Regardless, these threats do not change our position: we cannot in good conscience accede to their request,\" Amodei said. The Pentagon did not immediately respond to a request for comment. \"It is the Department's prerogative to select contractors most aligned with their vision. But given the substantial value that Anthropic's technology provides to our armed forces, we hope they reconsider,\" Amodei said. \"Should the Department choose to offboard Anthropic, we will work to enable a smooth transition to another provider,\" he added. An Anthropic spokesperson said the company remains \"ready to continue talks and committed to operational continuity for the Department and America's warfighters.\"",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/anthropic-ceo-says-company-cannot-accede-pentagons-request-in-ai-safeguards-dispute-5956836",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956886:en",
            "title": "Google signs multibillion-dollar AI chip deal with Meta, Information reports",
            "description": "Feb 26 : Meta Platforms has signed a deal to rent Google's AI chips, known as tensor processing units, to develop new AI models, the Information reported on Thursday, citing a person involved in the talks. The multi-year deal is worth billions of dollars, the report added. Meta and Google did not immediately respond to Reuters' requests for comment.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/google-signs-multibillion-dollar-ai-chip-deal-meta-information-reports-5956886",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956891:en",
            "title": "Tokyo Feb core CPI rises 1.8% yr/yr",
            "description": "TOKYO, Feb 27 : Core consumer prices in Tokyo rose 1.8 per cent in February from a year earlier, government data showed on Friday. The core consumer price index for Japan’s capital, which includes oil products but excludes fresh food prices, compared with economists' median estimate for a 1.7 per cent annual rise.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/tokyo-feb-core-cpi-rises-18-yryr-5956891",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956666:en",
            "title": "Netflix backs away from its offer to buy Warner Bros ",
            "description": "Feb 26 : Netflix on Thursday signaled it was backing away from its offer to buying Warner Bros Discovery's streaming and studio assets, saying the deal was no longer financially attractive after Paramount Skydance revised its offer for the coveted Hollywood studio to $31-a-share offer. Shares of Netflix rose around 10 per cent in extended trading. \"We've always been disciplined, and at the price required to match Paramount Skydance's latest offer, the deal is no longer financially attractive, so we are declining to match the Paramount Skydance bid,\" Netflix said in a statement. Warner Bros Discovery said earlier in the day that Paramount's revised $31-a-share offer was superior to its existing deal with Netflix. Netflix had earlier this month granted Warner Bros a seven-day waiver to seek a \"best and final offer\" from Paramount for the company. Netflix, which was looking to buy Warner Bros' streaming and studio assets, agreed in December to a deal valued at $27.75 per share. The company had said its offer, along with a planned divestiture of Warner Bros' cable assets, would deliver a greater shareholder value. In its revised bid, Paramount raised the termination fee it would pay should the deal fail to gain regulatory approval to $7 billion from $5.8 billion.  Paramount said it welcomed Warner Bros board's unanimous reaffirmation that its bid represents the stronger offer. The Ellison Trust is committing $45.7 billion in equity, up from $43.6 billion previously, backed by Larry Ellison and including any additional funds needed to satisfy Paramount's bank solvency requirements, the firm said. Bank of America Merrill Lynch, Citi and Apollo are providing $57.5 billion in debt financing, increased from an earlier $54 billion commitment. Activist investor Ancora Holdings, which owns a small stake in Warner Bros, has also stepped up pressure on the HBO owner by saying the company did not adequately engage with Paramount.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/netflix-backs-away-its-offer-buy-warner-bros-5956666",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956666:en",
            "title": "Netflix declines to raise offer after Warner Bros says Paramount bid superior",
            "description": "Feb 26 : Netflix on Thursday refused to raise its offer for Warner Bros Discovery after the coveted Hollywood studio said Paramount Skydance's revised $31-a-share offer was superior to its existing deal with the streaming giant. Shares of Netflix jumped 10 per cent in extended trading. \"We've always been disciplined, and at the price required to match Paramount Skydance's latest offer, the deal is no longer financially attractive, so we are declining to match the Paramount Skydance bid,\" Netflix said in a statement.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/netflix-declines-raise-offer-after-warner-bros-says-paramount-bid-superior-5956666",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956841:en",
            "title": "Netflix declines to raise offer for Warner Bros",
            "description": "Feb 26 : Netflix said on Thursday it will not raise its offer for Warner Bros Discovery after the HBO Max owner's board determined that Paramount Skydance's latest proposal was a \"Superior Proposal\" to the streaming pioneer's existing merger agreement.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/netflix-declines-raise-offer-warner-bros-5956841",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956836:en",
            "title": "Anthropic rejects Pentagon's requests in AI safeguards dispute, CEO says",
            "description": "Feb 26 : Anthropic cannot accede to the Pentagon's requests in an AI safeguards dispute, the AI firm's CEO Dario Amodei said on Thursday.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/anthropic-rejects-pentagons-requests-in-ai-safeguards-dispute-ceo-says-5956836",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956631:en",
            "title": "Intuit expects profit below estimates on higher marketing spend during US tax season",
            "description": "Feb 26 : Intuit forecast third-quarter profit below Wall Street estimates on Thursday, as it anticipates higher marketing spending to attract more customers during the U.S. tax season. Shares of the company fell around 4 per cent in extended trading. The third quarter is typically Intuit's strongest, as the tax season boosts demand for the company's financial management tools such as TurboTax, Credit Karma, and QuickBooks. The Internal Revenue Service (IRS), the U.S. federal government agency, began accepting federal tax returns on January 26 this year, with the filing deadline set for April 15. Intuit CFO Sandeep Aujla told Reuters that increased marketing and customer support spending are deployed in the third quarter to capitalize on the tax season and drive growth in the assisted tax and QuickBooks segments. The company forecast adjusted earnings per share of $12.45 to $12.51 for the third quarter ending April 30, compared with analysts' average estimate of $12.95, according to data compiled by LSEG. Intuit, which competes with rivals such as H&R Block and Oracle's NetSuite, expects about 10 per cent revenue growth in the quarter, largely in line with analysts' average estimate of 9.9 per cent growth. The forecasts come amid market fears that the growing use of AI tools would erode demand for traditional software, as customers increasingly seek personalized financial guidance and automated solutions for tasks such as bookkeeping. The company has signed multi-year deals with AI startups Anthropic and OpenAI to integrate their frontier models into its software and to add Intuit's personalized tax, finance, accounting and marketing capabilities into Claude and ChatGPT. \"We're paying OpenAI and Anthropic for the capabilities. We're not paying them revenue share,\" Aujla said, adding that more than 3 million clients engage with the company's AI agents. Intuit reiterated its fiscal 2026 forecasts and said its second-quarter revenue grew 17 per cent to $4.65 billion, beating analysts' average estimate of $4.53 billion.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/intuit-expects-profit-below-estimates-higher-marketing-spend-during-us-tax-season-5956631",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956651:en",
            "title": "CoreWeave slides as surging capex, backlog risks overshadow small revenue beat",
            "description": "Feb 26 : CoreWeave forecast that its capital expenses for the year will double, as it spends heavily to scale up its AI cloud platform to handle the massive computing power demanded by its customers to train and deploy advanced AI models. Its shares slumped 10 per cent in after-hours trading. The company expects capital expenditure of at least $30 billion in 2026, its co-founder and CEO Michael Intrator said on a call with analysts. Last year, its capital costs were $15.4 billion. CoreWeave, a so-called neo-cloud that counts hyperscalers such as Microsoft and Alphabet's Google among its rivals, said net losses in the fourth quarter ended December 31  ballooned to $284 million from $36 million in the same quarter last year. CoreWeave has positioned itself as a more specialized and cost-effective alternative to the  big tech companies, attracting clients ranging from AI labs to large enterprises. But it still relies heavily on large clients such as Microsoft and OpenAI, which remain critical to its growth trajectory, and faces significant revenue backlog risk. CoreWeave faces lingering concerns regarding its backlog risk, debt and cost of capital, D.A. Davidson analyst Alexander Platt noted. Revenue backlog was $66.8 billion as of December 31, CoreWeave said, up from $15.1 billion a year earlier.  Nvidia announced a $2 billion investment in CoreWeave in January, becoming the AI infrastructure provider's second-largest shareholder. CoreWeave's adjusted operating income margin fell to 6 per cent in the fourth quarter, from 16 per cent a year earlier. It has repurposed its high-performance GPU infrastructure, originally built for large-scale crypto mining, to establish itself as a premier cloud provider for the global AI sector. The company reported revenue of $1.57 billion for the fourth quarter, compared with analysts' average estimate of $1.55 billion.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/coreweave-slides-surging-capex-backlog-risks-overshadow-small-revenue-beat-5956651",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956741:en",
            "title": "Jack Dorsey’s Block to cut nearly half its workforce in AI overhaul, shares surge",
            "description": "Feb 26 : Block on Thursday said it will cut over 4,000 jobs, nearly half its workforce, as advances in AI reshape how it builds and runs its business, sending its shares up 23 per cent in after-hours trading. The layoffs signal how the AI boom is translating from hype into workforce changes, fueling long-held concerns among workers and economists that the technology could eliminate roles even as it boosts productivity and profits. \"Intelligence tools have changed what it means to build and run a company. We're already seeing it internally. A significantly smaller team using the tools can do more and do it better,\" CEO Jack Dorsey said in a statement. \"I don't think we're early to this realization. I think most companies are late,\" he added. AI-DRIVEN OVERHAUL In a post on social media platform X, Dorsey said Block opted for a single deep round of cuts instead of multiple smaller layoffs over time. He said a smaller company would also give it space to grow the business the right way, instead of constantly reacting to market pressures. Investors have been rewarding companies that show AI-driven cost savings, and the sharp workforce reduction signals the scale at which the technology is starting to translate into lower expenses and higher margins in some industries. The layoffs represent \"a seminal moment\" in the AI era, offering a glimpse into how the technology may fundamentally reshape the corporate world, analysts at Evercore ISI wrote in a note. The company said it expects to incur roughly $450 million to $500 million in restructuring charges. Dorsey said he expects a majority of companies to reach the same conclusion Block did and make similar structural changes. \"I'd rather get there honestly and on our own terms than be forced into it reactively.\" Analysts at Truist said the stock was likely surging on hopes of better-than-expected 2026 margins as a result of the workforce reduction. EARNINGS MOMENTUM Block posted an adjusted profit of 65 cents per share in the three months ended December 31, compared with 47 cents a year earlier. Gross profit grew 24 per cent in the quarter, driven by a 33 per cent surge in the Cash App business, which enables peer-to-peer mobile payments. Block said it believes it can sustain Cash App's strong gross profit growth and continue accelerating Square's gross payment volume over the next three years. Consumer spending has remained resilient despite elevated interest rates, sustaining transaction volumes across the payments sector. The results cap a broadly upbeat holiday-quarter reporting season for the payments sector, with Visa and Mastercard also posting solid results.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/jack-dorseys-block-cut-nearly-half-its-workforce-in-ai-overhaul-shares-surge-5956741",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        }
    ]
}