{
    "data": [
        {
            "id": "entity:node/5959641:en",
            "title": "Trump says he is directing federal agencies to cease use of Anthropic technology",
            "description": "WASHINGTON, Feb 27 : U.S. President Donald Trump on Friday said he was directing every federal agency to immediately cease all use of Anthropic's technology, adding there would be a six-month phase out for agencies such as the Defense Department who use the company's products. \"I am directing EVERY Federal Agency in the United States Government to IMMEDIATELY CEASE all use of Anthropic’s technology. We don’t need it, we don’t want it, and will not do business with them again!\" Trump said in a post on Truth Social. Trump's directive comes amid a feud between the Pentagon and top artificial intelligence lab Anthropic over concerns about how the military could use AI at war.Spokespeople for Anthropic did not immediately respond to a request for comment.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/trump-says-he-directing-federal-agencies-cease-use-anthropic-technology-5959641",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5959596:en",
            "title": "Goldman bucks private credit redemption trend as AI disruption fears mount",
            "description": "Feb 27 : Goldman Sachs' asset management arm has assured investors that the redemption rate at GS Credit remains well below that of its peers, setting it apart from turbulence in private credit sparked by concerns that AI could disrupt software companies. In a letter to investors seen by Reuters on Friday, the Wall Street firm added that Goldman Sachs Private Credit Corp continued to see strong appetite, with December inflows 11 per cent above the year-to-date average and a fourth-quarter redemption rate of 3.5 per cent, compared with more than 5 per cent for peers. Fears that AI could erode the earnings power of software companies and weaken their ability to repay loans are rippling through private credit, a key lender to the technology sector, prompting investors to reassess exposure, redemption risks and fundraising prospects, analysts have said. Concerns have been compounded by renewed troubles at Blue Owl over asset sales, triggering a sharp selloff in shares of alternative asset managers with a footprint in the private credit market. The shift in sentiment is testing a corner of the alternatives market that has swelled into a roughly $2 trillion juggernaut in recent years. \"As we enter 2026, the private credit landscape is facing volatile macroeconomic conditions, shifting flows in the traded and non-traded BDC (Business Development Company) market, and accelerating technological change - particularly around AI,\" Goldman said. ASSESSING AI IMPACT The firm disclosed that GS Credit's exposure to enterprise software credit was about 15.5 per cent at the end of the third quarter, toward the low end of the range reported by its peers. Investors have been grappling with the prospect of AI disruption for weeks, with many increasingly concerned that the technology has shifted from an efficiency and productivity tailwind for the software sector to a potential existential threat. Goldman said it has been assessing the impact of AI on the software space for years and passed on its first deal due to AI concerns in October 2023. \"We agree with the perspective that AI is significantly lowering development costs which will lead to increased competitive intensity for incumbent software companies,\" it said in the letter. Goldman added that it invests in businesses that show \"structural advantages and incumbency moats\" that may be difficult for new entrants to displace. The company said it rolled its first internal framework to evaluate AI disruption risk in early 2025. \"We do not underestimate the risk of AI disruption,\" it added.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/goldman-bucks-private-credit-redemption-trend-ai-disruption-fears-mount-5959596",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5959601:en",
            "title": "Exclusive-QIA, Visa and ADIA set to anchor SoftBank's PayPay IPO, sources say",
            "description": "Feb 27 : A group of global investors including Qatar Holdings, an investment arm of Qatar Investment Authority, Visa and Abu Dhabi Investment Authority, is preparing to invest more than $200 million as cornerstone investors in the U.S. initial public offering by SoftBank's PayPay, according to two people familiar with the matter. PayPay, a Japanese digital payments provider, is targeting a valuation of up to $14 billion in the offering, one of the people said, in what could be the biggest listing for a Japanese company on a U.S. stock exchange. The source declined to be identified as the information had not been publicly disclosed. The sources cautioned that no final commitment has been made, and the size, terms of the potential cornerstone investments and the valuation of the deal are being discussed and could change. PayPay plans to list on the Nasdaq next month, one of the people said, adding SoftBank hopes that bringing cornerstone investors on board will boost the IPO’s appeal. The IPO was initially expected in December, but was delayed by a prolonged U.S. government shutdown that slowed the regulatory process. PayPay, SoftBank, Qatar Holdings, Visa and ADIA did not immediately respond to requests for comment.  Reuters first reported over two years ago that SoftBank was considering a U.S. listing for PayPay. SOFTBANK GENERATING FUNDS FOR AI SPENDING The planned IPO of PayPay comes at a pivotal moment for SoftBank Group, which has gone all-in on artificial intelligence. The Japanese conglomerate has committed $30 billion to OpenAI, building on a roughly $41 billion investment it said it completed in December for an estimated 11 per cent stake, Reuters reported. To help fund its AI investments, CEO Masayoshi Son has sold billions of dollars' worth of assets, including the company’s $5.8 billion stake in Nvidia and $4.8 billion of T-Mobile U.S. shares. The PayPay listing - the first U.S. listing for a SoftBank-majority business since Arm Holdings - could provide a timely cash boost for the conglomerate. Earlier this month, PayPay said it had entered a partnership with Visa, as the Japanese payments company seeks to expand into the U.S.   Jointly formed by SoftBank and Yahoo Japan in 2018, PayPay has helped accelerate Japan's digital transformation, encouraging consumers to move away from cash by offering rebates on payments through its mobile app. Just over seven years since its founding, PayPay has rapidly expanded and grown into one of Japan's most widely used payment platforms, amassing roughly 72 million registered users as of December 31.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/exclusive-qia-visa-and-adia-set-anchor-softbanks-paypay-ipo-sources-say-5959601",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5959501:en",
            "title": "Brookfield's new AI unit Radiant valued at $1.3 billion after merger with UK startup, sources say",
            "description": "LONDON, Feb 27 : Brookfield Asset Management's new AI infrastructure company Radiant has been valued at $1.3 billion after merging with London-based cloud computing firm Ori Industries, according to three people with knowledge of the matter and a document seen by Reuters. Radiant, a new company the Canadian asset manager created to provide on-demand access to artificial intelligence chips, said it had combined with Ori in a deal announced on Tuesday without disclosing any financial terms. All of Ori's existing investors have rolled their stakes into Radiant, the sources said, adding that Brookfield injected fresh capital into the new company. Reuters could not determine how much of the valuation reflected Ori's contribution. The valuation was established earlier this month, according to the document and one of the people. Reuters could not determine if it had changed since then. Brookfield and Ori declined to comment. The sources declined to be identified because the terms were not made public. RACE TO BUILD AI INFRASTRUCTURE Companies House filings show that Ori had 42.5 million pounds ($57.2 million) in total assets less current liabilities at the end of 2024. Total debt was 11.3 million pounds from 4.4 million pounds a year earlier, according to its filed accounts. The deal comes as investors race to build the data-centre, power and chip infrastructure needed for advanced AI, amid a shortage of high-performance compute capacity. Mahdi Yahya, the founder of Ori, a startup backed by Saudi Aramco's venture arm, will now be president of Radiant. \"For more than seven years we have been designing software to support AI infrastructure at scale, and it was clear Brookfield was the right partner,\" he said in a statement on Tuesday. \"Through Radiant we can help address the supply-demand imbalance that has defined AI since 2023.\" Vishal Padiyar, executive chair of Radiant, said the company blends infrastructure and software to support governments and major enterprises, aiming to lower computing costs and improve performance at scale. Radiant is one of the first projects backed by Brookfield's AI infrastructure fund, which is seeking $10 billion in investor commitments and aims to scale to as much as $100  billion through co-investment and financing. The fund includes up to $5  billion earmarked for Bloom Energy to install up to 1 gigawatt of behind-the-meter power solutions for data centres and AI factories, while chipmaker Nvidia contributed to the fund's initial capital and will supply chips to Radiant.  Britain is ramping up data-centre construction and plans to expand national computing capacity 20-fold by 2030 as data centres are classed as critical infrastructure.  Global players such as Google and Microsoft have pledged multi-billion-pound investments to the sector in the UK, alongside up to 2 billion pounds ($2.70 billion) in public funding under the UK's Compute Roadmap.  ($1 = 0.7403 pounds)",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/brookfields-new-ai-unit-radiant-valued-13-billion-after-merger-uk-startup-sources-say-5959501",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5959506:en",
            "title": "Trump Media considers spinning off Truth Social into public company",
            "description": "Feb 27 : Trump Media & Technology Group, founded by U.S. President Donald Trump, is considering spinning off its social media platform Truth Social into a publicly traded company. TMTG is in discussions with TAE Technologies and Texas Ventures Acquisition III about the proposed transaction, the company said on Friday.  Under the proposal, shares in the spun-off company will be distributed to eligible TMTG shareholders, after which the new entity will merge with a special purpose acquisition company. Such a transaction would separate TMTG's social media and digital media assets from its recently announced fusion energy venture, effectively splitting the company into two publicly traded businesses with distinct strategies. Founded by President Donald Trump and known for its Truth Social platform aimed at conservative audiences, TMTG has faced challenges scaling its media business amid competition from larger social networks and uneven user growth. It is now seeking to reposition itself beyond its core Truth Social platform and tap investor interest in emerging energy technologies. TMTG said no definitive agreement has been reached on the spin-off and discussions are ongoing. The company's shares were down more than 3 per cent in afternoon trading. In December, TMTG agreed to merge with TAE in an all-stock deal valued at more than $6 billion, marking a pivot toward fusion energy and the creation of a publicly traded company focused on developing utility-scale power plants to help meet rising electricity demand, including from AI data centers. TAE Technologies is a California-based private company developing advanced nuclear fusion technology that has raised more than $1 billion from investors including Alphabet's Google and Chevron. The startup focuses on a form of fusion designed to produce electricity without releasing large amounts of neutron radiation, reducing radioactive waste.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/trump-media-considers-spinning-truth-social-public-company-5959506",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5959506:en",
            "title": "Truth Social parent explores spinning off social media platform",
            "description": "Feb 27 : Trump Media & Technology Group said on Friday it is in discussions with TAE Technologies and Texas Ventures Acquisition III about spinning off businesses including Truth Social into a new publicly traded company. Under the proposal, shares in the spun-off company will be distributed to eligible TMTG shareholders, after which the new entity would merge with the special purpose acquisition company.  TMTG said no definitive agreement has been reached and discussions remain ongoing.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/truth-social-parent-explores-spinning-social-media-platform-5959506",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5958876:en",
            "title": "OpenAI clinches $840 billion valuation with mega funding from Amazon, Nvidia, SoftBank",
            "description": "Feb 27 : OpenAI's latest funding round valued the ChatGPT maker at $840 billion as Big Tech and Masayoshi Son's SoftBank piled into the $110 billion blockbuster round, signaling the AI investment race is alive and well despite recent fears of a valuation bubble.  The funding round - one of the largest private capital raises on record - with various strings and conditions attached that come in phases, includes a $30 billion investment from SoftBank, $30 billion from Nvidia, and $50 billion from Amazon. It comes ahead of the AI startup's expected mega-IPO this year to meet the ChatGPT maker's surging compute and R&D costs.  More investors are expected to join the round as it progresses, OpenAI said in a statement on Friday. FUNDING BOOST AMID COMPETITION With the latest injection, SoftBank's investment in OpenAI is set to be $64.6 billion, representing an ownership interest of about 13 per cent, the Japanese conglomerate said. The investment will come in three phases throughout this year, with the first tranche of $10 billion expected to close by April 1.  As a result of the investment, SoftBank will gain preferred shares that will be converted into common shares of OpenAI upon an IPO.  SoftBank said the $30 billion is expected to be financed initially through bridge loans and capital raise from major financial institutions. The Japanese investment giant has sold stakes in its existing investments, including Nvidia, in order to fund its check into OpenAI.  The infusion will help OpenAI secure advanced AI chips and the computing capacity it needs to maintain its lead position in the AI industry, especially as competition heats up from Anthropic and Alphabet's Google.  It also exacerbates Wall Street concerns about  \"circular\" financing agreements, where firms invest in and sign supply deals with each other, inflating demand and revenue. After years of outsized gains, tech stocks have suffered sharp declines in 2026 as investors question whether AI investments will generate sufficient returns to justify lofty valuations. Nvidia was punished by shareholders this week after the chipmaker said it would pour money into the AI ecosystem, instead of returning cash to shareholders. Nvidia's investment in OpenAI gives the chip company a financial stake in one of its largest customers, tightening their already intertwined relationship. OpenAI said on Friday it would use Nvidia's latest Rubin systems, representing five gigawatts of computing capacity - enough energy to power millions of U.S. households. It was not immediately clear whether Nvidia's $30 billion investment replaced its earlier commitment announced in September under which Nvidia was set to invest up to $100 billion in the startup.  OpenAI and Nvidia did not immediately respond to Reuters' requests for clarification.  AMAZON PARTNERSHIP  The new investment is crucial for OpenAI.  The launch of Google's Gemini 3 in November has given the Alphabet-owned company a stronger footing, while Anthropic has cemented its lead in the enterprise AI market with its specialized coding tool. OpenAI, which is yet to turn a profit, is targeting roughly $600 billion in total compute spend through 2030, a source told Reuters last week.  Along with the $50 billion investment, OpenAI and Amazon have also struck a deal in which OpenAI will utilize two gigawatts of computing capacity powered by Amazon's in-house Trainium AI chips. The companies are also expanding their $38 billion cloud deal signed last year, with OpenAI saying it would spend an additional $100 billion on Amazon Web Services over the next eight years. As well, OpenAI will work with Amazon to develop customized models for the e-commerce company's engineering teams. Amazon will start with an initial $15 billion investment, followed by another $35 billion in the coming months when certain conditions are met, the companies said.  AWS will be the exclusive third-party cloud provider for OpenAI Frontier, the ChatGPT maker's enterprise platform for building and running AI agents.  Microsoft, in a joint statement with OpenAI, sought to outline the limits to the work that Amazon and OpenAI can undertake together without involving Azure, Microsoft's cloud unit. The partnership does not change OpenAI's relationship with Microsoft, with Microsoft Azure still the exclusive cloud provider for OpenAI's APIs that provide access to OpenAI's models, the companies said. OpenAI’s first-party products, including Frontier, will continue to be hosted on Azure.  ChatGPT serves more than 900 million weekly active users, OpenAI said on Friday, adding that it has surpassed 50 million consumer subscribers. January and February are on track to become the largest months for new subscriber additions, it said.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/openai-clinches-840-billion-valuation-mega-funding-amazon-nvidia-softbank-5958876",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5959481:en",
            "title": "Dorsey's blunt AI warning sharpens debate over jobs and profits",
            "description": "Feb 27 : Jack Dorsey is not the first chief executive to say artificial intelligence will transform work. He may be among the first to act as if it already has - and to say so openly. \"Intelligence tools have changed what it means to build and run a company. We're already seeing it internally. A significantly smaller team using the tools can do more and do it better,\" Block CEO and co-founder said in a statement on Thursday. \"I don't think we're early to this realization. I think most companies are late,\" he added as he laid out plans to cut over 4,000 jobs, nearly half the company's workforce, as part of an overhaul to embed AI across the fintech's operations. Block shares rose sharply on Friday, underscoring how markets are increasingly rewarding companies that present AI not as an experiment but as a driver of structural change. Dorsey also delivered a blunt warning to peers: most companies are behind the AI curve and will reach the same conclusion within a year. \"I'd rather get there honestly and on our own terms than be forced into it reactively.\" Until now, most executives have resisted those kinds of sweeping conclusions even as their firms pour billions into the technology. The comments are likely to sharpen a growing debate among executives, economists, investors and policymakers: is AI primarily a tool that helps workers do more - or one that enables companies to do the same with far fewer people? AI JOB CUTS ACCELERATE AI-linked layoffs have been rising worldwide. According to a Reuters tally, companies have announced more than 61,000 job cuts tied to AI, including Amazon, Pinterest and Australia's Wisetech since November. But Block is among the highest-profile companies to cite AI explicitly as the primary driver of its reductions, rather than a secondary efficiency gain. Some investors argue that automation-related cuts are partly correcting for years of overhiring. \"AI is the new scapegoat,\" said Brian Jacobsen, chief economic strategist at Annex Wealth Management, on Friday. Still, markets are increasingly uneasy about AI's potential to upend jobs and profits amid an uncertain global economic backdrop. A widely circulated report this week by Citrini Research outlined a 2028 scenario in which unemployment rises to 10.2 per cent, driven by rapid displacement of workers in software, logistics and delivery roles. BUSINESSES HAVE BEEN MORE GUARDED Evidence is emerging that firms are beginning to see returns on their investment. Morgan Stanley analysts said this week there has been a steady rise in the number of companies reporting quantifiable benefits from AI adoption, based on an analysis of more than 10,000 earnings calls and fourth-quarter conference transcripts. Some 21 per cent of S&P 500 companies mentioned at least one measurable benefit, up from 15 per cent in the third quarter and 10 per cent in the final quarter of 2024. Greater AI use will boost companies' profit margins by 40 basis points this year, they estimate. But until now, most executives and policymakers have been more guarded than Dorsey when talking about AI and jobs. \"What we are seeing for the moment is that it's increasing productivity,\" ECB President Christine Lagarde told a committee of the European Parliament on Thursday.  \"But we are not yet seeing consequences in terms of labour market and waves of redundancies that are feared, and that you know we will be extremely attentive going forward.\" At the World Economic Forum last month, JPMorgan Chase CEO Jamie Dimon said jobs would disappear but new ones would emerge. On Friday, Bank of America global economists Claudio Irigoyen and Antonio Gabriel said AI could ultimately affect a quarter of all jobs. AI shock, they said, will be disruptive for companies that do not survive and for workers who are displaced, but the economy will be better off because it will create new jobs and business opportunities that were previously prohibitive. Michael Ashley Schulman, partner and CIO at Running Point Capital Advisors, warned of unintended consequences from drastic steps like Block's. \"Dorsey's strategy suggests that less is more and that human capital has lost its competitive edge,\" he said. \"The question is whether the company is resetting to its smaller, nimbler startup days or whether it might lose the creativity and human intuition that built its most iconic products in the first place.\"    ",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/dorseys-blunt-ai-warning-sharpens-debate-over-jobs-and-profits-5959481",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5958876:en",
            "title": "OpenAI clinches $840 billion valuation with new funding from Amazon, Nvidia, SoftBank",
            "description": "Feb 27 : OpenAI's latest funding round valued the ChatGPT maker at $840 billion as Big Tech piled into the $110 billion blockbuster round, signaling the AI investment race is alive and well despite recent fears of a valuation bubble.  The funding round - one of the largest private capital raises on record - includes a $30 billion investment from SoftBank, $30 billion from Nvidia, and $50 billion from Amazon. It comes ahead of the AI startup's expected mega-IPO this year, and Wall Street expects more funding rounds before the debut. More investors are expected to join the round as it progresses, OpenAI said in a statement on Friday. FUNDING BOOST AS COMPETITION HEATS UP The infusion will help OpenAI secure advanced AI chips and the computing capacity it needs to maintain its lead position in the AI industry, especially as competition heats up from Anthropic and Alphabet's Google.  It also exacerbates Wall Street concerns about  \"circular\" financing agreements, where firms invest in and sign supply deals with each other, inflating demand and revenue. After years of outsized gains, tech stocks have suffered sharp declines in 2026 as investors question whether AI investments will generate sufficient returns to justify lofty valuations. Nvidia was punished by shareholders this week after the chipmaker said it would pour money into the AI ecosystem, instead of returning cash to shareholders. Nvidia's investment in OpenAI gives the chip company a financial stake in one of its largest customers, tightening their already intertwined relationship. OpenAI said on Friday it would use Nvidia's latest Rubin systems, representing five gigawatts of computing capacity - enough energy to power millions of U.S. households. It was not immediately clear whether Nvidia's $30 billion investment replaced its earlier commitment announced in September under which Nvidia was set to invest up to $100 billion in the startup.  OpenAI and Nvidia did not immediately respond to Reuters' requests for clarification.  With the latest injection, SoftBank's investment in OpenAI is set to be $64.6 billion, representing an ownership interest of about 13 per cent, the Japanese conglomerate said. AMAZON PARTNERSHIP  The new investment is crucial for OpenAI.  The launch of Google's Gemini 3 in November has given the Alphabet-owned company a stronger footing, while Anthropic has cemented its lead in the enterprise AI market with its specialized coding tool. OpenAI, which is yet to turn a profit, is targeting roughly $600 billion in total compute spend through 2030, a source told Reuters last week.  Along with the $50 billion investment, OpenAI and Amazon have also struck a deal in which OpenAI will utilize two gigawatts of computing capacity powered by Amazon's in-house Trainium AI chips. The companies are also expanding their $38 billion cloud deal signed last year, with OpenAI saying it would spend an additional $100 billion on Amazon Web Services over the next eight years. As well, OpenAI will work with Amazon to develop customized models for the e-commerce company's engineering teams. Amazon will start with an initial $15 billion investment, followed by another $35 billion in the coming months when certain conditions are met, the companies said.  AWS will be the exclusive third-party cloud provider for OpenAI Frontier, the ChatGPT maker's enterprise platform for building and running AI agents.  The partnership does not change OpenAI's relationship with Microsoft, with Microsoft Azure still the exclusive cloud provider for OpenAI's APIs that provide access to OpenAI's models, the companies said.  ChatGPT serves more than 900 million weekly active users, OpenAI said, adding that it has surpassed 50 million consumer subscribers. January and February are on track to become the largest months for new subscriber additions, it said.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/openai-clinches-840-billion-valuation-new-funding-amazon-nvidia-softbank-5958876",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5958406:en",
            "title": "India's GDP growth estimated at 7.8% in Oct-Dec following data revamp",
            "description": "NEW DELHI, Feb 27 : India's economy grew 7.8 per cent in October-December from the same period a year earlier, after posting 8.4 per cent growth in the previous quarter, the government said on Friday, as it unveiled a revised series of national output data. For the full fiscal year ending in March, the government expects the South Asian economy to have grown by 7.6 per cent, the National Statistics Office said. It had been forecast to grow by 7.4 per cent under the old data series. Prime Minister Narendra Modi's government has undertaken to revamp economic data, including for inflation and gross domestic product, by expanding the sources of information and updating the base year to 2022-23, among other changes. The adjustments aim to address criticism of outdated data practices and enhance accuracy.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/indias-gdp-growth-estimated-78-in-oct-dec-following-data-revamp-5958406",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5958876:en",
            "title": "OpenAI's $110 billion funding round draws investment from Amazon , Nvidia, SoftBank",
            "description": "Feb 27 : Amazon will invest $50 billion in OpenAI, starting with an initial $15 billion and followed by another $35 billion in the coming months, the companies said on Friday. The investment is part of a massive funding round for OpenAI, which is raising $110 billion in new investment at a pre-money valuation of $730 billion. The round also includes $30 billion from SoftBank and $30 billion from Nvidia. Amazon's cloud computing platform, AWS, will be the exclusive third-party cloud provider for OpenAI Frontier, the ChatGPT maker's enterprise platform for building, deploying and managing AI agents. OpenAI will consume 2 gigawatts of capacity powered by Amazon's in-house Trainium chips to support computing demand, the companies said.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/openais-110-billion-funding-round-draws-investment-amazon-nvidia-softbank-5958876",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5953051:en",
            "title": "Companies cutting jobs as investments shift toward AI",
            "description": "Feb 27 : Investors' and economists' concerns that artificial intelligence will upend established industries are deepening, as Goldman Sachs warned in February that accelerating AI adoption could push U.S. unemployment higher this year, with job losses already emerging in sectors most exposed to automation. Goldman economists estimated in February that the technology was responsible for 5,000 to 10,000 monthly net job losses last year in the most exposed U.S. industries. A survey by global outplacement firm Challenger, Gray & Christmas linked AI to 7 per cent of total U.S. planned layoffs announced in January. Below is a table of AI-linked global layoffs announced since October from biggest to smallest. Entries with no specified number are placed at the bottom. COMPANY MONTH JOB CUTS NOTES ANNOUNCED Amazon January 16,000 Corporate job cuts; AI‑ and efficiency‑driv en overhaul. HP Inc November 4,000-6,00 Global cuts by 0 end-2028; AI and operational streamlining. Mizuho February Up to Cuts over 10 5,000 years; long-term AI‑driven streamlining plan. Dow January 4,500 13 per cent of workforce; automation and AI streamlining. Block February >4,000 Nearly half its workforce; AI‑focused restructuring. SEB February Up to Cuts by 2,100 end-2027; restructuring to leverage AI. Wisetech February 2,000 One-third of global workforce; AI integration. Allianz November Up to Travel 1,800 insurance division; AI replacing manual work. Proximus February 1,200 Cuts by 2030; AI efficiency measures. Meta, Reality January >1,000 Pivot from Labs Metaverse to AI devices. Autodesk January ~1,000 7 per cent of workforce; shift towards cloud and AI. Nike January 775 Profit push and automation. Telstra February 650 AI‑driven restructuring with Infosys. Meta, October ~600 Downsizing in Superintellige AI division. nce Labs Pinterest January Up to 15 per cent Redirecting of resources workforce toward AI strategy. Agora December Up to 166 Nearly 7 per cent of workforce; digital restructuring. MercadoLibre  January 119 AI‑expansion move. British February Not AI‑driven American specified productivity Tobacco programme.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/companies-cutting-jobs-investments-shift-toward-ai-5953051",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5958876:en",
            "title": "Amazon to invest $50 billion in OpenAI",
            "description": "Feb 27 : Amazon will invest $50 billion in OpenAI, starting with an initial $15 billion and followed by another $35 billion in the coming months, the companies said on Friday.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/amazon-invest-50-billion-in-openai-5958876",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5958851:en",
            "title": "Block shares soar as Dorsey leans on AI to trim workforce ",
            "description": "Feb 27 : Block shares soared more than 20 per cent in premarket trading on Friday after it announced it would nearly halve its workforce as part of an overhaul to embed artificial intelligence tools across its operations. The layoffs are the most visible signs of how the U.S. fintech industry is navigating the impact of AI, with its CEO, tech billionaire Jack Dorsey, warning that most companies were \"late\" to realize the emerging technology's potential. \"At its core, it's about how some companies may be run going forward – not just doomsday headcount reductions, but also enabling higher ROI investments in growth and FCF,\" analysts at Evercore ISI wrote, referring to free cash flow. Accelerating AI adoption is helping companies to cut jobs in divisions most exposed to automation. Economists at Goldman Sachs have estimated that AI was responsible for job losses amounting to a 5,000 to 10,000 hit to average monthly job growth in the industries most exposed to it in 2025. Block was one of the companies that aggressively hired during the pandemic as the use of digital payments and online commerce spiked. \"In Block's case, this looks like a mix of AI efficiency gains and an overdue clean-up of corporate bloat,\" said Matt Britzman, an analyst at Hargreaves Lansdown. Its workforce jumped from about 3,800 employees in 2019 to more than 10,000 in 2025 as Block battled increasing pressures from rising competition in its payments and buy-now-pay-later segments. \"While the RIF (reduction in force) is large, it does bring Block's headcount back toward pandemic-era levels, making it a standout in gross profit per employee, well ahead of its peers including Visa,\" JPMorgan analysts said.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/block-shares-soar-dorsey-leans-ai-trim-workforce-5958851",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5958826:en",
            "title": "CoreWeave shares slump as doubling capital expenditure sparks margin concerns",
            "description": "Feb 27 : Shares of CoreWeave slumped around 12 per cent before the bell on Friday, after the company's plans to double capital expenditure this year fueled investor concerns about margin pressure and effective returns from its artificial intelligence push.  The cloud infrastructure company has committed significant capital toward the construction of large data centers filled with top-of-the line Nvidia chips to capitalize on the booming demand for AI services.  CoreWeave has budgeted $30 billion to $35 billion in capital expenditure this year, more than double the $14.9 billion it spent in 2025. The increased spending will put some \"short-term pressure on the margins,\" the company said. The company's ballooning spending mirrors that of hyperscale cloud providers such as Alphabet's Google and Amazon , which have collectively committed more than $600 billion this year for AI infrastructure buildouts.  Unlike Big Tech companies that are cushioned by massive cash reserves, neoclouds like CoreWeave and peer Nebius are more exposed to significant market downturns due to their business models. CoreWeave had $3.13 billion in cash and its equivalents, compared with Microsoft's $24.3 billion and Amazon's $86.8 billion, according to their most recent earnings reports.  Amsterdam-based Nebius earlier this month reported a sharp rise in capital spending to $2.1 billion in the December quarter from just $416 million in the prior year period. Neoclouds offer hardware and cloud capacity as services to other tech firms, usually by providing access to high-quality processors and cloud infrastructure.  Moreover, a rush to build out data centers could put pressure on chip availability. Any disruption to the supply could hamper CoreWeave's infrastructure plans and leave it with a revenue backlog it cannot fulfill. ",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/coreweave-shares-slump-doubling-capital-expenditure-sparks-margin-concerns-5958826",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        }
    ]
}