{
    "data": [
        {
            "id": "entity:node/5957821:en",
            "title": "Poland plans social-media ban for children under 15, Bloomberg News reports",
            "description": "Feb 27 : Poland plans to introduce new legislation to ban social media for children under 15 years of age and will hold platforms responsible for age verification, Education Minister Barbara Nowacka told Bloomberg News in an interview published on Friday. The ruling Civic Coalition will present the draft outline on Friday, with fines planned for platforms that remain accessible to younger users, Nowacka said, adding that the law could take effect by early 2027. \"We see the mental health of children and young people, we see a decline in their intellectual competence,\" said Nowacka adding that the size of penalties that companies would have to pay is still under discussion. Several European governments including Denmark, Greece, France, Spain and Britain have explored similar restrictions amid claims that social-media services are harmful or addictive for minors. The British government said in January it was considering restrictions to protect children online, after Australia implemented similar laws in December. The initiative could put Warsaw at odds with U.S. tech firms such as Meta and Elon Musk's X, some of which have pushed back against restrictions following Australia's ban last year.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/poland-plans-social-media-ban-children-under-15-bloomberg-news-reports-5957821",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5958061:en",
            "title": "Kia America to recall about 85,000 US vehicles over seat back frame issue",
            "description": "Feb 27 : Kia America is recalling 85,448 vehicles in the U.S. over failure of a seat back frame failing to properly restrain an occupant during a crash, the U.S. National Highway Traffic Safety Administration said on Friday.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/kia-america-recall-about-85000-us-vehicles-over-seat-back-frame-issue-5958061",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5957746:en",
            "title": "Indonesian trade surplus widened in Jan to $2.76 billion, Reuters poll shows",
            "description": "JAKARTA, Feb 27 : Indonesia's trade surplus is expected to have widened in January from a month earlier as double-digit growth in exports offset higher imports, a Reuters poll showed on Friday. A dozen economists surveyed by Reuters between February 23 and February 27 forecast a median January trade surplus of $2.76 billion, up from $2.52 billion in December, but down from $3.45 billion in January 2025. The largest economy in Southeast Asia has posted monthly trade surpluses since mid-2020, reaching a peak in April 2022 during a commodities boom. Exports in the first month of 2026 were estimated to have risen 11.07 per cent from a year earlier, a slightly slower pace compared with 11.64 per cent in December. January imports were projected to be 13.23 per cent higher than a year earlier, compared with 10.81 per cent growth in December. On Monday, the government's statistics office will also release consumer price data for February. The poll produced a median forecast for headline inflation of 4.31 per cent, picking up from 3.55 per cent in January. The central bank is targeting an inflation rate of 1.5 per cent to 3.5 per cent in 2026 and 2027. Annual core inflation, which strips out government-controlled and volatile food prices, was estimated at 2.48 per cent in February, up from 2.45 per cent in January, the poll showed. (Polling by Devayani Sathyan; Writing by Stefanno Sulaiman; Editing by Neil Fullick)",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/indonesian-trade-surplus-widened-in-jan-276-billion-reuters-poll-shows-5957746",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5958406:en",
            "title": "India's GDP growth estimated at 7.8% in Oct-Dec following data revamp",
            "description": "NEW DELHI, Feb 27 : India's economy grew 7.8 per cent in October-December from the same period a year earlier, after posting 8.4 per cent growth in the previous quarter, the government said on Friday, as it unveiled a revised series of national output data. For the full fiscal year ending in March, the government expects the South Asian economy to have grown by 7.6 per cent, the National Statistics Office said. It had been forecast to grow by 7.4 per cent under the old data series. Prime Minister Narendra Modi's government has undertaken to revamp economic data, including for inflation and gross domestic product, by expanding the sources of information and updating the base year to 2022-23, among other changes. The adjustments aim to address criticism of outdated data practices and enhance accuracy.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/indias-gdp-growth-estimated-78-in-oct-dec-following-data-revamp-5958406",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5958371:en",
            "title": "Dyson settles Malaysian workers' UK lawsuit",
            "description": "LONDON, Feb 27 : Two dozen migrant workers who alleged they were subjected to forced labour at a Malaysian factory while making parts for British vacuum cleaner manufacturer Dyson have settled their London lawsuit, their lawyers said on Friday. The 24 workers from Nepal and Bangladesh, one of whom has died and whose estate brought the case, sued Dyson Technology Ltd, Dyson Ltd and a Malaysian subsidiary in 2022. The claimants were workers for Malaysian firm ATA Industrial or its sister company and made components for Dyson products. Their lawyers previously said the workers had money unlawfully deducted from their wages and were sometimes beaten for not meeting onerous targets, alleging the Dyson companies were ultimately responsible. Dyson, whose Malaysian subsidiary cancelled its contract with ATA in 2021, denied the claimants' allegations. The lawsuit at London's High Court was settled, the claimants' law firm Leigh Day said in a statement, with no admission of liability by the defendants. \"This resolution was reached in recognition of the expenses of litigation and the benefits of settlement,\" a statement on Leigh Day's website said. \"The defendants deny and have always denied all liability in respect of the claimants, who were employed by a third-party supplier, at factories in Malaysia which were owned and operated by ATA Industrial (M) Sdn Bhd and its related entities.\"",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/dyson-settles-malaysian-workers-uk-lawsuit-5958371",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5958316:en",
            "title": "Netflix, Paramount shares jump as months-long fight for Warner Bros ends",
            "description": "Feb 27 : Netflix jumped more than 9 per cent premarket on Friday as investors cheered its decision to exit the fight for Warner Bros Discovery, while Paramount rose about 10 per cent on winning the race for some of the world's most prized TV and film assets. The end of the months-long bidding war put the focus back on the significant antitrust scrutiny that the Paramount-Warner Bros tie-up would face in the U.S. and Europe, including an active investigation in California. Warner Bros shares were marginally lower. Paramount Skydance maintained its dogged pursuit of Warner Bros, launching a hostile campaign to wrest the prize from Netflix. It managed to lure Warner Bros back to the bargaining table last week, with a revised $31-a-share bid that topped Netflix's $27.75 offer for the studio and streaming assets. Netflix said the price required to stay in the contest had climbed beyond what it considered financially sound, confirming to Reuters that it would withdraw from the takeover battle. \"We've always been disciplined… the deal is no longer financially attractive,\" the company said. \"The bid always looked like a mix of offence and defence – shoring up content and scale, while keeping competition from gaining any edge, but at a very high price,\" said Matt Britzman, senior equity analyst, Hargreaves Lansdown. \"For now, at least, the market seems to be pricing this as a win for everyone.\" In the fight for Warner Bros, the Paramount consortium backed by billionaire Larry Ellison and led by his son, Paramount CEO David Ellison, also boosted its termination fee to $7 billion and expanded its financing commitments, including $45.7 billion in equity. \"In the U.S., we believe Paramount has a good enough relationship with the presidential administration to ease concerns, and the Department of Justice has set a precedent in overlooking the merger of major studios when Disney bought Fox,\" analysts at Morningstar said.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/netflix-paramount-shares-jump-months-long-fight-warner-bros-ends-5958316",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5957101:en",
            "title": "Global shares inch higher, on track for monthly gain despite AI, Iran jitters",
            "description": "TOKYO/LONDON, Feb 27 : Global shares edged up on Friday to within a fraction of a fresh record high, and were set for a monthly gain, even as geopolitical tensions and persistent concerns about AI caused wild swings under the surface. Manish Kabra, head of U.S. equity strategy at SocGen, said in the absence of any major news, the market is refocusing on fundamentals which he described as \"rock solid.\" \"This is on a global basis. When I say fundamental, this is the profit cycle, the growth cycle, the broadening of the growth,\" said Kabra. Global shares rose 0.2 per cent, while Europe's STOXX 600 was up 0.4 per cent, buoyed by positive earnings. Nevertheless, jitters around AI spending and fears about the technology's broader business disruptions, as well as U.S.-Iran tensions, have weighed on sentiment this week. U.S. stock market futures were flashing red during early European trading, with S&P futures off 0.2 per cent while the tech-heavy Nasdaq futures were flat. Tech shares fell on Thursday even as Nvidia posted better-than-expected results for the January quarter and forecast current-quarter revenue above market estimates. \"It seems 'the Street' simply wanted more, or perhaps just isn't prepared to chase the stock at its current lofty valuation,\" IG market analyst Tony Sycamore said about Nvidia's results in a note. Shares in Nvidia down over 5 per cent ended Thursday. IRAN TENSIONS SIMMER Markets were also closely watching the latest developments in U.S. and Iran nuclear talks, as Washington amassed more military resources in the Middle East. An Omani mediator of U.S. and Iran nuclear talks gave an optimistic summary of the latest round of negotiations, but signs of a breakthrough that would avert potential U.S. strikes remained elusive. \"With no major breakthroughs announced in the U.S.–Iran talks, crude markets remained in wait-and-see mode, continuing to price in a significant risk of military escalation between the two countries,\" said Mantas Vanagas, senior economist at Westpac Group. U.S. crude rose 1.4 per cent to $66.16 a barrel, and Brent rose to $71.65, up 1.3 per cent. Spot gold shed 0.15 per cent to $5,178.29 an ounce.  The U.S. and Iran plan to resume negotiations over Tehran's nuclear programme after consultations in their countries' capitals, Omani Foreign Minister Sayyid Badr Albusaidi said in a post on X after the day's meetings in Switzerland.  Any substantial move forward could curb chances for U.S. President Donald Trump to carry out a threatened attack on Iran that many fear could escalate into a wider war. POLITICS ALSO IN FOCUS FOR CURRENCIES The dollar index, which measures the greenback against a basket of currencies, was flat at 97.73, with the euro up 0.07 per cent at $1.1805. The yen was flat 156.16 per dollar. Sterling rose 0.1 per cent to $1.349 after British Prime Minister Keir Starmer's Labour Party suffered an election defeat in an area of Greater Manchester that it had dominated for almost a century. The yield on benchmark U.S. 10-year notes fell 2.6 basis points to 3.99 per cent. Data in Japan showed cooling inflation in Tokyo and weaker-than-expected factory output, complicating the case for policy rate increases by the central bank. The data came on the heels of Prime Minister Sanae Takaichi putting forward two Bank of Japan board nominees who share her dovish mindset.  Japanese Finance Minister Satsuki Katayama signalled heightened vigilance over currency moves, telling parliament the government is monitoring the yen's recent drop with a strong sense of urgency.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/global-shares-inch-higher-track-monthly-gain-despite-ai-iran-jitters-5957101",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5957401:en",
            "title": "Japan finance minister signals greater vigilance over the yen's weakness",
            "description": "TOKYO, Feb 27 : Japanese Finance Minister Satsuki Katayama on Friday signalled heightened vigilance over currency moves, telling parliament the government is monitoring the yen's recent slide with a strong sense of urgency. \"We are watching recent movements very closely, with a strong sense of urgency,\" Katayama told parliament, when asked if the yen's depreciation may be hampering wage growth by pushing up import costs. \"We are also maintaining extremely close communication with the United States, and will continue engaging in dialogue to ensure that the concerns you raise do not materialise,\" she said.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/japan-finance-minister-signals-greater-vigilance-over-yens-weakness-5957401",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5958276:en",
            "title": "Petronas sees profit slide for third straight year as oil prices weigh on margins",
            "description": "KUALA LUMPUR, Feb 27 : Malaysian state energy firm Petroliam Nasional Bhd , on Friday warned of eroding margins amid persistent geopolitical and economic risks, as subdued oil prices saw its profits decline for the third straight year. Petroliam Nasional, or Petronas, reported a profit after tax of 45.4 billion ringgit  ($11.68 billion) in 2025 compared to 55.1 billion ringgit in 2024, while revenue fell to 266.1 billion ringgit ($68.44 billion) from 320 billion ringgit over the same period. Chief Executive Officer Tengku Muhammad Taufik Tengku Aziz said the decline was in line with industry peers, with oil prices falling amid oversupply concerns and macroeconomic challenges.  \"We have seen margin erosion manifest in our results, but we will see this come under more pressure as cost inflation converges with prices softening,\" he told a press conference.   PETRONAS TO FOCUS ON RESILIENCE The firm would focus on building resilience by strengthening its core hydrocarbons portfolio, as well as grow new businesses and manage emissions moving forward, he said. Petronas is a significant source of revenue for Malaysia's government, its sole shareholder, contributing billions to public coffers annually.  The company paid the government 32 billion ringgit in dividends last year. Muhammad Taufik said Petronas expects to pay 20 billion ringgit this year - the lowest since 2017 - reflecting a need for the firm to ensure sufficient cash flow.  \"(The dividend) is always going to be governed by our affordability,\" he said. Petronas last year embarked on a \"right-sizing\" exercise, aiming to cut about 5,000 employees to ensure its long-term survival. Muhammad Taufik said on Friday the process was expected to conclude by August.  Crude oil prices were expected to trade rangebound between $65-$70 per barrel over the next five years, with the firm allocating 2 billion ringgit annually for exploration in the same period, Petronas said.    Capital investments slipped to 41.6 billion ringgit in 2025 compared to 54.2 billion ringgit in 2024, the company said. Petronas' upstream business saw a decline in post-tax profit to 26.2 billion ringgit in 2025. Its gas and maritime business saw profit rise to 20.9 billion ringgit, while its downstream segment posted a loss after tax of 1.9 billion ringgit. Petronas reported a 2.2 per cent increase in carbon emissions in 2025 to 56.95 million tons of carbon dioxide equivalent emissions, attributed mainly to the transfer of operations for two production sharing contracts. The firm also reported a 72 per cent reduction in methane emissions, exceeding its target of 50 per cent.  ($1 = 3.8880 ringgit)",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/petronas-sees-profit-slide-third-straight-year-oil-prices-weigh-margins-5958276",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5957651:en",
            "title": "What AI windfall? Debt will still weigh on big economies",
            "description": "LONDON, Feb 27 : An AI productivity boom, if it materialises, may help buy major economies more time to clean up their strained public finances, economists say, although it won't do the heavy lifting. The stakes couldn't be higher. Debt is above 100 per cent of output across most rich economies and set to rise given ageing population costs, interest bills and pressure to spend more on defence and climate change. U.S. policymakers are already optimistic on AI-driven growth and economists say the technology has the potential to shake the world out of a post-2008 productivity slump by boosting workers' efficiency and freeing them to focus on more productive tasks. Higher economic growth would make government spending and debt loads potentially more manageable and help fend off scrutiny from bond vigilantes. To sketch the impact on public finances if AI does boost labour productivity over the long term, the OECD and three high- profile economists shared early estimates with Reuters. Filiz Unsal, the OECD's deputy director of economic policy and research, said an AI productivity surge, were it to increase employment, would lower debt across OECD countries, from the U.S. to Germany and Japan, by 10 per centage points from the roughly 150 per cent of output the organisation expects in 2036. That would still be a sharp rise from 110 per cent currently. Much will depend on whether job creation eventually outweighs any job losses from automation, as well as whether firms pass on higher profits by raising wages and how governments manage their overall spending. In the United States, two of the other economists projected debt rising more slowly to roughly 120 per cent over the next decade from around 100 per cent of output now in their best-case scenarios. One saw little change. \"Productivity is like magic... It helps the fiscal dynamics dramatically,\" said Idanna Appio, one of the economists, who was previously at the New York Federal Reserve and is now a fund manager at First Eagle Investment Management. \"But our fiscal problems are well beyond what productivity can fix,\" Appio said. DEMOGRAPHICS TO LIMIT AI IMPACT For now, ratings agency S&P assumes no major public finance impact by the end of the decade. \"The one (path) that the (U.S.) administration is hoping for would be you get saved by the bell,\" said Mark Patrick, head of macro and country risk at Teachers Insurance and Annuity Association of America, but added: that isn't \"something we can set our clocks by.\" The economists did not provide estimates for other countries. However, AI could boost productivity in Britain in line with the U.S., but by half as much in Italy and Japan due to lower adoption rates and smaller sectors that could benefit from AI, OECD research has found. Ultimately, fiscal dynamics will determine how much AI-driven productivity can counterbalance rising debt. Demographics is the biggest challenge. \"The root of the debt issue is with ageing demographics and the entitlements that are tied to that,\" said Kevin Khang, who heads global economic research at Vanguard, the world's second- largest asset manager. Addressing it \"requires getting the fiscal house in order and (AI is) just buying us the time,\" he said. Khang sees a scenario where AI boosts U.S. growth to average 3 per cent through 2040 as most likely. The Fed sees potential growth around 2 per cent. He estimates higher growth and tax revenues would slow U.S. debt growth to around 120 per cent of output by the late 2030s. That's much lower than the 180 per cent he foresees - higher than others - if AI disappoints, growth slows and market pressure raises borrowing costs. Bond investors have been quick to punish governments for fiscal largesse ever since bond yields rose sharply after the pandemic across rich economies. Appio said declining U.S. immigration added to the demographic challenge. \"The labour shock offsets any (AI) productivity growth,\" she said, but added she would be much more worried without AI. UNCERTAINTY AROUND TAX, SPENDING Economy-wide productivity gains should raise revenues. But if AI reduces employment or competition, and profits and capital - often taxed less than labour - see most benefit, revenues could disappoint. On the spending side, public sector efficiency gains could help costs, but the risk is spending rising alongside growth. That's why Kent Smetters, director of the University of Pennsylvania's Penn Wharton Budget Model analysis group, expects a tiny impact on U.S. debt in a decade. Even if growth is higher than he currently expects, that would still have little impact on curbing social security, which makes up a fifth of federal spending, because claims are indexed to average wages, Smetters said. Other labour costs the government covers would also rise if productivity raises private sector wages, he added. \"It's very important to see whether wages are going to increase,\" the OECD's Unsal said, adding that wage growth was more likely if AI doesn't increase employment. There are of course debt costs, which will depend on whether productivity raises real interest rates, a debate already emerging at the Fed, and how long growth outpaces any rise, economists said. Clearly, they don't have crystal balls. A shock could quickly upend this debate. A recession could mean \"the AI boom may not come quick enough before the market gets nervous about the fiscal trajectory,\" said Barclays' global head of economics research Christian Keller.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/what-ai-windfall-debt-will-still-weigh-big-economies-5957651",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5957371:en",
            "title": "NTT Data to boost India headcount by 5,000 this year, exec says",
            "description": "Feb 27 : Japanese technology firm NTT Data plans to raise its India headcount by 5,000 employees this year across software programming, consulting and IT support, a senior executive told Reuters.         Large IT contracts of more than $100 million have doubled in the last 12 months, with deals stemming from manufacturing, logistics and public sector, Sudhir Chaturvedi, chief growth officer and CEO of North America, said on Tuesday. \"North America is back to growth, and we expect strong growth next financial year.\"       The company, a subsidiary of telecom giant NTT Group, is building out four data centers in India as part of a $1.5 billion investment and currently employs 40,000 in the country. Global and local firms are increasingly looking to boost data center capacities in Asia's third-largest economy. India hosts 20 per cent of the world's data but has less than 6 per cent of global data center capacity, according to ratings agency ICRA, making investments in the sector an attractive bet. The government has granted a tax holiday for foreign companies using local data centers. Chaturvedi said clients' tech budgets are expected to rise 7 per cent to 9 per cent this year on account of investments beyond AI compared to 6 per cent to 7 per cent last year. ",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/ntt-data-boost-india-headcount-5000-year-exec-says-5957371",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5957361:en",
            "title": "Exclusive-Nintendo plans around $1.9 billion share sale by Kyoto bank and others, sources say",
            "description": "TOKYO, Feb 27 : Nintendo plans an unwinding of strategic shareholdings that would see companies including MUFG Bank and the Bank of Kyoto selling shares of the \"Super Mario\" maker, according to three sources familiar with the situation. The sale is expected to total roughly 300 billion yen ($1.9 billion) and Nintendo could make a decision as soon as Friday, two of the sources said. The Kyoto-based gaming company also plans a buyback, the sources said. Reuters is reporting Nintendo's plan for the first time. Nintendo did not respond to a request for comment. The sources declined to be identified as the information is not public. Nintendo's shares pared gains and were up 2.4 per cent. Both banks have set out policies to reduce cross-shareholdings. A 2019 sale of Nintendo's shares, in which they and others participated, totalled some 71 billion yen. The Bank of Kyoto, a regional lender, held a 4.19 per cent stake in Nintendo as of September last year. MUFG Bank, Japan's largest, had a 3.62 per cent stake, which is held by a trust bank. Mitsubishi UFJ Financial Group declined to comment and Kyoto Financial Group did not respond to a request for comment. Kyoto Financial's shares jumped 9 per cent. Regulators and the Tokyo Stock Exchange have been encouraging Japanese companies to unwind their cross-shareholdings. Toyota is planning an unwinding of strategic shareholdings that would involve banks and insurers selling around $19 billion of its shares, Reuters reported on Thursday. The practice, which involves firms holding shares in each other to cement business ties, has been criticised by governance experts and overseas investors as insulating management from shareholders. Although the practice has been widespread in Japan for decades, it is less common in the West.    ($1 = 156.0200 yen)",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/exclusive-nintendo-plans-around-19-billion-share-sale-kyoto-bank-and-others-sources-say-5957361",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5957081:en",
            "title": "Oil heads for weekly decline as US and Iran extend talks",
            "description": "LONDON, Feb 27 : Oil prices rose on Friday but remained on track for a weekly decline after the United States and Iran extended nuclear talks, easing concern over potential hostilities that could disrupt supply, while OPEC+ could raise output at its meeting on Sunday. Brent crude futures rose 28 cents, or 0.4 per cent, to $71.03 a barrel by 0845 GMT while U.S. West Texas Intermediate crude was up 42 cents, or 0.6 per cent, at $65.63. For the week, Brent was heading for a 1 per cent decline while WTI was on track for a 1.1 per cent drop, reversing some of the previous week's gains. \"Uncertainty prevails, fear is pushing prices slightly higher today,\" said Tamas Varga, an oil analyst at brokerage PVM. \"It is completely driven by the outcome of the Iranian nuclear talks and possible military action the U.S. might take against Iran.\" The United States and Iran held indirect talks in Geneva on Thursday after U.S. President Donald Trump ordered a military build-up in the region.  Oil prices gained more than a dollar a barrel during the talks on media reports indicating that discussions had stalled over U.S. insistence on zero enrichment of uranium by Iran. However, prices eased after the Omani mediator said the two sides had made progress in the talks. They plan to resume negotiations with technical-level discussions scheduled next week in Vienna, Omani Foreign Minister Sayyid Badr Albusaidi said on X. \"We think the latest round of talks offers some hope on chances of a peaceful resolution, but military strikes are in no way out of the equation,\" said DBS analyst Suvro Sarkar.  Geopolitical risk premiums of $8 to $10 a barrel have built in oil prices on fears that a conflict will disrupt Middle East supply through the Strait of Hormuz, where about 20 per cent of global oil supply passes, Sarkar said. To cushion the impact from a possible strike, Saudi Arabia is increasing oil production and exports, two sources familiar with the plans told Reuters. Producer group OPEC+, meanwhile, is likely to consider raising oil output by 137,000 barrels per day for April at its March 1 meeting, sources said, after suspending production increases in the first quarter.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/oil-heads-weekly-decline-us-and-iran-extend-talks-5957081",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5958101:en",
            "title": "Insta360 maker says it will import, sell products in US 'without restrictions' after USITC ruling",
            "description": "BEIJING, Feb 27 : Shenzhen-based Arashi Vision, which makes the Insta360 line of camera products, on Friday said it \"will continue to import and sell existing products in the U.S. without restrictions\" after a final ruling by USITC. California-based action camera maker GoPro had in 2024 claimed patents for its cameras, systems and accessories are being violated by Arashi Vision importing similar products into the United States. The U.S. International Trade Commission then launched an investigation under Section 337 of the Trade Act of 1930 into Arashi Vision and its U.S. subsidiary. The USITC published its final ruling on Thursday. The probe has concluded and has caused \"no substantial impact on the company's production and operations,\" Arashi Vision said in a filing to the Shanghai stock exchange on Friday.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/insta360-maker-says-it-will-import-sell-products-in-us-without-restrictions-after-usitc-ruling-5958101",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5958111:en",
            "title": "Exclusive-Indonesia bourse to phase in 15% free-float rule, may batch firms by readiness",
            "description": "JAKARTA, Feb 27 : The Indonesia Stock Exchange will implement in stages an upcoming requirement for companies to double their minimum free float, or freely tradable stocks, to 15 per cent, its interim chief executive told Reuters on Friday. The bourse may divide companies into batches according to their readiness to offer more stocks, giving each batch a year to comply with the minimum free float level, Jeffrey Hendrik said in an interview, adding the details were still subject to approval by the Financial Services Authority. The comments are the clearest details authorities have given about the plan to increase the mandatory free float, among a raft of capital‑market reforms pledged since MSCI in late January warned Indonesia risked being downgraded to frontier market status as early as May over limited transparency that may have enabled price manipulation.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/exclusive-indonesia-bourse-phase-in-15-free-float-rule-may-batch-firms-readiness-5958111",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        }
    ]
}