{
    "data": [
        {
            "id": "entity:node/5955461:en",
            "title": "Instagram to alert parents on teen suicide searches as UK weighs social media ban ",
            "description": "LONDON, Feb 26 : Instagram said it would notify parents if their teenager repeatedly searches for terms related to suicide or self-harm within a short period, as pressure grows for governments to follow Australia's ban on the use of social media for under 16s. Britain said in January it was considering restrictions to protect children online, after Australia's move in December. Spain, Greece, and Slovenia have in recent weeks said they are also looking at limiting access. Instagram, owned by Meta Platforms Inc, said on Thursday it would start alerting parents who are signed up to its optional supervision setting if their children try to access suicide or self-harm content. \"These alerts build on our existing work to help protect teens from potentially harmful content on Instagram,\" the platform said in a statement. \"We have strict policies against content that promotes or glorifies suicide or self-harm.\" Its existing policy is to block such searches and redirect people to support resources, Instagram said, adding that it would begin the alerts from next week for those signed up in the United States, Britain, Australia and Canada. Governments are increasingly seeking to protect children from harm online, particularly after worries over the AI chatbot Grok which has generated non-consensual sexualised images. In Britain, measures designed to stop access to pornography sites for children have had implications for adults' privacy, and have led to tension with the U.S. over limits on free speech and regulatory reach. Instagram's \"teen accounts\" for under 16s need a parent's permission to change settings, while parents can select an extra layer of monitoring with the agreement of their teenager.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/instagram-alert-parents-teen-suicide-searches-uk-weighs-social-media-ban-5955461",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5955306:en",
            "title": "Norway's wealth fund using AI to screen for ESG risks",
            "description": "OSLO, Feb 26 : Norway's $2.2 trillion sovereign wealth fund, the world's largest, is using AI to screen companies for risks such as potential links to forced labour and corruption, and help avoid financial losses as a result, it said on Thursday. One of the world's largest investors, the fund holds stakes in around 7,200 companies globally, owning about 1.5 per cent of all listed stocks. It has often set the pace on environmental, social and governance issues. The fund's investments are measured against a benchmark index set by the finance ministry, with equities tracked against the FTSE Global All Cap index. Each time that index includes new companies, the fund's operator, Norges Bank Investment Management (NBIM), must screen them before they enter the portfolio. Since 2025, NBIM has used large language models to screen all companies on the day they enter the equity portfolio, rapidly scanning for public information that data vendors typically do not provide. \"Within 24 hours of our investment, the AI tools flag new companies in the fund's equity portfolio with potential links to, for example, forced labour, corruption or fraud,\" NBIM said in its annual responsible investment report, published on Thursday. \"In multiple instances, we identified and sold these investments before the broader market reacted to the risks, avoiding potential losses.\" AI is especially useful for researching smaller companies in emerging markets, NBIM said, noting that data vendors often offer limited coverage and international media may not report on them. \"News may be limited to small media outlets in local languages, and controversies suggesting systemic failures in risk management may go unreported in international media,\" it said.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/norways-wealth-fund-using-ai-screen-esg-risks-5955306",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5955246:en",
            "title": "Musk touts California robotaxis but Tesla does nothing to get permits",
            "description": "LOS ANGELES, Feb 26 : For more than a year, Elon Musk has repeatedly said Tesla is months away from launching a driverless robotaxi service in California – once state regulators give their blessing. Tesla did nothing to secure that approval in 2025, according to previously unreported state Department of Motor Vehicles records and a state spokesperson. Tesla logged zero miles of autonomous test driving on California roads last year for the sixth year in a row, the records show. Documenting test miles is critical in California’s regulatory system for robotaxis, which requires companies to progress through a series of permits before being allowed to operate a driverless ride-hailing service such as Alphabet's Waymo. Much of Tesla’s $1.5 trillion market value is tied to investors’ belief that it will soon operate a vast fleet of robotaxis and sell millions of autonomous-driving software subscriptions. Operating driverless vehicles in California – the largest U.S. auto market – is a linchpin of those ambitions. Bryant Walker Smith, a University of South Carolina law professor and autonomous-driving expert who has consulted for the California DMV, said Tesla is implying that “they are ready and regulators are not,” while the reality is that “regulators are ready, and they are not.” Tesla did not respond to requests for comment. On an earnings call in October, Musk told analysts that the company is \"paranoid about safety\" and that it takes a \"cautious approach\" to new markets. \"We probably could just let it loose in these cities,\" he said, \"but we just don't want to take a chance.\" So far, Tesla operates only a small pilot robotaxi service in Austin, Texas, which has far fewer regulatory barriers than California. In the San Francisco Bay Area, the company last July started operating what it called a “robotaxi” service that was not a robotaxi service at all. Instead, it is a chauffeur service with human drivers who use Tesla’s “Full Self-Driving” driver-assistance software, which is not fully autonomous, according to the state regulator authorizing the service and Tesla’s disclosures to customers. In order to operate fully self-driving vehicles in California, like Waymo, Tesla would first need to obtain permits to test and operate driverless vehicles from the state's DMV and Public Utilities Commission, which regulates commercial ride-hailing. Tesla so far has only the entry-level DMV permit, which allows testing driverless vehicles only with a human safety monitor in the driver’s seat. A DMV spokesperson said Tesla has not applied for any additional permits. Tesla would need to log at least 50,000 miles (80,467 km) of autonomous driving on public roads in California with a safety driver before applying for a different permit allowing testing without one, according to proposed DMV regulations expected to be finalized later this year. Tesla has not logged any miles with state regulators since 2019 and has documented only 562 miles in total since 2016.  Waymo, by comparison, logged more than 13 million testing miles and secured seven different regulatory approvals between 2014 and 2023, when it received approval to charge passengers for rides in driverless robotaxis. Waymo is one of three companies with California permits to commercially operate driverless vehicles and the only one approved to operate a robotaxi fleet anything like what Musk envisions. In written comments last year, Tesla criticized some of the California DMV's proposed revisions to autonomous-driving rules, questioning the need for testing on state roads and minimum-mile requirements. The company also complained about \"overly burdensome reporting requirements\" for crashes and other system failures. Musk has often suggested California regulations are the main impediment to deploying robotaxis there. On an October 2024 earnings call, he said California has “quite a long regulatory approval process.” “I’d be shocked if we don’t get approved next year,” he added, “but it’s just not something we totally control.”",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/musk-touts-california-robotaxis-tesla-does-nothing-get-permits-5955246",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5955271:en",
            "title": "Amazon refused permission to appeal go-ahead for UK lawsuits from retailers, consumers",
            "description": "LONDON, Feb 26 : Amazon on Thursday lost its latest bid to try to throw out two mass lawsuits from retailers and consumers worth up to 4 billion pounds ($5.41 billion) for allegedly abusing its dominant position. Andreas Stephan, a competition law academic, brought one of the cases on behalf of over 200,000 third-party retailers, worth up to 2.7 billion pounds. His lawyers allege that Amazon manipulates the \"Buy Box\" feature on its website to its own advantage and favours products that use Amazon's own logistics centres and delivery network. Consumer advocate Robert Hammond separately brought a case valued at up to 1.3 billion pounds on behalf of millions of Amazon customers for similar alleged abuses of dominance. Amazon has previously said the claims are without merit. It had argued the cases should not be certified to proceed, an early step in the proceedings, including because the economic methodology for proving the cases was flawed. The Competition Appeal Tribunal last year certified both cases on an opt-out basis, meaning members of the claimant class would be part of the case unless they decide otherwise. Amazon sought permission to appeal against that decision, but the Court of Appeal refused permission on Thursday. Amazon did not immediately respond to a request for comment. ($1 = 0.7390 pounds)",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/amazon-refused-permission-appeal-go-ahead-uk-lawsuits-retailers-consumers-5955271",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5955266:en",
            "title": "US stock futures waver as Nvidia's blockbuster results draw muted response",
            "description": "Feb 26 : U.S. stock index futures were muted on Thursday as Nvidia's stellar quarterly results garnered a lukewarm response from investors and downbeat earnings from software company Salesforce weighed on sentiment. Nvidia inched 0.6 per cent higher in premarket trading after the chipmaker posted better-than-expected results for the January quarter and forecast current-quarter revenue above market estimates. \"The needle has clearly shifted when it comes to what its going to take to convince investors that the billions being poured into AI infrastructure will pay off,\" said Raffi Boyadjian, lead market analyst at Trading Point. \"Markets are now moving into a phase where they want to see tangible results of AI monetization before pushing AI stocks above their recent ranges.\" Most megacap and growth stocks including Apple and Microsoft were trading in the flat-to-lower band. At 05:51 a.m. ET, Dow E-minis were down 53 points, or 0.11 per cent, S&P 500 E-minis were down 6.25 points, or 0.09 per cent, and Nasdaq 100 E-minis were down 27 points, or 0.11 per cent. Salesforce shed 3.1 per cent after the cloud software provider forecast fiscal 2027 revenue below expectations, signaling sluggish spending on enterprise business software. Results from software-related companies could garner extra attention this earnings season given the S&P 500 software and services index has dropped nearly 21 per cent so far this year as concerns of AI-related disruptions hit the sector. While software has been one of the worst hit, financial brokerage, data analytics and legal services, real estate services and trucking are some other sectors that clocked heavy losses amid growing AI disruption fears earlier this year. February has been a choppy month for U.S. equities, with the main indexes swinging sharply between gains and losses as sentiment towards AI and technology stocks waver, with investors questioning if massive planned AI spending is actually paying off. The S&P 500 and the Nasdaq closed at two-week highs on Wednesday, fueled by a rally in heavyweight technology stocks. Media company Warner Bros Discovery, Skippy peanut butter maker Hormel Foods and utility Vistra are some of the prominent companies reporting earnings before the bell on Thursday. A weekly jobless claims reading is due later in the day and January producer prices data is scheduled for release on Friday. Among other stocks, Trade Desk dropped 16.9 per cent after the advertising technology firm forecast first-quarter revenue below estimates amid mounting pressure from larger rivals. C3.ai slipped 22.7 per cent after the software provider forecast current-quarter sales below estimates and said it was cutting 26 per cent of its global workforce. Shares of energy companies including Exxon Mobil and Chevron were down around 0.4 per cent each, tracking lower crude oil prices as investors assessed whether U.S.-Iran talks could avert a military conflict that risks supply disruptions.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/us-stock-futures-waver-nvidias-blockbuster-results-draw-muted-response-5955266",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5955261:en",
            "title": "Deutsche Telekom CEO criticises EU telecom rules overhaul",
            "description": "Feb 26 : Deutsche Telekom chief executive Timotheus Hoettges expressed dissatisfaction with how the European Union is handling the reform of telecommunication sector rules and called for more deregulation. \"We're seeing more and more red tape, more requirements,\" he said during a press conference after the publication of the company's fourth-quarter results. Following several months of pressure from European telecom companies, the European Commission unveiled in January a major revamp of the sector rules known as the Digital Networks Act. The proposal would allow operators to use radio spectrum for an unlimited duration, a move which would increase predictability and favour investments, the Commission said. However, it did not meet the European operators' call for U.S. tech giants such as Google, Netflix and Meta to pay a network fee in light of their massive traffic, opting for a voluntary cooperation mechanism.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/deutsche-telekom-ceo-criticises-eu-telecom-rules-overhaul-5955261",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5954381:en",
            "title": "Nvidia's CEO prepares investors for a renewed battle with Intel, AMD ",
            "description": "SAN FRANCISCO, Feb 25 : Nvidia may have made its immense fortune on the back of specialized graphics processing units (GPUs) used to power artificial intelligence servers, but CEO Jensen Huang is increasingly professing his love for the more generalist CPU. The CPU, or central processing unit, was for decades traditionally viewed as the main brain of a computer - a product most associated with Intel or sometimes Advanced Micro Devices. Huang is fond of saying that where once 90 per cent of computing used to happen on CPUs and 10 per cent on chips like his, the ratio had flipped in recent years. But the CPU is now making a comeback - increasingly seen as an equivalent if not better option as AI companies shift from training their models to deploying them - a shift that Nvidia plans to be a big part of. \"We love CPUs as well as GPUs,\" Huang said on a call with analysts on Wednesday for the company's fourth-quarter results. He assured them that Nvidia was not only ready for the CPU's return to the spotlight, but also that Nvidia's own CPU offerings for data centers, first released in 2023, would outcompete rivals. Last month, at the Consumer Electronics Show in Las Vegas in January, Huang also said the number of high-performance Nvidia CPUs being used in data centers would explode and that he wouldn't be surprised \"if Nvidia becomes one of the largest CPU makers in the world.\" THE CPU VERSUS THE GPU CPUs and GPUs have served different computing tasks for decades. CPUs are generalist chips designed to handle any mathematical task a software programmer might throw at the chip at reasonable speed, given the variety of work. GPUs, by contrast, specialize in carrying out a simpler set of mathematical tasks, but doing those simple calculations in parallel thousands of times at once. In video games that meant calculating the value of thousands of pixels on a screen many times a second, and in AI work that means multiplying and adding large matrices of numbers that developers use to represent real-world data such as words and images. AI companies are increasingly deploying \"agents\" that can independently carry out tasks such as writing code, sifting through documents and writing research reports - and that sort of computing \"is happening more and more, and sometimes primarily, on the CPU,\" said Ben Bajarin, an analyst at Creative Strategies. Nvidia's current flagship AI server - called the NVL72 - contains 36 of its CPUs and 72 of its GPUs. Bajarin thinks that could change to a 1 to 1 ratio for so-called agentic work or even that the GPU could be skipped altogether. NVIDIA OUT TO PROVE A POINT Underscoring its CPU ambitions, Nvidia recently announced a deal with Meta Platforms that will see the Facebook owner use large volumes of its Grace and Vera CPU chips on a standalone basis. That's a relatively new development compared to Nvidia's current AI servers where each CPU is accompanied by multiple GPUs. Though it's not that Meta has switched vendors for CPUs - it's just securing more suppliers. Days later, AMD also announced a large deal with Meta that also included its CPUs, which Meta has been buying for years. On the call with analysts, Huang argued that Nvidia had taken a fundamentally different approach to CPUs. He outlined why Nvidia had minimized an approach to breaking up chips into smaller parts that Intel and AMD have used, saying the Nvidia CPU was able to carry out many simple tasks in a row with good access to a lot of computer memory. \"It is designed to be focused on very high data processing capabilities,\" Huang said on the call. \"And the reason for that is because most of the computing problems that we're interested in are data driven - artificial intelligence being one.\" Dave Altavilla, principal analyst at HotTech Vision and Analysis, said Nvidia is aiming to prove that the CPU type once supplied primarily by Intel \"is no longer the assumed default foundation of modern compute infrastructure. Instead, it becomes just one architectural option among several.\" Huang said that Nvidia would have more to disclose about its CPUs at the company's annual developer conference in Silicon Valley next month. ",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/nvidias-ceo-prepares-investors-renewed-battle-intel-amd-5954381",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5954591:en",
            "title": "Apple in talks with banks to start payment service in India, Bloomberg News reports",
            "description": "Feb 26 : Apple is in talks with several Indian banks and global card networks as it prepares to launch its Apple Pay service in India, Bloomberg News reported on Thursday, citing people familiar with the matter.  The iPhone maker is in talks with ICICI Bank, HDFC Bank and Axis Bank, as it aims to introduce its payment service in India around the middle of 2026, the report said.  Reuters could not immediately verify the report. ",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/apple-in-talks-banks-start-payment-service-in-india-bloomberg-news-reports-5954591",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5954381:en",
            "title": "Analysis:Nvidia's CEO prepares investors for a renewed battle with Intel, AMD ",
            "description": "SAN FRANCISCO, Feb 25 : Nvidia may have made its immense fortune on the back of specialized graphics processing units (GPUs) used to power artificial intelligence servers, but CEO Jensen Huang is increasingly professing his love for the more generalist CPU. The CPU, or central processing unit, was for decades traditionally viewed as the main brain of a computer - a product most associated with Intel or sometimes Advanced Micro Devices. Huang is fond of saying that where once 90 per cent of computing used to happen on CPUs and 10 per cent on chips like his, the ratio had flipped in recent years. But the CPU is now making a comeback - increasingly seen as an equivalent if not better option as AI companies shift from training their models to deploying them - a shift that Nvidia plans to be a big part of. \"We love CPUs as well as GPUs,\" Huang said on a call with analysts on Wednesday for the company's fourth-quarter results. He assured them that Nvidia was not only ready for the CPU's return to the spotlight, but also that Nvidia's own CPU offerings for data centers, first released in 2023, would outcompete rivals. Last month, at the Consumer Electronics Show in Las Vegas in January, Huang also said the number of high-performance Nvidia CPUs being used in data centers would explode and that he wouldn't be surprised \"if Nvidia becomes one of the largest CPU makers in the world.\" THE CPU VERSUS THE GPU CPUs and GPUs have served different computing tasks for decades. CPUs are generalist chips designed to handle any mathematical task a software programmer might throw at the chip at reasonable speed, given the variety of work. GPUs, by contrast, specialize in carrying out a simpler set of mathematical tasks, but doing those simple calculations in parallel thousands of times at once. In video games that meant calculating the value of thousands of pixels on a screen many times a second, and in AI work that means multiplying and adding large matrices of numbers that developers use to represent real-world data such as words and images. AI companies are increasingly deploying \"agents\" that can independently carry out tasks such as writing code, sifting through documents and writing research reports - and that sort of computing \"is happening more and more, and sometimes primarily, on the CPU,\" said Ben Bajarin, an analyst at Creative Strategies. Nvidia's current flagship AI server - called the NVL72 - contains 36 of its CPUs and 72 of its GPUs. Bajarin thinks that could change to a 1 to 1 ratio for so-called agentic work or even that the GPU could be skipped altogether. NVIDIA OUT TO PROVE A POINT Underscoring its CPU ambitions, Nvidia recently announced a deal with Meta Platforms that will see the Facebook owner use large volumes of its Grace and Vera CPU chips on a standalone basis. That's a relatively new development compared to Nvidia's current AI servers where each CPU is accompanied by multiple GPUs. Though it's not that Meta has switched vendors for CPUs - it's just securing more suppliers. Days later, AMD also announced a large deal with Meta that also included its CPUs, which Meta has been buying for years. On the call with analysts, Huang argued that Nvidia had taken a fundamentally different approach to CPUs. He outlined why Nvidia had minimized an approach to breaking up chips into smaller parts that Intel and AMD have used, saying the Nvidia CPU was able to carry out many simple tasks in a row with good access to a lot of computer memory. \"It is designed to be focused on very high data processing capabilities,\" Huang said on the call. \"And the reason for that is because most of the computing problems that we're interested in are data driven - artificial intelligence being one.\" Dave Altavilla, principal analyst at HotTech Vision and Analysis, said Nvidia is aiming to prove that the CPU type once supplied primarily by Intel \"is no longer the assumed default foundation of modern compute infrastructure. Instead, it becomes just one architectural option among several.\" Huang said that Nvidia would have more to disclose about its CPUs at the company's annual developer conference in Silicon Valley next month. ",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/analysisnvidias-ceo-prepares-investors-renewed-battle-intel-amd-5954381",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5955136:en",
            "title": "Threat to large IT firms 'overblown', Cognizant's AI chief says amid Anthropic-driven disruption",
            "description": "MUMBAI, Feb 26 : Fears that new artificial intelligence tools could replace large IT services firms are \"overblown\" as clients still need help deploying and scaling the technology, Babak Hodjat, chief AI officer at Cognizant, told Reuters in an interview.  Automated AI tools from startups such as Anthropic have stirred concerns about disruption in the business models of software and services firms globally, including India's traditionally labour-intensive IT services industry. Enterprises are far from being able to rely on a single, all-purpose AI agent, said Hodjat, adding that most clients still need help engineering, integrating, and governing AI systems. \"That mapping is our job, it does not come just automatically out of the box,\" said Hodjat, whose work helped power Apple's Siri voice assistant. Nasdaq-listed Cognizant, which has more than 70 per cent of its workforce operating out of India, forecast annual revenue above Wall Street estimates on the back of strong demand as businesses adopt AI into their workflows. Rivals Tata Consultancy Services and Wipro have also maintained that rapid AI adoption will boost, rather than shrink, demand for software service providers. Hodjat's vote of confidence in the role of services companies comes despite AI-related job cuts already underway. Shipping and logistics management software company WiseTech Global said it would lay off nearly a third of its workforce as it integrates AI into its customer software and internal operations. TCS announced 12,000 job cuts last year, but has since denied to local media that the layoffs were AI-related. Cognizant, which generates about 30 per cent of its code through AI and aims to reach 50 per cent, is not worried about automation eliminating entry-level jobs. CEO Ravi Kumar S said during the company's earnings call earlier this month that it hired 25,000 fresh graduates in 2025, and expects to exceed that in 2026. Almost all of Cognizant's clients have already tried to work with AI agents, Hodjat said, but have acknowledged that they need us to deploy it within their systems for returns.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/threat-large-it-firms-overblown-cognizants-ai-chief-says-amid-anthropic-driven-disruption-5955136",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5954586:en",
            "title": "Schneider beats profit expectations on data center demand",
            "description": "Feb 26 : French industrial group Schneider Electric on Thursday reported stronger-than-expected core earnings, driven by robust data centre demand, and provided 2026 expectations that analysts saw as conservative. The company also announced that its CFO Hilary Maxson would leave the company on April 5 and be replaced by Nathan Fast, who became head of investor relations in January. The Paris-listed stock was up almost 4 per cent to 275 euros by 1015 GMT, its highest price on record. Schneider, once known primarily for industrial components like fuses and circuit breakers, now builds the backbone of data centers, supplying everything from cooling units and server racks to critical power distribution equipment. Data centers and networks account for about 30 per cent of its total orders. While the United States is driving data centres growth, demand in also picking up in Northern European countries and France, \"places where they've put together permitting, electrical connection, with the governments pushing\", Maxson told journalists. The group reported triple-digit year-on-year growth within its pure data centre segment. Quarterly revenues grew organically by 10.7 per cent to 11.10 billion euros ($13.12 billion). Full-year adjusted earnings before interest, taxes and amortisation (EBITA) totaled 7.52 billion euros despite pressure from a weakening dollar. Analysts polled by the company expected on average fourth-quarter revenue of 10.90 billions and full-year adjusted EBITA of 7.48 billions. CONSERVATIVE FORECASTS Schneider said it expects organic revenue growth between 7 per cent and 10 per cent and its adjusted EBITA margin growing between 50bps and 80 bps this year, in line with targets it laid out in December. \"I can understand how they want to just set the base at the level that they can be very confident on and then maybe improve as you go through the year\" after the abrupt CFO change and risks such as tariffs and pricing, UBS analysts Andre Kukhnin said. JP Morgan also described the guidance as \"suitably beatable\". The group, which makes over a third of its revenues in North America, said it expected a foreign exchange impact of between 850 and 950 million euros on its 2026 revenues, after currency fluctuations reduced its fourth-quarter revenues by 701 million euros due to a weakening dollar, Indian Rupee and Chinese Yuan. Schneider sees an impact from import tariffs, including in the U.S., of \"a little bit less than double\" the incremental 160 million euros reported for 2025, Maxson said. It is the latest company to provide bullish expectations for AI demand this year, following upbeat comments by chipmaker Nvidia overnight. ($1 = 0.8462 euros)",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/schneider-beats-profit-expectations-data-center-demand-5954586",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5955016:en",
            "title": "EU court adviser rejects Meta's fight against EU antitrust demands for Facebook data",
            "description": "BRUSSELS, Feb 26 : An adviser to Europe's top court on Thursday backed Meta Platforms' fight against EU antitrust regulators over what the U.S. tech giant said were aberrant requests for information from the later during two investigations into the company. Meta had taken its case to the Luxembourg-based Court of Justice of the European Union, questioning EU demands related to its Facebook social network and online classified ads. \"In his opinion, Advocate General Athanasios Rantos proposes that the Court of Justice dismiss both appeals and uphold the judgments of the General Court\", the court said in a statement, adding that Rantos said in his non-binding opinion that the General Court \"did not err in law in assessing the necessity of the information requested or in examining the safeguards for its provision.\" Judges, who usually follow the majority of such recommendations, will rule in the coming months. The cases are C-496/23 P Meta Platforms Ireland v Commission (Facebook Marketplace) and C-497/23 P Meta Platforms Ireland v Commission (Facebook Data).",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/eu-court-adviser-rejects-metas-fight-against-eu-antitrust-demands-facebook-data-5955016",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5954971:en",
            "title": "ECB sees no wave of AI-led layoffs yet, Lagarde says",
            "description": "FRANKFURT, Feb 26 : Artificial intelligence is boosting productivity in the euro zone but it is not yet causing a wave of layoffs due to greater automation of labour, European Central Bank President Christine Lagarde said on Thursday. \"What we are seeing for the moment is that it's increasing productivity,\" Lagarde told a committee of the European Parliament. \"But we are not yet seeing consequences in terms of labour market and waves of redundancies that are feared, and that you know we will be extremely attentive going forward.\"",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/ecb-sees-no-wave-ai-led-layoffs-yet-lagarde-says-5954971",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5954751:en",
            "title": "Deliveroo's Singapore exit may lead to higher fees, fewer discounts, analysts say",
            "description": "SINGAPORE: Deliveroo’s exit from Singapore could gradually translate into higher delivery fees, fewer promotions and steeper commissions for eateries as the market shifts to two major players, although consumers may not feel the impact immediately. After Deliveroo's last day of service on Mar 4, Grab and Foodpanda will be the two major food delivery platforms in Singapore. Analysts said the transition is unlikely to cause immediate disruption and may even spark a brief burst of competition as the remaining platforms compete for Deliveroo's merchants and users. This could lead to lower prices initially, said Associate Professor Seshan Ramaswami, who teaches marketing at Singapore Management University (SMU). However, the longer-term outlook may be less favourable. Analysts said the market would resemble a duopoly, with Grab expected to command a significantly larger share. \"Both platforms are likely to reduce subsidies, raise delivery fees, and/or increase commissions; for example, slower voucher intensity and higher basket-level fees,\" National University of Singapore's (NUS) Professor of Marketing Jochen Wirtz said. NUS Assistant Professor Tiffany Tsai, who is in the Department of Economics, said that if the two continue to compete aggressively on delivery speed, service quality and merchant selection, they may maintain \"relatively high promotional intensity and keep fees in check\".  \"In that case, the overall impact on consumers may be limited,\" she added. On whether an eventual monopoly may arise, Prof Wirtz said this was unlikely unless a merger occurred, which would then be scrutinised by competition authorities. But Asst Prof Tsai said that an effective monopoly may become a concern if one of the remaining competitors is unable to \"meaningfully constrain pricing or commission levels over time, or to maintain sufficient scale and a multi-category ecosystem to discipline the largest platform\".  Observers said the short-term impact on businesses is expected to be limited, but reduced competition could weaken their bargaining power, potentially leading to higher commission rates sought by platforms.  Similarly, delivery riders who switch platforms could result in stronger competition for orders, Nanyang Technological University's (NTU) Assistant Professor Lee Wee Kiat said.  Over the longer term, reduced platform competition may weaken riders’ bargaining power, with possible shifts away from sign-up bonuses and surge incentives that were previously used to attract and retain riders, said Asst Prof Tsai. Platforms may shift towards more performance-based pay structures, she said.WHY DELIVEROO STRUGGLED Deliveroo entered Singapore in 2015 to a highly competitive food delivery landscape . Analysts CNA spoke to noted the difficulties of Singapore's market for a subscale competitor like Deliveroo. \"Delivery platforms are fundamentally density-driven businesses, where the profitability depends on having high order volume within the same area and time window to keep costs low,\" said NTU's Asst Prof Lee, who is from the Nanyang Business School's College of Business. \"In a geographically compact and highly competitive market like Singapore, where two platforms already hold significant scale, it is difficult for a smaller player to build and sustain an advantage in the same area.\" NUS' Prof Wirtz said the market was highly competitive and promotion-heavy, with compressed margins. \"Riders pick the platform that offers a higher pay, and customers pick the platform that has lower costs. Switching between platforms is just a click away,\" he said. Experts pointed out that Grab’s super-app ecosystem - spanning ride-hailing, payments and rewards - allows it to cross-promote across services and generate additional revenue through advertising.  Prof Wirtz pointed out that while Foodpanda was not a super app, it monetised ads and retail media, especially via Pandamart and fast-moving consumer goods brand partnerships. \"Deliveroo had sponsored listings and co-funded promos, but with a smaller audience and fewer surfaces, its ad monetisation was relatively limited,\" he added. Last year, DoorDash acquired Deliveroo with a view to growing its market share in Europe. \"Given Deliveroo’s limited growth trajectory in Singapore, it is likely that the market was not considered a strategic priority within DoorDash’s broader global portfolio,\" said Asst Prof Tsai from NUS. SMU's Assoc Prof Ramaswami noted that the industry could be entering a slower growth phase following the pandemic-era surge in demand, and may even decline. Challenges remain even with only two competitors. They still face headwinds in the form of price-sensitive consumers, rising operating costs, as well as the ongoing challenge of maintaining reliable rider supply and service, NTU's Asst Prof Lee said. Asst Prof Tsai said that the platforms may shift away from simple user acquisition, and that it was no longer sufficient for a platform to maintain market share in food delivery alone. \"Platforms increasingly rely on ecosystem bundling (eg integrating delivery with ride-hailing, payments, subscriptions, or loyalty programmes) to retain users, increase order frequency, and improve overall unit economics,\" she said. \"In such a mature market, profitability, customer retention, and ecosystem integration become more important than the rapid expansion strategies observed in the earlier growth phase.\" Assoc Prof Ramaswami raised the possibility of new entrants who may see an opportunity to differentiate themselves from the two remaining players. Other delivery services, such as Lalamove, are also in a position to enter the food delivery market, as they have delivery fleets and the logistics infrastructure.",
            "image": "",
            "link": "https://www.channelnewsasia.com/singapore/deliveroo-grab-foodpanda-food-delivery-platforms-analysts-5954751",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5954701:en",
            "title": "Australia union seeks urgent talks with WiseTech over AI‑driven job cuts",
            "description": "Feb 26 : An Australian trade union has sought an urgent meeting with WiseTech Global after the software firm announced it would cut about 2,000 jobs as part of a two‑year artificial intelligence-linked restructuring. Professionals Australia, which represents tech and engineering workers, said on Thursday that WiseTech is required to consult staff and the union before implementing major workplace changes and must provide written details on how the new AI systems will be deployed, their likely impact on jobs, and measures to avoid or reduce redundancies. Sydney‑based WiseTech, which makes shipping and logistics management software, said on Wednesday it plans to integrate AI into its customer software as well as internal operations, affecting around 29 per cent of its global workforce of around 7,000 people across 40 countries. \"The introduction of AI on this scale is clearly a major workplace change,\" said Professionals Australia Director Paul Inglis, adding that consultation must include transparency on the scope of job reductions and genuine consideration of alternatives such as redeployment and retraining.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/australia-union-seeks-urgent-talks-wisetech-over-ai-driven-job-cuts-5954701",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        }
    ]
}