{
    "data": [
        {
            "id": "entity:node/5956631:en",
            "title": "Intuit expects profit below estimates on higher marketing spend during US tax season",
            "description": "Feb 26 : Intuit forecast third-quarter profit below Wall Street estimates on Thursday, as it anticipates higher marketing spending to attract more customers during the U.S. tax season. The third quarter is typically Intuit's strongest, as the tax season boosts demand for the company's financial management tools such as TurboTax, Credit Karma, and QuickBooks. The Internal Revenue Service (IRS), the U.S. federal government agency, began accepting federal tax returns on January 26 this year, with the filing deadline set for April 15. Intuit CFO Sandeep Aujla told Reuters that increased marketing and customer support spending are deployed in the third quarter to capitalize on the tax season and drive growth in the assisted tax and QuickBooks segments. The company forecast adjusted earnings per share of $12.45 to $12.51 for the third quarter ending April 30, compared with analysts' average estimate of $12.95, according to data compiled by LSEG. It expects about 10 per cent revenue growth in the quarter, largely in line with analysts' average estimate of 9.9 per cent growth. The forecasts come amid market fears that the growing use of AI tools would erode demand for traditional software, as customers increasingly seek personalized financial guidance and automated solutions for tasks such as bookkeeping. To better compete with rivals such as H&R Block, Oracle's NetSuite and Microsoft's Dynamics 365 Platform, Intuit has signed multi-year deals with AI startups Anthropic and OpenAI to integrate their frontier models into its software. \"We're paying OpenAI and Anthropic for the capabilities. We're not paying them revenue share,\" Aujla said, adding that more than 3 million clients engage with the company's AI agents. Intuit reiterated its fiscal 2026 forecasts and said its second-quarter revenue grew 17 per cent to $4.65 billion, beating analysts' average estimate of $4.53 billion.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/intuit-expects-profit-below-estimates-higher-marketing-spend-during-us-tax-season-5956631",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956621:en",
            "title": "Duolingo prioritizes user growth over monetization, forecasts softer bookings",
            "description": "Feb 25 : Duolingo forecast first-quarter and 2026 bookings below expectations on Thursday as the language-learning app shifts strategy toward faster user growth, a move it said will weigh on bookings growth and profitability this year. As part of the push, Duolingo said it will expand access to its artificial intelligence-powered \"Video Call with Lily\" feature by adding it to its Super Duolingo subscription, rather than limiting it to the premium Max tier. The language-learning app has spent recent years fine-tuning monetization through more ads and subscription prompts, helping lift bookings per user. But that coincided with slower user growth, prompting the renewed focus on engagement. \"If we're seeing faster user growth than we're expecting, and what we are expecting is about 20 per cent, then that means the strategy is working,\" CEO Luis von Ahn told Reuters. The Pittsburgh, Pennsylvania-based company also plans to roll out more AI-driven speaking tools to free users, reducing friction that previously nudged learners toward paid plans. The AI-based video call is now more than ten times cheaper to run than at launch, and as costs continue to fall, Duolingo plans to expand access to all users to maximize learning, Von Ahn added. Duolingo said daily active user growth decelerated through 2025 and is expected to fall to roughly half the pace it sustained in prior years. Investors have increasingly scrutinized the company's moderating expansion as it scales, particularly after several quarters of breakneck growth. Bookings are now expected to rise about 11 per cent in 2026, compared with roughly 20 per cent growth the company said it could have delivered under its previous approach. Adjusted core profit margin is forecast to decline to about 25 per cent this year as Duolingo invests in broader access to AI features and steps up marketing. For the first quarter, Duolingo forecast bookings of about $301.5 million, below estimates of $329.7 million, according to Visible Alpha data. For the full year, it expects bookings between $1.27 billion and $1.30 billion, below estimates of $1.39 billion. The company expects revenue between $1.20 billion and $1.22 billion, lagging expectations of $1.26 billion, according to estimates compiled by LSEG.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/duolingo-prioritizes-user-growth-over-monetization-forecasts-softer-bookings-5956621",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956521:en",
            "title": "Nvidia expects gaming chips shortage to last until year-end",
            "description": "Feb 26 : A global shortage of gaming chips could last until the end of this year, an Nvidia executive has said, signaling more pain for the video game industry that is already buckling under weak sales due to slowing consumer demand. Nvidia expects the supply constraints to hurt its gaming business in the current quarter and beyond even as the chip giant sees strong demand, Nvidia finance chief Colette Kress said on the company's quarterly earnings call on Wednesday. \"As much as we would love to have more supply, we do believe for a couple quarters it is going to be very tight,\" Kress said. \"If things improve by the end of the year, there is an opportunity to think about what that is from a year-over-year growth. But it's still too early for us to know at this time.\" With the tech industry racing to build out artificial intelligence capacity, demand for memory chips has outstripped supply, causing a spike in prices and prompting manufacturers to prioritize components for higher-margin data center chips. That has constrained supply for consumer electronics such as smartphones and personal computers, as well as gaming consoles. Nvidia chips are widely used in PC gaming as well as in the Nintendo Switch console, while Sony's PlayStation and Microsoft's Xbox consoles use AMD hardware. Forecasts for the console market have been bleak. According to projections from tech industry research firm TrendForce in December, the console market is expected to see a 4.4 per cent decline this year, compared with its earlier forecast of a 3.5 per cent drop.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/nvidia-expects-gaming-chips-shortage-last-until-year-end-5956521",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956476:en",
            "title": "US regulator may share World Liberty bank application with lawmakers",
            "description": "WASHINGTON, Feb 26 : The head of the national U.S. bank regulator said on Thursday he would consider a request to allow senior members of Congress to review the bank charter application of World Liberty Financial, a crypto venture backed by the family of President Donald Trump. Jonathan Gould, Comptroller of the Currency named by Trump last year, told Democratic Senator Elizabeth Warren during a Senate Banking Committee hearing he would \"entertain\" her request to confidentially review the crypto company's application to become a national trust bank, which it filed in January. Such a charter would allow the company to expand its business operations. Warren, who along with other Democrats raised concerns that the application presents a potential conflict of interest, said she wanted Gould to share an unredacted copy of the application with her and Senate Banking Committee Chairman Tim Scott, a Republican, to ensure it includes all necessary information. Warren and several other Democrats on the Committee also pressed Gould to reject or delay reviewing the application. World Liberty Financial is run by Trump's sons and other associates.  Democrats also cited reporting from The Wall Street Journal that the United Arab Emirates' national security adviser is a large investor. A spokesman for World Liberty Financial said the company has complied with all requirements during the application process, including required disclosures. \"Democrats are playing politics and, with baseless lies, smearing a private American company undergoing a rigorous regulatory process,\" said spokesman David Wachsman. The White House has previously denied that the Trump family's crypto ties present a conflict of interest. Gould said the licensing process is run by \"superb\" agency staff and its process is detailed in publicly available staff manuals. \"We process applications in a fair and evenhanded manner,\" he said during the congressional hearing. A trust bank charter allows companies to manage and hold assets on behalf of customers and settle payments faster, but firms cannot take deposits or make loans. Several other crypto firms have received preliminary approval for such charters.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/us-regulator-may-share-world-liberty-bank-application-lawmakers-5956476",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956446:en",
            "title": "Smartphone market set for biggest-ever decline in 2026 on memory price surge, IDC says",
            "description": "Feb 26 : The global smartphone market is poised to suffer its biggest decline ever in 2026, sinking to a more than decade low in shipments, as surging memory chip prices drive up device costs, the International Data Corporation said on Thursday. Smartphone shipments are expected to drop 12.9 per cent to 1.12 billion units, the research firm said in a report. The decline will hit low-end Android manufacturers the hardest, while Apple and Samsung are positioned to gain market share as smaller rivals struggle or exit the market entirely, the report said. \"What we are witnessing is not a temporary squeeze, but a tsunami-like shock originating in the memory supply chain,\" said Francisco Jeronimo, vice president for Worldwide Client Devices at IDC. A rapid build-out of AI infrastructure by tech firms such as Meta, Google and Microsoft has captured much of the memory chips supply, lifting prices as manufacturers prioritize components for higher-margin data centers over consumer devices. Memory chips, or DRAM, are crucial to smartphones as they allow power-hungry applications to run smoothly. Analysts have said rising component costs will force budget-device focused companies to pass the expenses on to consumers, just as demand at higher price points is weakening. Apple and Samsung, with stronger balance sheets and premium positioning, are better positioned, IDC said. It expects the average selling price of smartphones to surge 14 per cent to a record $523 this year, as manufacturers shift toward higher-margin models to offset ballooning costs. IDC expects a modest 2 per cent recovery in 2027 as the crisis eases, followed by a 5.2 per cent rebound in 2028, though it said that the market was unlikely to return to previous norms. \"The memory crisis will cause more than a temporary decline; it marks a structural reset of the entire market,\" said Nabila Popal, senior research director at IDC's Mobile Phone Tracker. She warned that the sub-$100 smartphone segment, representing 171 million devices, will become \"permanently uneconomical\" even after memory prices stabilize by mid-2027.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/smartphone-market-set-biggest-ever-decline-in-2026-memory-price-surge-idc-says-5956446",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956411:en",
            "title": "In prehistoric interbreeding, it was Neanderthal men and Homo sapiens women",
            "description": "WASHINGTON, Feb 26 : When Homo sapiens trekked out of Africa, our species encountered Neanderthal populations already inhabiting the vast expanses of Europe, Asia and the Middle East. As the presence of Neanderthal DNA in most present-day people shows, interbreeding occurred, though the circumstances have remained unclear. New research focusing on the X chromosome, one of the two sex chromosomes, in present-day people and, as revealed by ancient genomes, in Neanderthals is providing insight into who participated in these prehistoric pairings. The genetic analysis backs the conclusion that this phenomenon primarily was driven by sex between Neanderthal men and Homo sapiens women. The researchers said it is unknown why this occurred, whether by peaceful mating preference, by force or some other scenario. \"The preferences of either or both parties could produce these kinds of patterns, with or without the consent of the other,\" said geneticist Alexander Platt of the University of Pennsylvania's Perelman School of Medicine, co-lead author of the research published on Thursday in the journal Science. Chromosomes are threadlike structures that carry genetic information from cell to cell. In people, females carry two X chromosomes - one inherited from each parent. Males carry one X chromosome inherited from their mother and one Y chromosome from their father. For the other chromosomes, everyone has two copies - one from each parent, equally distributed across the sexes. Most people, with the exception of certain sub-Saharan African populations, carry small amounts - often 1 per cent to 4 per cent - of Neanderthal DNA across much of their genome but have little to none on their X chromosomes. Africans are the exception because their ancestors, having stayed on the continent, never mixed with Neanderthals. The genomes of three Neanderthals showed an excess of Homo sapiens DNA on X chromosomes, a pattern opposite from present-day people and suggestive of male Neanderthal-female Homo sapiens mating. The researchers also examined genetic data from present-day Africans lacking Neanderthal ancestry to better track gene flow between Homo sapiens and Neanderthals who interbred starting as early as 250,000 years ago. A more recent Homo sapiens migration resulted in additional interbreeding peaking around 47,000 years ago. Scientists had long assumed the absence of Neanderthal contribution to modern X chromosomes was because some Neanderthal genes were biologically incompatible with Homo sapiens, causing serious health problems, and were purged because offspring failed to reproduce - Darwinian \"survival of the fittest.\" But the abundance of Homo sapiens DNA in Neanderthal X chromosomes contradicted that notion. Instead, the genetic data, the researchers said, is best explained by Neanderthal men and Homo sapiens women mating, with mathematical modeling confirming this mating bias could reproduce the observed genetic patterns. SIMILARITIES BEYOND THE ANATOMICAL Homo sapiens and Neanderthals had a common ancestor until approximately 600,000 years ago. The lineage then split, with Neanderthals evolving in Europe and Homo sapiens in Africa. Neanderthals, who disappeared roughly 40,000 years ago, and Homo sapiens had similarities beyond the anatomical. Neanderthals, more robustly built and with larger brows, were intelligent, creating art and using complex group-hunting methods, symbolic objects and perhaps spoken language. The nature of the interaction is difficult to ascertain based on archaeological and genetic evidence, including whether, for example, there were hostilities such as raiding parties by Neanderthal men to abduct Homo sapiens women. \"We have no way of knowing if this was a conflict scenario,\" University of Pennsylvania geneticist and study senior author Sarah Tishkoff said, noting the interaction could have been peaceful. \"But we also don't know why this pattern happened of more modern human (Homo sapiens) females mating with Neanderthals - whether it was due to choice or they were forced. This is what makes it so fascinating, and hopefully someday perhaps there will be archaeological and fossil data that will shed further light on the interactions between Neanderthals and modern humans.\" At some point after spreading through Eurasia, our species greatly outnumbered the Neanderthals. \"If you consider that there may have been 10 to 20 times as many Homo sapiens in the area as Neanderthals, the observation that we had as much as 5 per cent Neanderthal ancestry 30,000 to 40,000 years ago suggests it's entirely reasonable to guess that there was simply so much interbreeding that we swamped the gene pool - that Neanderthals didn't actually disappear at all, they just became some of us,\" Platt said. \"It's kind of fun to think that there are currently some six billion people walking around with about 2 per cent Neanderthal genomes,\" Platt said. \"To the extent that that's equivalent to 120 million Neanderthals' worth of genomes, they're doing better than ever.\"",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/in-prehistoric-interbreeding-it-was-neanderthal-men-and-homo-sapiens-women-5956411",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956386:en",
            "title": "Netflix and Apple TV join forces on F1 content",
            "description": "Feb 26 : Netflix will broadcast the Canadian Formula One Grand Prix live to U.S. viewers in May as part of a deal that makes season eight of its hit docu-series 'Drive to Survive' available for streaming on Apple TV. Apple TV is taking over from Walt Disney's ESPN this season as the exclusive U.S. broadcaster of Formula One, with live coverage of all 24 rounds. Streaming giant Netflix had also been a contender for the U.S. broadcasting rights, according to media reports in February last year. Season eight of 'Drive to Survive', with exclusive behind the scenes access through the 2025 Formula One campaign won by McLaren and Lando Norris, launches globally on Friday. Formula One's new season, with three U.S. rounds, starts in Australia on March 8. Apple's Senior Vice-President of Services Eddy Cue told reporters on a video call that select races and practice sessions would also be made available for free through the season, without giving details. \"We look at F1 and Apple TV as a true partnership where we're going to amplify this sport across all our Apple services,\" he said. \"Netflix, I think, has played a pivotal role in growing F1 since the launch of 'Drive to Survive' and we're thrilled to make F1 content more broadly available to new and existing U.S. fans on both Netflix and Apple TV.\" Formula One's Chief Media Rights and Broadcast officer Ian Holmes said ESPN had taken Formula One in the United States, a key market, to a new level with their coverage and the relationship with Apple was \"the next big iteration\". \"I'd say we are probably the only sport in the world whose audience is getting younger and more female skewed, and that couldn't be more represented than currently in the U.S.,\" he added. \"So we see a relationship with Apple and the way that Apple is able to offer its content as the most forward-looking approach that we can pursue.\"",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/netflix-and-apple-tv-join-forces-f1-content-5956386",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956361:en",
            "title": "Prada layers winter jackets over light dresses at Milan show as Zuckerberg's presence fuels smart glasses talk",
            "description": "MILAN, Feb 26 : Prada's autumn/winter show in Milan on Thursday included embroidered satin dresses, sheer skirts and wool sweaters, while the front row presence of Mark Zuckerberg fuelled speculation about a potential smart glasses partnership. Designers Miuccia Prada and Raf Simons chose to have only 15 models walk the runway, each wearing multiple looks to focus on layering clothes to best effect, including short jackets over lightweight tunics. \"As a woman, your life is layered - each day demands not only a shifting of clothes, but a richness of identities within yourself,\" said Miuccia Prada in the press notes. Brightly coloured handbags and quirky kitten heel shoes were also on display. Zuckerberg, CEO of Facebook owner Meta Platforms, and his wife Priscilla Chan sat alongside Prada's CEO Andrea Guerra and Prada's family heir Lorenzo Bertelli. In November, Bertelli, who is Prada's chief marketing officer, told Reuters that the group had had \"exploratory talks\" with EssilorLuxottica over the potential development of smart glasses under its brands, but no decision had been made. Prada has a licensing agreement with the Franco-Italian eyewear maker, which has a partnership with Meta to develop AI-powered glasses.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/prada-layers-winter-jackets-over-light-dresses-milan-show-zuckerbergs-presence-fuels-smart-glasses-talk-5956361",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5955941:en",
            "title": "Nvidia shares fall as investors fret over returns, look past strong results ",
            "description": "Feb 26 : Nvidia's shares fell on Thursday as investors looked past strong earnings, wary that the chip designer continues to channel capital into expanding the AI ecosystem, the payoffs for which are still unclear, rather than boosting shareholder returns. Its shares slid 4 per cent to $187.6 and dragged other chip stocks including Broadcom and Advanced Micro Devices lower. The stock closed at a three-month high on Wednesday. The bearish reaction reflects growing concerns about whether Nvidia's record-setting momentum can hold as rivals push new AI accelerators, hyperscalers invest in custom silicon and the broader AI spending cycle becomes more uneven. \"Nvidia once again exceeded expectations but the competitive picture is also shifting as companies like Meta diversify toward AMD (Advanced Micro Devices) and the big cloud players invest more in custom silicon,\" said Jacob Bourne, analyst at eMarketer. \"This puts a focus on Nvidia's guidance for what the future holds in terms of maintaining its dominance as the AI buildout matures and questions around enterprise ROI (return on investment) intensify.\" Hyperscalers including Meta Platforms - a major customer - have forecast total capital expenditure of at least $630 billion in 2026, with most of it earmarked for data centers and processors. Nvidia's shares also fell below technical support levels around their 50- and 100-day moving averages, which could be indicative of more selling pressure. To an analyst's question during a post-earnings call on whether the company was looking to give back shareholders some of the $100 billion cash it was likely to generate this year, Nvidia Chief Financial Officer Colette Kress said the company wanted to keep investing in the AI ecosystem. The world's most valuable company said it expects fiscal first-quarter sales of $78 billion, plus or minus 2 per cent, compared with analysts' average estimate of $72.60 billion, according to data compiled by LSEG. \"For about the 5th time in the last 3 years, there appear to be generalist concerns that growth will slow, despite near-term acceleration and the clear increase in model usage that is starting to have a major impact on productivity,\" Morgan Stanley equity strategist Joseph Moore said in a note. Massive demand from AI infrastructure has also fuelled concerns about a global memory chip supply crunch. Nvidia dismissed questions on whether supply shortfalls at its chip contract maker TSMC would hamper growth, stating it had secured enough chip inventory and capacity to meet demand beyond the next several quarters, but did reveal that it will affect its gaming business. The company's price-to-earnings (PE) ratio is currently 24.5 times forward earnings, down from 34.6 on October 29 when it hit $5 trillion in market capitalization for the first time, as per LSEG DataStream. It is also well below Advanced Micro Devices' PE ratio of 28.8 and Intel's 81.4.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/nvidia-shares-fall-investors-fret-over-returns-look-past-strong-results-5955941",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5953991:en",
            "title": "World shares ease on concerns about tech valuations",
            "description": "NEW YORK, Feb 26 : An index of global equity markets eased after hitting a fresh record high on Thursday as concerns about lofty valuations of leading technology companies weighed on markets after artificial intelligence chipmaker Nvidia reported strong quarterly results. Shares on Wall Street and in Europe traded down as investors digested another blowout quarter from Nvidia, the world's most valuable company, but worried about its market value even as it forecast that first-quarter revenue would come in at a whopping $78 billion.  On Wall Street, technology and communication services were the biggest losers, with Nvidia's shares down 4 per cent. The Dow Jones Industrial Average rose 0.11 per cent, the S&P 500 fell 0.70 per cent, and the Nasdaq Composite fell 1.37 per cent. \"People are getting concerned about lofty valuations even though when you look at a company like Nvidia, the estimates, cash flow, and everything else are dramatically higher,\" said Thomas Plumb, chief executive and portfolio manager at Plumb Funds in Madison, Wisconsin. \"But I think the sentiment will eventually match up with the realities,\" said Plumb, who has Nvidia as his largest investment holding.  In Europe, the broad STOXX 600 index fell 0.11 per cent. MSCI's All Share Index was down 0.30 per cent after rising to a record high of 1,063.86.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/world-shares-ease-concerns-about-tech-valuations-5953991",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5955471:en",
            "title": "Warner Bros’ TV decline puts pressure on Netflix deal",
            "description": "Feb 26 : Warner Bros Discovery heaped an additional burden on Netflix's $82.7 billion bid for the movie studio and HBO. The entertainment company behind the buzzy series \"Heated Rivalry\" and the film \"Wuthering Heights\" reported fourth-quarter earnings Thursday that showed profit at its cable channels is deteriorating at a fast pace. The networks, which include CNN, the Discovery Network and TNT, are not part of Netflix’s deal. But their worth as a separately traded company is a key component in valuing the streaming service’s offer for the Warner Bros film and TV studios, its library, HBO and the HBO Max streaming service. Rival Paramount Skydance raised its proposal to buy all of Warner Bros to $110 billion. On Tuesday, the Warner board said it is negotiating with the rival bidder to determine whether the revised proposal could result in a deal superior to Netflix's offer.  Warner Bros Chief Executive David Zaslav did not address the discussions on a call with investors Thursday. Instead, he highlighted his role in sparking a bidding war for the coveted assets. \"We engaged with four bidders, which led to eight price increases, and have thus far achieved a 63 per cent increase in value versus the first offer received in September, delivering significant value to WBD shareholders throughout the process,\" Zaslav told investors. Warner's board had previously determined Netflix's offer was superior to Paramount's because investors would also receive the value of its planned spin-off of the television group, Discovery Global.  The division's revenue fell to $4.2 billion, down 12 per cent from a year earlier, and adjusted income dropped to $1.4 billion, a 27 per cent plunge from the same quarter a year earlier. Such declines affect the value of the TV networks as a standalone business, Discovery Global. Its closest comparison is Versant Media, the cable and digital assets separated from Comcast earlier this year. Versant's enterprise is worth roughly 3 times its 2025 forecast EBITDA of $2.1 billion. On the same yardstick, Discovery Global's market capitalization would be approximately $3 billion or a little over $1 per share, assuming $17 billion in net debt. Add that to Netflix's cash offer of $27.75 per share and it comes in shy of Paramount's bid of $31. Warner CFO Gunnar Wiedenfels declined to address that comparison. Netflix did not immediately reply to a request for comment.  HBO Max continued to grow, helped by series like \"Heated Rivalry\" and \"It: Welcome to Derry.\" Warner Bros added 3.5 million streaming subscribers in the quarter, bringing its total number worldwide to 131.6 million. The streaming group's revenue rose 5 per cent to nearly $2.8 billion, but adjusted earnings fell 4 per cent to $393 million due to the end of an unspecified distribution deal. \"The best thing for WBD shareholders is that it is being sold, because its fundamentals continue to deteriorate,\" wrote Needham & Co senior research analyst Laura Martin. Warner's stock was largely unchanged in early morning trading. Zaslav also highlighted the success of the Warner Bros film slate, including \"Wuthering Heights,\" \"A Minecraft Movie\" and \"Superman.\" \"We love the motion picture business,\" Zaslav said on the call. \"We at the company believe so deeply in the motion picture business, putting movies on the screen for shared experience ... Our commitment to the motion picture business is the core of our company.\" Netflix Chief Executive Ted Sarandos has defended his deal for the studio and HBO by affirming his commitment to releasing movies in theaters, a strategy that was never part of Netflix's DNA. Should Warner Bros board declare that Paramount's deal is superior, Netflix has four business days to revise its offer.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/warner-bros-tv-decline-puts-pressure-netflix-deal-5955471",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956151:en",
            "title": "Woman suing Meta, YouTube over social media addiction expected to take stand at trial",
            "description": "Feb 26 : A California woman is expected to testify in court on Thursday about how using Meta Platforms' Instagram and Google's YouTube as a child harmed her mental health, as her landmark trial in Los Angeles continues. The plaintiff, known as Kaley G.M. in court, began using Instagram at age 9 and YouTube at age 6 and says the platforms contributed to her depression and body dysmorphia. The companies sought to profit by hooking young children on their services despite knowing social media could harm their mental health, her lawyers say. Kaley G.M.'s testimony comes a day after her former psychotherapist said adolescent social media usage was a \"contributing factor\" to her mental health issues. The case is part of a broader global backlash against social media companies over alleged harms to children and teens. Australia has banned under-16s from such platforms, and other countries are considering similar restrictions. YouTube and Meta have denied the allegations and said evidence in the case does not support the woman's claims. The therapist was called by lawyers for the plaintiff to set the stage for the next phase of the trial, exploring whether and how Kaley's engagement with social media as a child affected her well-being. The beginning of the trial focused on what the companies knew about how social media affects children, and their business strategies related to younger users. Meta CEO Mark Zuckerberg testified the company discussed but never launched products for children. To win the case, Kaley's lawyers must show that the way the companies designed or operated the platforms was a substantial factor in causing or worsening her mental health issues.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/woman-suing-meta-youtube-over-social-media-addiction-expected-take-stand-trial-5956151",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956081:en",
            "title": "Google rolls out Nano Banana 2 after viral success of AI image generation tool ",
            "description": "Feb 26 : Google on Thursday unveiled a successor to its viral Nano Banana image generation model, touting faster performance as the search-engine behemoth pushes to attract more users to its AI tools. The model, called Nano Banana 2, is being rolled out across products, including the Gemini app, AI Mode and Lens features on Search, and Flow, its AI-powered video tool, the Alphabet-owned company said. The launch is Google's latest in a series of moves that have propelled the company to the forefront of the AI race, helping it better compete with OpenAI's ChatGPT after suffering a string of embarrassments initially. The success has fueled a 47 per cent surge in its stock in the past six months. Google rolled out the Nano Banana AI image editor in August, which quickly became a viral sensation, attracting 13 million first-time users to the Gemini app in just four days in September. By mid-October, it had generated more than 5 billion images. The tech giant followed that with the release of the upgraded Nano Banana Pro in November. Nano Banana 2 leans on Gemini's faster and cheaper models known as Flash, which allows quicker image generation and editing, Google said, adding that it also has better instruction-following capabilities and delivers sharper details. In November, Google released its Gemini 3 AI model, whose success prompted rival OpenAI to issue an internal \"code red\" to push teams to accelerate development. Gemini 3 has significantly boosted user engagement, helping the Gemini app capture more than 750 million monthly active users at the end of December.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/google-rolls-out-nano-banana-2-after-viral-success-ai-image-generation-tool-5956081",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5956076:en",
            "title": "Apple seeks dismissal of fraud lawsuit over Siri AI, Epic injunction",
            "description": "Feb 26 : Apple urged a federal judge to dismiss a proposed class action claiming it defrauded shareholders twice, by overstating the artificial intelligence capabilities of its Siri voice assistant and falsely representing its compliance with an injunction governing commissions on app sales.   In a Wednesday filing in the San Jose, California, federal court, Apple said there was no proof it knew when discussing AI at a June 2024 conference that it would take longer than expected to incorporate two advanced AI features into Siri, potentially hurting iPhone 16 sales. The company delayed some Siri upgrades the following March, and Chief Executive Tim Cook said two months later that developing a \"more personal\" Siri was \"taking a bit longer than we thought.\" Apple also said it provided no assurance that its procedures designed to comply with a 2021 injunction, in a case brought by Epic Games, to let app users pay developers directly rather than have the company charge the developers hefty commissions would be foolproof. \"It is no secret that Apple faced challenges and weathered ups and downs in its stock price in 2025, like many major companies,\" Apple said. \"But plaintiff takes a massive and unsupported leap by claiming that securities fraud caused the temporary price drops.\" The lawsuit covers Apple shareholders who suffered potentially hundreds of billions of dollars of losses in the Cupertino, California-based company's stock between May 3, 2024 and May 1, 2025, the day after a judge said Apple was violating the injunction. Lawyers for shareholders led by South Korea's National Pension Service, the world's third largest pension fund with close to $1 trillion of assets, did not immediately respond to requests for comment. Apple's injunction required the company to provide app users with external links for purchases, so developers wouldn't owe 30 per cent commissions for purchases in its App Store. The judge overseeing that case rebuked Apple for creating a new system that charged a 27 per cent commission on some external sales. A federal appeals court partially reversed her sanctions in December.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/apple-seeks-dismissal-fraud-lawsuit-over-siri-ai-epic-injunction-5956076",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "entity:node/5955991:en",
            "title": "Exclusive-CNBC to unify digital and TV news operations, cut nearly a dozen jobs, sources say",
            "description": "Feb 26 : CNBC is restructuring its newsroom to unify its TV and digital operations in a move that would result in nearly a dozen layoffs including the departure of the website's managing editor, Jeff McCracken, four sources familiar with the matter told Reuters. The cuts are part of an overhaul under Editor-in-Chief David Cho, as CNBC prepares to introduce a paywall on its website, the sources said, requesting anonymity because the information was not public. The layoffs are not aimed at cutting costs and the news organization plans to add some 40 roles in the coming year, according to two of the sources. CNBC and McCracken declined to comment. CNBC is among the most-watched cable networks thanks to its live coverage of markets and global business developments. The layoffs come weeks after Versant Media, the parent company of CNBC, was spun out of Comcast. Shares of Versant have declined more than 30 per cent since the company listed on the Nasdaq in January. Besides CNBC, Versant also owns cable networks such as USA, MS NOW, Oxygen, as well as digital assets like Fandango and Rotten Tomatoes.",
            "image": "",
            "link": "https://www.channelnewsasia.com/business/exclusive-cnbc-unify-digital-and-tv-news-operations-cut-nearly-dozen-jobs-sources-say-5955991",
            "pub_date": "",
            "source": "channelnewsasia",
            "kind": 1,
            "language": "en"
        }
    ]
}