{
    "data": [
        {
            "title": "BIGLARI CAPITAL URGES ALL JACK IN THE BOX SHAREHOLDERS TO VOTE AGAINST DAVID GOEBEL -- TODAY | JACK Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p class=\"prntac\"><b><i>17 Years of Failed Leadership Cannot Be Undone in One More Year</i></b></p><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.tx.sanant\">SAN ANTONIO</location></span>, <span class=\"legendSpanClass\">Feb. 26, 2026</span> /PRNewswire/ -- Biglari Capital Corp. (\"Biglari Capital\"), the largest shareholder of Jack in the Box Inc. (NasdaqGS: <a class=\"symbol-link\" href=\"/overview/JACK/\" title=\"View JACK stock overview\">JACK</a>), with a <percent>9.86%</percent> ownership stake, issues this urgent call to action: Shareholders must vote AGAINST the re-election of Chairman David Goebel at tomorrow's annual meeting.</p><p><b>The Time for Accountability Is Now<br/></b>Under David Goebel's tenure as chairman, <a class=\"symbol-link\" href=\"/overview/JACK/\" title=\"View JACK stock overview\">JACK</a> shareholders have lost approximately <money><money>$1.8 billion</money></money> of shareholder value.</p><p><b>Shareholder Loss Is Mr. Goebel's Gain<br/></b>In the last five years alone, the very years in which <a class=\"symbol-link\" href=\"/overview/JACK/\" title=\"View JACK stock overview\">JACK</a> lost <percent>80%</percent> of its value, Mr. Goebel collected <money><money>$1.5 million</money></money> in total compensation. And now JACK is wasting <money><money>$5 million</money></money> of shareholder capital to defend the director most responsible for the Company's precarious financial position. Shareholders bore all the losses; Mr. Goebel bore none of them.</p><p><b>It is Time to Hold Mr. Goebel Accountable<br/></b><span>Shareholders must acknowledge that after 17 years of failed leadership. Mr. </span>Goebel<span> will not suddenly generate positive returns given one more year.</span></p><p>The chairman has a negligible stake, yet he has caused the company to spend <money><money>$5 million</money></money> to retain his directorship.</p><p>His continued presence on the Board constrains meaningful boardroom discussion, blocking the fresh perspectives JACK urgently needs.</p><p><b>Removing Chairman Goebel Opens the Door to Real Change<br/></b><span>If Mr. </span>Goebel<span> is removed from the Board, the possibility of genuine, unconstrained board discussion on how to change the Company's trajectory becomes real. We believe the market will react positively to his removal — a signal that entrenchment is ending and accountability has arrived.</span></p><p>One more year of Mr. Goebel's influence risks pushing JACK into financial distress from which it may be difficult to recover. The company has already been forced to suspend dividends and close 150–200 stores. This is not a moment for delay. This is a time for accountability. Shareholders must send the Board a message that performance must change. Do not support failure.</p><p class=\"prntac\"><b>VOTE <u>AGAINST</u> DAVID GOEBEL. VOTE NOW.</b></p><p class=\"prntac\"><i>If you have already voted, you can still change your vote before midnight ET. Only your last dated vote counts.</i></p><p>Contact: <a href=\"mailto:info@saratogaproxy.com\" rel=\"nofollow noopener\" xmlns=\"http://www.w3.org/1999/xhtml\">info@saratogaproxy.com</a></p><p>SOURCE Biglari Capital</p></div></article>",
            "link": "https://www.stocktitan.net/news/JACK/biglari-capital-urges-all-jack-in-the-box-shareholders-to-vote-6r5z9vk80oq9.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 03:48:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Flutter Entertainment PLC: Publication of Annual Report and Accounts 2025 | FLUT Stock News",
            "description": "<article class=\"article\"><p align=\"left\">DUBLIN and TORONTO, Feb.  27, 2026  (GLOBE NEWSWIRE) -- </p> <p align=\"center\"><strong>Flutter Entertainment plc </strong><br/><strong>(the \"Company\")</strong><br/><br/><strong>Publication of Annual Report and Accounts 2025</strong></p> <p align=\"justify\">Flutter Entertainment plc announces that its Annual Report on Form 10-K for the financial year ended 31 December 2025 (the “Annual Report on Form 10-K”) has been published and filed with the U.S. Securities and Exchange Commission (the “SEC”)</p> <p align=\"justify\">In connection with its reporting obligations under the Listing Rules of the UK Financial Conduct Authority, the Company has also prepared a UK annual report, incorporating the Annual Report on Form 10-K (the “Annual Report and Accounts 2025”). A copy of the Annual Report and Accounts 2025 is available at <a href=\"http://www.rns-pdf.londonstockexchange.com/rns/6194U_1-2026-2-26.pdf\" rel=\"nofollow noopener\" target=\"_blank\">http://www.rns-pdf.londonstockexchange.com/rns/6194U_1-2026-2-26.pdf</a> and has been submitted to the UK National Storage Mechanism and will shortly be available for inspection at <a href=\"https://data.fca.org.uk/#/nsm/nationalstoragemechanism\" rel=\"nofollow noopener\" target=\"_blank\">https://data.fca.org.uk/#/nsm/nationalstoragemechanism</a>.</p> <p align=\"justify\">The Annual Report on Form 10-K and the Annual Report and Accounts 2025 are also publicly available on the Company's website at <a href=\"https://flutter.com/investors/investor-hub/results-reports/\" rel=\"nofollow noopener\" target=\"_blank\">https://flutter.com/investors/investor-hub/results-reports/</a>.</p> <p align=\"justify\"><strong>Enquiries:</strong><br/>Edward Traynor<br/>Company Secretary<br/>+353 (87) 2232455</p> <p align=\"justify\">This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" rel=\"nofollow noopener\" target=\"_blank\"><u>rns@lseg.com</u></a> or visit <a href=\"http://www.rns.com/\" rel=\"nofollow noopener\" target=\"_blank\"><u>www.rns.com</u></a>.</p> <img alt=\"\" class=\"__GNW8366DE3E__IMG\" loading=\"lazy\" src=\"https://www.globenewswire.com/newsroom/ti?nf=OTY2MjcyMiM3NDU4ODk5IzUwMDEzMTg3Mg==\"/> <br/><img alt=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\" src=\"https://ml.globenewswire.com/media/OTg3ZTM5N2EtOWM0OS00Y2Y1LTkzNDMtZWZmY2EwNTk1NmQ2LTUwMDEzMTg3Mi0yMDI2LTAyLTI3LWVu/tiny/Flutter-Entertainment-PLC.png\"/></article>",
            "link": "https://www.stocktitan.net/news/FLUT/flutter-entertainment-plc-publication-of-annual-report-and-accounts-knc5r3zlygxa.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 07:05:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Avalon GloboCare Announces up to $9.75 Million Private Placement Priced At-the-Market under Nasdaq Rules | ALBT Stock News",
            "description": "<article class=\"article\"><p><strong><money>$3.25 Million</money> Upfront With up to Approximately <money>$6.5 Million</money> of Potential Aggregate Proceeds Upon the Exercise in Full of Warrants</strong></p><p align=\"justify\">FREEHOLD, N.J., Feb.  26, 2026  (GLOBE NEWSWIRE) -- Avalon GloboCare Corp. (“Avalon” or the “Company”) (NASDAQ: <a class=\"symbol-link\" href=\"/overview/ALBT/\" title=\"View ALBT stock overview\">ALBT</a>), a diversified company focused on the development of precision diagnostic consumer products and generative AI publishing and software, today announced that it has entered into definitive agreements for the issuance and sale of 6,372,550 shares of its common stock (or pre-funded warrants in lieu thereof), Series A-1 warrants to purchase up to an aggregate of 6,372,550 shares of common stock and Series A-2 warrants to purchase up to an aggregate of 6,372,550 shares of common stock, at a purchase price of <money>$0.51</money> per share (or pre-funded warrant in lieu thereof) and associated warrants in a private placement priced at-the-market under Nasdaq rules. The warrants will have an exercise price of <money>$0.51</money> per share and will be exercisable beginning on the effective date of stockholder approval of the issuance of the shares upon exercise of the warrants. The Series A-1 warrants will expire five years from the date of stockholder approval and the Series A-2 warrants will expire eighteen months from the date of stockholder approval.</p> <p align=\"justify\">H.C. Wainwright &amp; Co. is acting as the exclusive placement agent for the offering.</p> <p align=\"justify\">The aggregate gross proceeds to the Company from the offering are expected to be approximately <money>$3.25 million</money>, before deducting placement agent fees and other offering expenses. The offering is expected to close on or about February 27, 2026, subject to the satisfaction of customary closing conditions. The potential additional gross proceeds to the Company from the warrants, if fully-exercised on a cash basis, will be approximately <money>$6.5 million</money>. No assurance can be given that any of such warrants will become exercisable or will be exercised. The Company intends to use the net proceeds from the offering for the repayment of certain outstanding debt and for working capital and general corporate purposes.</p> <p align=\"justify\">The securities described above were offered in a private placement under Section 4(a)(2) of the Securities Act of 1933, as amended (the “Act”) and Regulation D promulgated thereunder and, along with the shares of common stock underlying the warrants sold in the offering, have not been registered under the Act or applicable state securities laws. Accordingly, such securities may not be offered or sold in the United States absent registration with the SEC or an applicable exemption from such registration requirements. The securities were offered only to accredited investors. Pursuant to a registration rights agreement, the Company has agreed to file one or more registration statements with the SEC covering the resale of the unregistered securities to be issued in the offering.</p> <p align=\"justify\">This press release shall not constitute an offer to sell or the solicitation of an offer to buy these securities, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.</p> <p align=\"justify\"><strong>About Avalon GloboCare Corp.</strong></p> <p align=\"justify\">Avalon GloboCare Corp. (NASDAQ: <a class=\"symbol-link\" href=\"/overview/ALBT/\" title=\"View ALBT stock overview\">ALBT</a>) is a technology-focused company developing and acquiring innovative artificial intelligence platforms. Through its AI-driven subsidiary, Avalon Quantum AI LLC, the Company is advancing next-generation AI systems, including automated video generation, enterprise documentation, and workflow automation solutions. Avalon is also expanding its intellectual property portfolio in cellular therapy and generative AI publishing and software. In addition, Avalon is marketing the KetoAir™ breathalyzer device, which is registered with the U.S. Food and Drug Administration as a Class I medical device, and plans to pursue additional diagnostic applications for the technology.</p> <p align=\"justify\">For more information about Avalon, please visit www.avalon-globocare.com. Information on the Company’s website does not constitute a part of and is not incorporated by reference into this press release.</p> <p align=\"justify\"><strong>Forward-Looking Statements</strong></p> <p align=\"justify\">Certain statements contained in this press release are “forward-looking statements” within the meaning of the federal securities laws. Forward-looking statements are made based on our expectations and beliefs concerning future events impacting the Company and therefore involve several risks and uncertainties. You can identify these statements by the fact that they use words such as “will”, “anticipate”, “estimate”, “expect”, “should”, “may”, and other words and terms of similar meaning or use of future dates; however, the absence of these words or similar expressions does not mean that a statement is not forward-looking. Forward-looking statements provide current expectations of future events based on certain assumptions and include any statement that does not directly relate to any historical or current fact, including statements regarding the completion of the offering, satisfaction of the closing conditions and use of proceeds therefrom, the receipt of stockholder approval for the warrants and the exercise of the warrants prior to their expiration. Actual results may differ materially from those indicated by such forward-looking statements as a result of various important factors as disclosed in our filings with the SEC, accessible through the SEC’s website (http://www.sec.gov), including our most recent Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, and Current Reports on Form 8-K filed or furnished with the SEC. In addition to these factors, actual future performance, outcomes, and results may differ materially because of more general factors, including (without limitation) general industry and market conditions and growth rates, economic conditions, and governmental and public policy changes. The forward-looking statements included in this press release represent the Company's views as of the date of this press release and these views could change. The Company disclaims any obligation to update forward-looking statements. These forward-looking statements should not be relied upon as representing the Company's views as of any date subsequent to the date of the press release. The contents of any website referenced in this press release are not incorporated by reference herein.</p> <p align=\"justify\"><strong>Contact Information:</strong><br/>Avalon GloboCare Corp.<br/>4400 Route 9 South, Suite 3100<br/>Freehold, NJ 07728<br/>PR@Avalon-GloboCare.com</p> <p align=\"justify\">Investor Relations:<br/>Crescendo Communications, LLC<br/>Tel: (212) 671-1020 Ext. 304<br/>albt@crescendo-ir.com</p> <img alt=\"\" class=\"__GNW8366DE3E__IMG\" loading=\"lazy\" src=\"https://www.globenewswire.com/newsroom/ti?nf=OTY2MjY3NiM3NDU4NzU0IzIxODQyMDc=\"/> <br/><img alt=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\" src=\"https://ml.globenewswire.com/media/ZTA5OWZiODUtYjM2ZC00ZjI1LWJjMDAtMTk4MDQ0MGEyYWM3LTExOTU3NjEtMjAyNi0wMi0yNy1lbg==/tiny/Avalon-GloboCare-Corp-.png\"/></article>",
            "link": "https://www.stocktitan.net/news/ALBT/avalon-globo-care-announces-up-to-9-75-million-private-placement-i1ib474e73am.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 02:20:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tims China Marks 7th Anniversary, Partners with Air Canada to Celebrate a Club-Members only “Maple Journey” Promotion* | THCH Stock News",
            "description": "<article class=\"article\"><p align=\"justify\">SHANGHAI, Feb.  27, 2026  (GLOBE NEWSWIRE) -- On February 26, TH International Limited (NASDAQ: <a class=\"symbol-link\" href=\"/overview/THCH/\" title=\"View THCH stock overview\">THCH</a>), the exclusive operator of Tim Hortons in China (“Tims China” or the “Company”), marks its seventh year of operations in the country.</p> <p align=\"left\"><strong>Seven Years of Steady Growth in China </strong></p> <p align=\"justify\">Honoring the Canadian roots of the Tims Hortons brand - the first coffee shop opened in Hamilton, Ontario, in 1964 - Tims China is as committed as ever to delivering a warm connection with every cup. The brand will continue expanding its footprint, reaching more and more communities and customers nationwide.</p> <p align=\"left\">Since entering the Chinese market in 2019, Tims China has steadily expanded its presence, completing a successful Nasdaq listing, surpassing 1,000 stores in nearly 100 cities across China, and standing out in the competitive coffee market with its distinctive “Coffee + Freshly Prepared Food” positioning.</p> <p align=\"left\"><strong>Partnering with Air Canada to Celebrate a “Maple Journey”</strong></p> <p align=\"center\"><img alt=\"加航小红书3-4\" data-caption=\"Round-trip Tickets Between Shanghai And Canada\" data-dpi=\"96\" data-filename=\"加航小红书3-4.jpg\" height=\"600\" loading=\"lazy\" src=\"https://ml.globenewswire.com/Resource/Download/fbf7e0dd-212e-4440-9a08-75c6ee37965e/-3-4.jpg\" width=\"450\"/><br/></p> <p align=\"center\"><strong><em>(Round-trip Tickets Between Shanghai And Canada)</em></strong></p> <p align=\"left\">To celebrate the dual anniversarys with all of its over 31 million Club Members, Tims China has partnered with<strong> Air Canada </strong>to celebrate a special “Maple Journey,” offering <strong>four round-trip tickets between Shanghai and a city of choice in Canada</strong>.* This exclusive promotion is a heartfelt thank-you to Chinese consumers for their support over the past seven years, connecting Shanghai and Canada through both coffee and travel.</p> <p align=\"left\">Shanghai is where Tims China began its journey seven years ago. It remains a key strategic hub. Canada, Tim Horton’s birthplace, represents its heritage and roots. From Canada to Shanghai, from a cup of coffee to a long-haul journey, what spans oceans is a connection between people and cities.</p> <p align=\"left\">Tims China’s connection with travel extends beyond this partnership. In recent years, the brand has expanded into key transportation hubs, including airports, high-speed rail stations, and highway service areas, bringing Tims stores to major transit points. Whether in the air or on the move through cities, travelers can enjoy a delicious and trusted Tims experience.</p> <p align=\"left\"><strong>Yongchen Lu, CEO of Tims China,</strong> said: “Over the past seven years, the support and recognition of Chinese consumers, and especially our over 31 million Loyalty Club Members have driven us forward. We have traveled our seven-year journey together every step of the way. Therefore, we are thrilled to express our sincere gratitude to our members by offering four round-trip tickets from Shanghai to a city of choice in Canada where Tim Hortons was founded 62 years ago.* With this milestone anniversary under our belt, our future is bright and we will continue to optimize our ‘Coffee + Freshly Prepared Food’ strategy, guided by local preferences and powered by digitalization and innovation.”</p> <p align=\"left\"><sup>* Enter the lucky draw via the Tims China official WeChat Mini Program.<br/></sup><sup>Travel Period: Mar 1, 2026 – Feb 28, 2027<br/></sup><sup>Route: Shanghai ✈ A city of choice in Canada (economy class round-trip)<br/></sup><sup>Flights must be operated by Air Canada<br/></sup><sup>Round-trip travel must be completed within 90 days<br/></sup><sup>Tickets are non-transferable and cannot be exchanged for cash</sup></p> <p align=\"left\"><strong>ABOUT TH INTERNATIONAL LIMITED</strong></p> <p align=\"justify\">TH International Limited (Nasdaq: <a class=\"symbol-link\" href=\"/overview/THCH/\" title=\"View THCH stock overview\">THCH</a>) (“Tims China”) is the parent company of the exclusive master franchisee of Tim Hortons coffee shops in mainland China, Hong Kong, and Macau. Tims China was founded by Cartesian Capital Group and Tim Hortons Restaurants International, a subsidiary of Restaurant Brands International (TSX: QSR) (NYSE: QSR).</p> <p align=\"justify\">The company’s philosophy is rooted in world-class execution and data-driven decision making and centered around true local relevance, continuous innovation, genuine community, and absolute convenience. For more information, please visit <a href=\"https://www.globenewswire.com/Tracker?data=L-UPebJuvydWfOZ68aP76Aujh0AXuri_BrmpGk95H5v1xa65_3ynjzgFciNszvmJW9S8hxhyE_efhA1YkeKWLMZs-y98muIBm2DhMwGHvY0=\" rel=\"nofollow noopener\" target=\"_blank\">https://www.timschina.com</a>.</p> <p align=\"justify\"><strong>ABOUT AIR CANADA</strong></p> <p align=\"justify\">Air Canada is Canada's largest airline, the country’s flag carrier and a founding member of Star Alliance, the world's most comprehensive air transportation network. Headquartered in Montréal, Air Canada provides scheduled service directly to more than 180 airports in Canada, the United States and Internationally on six continents. It holds a Four-Star ranking from Skytrax. Air Canada’s Aeroplan program is Canada’s premier travel loyalty program, with more than 10 million members worldwide. Members can earn or redeem points on the world’s largest airline partner network of 45 airlines, plus through an extensive range of merchandise, hotel and car rental partners. Through Air Canada Vacations, it offers more travel choices than any other Canadian tour operator to hundreds of destinations worldwide, with a wide selection of hotels, flights, cruises, day tours, and car rentals. Its freight division, Air Canada Cargo, provides air freight lift and connectivity to hundreds of destinations across six continents using Air Canada’s passenger and freighter aircraft. Air Canada’s climate-related ambition includes a long-term aspirational goal of net-zero greenhouse gas emissions by 2050. For additional information, please see Air Canada’s TCFD disclosure. Air Canada shares are publicly traded on the TSX (AC) in Canada and the OTCQX (ACDVF) in the US.</p> <p align=\"left\"><strong>Contacts</strong></p> <p align=\"left\"><strong>Investor Relations</strong><br/><u><a href=\"https://www.globenewswire.com/Tracker?data=ixKEVv5if7vVYvqblc78PJcB5IC6ctSOALlMAci0Uq4J2Yiyjh-93HKzlRPqZhlvBrINCupthkqR7-Yh6XH20j13Dlm3H_xFjuspf9H9W10=\" rel=\"nofollow noopener\" target=\"_blank\">IR@timschina.com</a></u> or <u><a href=\"https://www.globenewswire.com/Tracker?data=yZTCsDZzWyWzJURpKw6Uphb0b6qYE_sUjBbvNAQ5utot0mgCNvTAdZrWQ2aZYPxcOBz_XUBDahp-QmfX5Yd83aWR0p_VQY17CPJjl7vtEonSBfVka-DWLhHykWtXuk4W\" rel=\"nofollow noopener\" target=\"_blank\">gemma.bakx@cartesiangroup.com</a></u></p> <p align=\"left\"><strong>Public Relations</strong><br/><u><a href=\"https://www.globenewswire.com/Tracker?data=aZxTIiACPfmKpiOikiqO6m7DLBDhKMN0T3U7OwuWoSKH3Ris7_j7MfX9QgLm7kuPcGDJD4mGZNvKGsCVixGBFOuJvUElX95JSW3L851y2I0=\" rel=\"nofollow noopener\" target=\"_blank\">patty.yu@timschina.com</a></u></p> <p align=\"left\">Follow @<a href=\"https://www.globenewswire.com/Tracker?data=yCcfO8x_CYLuu5qp_350a5DNr60Z4YapeoC-XBe-RAjKqPqjPFw34kSHMlS133UMgAjHF7ocmDqN4BJnlAVHk9GHXqRXBU1wnqoXsO4Y3hw=\" rel=\"nofollow noopener\" target=\"_blank\">TimHortonsChina</a></p> <p>A photo accompanying this announcement is available at <a href=\"https://www.globenewswire.com/Tracker?data=L-UPebJuvydWfOZ68aP76I8STGkzAPY3rYZ3cIanGNjL8UZx38VbyYEtZr5OLlGCK_CriK5W6caAatkq1H1BsfU5-3r3zsuZBnzMeOmfDeKZBH4Tb6UHy6qjTnoT962feoX9TcFdoyVwemDWpyuScae_0n0YiVZLrjsLOhU3XCsbQsqwHrhd3DsJ5uxkdlQVVjbXToDoNO1vOAUIlAtM-DBcH9WC_Lpc2QNvt4bjmGqGSkPEPtjr013pL0gSUC0GRp4M4Jgzz6bj9m8uzcETYg==\" rel=\"nofollow noopener\" target=\"_blank\">https://www.globenewswire.com/NewsRoom/AttachmentNg/fbf7e0dd-212e-4440-9a08-75c6ee37965e</a></p> <img alt=\"\" class=\"__GNW8366DE3E__IMG\" loading=\"lazy\" src=\"https://www.globenewswire.com/newsroom/ti?nf=OTY2MjcyNiM3NDU4ODkyIzIyMjQ3Nzk=\"/> <br/><img alt=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\" src=\"https://ml.globenewswire.com/media/YTEyMTRkNTQtM2U1OC00MGM0LTk4NjEtMDgzYjU2MWQxOTE3LTEyMzYzMzItMjAyNi0wMi0yNy1lbg==/tiny/TH-International-Limited.png\"/></article>",
            "link": "https://www.stocktitan.net/news/THCH/tims-china-marks-7th-anniversary-partners-with-air-canada-to-8btrb525b8pj.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 06:48:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "District Announces Q2 2026 Results | DMXCF Stock News",
            "description": "<article class=\"article\"><p>Vancouver, British Columbia--(Newsfile Corp. - February 27, 2026) - <b>District Metals Corp. (TSXV: DMX) (Nasdaq First North: DMXSE SDB) (OTCQX: <a class=\"symbol-link\" href=\"/overview/DMXCF/\" title=\"View DMXCF stock overview\">DMXCF</a>) (FSE: DFPP)</b>; (\"<b>District</b>\" or the \"<b>Company</b>\") is pleased to report its results for the three and six months ended December 31, 2025. All amounts are in Canadian dollars, unless otherwise noted.</p><p><b>Highlights</b></p><ul style=\"list-style-type: disc;\"><li>The Company had <money>$8.81</money>7 million in cash and cash equivalents at December 31, 2025.</li></ul><p>The Company's unaudited condensed interim consolidated financial statements for the three and six months ended December 31, 2025 (the \"Financial Statements\") are available on SEDAR+ (<a href=\"https://api.newsfilecorp.com/redirect/LqpZvuGwwj\" rel=\"nofollow noopener\">www.sedarplus.ca</a>) and the Company's website <a href=\"https://api.newsfilecorp.com/redirect/oPygGHBDD2\" rel=\"nofollow noopener\">here</a>. </p><p><b>Next Earnings Report Release</b></p><p>The Company plans to report its third quarter results for the three and nine months ended March 31, 2026 on May 29, 2026.</p><p><b>About District Metals Corp.</b></p><p>District Metals Corp. is led by industry professionals with a track record of success in the mining industry. The Company's mandate is to seek out, explore, and develop prospective mineral properties through a disciplined science-based approach to create shareholder value and benefit other stakeholders. District is a 2025 TSX Venture 50 company, ranking among the top-performing issuers on the TSX Venture Exchange in the past year.</p><p>District is a uranium polymetallic exploration and development company focused on its flagship Viken Property in Sweden. The Viken Property covers <percent>100%</percent> of the Viken Energy Metals Deposit, which contains the largest undeveloped Mineral Resource Estimate of uranium in the world<sup>i</sup> along with significant Mineral Resource Estimates of vanadium, molybdenum, nickel, copper, zinc, and other important and critical raw materials.</p><p>For further information on the Viken Property, please see the technical report entitled \"NI 43-101 Updated Mineral Resource Estimate and Technical Report on the Viken Energy Metals Project, Jämtland County, Sweden\" dated effective April 25, 2025, which is available on SEDAR+ at <a href=\"https://api.newsfilecorp.com/redirect/OARyQU2DDe\" rel=\"nofollow noopener\">www.sedarplus.ca</a>.</p><div id=\"contactInfo\"><p>On Behalf of the Board of Directors</p><p>\"<i>Garrett Ainsworth</i>\"</p><p>President and Chief Executive Officer<br/>(604) 288-4430</p></div><p><i><b>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</b></i></p><p><u><i><b>Cautionary Statement Regarding \"Forward-Looking Information\" </b></i></u></p><p><i>This news release contains certain statements that may be considered \"forward-looking information\" with respect to the Company within the meaning of applicable securities laws. In some cases, but not necessarily in all cases, forward-looking information can be identified by the use of forward-looking terminology such as \"plans\", \"targets\", \"expects\" or \"does not expect\", \"is expected\", \"an opportunity exists\", \"is positioned\", \"estimates\", \"intends\", \"assumes\", \"anticipates\" or \"does not anticipate\" or \"believes\", or variations of such words and phrases or statements that certain actions, events or results \"may\", \"could\", \"would\", \"might\", \"will\" or \"will be taken\", \"occur\" or \"be achieved\" and any similar expressions. In addition, any statements that refer to expectations, predictions, indications, projections or other characterizations of future events or circumstances contain forward-looking information. Statements containing forward-looking information are not historical facts but instead represent management's expectations, estimates and projections regarding future events. Forward-looking information in this news release relating to the Company include, among other things, statements relating to uranium and Alum Shale mining regulation in Sweden.</i></p><p><i>These statements and other forward-looking information are based on opinions, assumptions and estimates made by the Company in light of its experience and perception of historical trends, current conditions and expected future developments, as well as other factors that the Company believes are appropriate and reasonable in the circumstances, as of the date of this news release, including, without limitation, the reliability of exploration and drill results; reliability of data and the accuracy of publicly reported information regarding current, past and historic mines in the Bergslagen district and in respect of the Swedish properties; uranium and Alum Shale exploration and mining regulation in Sweden; the Company's ability to raise sufficient capital to fund planned exploration activities, maintain corporate capacity; stability in financial and capital markets; the Company's ability to complete its planned exploration programs; the absence of adverse conditions at mineral properties; no unforeseen operational delays; no material delays in obtaining necessary permits; the price of metals remaining at levels that render mineral properties economic.</i></p><p><i>Forward-looking information is necessarily based on a number of opinions, assumptions and estimates that, while considered reasonable by the Company as of the date such statements are made, are subject to known and unknown risks, uncertainties, assumptions and other factors that may cause the actual results, level of activity, performance or achievements to be materially different from those expressed or implied by such forward-looking information, including but not limited to risks associated with the following: the results of the inquiry into the mining of Alum Shale in Sweden and the possibility that it will be the subject of a municipal veto; the reliability of historic data on District's properties; the Company's ability to raise sufficient capital to finance planned exploration; the Company's limited operating history; the Company's negative operating cash flow and dependence on third-party financing; the uncertainty of additional funding; the uncertainties associated with early stage exploration activities including general economic, market and business conditions, the regulatory process, failure to obtain necessary permits and approvals, technical issues, potential delays, unexpected events and management's capacity to execute and implement its future plans; the Company's ability to identify Mineral Resources and Mineral Reserves; the substantial expenditures required to establish Mineral Reserves through drilling and the estimation of Mineral Reserves or Mineral Resources; the uncertainty of estimates used to calculated mineralization figures; changes in governmental regulations; compliance with applicable laws and regulations; competition for future resource acquisitions and skilled industry personnel; reliance on key personnel; title matters; conflicts of interest; environmental laws and regulations and associated risks, including climate change legislation; land reclamation requirements; changes in government policies; volatility of the Company's share price; the unlikelihood that shareholders will receive dividends from the Company; potential future acquisitions and joint ventures; infrastructure risks; fluctuations in demand for, and prices of metals; fluctuations in foreign currency exchange rates; legal proceedings and the enforceability of judgments; going concern risk; risks related to the Company's information technology systems and cyber-security risks; and risk related to the outbreak of epidemics or pandemics or other health crises. These factors and assumptions are not intended to represent a complete list of the factors and assumptions that could affect the Company. These factors and assumptions, however, should be considered carefully. Although the Company has attempted to identify factors that would cause actual actions, events or results to differ materially from those disclosed in the forward-looking information or information, there may be other factors that cause actions, events or results not to be as anticipated, estimated or intended. Also, many of such factors are beyond the control of the Company. Accordingly, readers should not place undue reliance on forward-looking information. The forward-looking information is made as of the date of this news release, and the Company assumes no obligation to publicly update or revise such forward-looking information, except as required by applicable securities laws.</i></p><hr style=\"width: 33%; margin-left: 0px; border-top: 1px solid #000000;\"/><p><font style=\"font-size: 11px;\"><sup>i</sup> S&amp;P Global Market Intelligence - Market Intelligence Research</font></p><p id=\"corporateNewsLogoContainer\"><img alt=\"Corporate Logo\" id=\"corporateNewsLogo\" loading=\"lazy\" src=\"https://images.newsfilecorp.com/files/7971/285593_c31f4b08f4abc81e_logo.jpg\"/></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/PqE2mugAAz\" rel=\"nofollow noopener\">https://www.newsfilecorp.com/release/285593</a></p><p><img alt=\"\" loading=\"lazy\" src=\"https://api.newsfilecorp.com/newsinfo/285593/375\"/></p></article>",
            "link": "https://www.stocktitan.net/news/DMXCF/district-announces-q2-2026-o35onuzrivnl.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 05:08:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Manganese X Energy Corp. Pre-Feasibility Update: Geotechnical Drilling and Optimized Metallurgical Processing Initiatives | MNXXF Stock News",
            "description": "<article class=\"article\"><p>Montreal, Quebec--(Newsfile Corp. - February 27, 2026) - <i>Manganese X Energy Corp.</i> (TSXV: MN) (FSE: 9SC) (TRADEGATE: 9SC) (OTCQB: <a class=\"symbol-link\" href=\"/overview/MNXXF/\" title=\"View MNXXF stock overview\">MNXXF</a>) (\"<b>Manganese X</b>\" or the \"<b>Company</b>\") is pleased to provide an update on the advancement of its ongoing Pre-Feasibility Study (\"<b>PFS</b>\") at its flagship Battery Hill Project located in New Brunswick, Canada, including the initiation of additional geotechnical drilling and continued metallurgical process optimization initiatives.</p><p>ABH Engineering Inc<b>.</b>, the lead consulting firm engaged for the Company's PFS, has initiated preliminary engineering activities, including the establishment of the project to include critical path, execution of schedule, and organizational framework.</p><p>Martin Kepman, CEO of Manganese X, stated, \"Advancing geotechnical precision and continuing metallurgical optimization are critical steps in strengthening the foundation of our Pre-Feasibility Study. These initiatives demonstrate our commitment to maximizing project efficiency and reducing operating costs, while positioning Battery Hill as a key domestic supplier of battery-grade manganese.\"</p><p>In support of continued mine plan optimization, and in collaboration with GEMTEC Consulting Engineers and Scientists Limited, the Company has commenced a targeted geotechnical drilling and testing program consisting of three (3) drill holes totaling approximately 550 metres. The objective of this program is to obtain site-specific geotechnical data to support associated infrastructure planning as part of the PFS.</p><p>The program is designed to:</p><ul style=\"list-style-type: disc;\"><li>Determine optimal pit slope angles (\"pit pitch\") for mine design</li><li>Refine geotechnical input parameters for optimized pit wall stability</li><li>Evaluate additional pit development requirements to accommodate processing infrastructure and operational efficiencies</li><li>Collect additional geotechnical and hydrogeological data to enhance the understanding of site and pit hydrogeological conditions</li></ul><p>The results of this program are expected to improve mine design confidence, optimize material movement assumptions, and support the overall economic evaluation of the Battery Hill Project within the updated PFS framework.</p><p>In parallel with mine optimization activities, the Company continues to work with Kemetco Research Inc. in support of the ongoing PFS. Current metallurgical activities are focused on providing technical support to the engineering team and preparing representative product samples to assist with ongoing evaluation and development efforts related to the Battery Hill Project.</p><p>The Company will provide further updates as results become available and are incorporated into the Pre-Feasibility Study.</p><p>The PFS will also involve furthering environmental and social impact investigations, including baseline environmental conditions, permitting needs, and community engagement, and continued development of First Nations relationships.</p><p><u><b>Manganese X Energy Corp. Exhibiting at PDAC Toronto  March 1</b></u><sup><u><b>st</b></u></sup><u><b> - March 4th</b></u></p><p>Manganese X Energy Corp. is pleased to announce that it will be exhibiting at the 2026 convention of the Prospectors &amp; Developers Association of Canada (\"<b>PDAC</b>\"), taking place March 1-4, 2026 at the Metro Toronto Convention Centre in Toronto, Ontario. The Company invites investors and industry participants attending PDAC to visit its newly relocated Booth #2842 in the Investors Exchange, open Sunday, March 1 through Tuesday, March 3 from 10:00 a.m. to 5:00 p.m., and Wednesday, March 4 from 9:00 a.m. to 12:00 p.m. We look forward to seeing you there!</p><p><u><b>About Manganese X Energy Corp. </b></u></p><p>Manganese X's mission is to advance its Battery Hill project into production, thereby becoming the first public actively traded manganese mining company in Canada and the U.S. to commercialize EV compliant high-purity manganese, potentially supplying the North American supply chain. The Company intends on supplying value-added materials to the lithium-ion battery and other alternative energy industries, as well as striving to achieve new carbon-friendly, more efficient methodologies, while processing manganese at a lower, competitive cost. </p><p>For more information, visit the Company's website at <a href=\"https://api.newsfilecorp.com/redirect/87w85COjy7\" rel=\"nofollow noopener\">www.manganesexenergycorp.com</a>.</p><div id=\"contactInfo\"><p>On behalf of the Board of Directors of <br/><b>MANGANESE X ENERGY CORP. </b></p><p>Martin Kepman <br/>CEO and Director <br/>Email: <a href=\"mailto:martin@kepman.com\" rel=\"nofollow noopener\">martin@kepman.com</a><br/>Tel: 1-514-802-1814 </p></div><p>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. </p><p><i><b>Cautionary Note Regarding Forward-Looking Statements: </b></i></p><p><i>This news release contains certain \"forward-looking information\" and \"forward-looking statements\" (collectively \"forward-looking statements\") within the meaning of applicable securities legislation. All statements, other than statements of historical fact, included herein, without limitation, statements relating to the future operations and activities of Manganese X, are forward-looking statements. Forward-looking statements in this news release relate to statements regarding: the timing, scope, and completion of the Pre-Feasibility Study; the expected project economics; potential environmental, technical, and operational outcomes; the Company's development strategy; the advancement and scaling of high-purity manganese processing technologies; the evaluation of processing routes; the anticipated benefits of patent protection and intellectual property; plans toward commercialization; and the Battery Hill Project's potential to become a high-purity manganese production hub in North America. There can be no assurance that such statements will prove to be accurate, and actual results and future events could differ materially from those anticipated in such statements. Forward-looking statements reflect the beliefs, opinions, and projections on the date the statements are made and are based upon a number of assumptions and estimates that, while considered reasonable by Manganese X, are inherently subject to significant business, economic, competitive, political, and social uncertainties and contingencies. Many factors, both known and unknown, could cause actual results, performance or achievements to be materially different from the results, performance, or achievements that are or may be expressed or implied by such forward looking statements, and the parties have made assumptions and estimates based on or related to many of these factors. These risks, as well as others, are disclosed within the Company's filings on SEDAR+ (<a href=\"https://api.newsfilecorp.com/redirect/y4vnEtbZkR\" rel=\"nofollow noopener\">www.sedarplus.ca</a>), which investors are encouraged to review prior to any transaction involving the securities of the Company. Readers should not place undue reliance on the forward-looking statements. Manganese X does not assume any obligation to update the forward-looking statements if beliefs, opinions, projections, or other factors, should change, except as required by applicable securities laws.</i></p><p id=\"corporateNewsLogoContainer\"><img alt=\"Corporate Logo\" id=\"corporateNewsLogo\" loading=\"lazy\" src=\"https://images.newsfilecorp.com/files/2487/285518_218eafd6c4d85894_logo.jpg\"/></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/1KQ8pSRbe4\" rel=\"nofollow noopener\">https://www.newsfilecorp.com/release/285518</a></p><p><img alt=\"\" loading=\"lazy\" src=\"https://api.newsfilecorp.com/newsinfo/285518/375\"/></p></article>",
            "link": "https://www.stocktitan.net/news/MNXXF/manganese-x-energy-corp-pre-feasibility-update-geotechnical-drilling-eq7xbfz6u2jm.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 05:15:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Full Truck Alliance Co. Ltd. to Announce Fourth Quarter and Fiscal Year 2025 Financial Results on Thursday, March 12, 2026 | YMM Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p class=\"prntac\"><b><i>Earnings Call Scheduled for </i></b><b><i>8</i></b><b><i>:00 A.M. <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> ET on </i></b><b><i>March 12, 2026</i></b> </p><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/cn..guyang\">GUIYANG, China</location></span>, <span class=\"legendSpanClass\">Feb. 27, 2026</span> /PRNewswire/ -- Full Truck Alliance Co. Ltd. (\"FTA\" or the \"Company\") (NYSE: <a class=\"symbol-link\" href=\"/overview/YMM/\" title=\"View YMM stock overview\">YMM</a>), a leading digital freight platform, today announced that it will release its fourth quarter and fiscal year 2025 unaudited financial results on Thursday, March 12, 2026, before the open of the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> markets.</p><p>The Company's management will hold an earnings conference call at 8:00 A.M. <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> Eastern Time on March 12, 2026 or 8:00 P.M. Beijing Time to discuss the financial results.</p><p>For participants who wish to join the conference using dial-in numbers, please complete online registration using the link provided below prior to the scheduled call start time.</p><p>Participant Online Registration:<br/><a href=\"https://nam12.safelinks.protection.outlook.com/?url=https%3A%2F%2Fprotect.checkpoint.com%2Fv2%2Fr01%2F___https%3A%2F%2Fs1.c-conf.com%2Fdiamondpass%2F10053167-hy76t5.html___.YzJ1OnBhdWxiYWtlcm5vdGlmaWVkY29tOmM6bzoxN2U4NDNlYzlhODYwZDFkYzU4NDE4NWVmN2I3ZGUyYjo3OjA4YTA6YjliYjcxMDhmMGZlMTVlMjRiMmJmZjMwNjAxMjdmYTc4MjA5OGNjN2Y0YmZkZWI4MzI2MDRlZTVkMmFmNDU4YjpoOlQ6Tg&amp;data=05%7C02%7Ckaryngiselle.uy%40notified.com%7C3e080cf63d074fa213a608de6795902f%7Cf6156a017c5b4c82b9ba5750c109536e%7C0%7C0%7C639062089270928374%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=h6aPzANOJ0odXvLUKhGKQ9Di9xqNtIipueNX9A2JvyM%3D&amp;reserved=0\" rel=\"nofollow noopener\" target=\"_blank\">https://s1.c-conf.com/diamondpass/10053167-hy76t5.html</a></p><p>Upon registration, each participant will receive details for the conference call, including dial-in numbers, and a unique access PIN. To join the conference, please dial the provided number, enter your PIN, and you will join the conference.</p><p>A replay of the conference call will be accessible by phone one hour after the conclusion of the live call at the following numbers, until March 19, 2026:</p><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><location idsrc=\"xmltag.org\" value=\"LC/us\">United States</location>:</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">+1-855-883-1031</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Mainland <location idsrc=\"xmltag.org\" value=\"LC/cn\">China</location>:</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">400-120-9216</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><location idsrc=\"xmltag.org\" value=\"LC/hk\">Hong Kong</location>, SAR:</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">800-930-639</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><location idsrc=\"xmltag.org\" value=\"LC/gb\">United Kingdom</location>:</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0800-031-4295</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><location idsrc=\"xmltag.org\" value=\"LC/sg\">Singapore</location>:</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">800-101-3223</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Replay Access Code:</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">10053167</span></p></td></tr></table></div><p>A live and archived webcast of the conference call will also be available on the Company's investor relations website at <a href=\"http://ir.fulltruckalliance.com/\" rel=\"nofollow noopener\" target=\"_blank\">ir.fulltruckalliance.com</a>.</p><p><b>About Full Truck Alliance Co. Ltd.</b></p><p>Full Truck Alliance Co. Ltd. (NYSE: <a class=\"symbol-link\" href=\"/overview/YMM/\" title=\"View YMM stock overview\">YMM</a>) is a leading digital freight platform connecting shippers with truckers to facilitate shipments across distance ranges, cargo weights and types. The Company provides a range of freight matching services, including freight listing, freight brokerage and transaction services. The Company also provides a range of value-added services that cater to the various needs of shippers and truckers, such as financial institutions, highway authorities, and gas station operators. With a mission to empower enterprises with greater logistics competitiveness, the Company is shaping the future of logistics with technology and aspires to revolutionize logistics, improve efficiency across the value chain and reduce its carbon footprint for our planet. For more information, please visit <a href=\"https://ir.fulltruckalliance.com/\" rel=\"nofollow noopener\" target=\"_blank\">ir.fulltruckalliance.com</a>.</p><p><b>For in</b><b>vestor and media inquiries, please contact:</b></p><p>In <location idsrc=\"xmltag.org\" value=\"LC/cn\">China</location>:</p><p>Full Truck Alliance Co. Ltd.<br/>Mao Mao<br/>E-mail: <a href=\"mailto:IR@amh-group.com\" rel=\"nofollow noopener\" target=\"_blank\">IR@amh-group.com</a></p><p>Piacente Financial Communications<br/>Helen Wu<br/>Tel: +86-10-6508-0677<br/>E-mail: <a href=\"mailto:FTA@thepiacentegroup.com\" rel=\"nofollow noopener\" target=\"_blank\">FTA@thepiacentegroup.com</a></p><p>In <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location>:</p><p>Piacente Financial Communications<br/>Brandi Piacente<br/>Tel: +1-212-481-2050<br/>E-mail: <a href=\"mailto:FTA@thepiacentegroup.com\" rel=\"nofollow noopener\" target=\"_blank\">FTA@thepiacentegroup.com</a></p><p>SOURCE Full Truck Alliance Co. Ltd.</p></div></article>",
            "link": "https://www.stocktitan.net/news/YMM/full-truck-alliance-co-ltd-to-announce-fourth-quarter-and-fiscal-jsg7m32hytmm.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 08:00:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CPP Investments and Equinix to Acquire atNorth for US$4 Billion | EQIX Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p class=\"prntac\"><i>Leading Data Center Provider in the Nordics Has Operations in Five Countries, Providing Equinix with Access to Capacity to Meet Enterprise, AI and Hyperscale Demand in Key Markets</i></p><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/ca.on.tornto\">TORONTO, ON</location> and <location idsrc=\"xmltag.org\" value=\"LU/ca.sk.amster\">AMSTERDAM</location></span>, <span class=\"legendSpanClass\">Feb. 27, 2026</span> /PRNewswire/ -- <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628688-1&amp;h=1490062697&amp;u=http%3A%2F%2Fwww.cppinvestments.com%2F&amp;a=Canada+Pension+Plan+Investment+Board\" rel=\"nofollow noopener\" target=\"_blank\">Canada Pension Plan Investment Board</a> (CPP Investments) and <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628688-1&amp;h=640025225&amp;u=https%3A%2F%2Fwww.equinix.com%2F&amp;a=Equinix%2C+Inc.\" rel=\"nofollow noopener\" target=\"_blank\">Equinix, Inc.</a> (Nasdaq: <a class=\"symbol-link\" href=\"/overview/EQIX/\" title=\"View EQIX stock overview\">EQIX</a>), the world's digital infrastructure company<sup>®</sup>, today announced they have entered into a joint agreement to purchase <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628688-1&amp;h=3834646975&amp;u=http%3A%2F%2Fwww.atnorth.com%2F&amp;a=atNorth\" rel=\"nofollow noopener\" target=\"_blank\">atNorth</a>—a leading Nordic high-density colocation and built-to-suit data center provider—from Partners Group, one of the largest firms in the global private markets industry.</p><p>The <money>US<money>$4 billion</money></money> enterprise value transaction is subject to customary closing conditions, including regulatory approvals. The agreement between CPP Investments and Equinix will support atNorth in its continued rapid scaling, through capturing opportunities created by rising demand for data center infrastructure. CPP Investments will invest approximately <money>US<money>$1.6 billion</money></money>, owning an approximate <percent>60%</percent> controlling interest, and Equinix will own an approximate <percent>40%</percent> stake. The transaction is expected to be immediately accretive upon close to Equinix's adjusted funds from operations (AFFO) per share.</p><p>atNorth's portfolio includes eight operational data centers alongside several sites under development across <location idsrc=\"xmltag.org\" value=\"LC/dk\">Denmark</location>, <location idsrc=\"xmltag.org\" value=\"LC/fi\">Finland</location>, <location idsrc=\"xmltag.org\" value=\"LC/is\">Iceland</location>, <location idsrc=\"xmltag.org\" value=\"LC/no\">Norway</location> and Sweden, as well as plans for further expansion, with 1 GW of secured power and a considerable amount of additional future capacity planned. Designed to meet increasing demand for AI and high-performance computing, several of the company's facilities are liquid cooling-enabled to support high-density workloads. Across its portfolio, atNorth integrates renewable energy sourcing, heat reuse initiatives and efficient modular design to advance circular economy principles and minimize environmental impact.</p><p>\"This acquisition is a powerful validation of atNorth's journey and its market position as the leading Nordics data center platform,\" said<b> Eyjólfur Magnús Kristinsson, CEO of atNorth</b>. \"It further illustrates the strategic importance of the region as <location idsrc=\"xmltag.org\" value=\"LR/eur\">Europe's</location> rising AI powerhouse. I'm extremely proud to announce the next step in our chapter, welcoming this investment from CPP Investments and Equinix, which will enable access to capital, global enterprise, and hyperscale relationships, and supply chain strength required to scale at pace. Our strategy remains firmly rooted in the Nordics, and we will continue to operate independently under the atNorth brand, preserving our dedication to the communities where we operate and the culture and values that have defined our success to date.\"</p><p>\"This transaction builds on our long-standing and highly productive relationship with Equinix,\" said <b>Maximilian Biagosch,</b> <b>Senior Managing Director &amp; Global Head of Real Assets, CPP Investments</b>. \"It demonstrates our conviction and commitment to the data center sector, where demand continues to accelerate, fueled by continued strong enterprise demand as well as cloud and AI adoption. The Nordics are an attractive market for data center growth and the opportunity to partner with Equinix on this acquisition allows us to deploy capital at scale into a high-quality platform, helping us deliver attractive risk-adjusted returns for CPP contributors and beneficiaries.\"   </p><p>\"The scalable sites of atNorth are very complementary to Equinix's connectivity services and global footprint. Combined with our joint focus on sustainability, this acquisition is expected to enhance our ability to help customers unlock the full potential of the Nordics' expanding digital landscape,\" explained <b>Bruce Owen, President, EMEA, Equinix</b>. \"For businesses looking to scale with resilience, Equinix offers a future-ready infrastructure for long-term success, maintaining the jurisdictional and data sovereignty of organizations operating in the region. We are delighted to partner with CPP Investments, whose long-term track record of investing in the sector is highly complementary to Equinix's connectivity services.\"</p><p>There are multiple factors contributing to the Nordics' burgeoning status as a critical hub for the next generation of digital growth. The Nordics region is widely recognized for its strong and resilient economy, supported by a long‑standing emphasis on innovation, research and technical expertise. Renowned worldwide for its leadership in environmentally sustainable projects, the Nordic region provides access to renewable energy sources, bolstered by its naturally cool climates.</p><p><b>Highlights / Key Facts</b></p><ul type=\"disc\"><li>As part of the transaction, CPP Investments and Equinix have provisionally agreed to a financing package of <money>US<money>$4.2 billion</money></money> (<money>€3.6 billion</money>), underwritten by a group of European and Canadian lenders to fund the transaction as well as the capital required to fund the expansion of the business.</li><li>atNorth has an installed and active development pipeline of approximately 800 MW that will come online over the next five years. In addition, it has plans for significant further expansion, with an additional 1 GW of secured power and a considerable amount of future capacity planned, providing a platform for future expansion across the Nordics.</li><li>Equinix currently operates eight data centers in the Nordics, including five in <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628688-1&amp;h=2692398387&amp;u=https%3A%2F%2Fwww.equinix.com%2Fdata-centers%2Feurope-colocation%2Ffinland-colocation%2Fhelsinki-data-centers&amp;a=Helsinki\" rel=\"nofollow noopener\" target=\"_blank\"><location idsrc=\"xmltag.org\" value=\"LU/fi..helsin\">Helsinki</location></a> and three in <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628688-1&amp;h=1205765313&amp;u=https%3A%2F%2Fwww.equinix.com%2Fdata-centers%2Feurope-colocation%2Fsweden-colocation%2Fstockholm-data-centers&amp;a=Stockholm\" rel=\"nofollow noopener\" target=\"_blank\"><location idsrc=\"xmltag.org\" value=\"LU/se..stholm\">Stockholm</location></a>, contributing to a wider European footprint of over 100 facilities across 20 countries. This regional reach enables customers to deploy infrastructure close to end users and directly connect with AI, cloud, network and enterprise partners anywhere in the world.</li><li>The transaction adds to CPP Investments' long-standing collaboration with Equinix, which includes a 2024 <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628688-1&amp;h=2930075323&amp;u=https%3A%2F%2Finvestor.equinix.com%2Fnews-events%2Fpress-releases%2Fdetail%2F1053%2Fequinix-agrees-to-form-greater-than-15b-jv-to-expand&amp;a=joint+venture\" rel=\"nofollow noopener\" target=\"_blank\">joint venture</a> alongside GIC to expand the Equinix xScale<sup>®</sup> data center program.</li><li>The investment further enhances CPP Investments' global data center strategy and builds out its presence in <location idsrc=\"xmltag.org\" value=\"LR/eur\">Europe</location>.</li><li>Designing for responsible operations and in line with atNorth's sustainability focus, Equinix operates all its European facilities with <percent>100%</percent> renewable energy coverage and is on track to achieve its global net-zero target by 2040. The company's environmental strategy centers around implementing energy efficiency initiatives to optimize energy usage, piloting innovative decarbonization solutions and collaborating with suppliers to address emissions.</li><li>Equinix delivers customer-controlled sovereignty, providing the foundation of digital infrastructure—secure facilities, reliable power, private connectivity—with customers keeping <percent>100%</percent> control of their technology stack, data and operational decisions. The company's global infrastructure enables organizations to access comprehensive ecosystems around the world while maintaining uncompromising local control.</li><li>Equinix was advised by Guggenheim Securities Europe Ltd. as financial advisor as well as Slaughter and May as legal advisor.</li></ul><p><b>Additional Resources</b> </p><ul type=\"disc\"><li><u><a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628688-1&amp;h=4112968632&amp;u=https%3A%2F%2Fsustainability.equinix.com%2F&amp;a=Sustainability+at+Equinix\" rel=\"nofollow noopener\" target=\"_blank\">Sustainability at Equinix</a></u> [website]</li><li><a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628688-1&amp;h=573887298&amp;u=https%3A%2F%2Fwww.equinix.com%2Fdata-centers%2Feurope-colocation&amp;a=Unmatched+interconnection%2C+scalable+colocation+and+infrastructure+across+Europe%2C+the+Middle+East+and+Africa\" rel=\"nofollow noopener\" target=\"_blank\">Unmatched interconnection, scalable colocation and infrastructure across <location idsrc=\"xmltag.org\" value=\"LR/eur\">Europe</location>, the <location idsrc=\"xmltag.org\" value=\"LR/mde\">Middle East</location> and <location idsrc=\"xmltag.org\" value=\"LR/afr\">Africa</location></a> [website]</li><li><a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628688-1&amp;h=1078967562&amp;u=https%3A%2F%2Fblog.equinix.com%2Fblog%2F2024%2F03%2F07%2Fwhats-driving-the-digital-economy-in-the-nordic-countries%2F&amp;a=What%27s+Driving+the+Digital+Economy+in+the+Nordic+Countries%3F\" rel=\"nofollow noopener\" target=\"_blank\">What's Driving the Digital Economy in the Nordic Countries?</a> [blog]</li><li><a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628688-1&amp;h=3092881195&amp;u=https%3A%2F%2Fblog.equinix.com%2Fblog%2F2026%2F01%2F28%2Fthe-future-of-autonomous-networking-how-ai-is-redefining-connectivity%2F&amp;a=The+Future+of+Autonomous+Networking%3A+How+AI+Is+Redefining+Connectivity\" rel=\"nofollow noopener\" target=\"_blank\">The Future of Autonomous Networking: How AI Is Redefining Connectivity</a> [blog]</li></ul><p><b>About atNorth</b> <br/>atNorth is the leading Nordic data center company that offers cost-effective, <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628688-1&amp;h=1924781838&amp;u=https%3A%2F%2Fwww.atnorth.com%2Fsolutions%2Fhigh-density-colocation%2F&amp;a=scalable+high-density+colocation\" rel=\"nofollow noopener\" target=\"_blank\">scalable high-density colocation</a> and built-to-suit services trusted by industry-leading organizations. With <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628688-1&amp;h=1196358003&amp;u=https%3A%2F%2Fwww.atnorth.com%2Fsustainability%2Fsustainability-strategy%2F&amp;a=sustainability+at+its+core\" rel=\"nofollow noopener\" target=\"_blank\">sustainability at its core</a>, atNorth's data centers run on renewable energy resources and support circular economy principles. All atNorth sites leverage innovative design, power efficiency, and intelligent operations to provide long-term infrastructure and flexible colocation deployments. atNorth is headquartered in <location idsrc=\"xmltag.org\" value=\"LU/is..reykjk\">Reykjavik, Iceland</location> and <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628688-1&amp;h=4013917974&amp;u=https%3A%2F%2Fwww.atnorth.com%2Fnordic-data-centers%2F&amp;a=operates+eight+data+centers\" rel=\"nofollow noopener\" target=\"_blank\">operates eight data centers</a> in strategic locations across the Nordics, as well as a ninth under construction in Kouvola, <location idsrc=\"xmltag.org\" value=\"LC/fi\">Finland</location>, a tenth site in Ølgod, <location idsrc=\"xmltag.org\" value=\"LC/dk\">Denmark</location> and an eleventh campus in <location idsrc=\"xmltag.org\" value=\"LU/se..stholm\">Stockholm, Sweden</location>. The business has also announced a new mega-site development in the Sollefteå Municipality in <location idsrc=\"xmltag.org\" value=\"LC/se\">Sweden</location>.</p><p>For more information, visit atNorth.com or follow atNorth on <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628688-1&amp;h=2474737431&amp;u=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2F18014497&amp;a=LinkedIn\" rel=\"nofollow noopener\" target=\"_blank\">LinkedIn</a>.  </p><p><b>About CPP Investments<br/></b>Canada Pension Plan Investment Board (CPP Investments™) is a professional investment management organization that manages the Canada Pension Plan Fund in the best interest of the more than 22 million contributors and beneficiaries. In order to build diversified portfolios of assets, we make investments around the world in public equities, private equities, real estate, infrastructure, fixed income and alternative strategies including in partnership with funds. Headquartered in <location idsrc=\"xmltag.org\" value=\"LU/ca.on.tornto\">Toronto</location>, with offices in <location idsrc=\"xmltag.org\" value=\"LC/hk\">Hong Kong</location>, <location idsrc=\"xmltag.org\" value=\"LU/gb.eng.london\">London</location>, <location idsrc=\"xmltag.org\" value=\"LU/in..bombay\">Mumbai</location>, <location idsrc=\"xmltag.org\" value=\"LU/us.ny.nyc\">New York City</location>, São Paulo and <location idsrc=\"xmltag.org\" value=\"LU/au..sydney\">Sydney</location>, CPP Investments is governed and managed independently of the Canada Pension Plan and at arm's length from governments. At December 31, 2025, the Fund totaled <money>C<money>$780.7 billion</money></money>. For more information, please visit <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628688-1&amp;h=2966501133&amp;u=http%3A%2F%2Fwww.cppinvestments.com%2F&amp;a=www.cppinvestments.com\" rel=\"nofollow noopener\" target=\"_blank\">www.cppinvestments.com</a> or follow us on <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628688-1&amp;h=2103465990&amp;u=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fcppinvestments%2F&amp;a=LinkedIn\" rel=\"nofollow noopener\" target=\"_blank\">LinkedIn</a>, <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628688-1&amp;h=2570470615&amp;u=https%3A%2F%2Fwww.instagram.com%2Fcppinvestments%2F&amp;a=Instagram\" rel=\"nofollow noopener\" target=\"_blank\">Instagram</a> or on X <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628688-1&amp;h=2657408135&amp;u=https%3A%2F%2Ftwitter.com%2Fcppinvestments&amp;a=%40CPPInvestments\" rel=\"nofollow noopener\" target=\"_blank\">@CPPInvestments</a>.</p><p><b>About Equinix<br/></b><a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628688-1&amp;h=2977580831&amp;u=https%3A%2F%2Fwww.equinix.com%2F&amp;a=Equinix\" rel=\"nofollow noopener\" target=\"_blank\">Equinix</a>, Inc. (Nasdaq: <a class=\"symbol-link\" href=\"/overview/EQIX/\" title=\"View EQIX stock overview\">EQIX</a>) shortens the path to boundless connectivity anywhere in the world. Its digital infrastructure, data center footprint and interconnected ecosystems empower innovations that enhance our work, life and planet. Equinix connects economies, countries, organizations and communities, delivering seamless digital experiences and cutting-edge AI—quickly, efficiently and everywhere.</p><p><b>Forward-Looking Statements<br/></b><i>This press release contains forward-looking statements that involve risks and uncertainties. Actual results may differ materially from expectations discussed in such forward-looking statements, including statements related to the acquisition of atNorth, the joint agreement between CPP investments and Equinix and the expected benefits from the acquisition or the joint agreement. Factors that might cause such differences include, but are not limited to, risks related to the ability to complete the closing of the acquisition on the proposed terms, including obtaining regulatory approval; any inability to obtain financing as needed to complete the acquisition; risks to our business and operating results related to the current inflationary environment; foreign currency exchange rate fluctuations; stock price fluctuations; increased costs to procure power and the general volatility in the global energy market; the challenges of building and operating IBX<sup>®</sup> and xScale<sup>®</sup> data centers, including those related to sourcing suitable power and land, and any supply chain constraints or increased costs of supplies; the challenges of developing, deploying and delivering Equinix products and solutions; unanticipated costs or difficulties relating to the integration of companies we have acquired or will acquire into Equinix; a failure to receive significant revenues from customers in recently built out or acquired data centers, including the atNorth data centers; failure to complete any financing arrangements contemplated from time to time; competition from existing and new competitors; the ability to generate sufficient cash flow or otherwise obtain funds to repay new or outstanding indebtedness; the loss or decline in business from our key customers; risks related to our taxation as a REIT; risks related to regulatory inquiries or litigation; and other risks described from time to time in Equinix filings with the Securities and Exchange Commission. In particular, see recent and upcoming Equinix quarterly and annual reports filed with the Securities and Exchange Commission, copies of which are available upon request from Equinix. Equinix does not assume any obligation to update the forward-looking information contained in this press release. </i></p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder6777\"><p><a href=\"https://mma.prnewswire.com/media/2921635/Photo_of_one_of_the_atNorth_facilities_in_the_Nordics_Equinix_Inc.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"Photo of one of the atNorth facilities in the Nordics\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/2921635/Photo_of_one_of_the_atNorth_facilities_in_the_Nordics_Equinix_Inc.jpg\" title=\"Photo of one of the atNorth facilities in the Nordics\"/></a></p></div><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder3565\"><p><a href=\"https://mma.prnewswire.com/media/276273/equinix_times_square_logo.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"Equinix.  (PRNewsFoto/Equinix) (PRNewsfoto/Equinix, Inc.)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/276273/equinix_times_square_logo.jpg\" title=\"Equinix.  (PRNewsFoto/Equinix) (PRNewsfoto/Equinix, Inc.)\"/></a></p></div><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder0\"></div><p>SOURCE Equinix, Inc.</p></div></article>",
            "link": "https://www.stocktitan.net/news/EQIX/cpp-investments-and-equinix-to-acquire-at-north-for-us-4-z8zkta4x78w6.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 08:00:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NextEra Energy announces sale of equity units | NEE Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.fl.junach\">JUNO BEACH, Fla.</location></span>, <span class=\"legendSpanClass\">Feb. 26, 2026</span> /PRNewswire/ -- NextEra Energy, Inc. (NYSE: <a class=\"symbol-link\" href=\"/overview/NEE/\" title=\"View NEE stock overview\">NEE</a>) announced today that it has priced its public offering of <money><money>$2.00 billion</money></money> of equity units. The transaction is expected to close on March 3, 2026.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\"><p><a href=\"https://mma.prnewswire.com/media/2804083/NextEra_Energy_Logo.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"NextEra Energy (PRNewsfoto/NextEra Energy)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/2804083/NextEra_Energy_Logo.jpg\" title=\"NextEra Energy (PRNewsfoto/NextEra Energy)\"/></a></p></div><p>NextEra Energy, Inc. has granted the underwriters an option to purchase during the 13-day period beginning on, and including, the closing date up to an additional aggregate stated amount of <money><money>$0.30 billion</money></money>, solely for the purpose of covering over-allotments.</p><p>The net proceeds from the sale of the equity units, which are expected to be approximately <money><money>$1.97 billion</money></money> (or approximately <money><money>$2.27 billion</money></money> if the over-allotment option is exercised in full), after deducting the underwriting discount but before deducting other offering expenses, will be added to the general funds of NextEra Energy Capital Holdings, Inc., a wholly owned subsidiary of NextEra Energy. NextEra Energy Capital Holdings expects to use its general funds to fund investments in energy and power projects and for other general corporate purposes, including the repayment of a portion of its outstanding commercial paper obligations.</p><p>Each equity unit will be issued in a stated amount of <money><money>$50</money></money>. Each equity unit will consist of a contract to purchase NextEra Energy common stock in the future, and undivided beneficial ownership interests in two series of debentures issued by NextEra Energy Capital Holdings, consisting of a Series P Debenture due March 1, 2031, and a Series Q Debenture due March 1, 2034, each with a principal amount of <money><money>$1,000</money></money>. The debentures will be guaranteed by NextEra Energy. Total annual distributions on the equity units will be at the rate of <percent>7.375%</percent> on the stated amount of <money><money>$50</money></money> per unit, consisting of interest on the debentures and payments under the stock purchase contracts.</p><p>In approximately three years, each stock purchase contract will require the holder to purchase NextEra Energy common stock for cash, based on a per-share price range of <money><money>$91.99</money></money> to <money><money>$115.00</money></money>. The higher end of this price range reflects a premium of approximately <percent>25%</percent> over the New York Stock Exchange closing price of NextEra Energy common stock on Feb. 26, 2026, which was <money><money>$91.99</money></money>. The holders of the equity units must complete the stock purchase by no later than Feb. 15, 2029, with the required purchase price of stock purchased on that date determined based on the average closing price of NextEra Energy's common stock over the 20 consecutive trading day period ending on Feb. 12, 2029. The holders may satisfy their purchase obligations with proceeds raised from remarketing the debentures that comprise part of their equity units.</p><p>Upon settlement of the purchase contract, NextEra Energy will receive cash and will issue the requisite number of shares of its common stock. Before the issuance of NextEra Energy common stock upon settlement of the purchase contracts, the purchase contracts will be reflected in NextEra Energy's diluted earnings per share calculations using the treasury stock method.</p><p>Wells Fargo Securities, BofA Securities, Citigroup and Mizuho will be joint book-running managers for the offering.</p><p>This news release does not constitute an offer to sell or a solicitation of an offer to buy any securities, nor shall there be any sale of securities to which this communication relates in any jurisdiction in which such an offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. The offering may be made only by means of a prospectus and the related prospectus supplement, copies of which may be obtained from Wells Fargo Securities, 90 South 7th Street, 5th Floor, <location idsrc=\"xmltag.org\" value=\"LU/us.mn.minnea\">Minneapolis, Minnesota</location> 55402, by telephone toll free at 800-645-3751 (option #5) or by email at <a href=\"mailto:WFScustomerservice@wellsfargo.com\" rel=\"nofollow noopener\" target=\"_blank\">WFScustomerservice@wellsfargo.com</a>; BofA Securities at NC1-022-02-25, 201 North Tryon Street, Charlotte, NC 28255-0001 Attn: Prospectus Department, or by email at <a href=\"mailto:dg.prospectus_requests@bofa.com\" rel=\"nofollow noopener\" target=\"_blank\">dg.prospectus_requests@bofa.com</a>; Citigroup, c/o Broadridge Financial Solutions,1155 Long Island Avenue, <location idsrc=\"xmltag.org\" value=\"LU/us.ny.edgood\">Edgewood, New York</location> 11717, by telephone toll free at 800-831-9146; and Mizuho Securities <location idsrc=\"xmltag.org\" value=\"LC/us\">USA</location> LLC, 1271 Avenue of the <location idsrc=\"xmltag.org\" value=\"LR/am\">Americas</location>, 3rd Floor, <location idsrc=\"xmltag.org\" value=\"LU/us.ny.nyc\">New York New York</location> 10020 Attn: Equity Capital Markets, by telephone at 212-205-7600 or by email at <a href=\"mailto:US-ECM@mizuhogroup.com\" rel=\"nofollow noopener\" target=\"_blank\">US-ECM@mizuhogroup.com</a>.</p><p><b>NextEra Energy, Inc.<br/></b>NextEra Energy, Inc. (NYSE: <a class=\"symbol-link\" href=\"/overview/NEE/\" title=\"View NEE stock overview\">NEE</a>) is the largest electric power and energy infrastructure company in <location idsrc=\"xmltag.org\" value=\"LB/nam\">North America</location> and is a leading provider of electricity to American homes and businesses. Headquartered in <location idsrc=\"xmltag.org\" value=\"LU/us.fl.junach\">Juno Beach, Florida</location>, NextEra Energy is a Fortune 200 company that owns Florida Power &amp; Light Company, America's largest electric utility, which provides reliable electricity to approximately 12 million people across <location idsrc=\"xmltag.org\" value=\"LS/us.fl\">Florida</location>. NextEra Energy also owns the largest energy infrastructure development company in the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location>, NextEra Energy Resources, LLC. NextEra Energy and its affiliated entities are meeting America's growing energy needs with a diverse mix of energy sources, including natural gas, nuclear, renewable energy and battery storage. </p><p class=\"prntac\"><b>Cautionary Statements and Risk Factors That May Affect Future Results</b></p><p>This news release contains \"forward-looking statements\" within the meaning of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements are not statements of historical facts, but instead represent the current expectations of NextEra Energy, Inc. (together with its subsidiaries, NextEra Energy) regarding future operating results and other future events, many of which, by their nature, are inherently uncertain and outside of NextEra Energy's control. In some cases, you can identify the forward-looking statements by words or phrases such as \"will,\" \"may result,\" \"expect,\" \"anticipate,\" \"believe,\" \"intend,\" \"plan,\" \"seek,\" \"potential,\" \"projection,\" \"forecast,\" \"predict,\" \"goals,\" \"target,\" \"outlook,\" \"should,\" \"would\" or similar words or expressions. You should not place undue reliance on these forward-looking statements, which are not a guarantee of future performance. The future results of NextEra Energy and its business and financial condition are subject to risks and uncertainties that could cause actual results to differ materially from those expressed or implied in the forward-looking statements, or may require it to limit or eliminate certain operations. These risks and uncertainties include, but are not limited to, those discussed in this news release and the following: effects of extensive regulation of NextEra Energy's business operations; inability of NextEra Energy to recover in a timely manner any significant amount of costs, a return on certain assets or a reasonable return on invested capital through base rates, cost recovery clauses, other regulatory mechanisms or otherwise; impact of political, regulatory, operational and economic factors on regulatory decisions important to NextEra Energy; effect of any reductions or modifications to, or elimination of, governmental incentives or policies that support clean energy or changes in or the imposition of additional tax laws, tariffs, duties, policies or other costs or assessments on clean energy or equipment necessary to generate, store or deliver it; impact of new or revised laws, regulations, executive orders, interpretations or constitutional ballot and regulatory initiatives on NextEra Energy; capital expenditures, increased operating costs and various liabilities attributable to environmental laws, regulations and other standards applicable to NextEra Energy; effects on NextEra Energy of federal or state laws or regulations mandating new or additional limits on the production of greenhouse gas emissions; exposure of NextEra Energy to significant and increasing compliance costs and substantial monetary penalties and other sanctions as a result of extensive federal, state and local government regulation of its operations and businesses; effect on NextEra Energy of changes in tax laws, guidance or policies as well as in judgments and estimates used to determine tax-related asset and liability amounts; impact on NextEra Energy of adverse results of litigation; impacts of NextEra Energy of allegations of violations of law; effect on NextEra Energy of failure to proceed with projects under development or inability to complete the construction of (or capital improvements to) electric generation, storage, transmission and distribution facilities, natural gas and oil production and transportation facilities and other facilities on schedule or within budget; impact on development and operating activities of NextEra Energy resulting from risks related to project siting, construction, permitting, governmental approvals and the negotiation of project development agreements, as well as supply chain disruptions; risks involved in the operation and maintenance of electric generation, storage, transmission and distribution facilities, natural gas and oil production and transportation facilities, and other facilities; effect on NextEra Energy of a lack of growth, slower growth or a decline in the number of customers or in customer usage; planned productivity increases and competitive advantages through the use of artificial intelligence technologies may not be realized and the use of and reliance on artificial intelligence may present certain risks; impact on NextEra Energy of severe weather and other weather conditions; threats of terrorism and catastrophic events that could result from geopolitical factors, terrorism, cyberattacks or other attempts to disrupt NextEra Energy's business or the businesses of third parties; inability to obtain adequate insurance coverage for protection of NextEra Energy against significant losses and risk that insurance coverage does not provide protection against all significant losses; a prolonged period of low natural gas and oil prices, disrupted production or unsuccessful drilling efforts could impact NextEra Energy's natural gas and oil production and transportation operations and cause NextEra Energy to delay or cancel certain natural gas and oil production projects and could result in certain assets becoming impaired; risk of increased operating costs resulting from unfavorable supply costs necessary to provide full energy and capacity requirements services; inability or failure to manage properly or hedge effectively the commodity risk within its portfolio; effect of reductions in the liquidity of energy markets on NextEra Energy's ability to manage operational risks; effectiveness of NextEra Energy's risk management tools associated with its hedging and trading procedures to protect against significant losses, including the effect of unforeseen price variances from historical behavior; impact of unavailability or disruption of power transmission or commodity transportation operations on sale and delivery of power or natural gas; exposure of NextEra Energy to credit and performance risk from customers, hedging counterparties and vendors; failure of counterparties to perform under derivative contracts or of requirement for NextEra Energy to post margin cash collateral under derivative contracts; failure or breach of NextEra Energy's information technology systems, or implementation challenges; risks to NextEra Energy's retail businesses from compromise of sensitive customer data; losses from volatility in the market values of derivative instruments and limited liquidity in over-the-counter markets; impact of negative publicity; inability to maintain, negotiate or renegotiate acceptable franchise agreements; occurrence of work strikes or stoppages and increasing personnel costs; NextEra Energy's ability to successfully identify, complete and integrate acquisitions, including the effect of increased competition for acquisitions; environmental, health and financial risks associated with ownership and operation of nuclear generation facilities; liability of NextEra Energy for significant retrospective assessments and/or retrospective insurance premiums in the event of an incident at certain nuclear generation facilities; increased operating and capital expenditures and/or reduced revenues at nuclear generation facilities resulting from orders or new regulations of the Nuclear Regulatory Commission; inability to operate any of NextEra Energy's owned nuclear generation units through the end of their respective operating licenses or planned license extensions; effect of disruptions, uncertainty or volatility in the credit and capital markets or actions by third parties in connection with project-specific or other financing arrangements on NextEra Energy's ability to fund its liquidity and capital needs and meet its growth objectives; defaults or noncompliance related to project-specific, limited-recourse financing agreements; inability to maintain current credit ratings; reduced liquidity from the inability of credit providers to fund their credit commitments or to maintain their current credit ratings; poor market performance and other economic factors that could affect NextEra Energy's defined benefit pension plan's funded status; poor market performance and other risks to the asset values of nuclear decommissioning funds; changes in market value and other risks to certain of NextEra Energy's assets and investments; effect of inability of NextEra Energy subsidiaries to pay upstream dividends, make distributions or repay funds to NextEra Energy or of NextEra Energy's performance under guarantees of subsidiary obligations on NextEra Energy's ability to meet its financial obligations and to pay dividends on its common stock; the fact that the amount and timing of dividends payable on NextEra Energy's common stock, as well as the dividend policy approved by NextEra Energy's board of directors from time to time, and changes to that policy, are within the sole discretion of NextEra Energy's board of directors and, if declared and paid, dividends may be in amounts that are less than might be expected by shareholders; effects of disruptions, uncertainty or volatility in the credit and capital markets on the market price of NextEra Energy's common stock; and the ultimate severity and duration of public health crises, epidemics and pandemics, and its effects on NextEra Energy's business. NextEra Energy discusses these and other risks and uncertainties in its annual report on Form 10-K for the year ended December 31, 2025 and other Securities and Exchange Commission (SEC) filings, and this news release should be read in conjunction with such SEC filings. The forward-looking statements made in this news release are made only as of the date of this news release and NextEra Energy undertakes no obligation to update any forward-looking statements.</p><p>SOURCE NextEra Energy</p></div></article>",
            "link": "https://www.stocktitan.net/news/NEE/next-era-energy-announces-sale-of-equity-jyb4xx75zhvd.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 01:41:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FRMO Corp. Announces Fiscal 2026 Second Quarter Results and Conference Call | FRMO Stock News",
            "description": "<article class=\"article\"><p><strong id=\"dateline\">WHITE PLAINS, NY / <a href=\"https://www.accessnewswire.com/\" rel=\"nofollow noopener\">ACCESS Newswire</a> / February 26, 2026 / </strong>FRMO Corp. (the \"Company\" or \"<a class=\"symbol-link\" href=\"/overview/FRMO/\" title=\"View FRMO stock overview\">FRMO</a>\") (OTC Pink:FRMO) reported its financial results for the fiscal year 2026 second quarter ended November 30, 2025.</p><p><strong>Financial Highlights</strong></p><p>FRMO's total book value as of November 30, 2025 was <money>$530.0 million</money>. Excluding the non-controlling interests, equity attributable to shareholders was <money>$293.3 million</money> (<money>$6.66</money> per share). This compares with total book value at the prior fiscal year end on May 31, 2025 of <money>$617.8 million</money> (as restated). Excluding the non-controlling interests, equity attributable to shareholders was <money>$319.6 million</money> (<money>$7.26</money> per share) at May 31, 2025 (as restated).</p><p>Current assets, comprised primarily of cash and cash equivalents, amounted to <money>$46.4 million</money> as of November 30, 2025, and <money>$46.3 million</money> as of May 31, 2025. Total liabilities were <money>$81.8 million</money> as of November 30, 2025, and <money>$95.6 million</money> as of May 31, 2025 (as restated), comprised primarily of deferred taxes and securities sold, not yet purchased.</p><p>FRMO's net loss attributable to the Company for the quarter ended November 30, 2025 was <money>$13.0 million</money> (<money>$0.30</money> per diluted share), compared to net income of <money>$115.6 million</money> (<money>$2.63</money> per diluted share) a year earlier. The equity security investment that accounts for the net loss is identified as Investment A in Note 4 of the Interim Condensed Consolidated Financial Statements under Investment Concentration.</p><p>For the six months ended November 30, 2025, <a class=\"symbol-link\" href=\"/overview/FRMO/\" title=\"View FRMO stock overview\">FRMO</a>'s net loss attributable to the Company was <money>$26.4 million</money> (<money>$0.60</money> per diluted share), compared to net income of <money>$145.0 million</money> (<money>$3.29</money> per diluted share) a year earlier.</p><p>Net loss attributable to the Company excluding the effect of unrealized gain or loss from equity securities and digital assets net of taxes for the three months ended November 30, 2025 was <money>$7.3 million</money> (<money>$0.17</money> per diluted share) compared to net income of <money>$46.1 million</money> (<money>$1.05</money> per diluted share) for the three months ended November 30, 2024 (as restated). The six-month figures, as of the same end dates, are a net loss of <money>$8.6 million</money> (<money>$0.20</money> per diluted share) in 2025 compared to net income of <money>$53.3 million</money> (<money>$1.21</money> per diluted share) in 2024 (as restated).</p><p>Net income or loss attributable to the Company excluding the effect of unrealized gain or loss from equity securities and digital assets net of taxes is a measure not based on GAAP and is defined and reconciled to the most directly comparable GAAP measures in \"Information Regarding Non-GAAP Measures\" at the end of this release.</p><p>Valuation of securities and digital assets are subject to change after November 30, 2025. The market value of several securities and digital assets might have changed substantially since that date. We look forward to finding new ways to expand our digital assets mining operations.</p><p>The interim condensed consolidated financial statements include the accounts of <a class=\"symbol-link\" href=\"/overview/FRMO/\" title=\"View FRMO stock overview\">FRMO</a> Corporation and its controlled subsidiaries (collectively referred to as the \"Company\"). As of November 30, 2025 and May 31, 2025, the Company held a <percent>21.77%</percent> and <percent>21.82%</percent> equity interest in Horizon Kinetics Hard Assets LLC (\"HKHA\"), a company formed by Horizon Kinetics Holding Corporation (\"HKHC\") or (\"Horizon\") and certain officers, principal stockholders and directors of the Company. The Company owns <percent>4.42%</percent> of HKHC and earns substantially all of its advisory fees from HKHC (see Note 4 - Investments, Investments under the Equity Method of Accounting). Due to the common control and ownership between HKHA and the Company's principal stockholders and directors, HKHA has been consolidated within the Company's financial statements. The noncontrolling interest of <percent>78.23%</percent> and <percent>78.12%</percent> in HKHA has been eliminated from results of operations for the periods ended November 30, 2025 and November 30, 2024. Total stockholders' equity includes, as a separate item, the amount attributable to the noncontrolling interests.</p><p>Further details are available in the Company's Condensed Consolidated Financial Statements for the three months and six months ended November 30, 2025 and November 30, 2024. These statements have been filed on the OTC Markets Group Disclosure and News Services, which may be accessed at <a href=\"https://pr.report/j401\" rel=\"nofollow noopener\">www.otcmarkets.com/stock/FRMO/filings</a>. These documents are also available on the FRMO website at <a href=\"https://pr.report/j402\" rel=\"nofollow noopener\">www.frmocorp.com</a>.</p><p><strong>Conference Call</strong></p><p>Murray Stahl, CEO, and Steven Bregman, President and CFO, will host a conference call on Tuesday, March 3, 2026 at 4:15 p.m. Eastern Time. <i>Only questions submitted to </i><a href=\"mailto:info@frmocorp.com\" rel=\"nofollow noopener\"><i>info@frmocorp.com</i></a><i> before 1:00 p.m. on the day of the call will be considered</i>. You may register for the conference call by clicking on the following link:</p><p><u>Please register for FRMO 2Q 2026 Quarterly Conference Call on March 3, 2026 4:15 PM EDT at:</u></p><p><a href=\"https://pr.report/j403\" rel=\"nofollow noopener\">https://attendee.gotowebinar.com/register/5914319678803745365</a></p><p>After registering, you will receive a confirmation email containing information about joining the webinar.</p><p>An audio replay link will be available on the FRMO website (<a href=\"https://pr.report/j404\" rel=\"nofollow noopener\">https://frmocorp.com/q_transcripts.html</a>) until the summary transcript is posted.</p><a href=\"https://app.accessnewswire.com/imagelibrary/24283307-76a5-458a-9ce4-68b4b568d3d5/1142101/table-1.png\" rel=\"nofollow noopener\"><img loading=\"lazy\" src=\"https://app.accessnewswire.com/imagelibrary/24283307-76a5-458a-9ce4-68b4b568d3d5/1142101/table-1.png\" style=\"width:722px;text-align:center;margin:0.9em auto;\"/></a><div></div><div></div><div></div><a href=\"https://app.accessnewswire.com/imagelibrary/ea6bc7b6-b18c-4a8d-b5ea-32add0636438/1142101/table-2.png\" rel=\"nofollow noopener\"><img loading=\"lazy\" src=\"https://app.accessnewswire.com/imagelibrary/ea6bc7b6-b18c-4a8d-b5ea-32add0636438/1142101/table-2.png\" style=\"width:745px;text-align:center;margin:0.9em auto;\"/></a><div></div><div></div><div></div><p><strong>About FRMO Corp.</strong></p><p style=\"text-align:justify;\">FRMO Corp. is an intellectual capital firm that provides consulting and advisory services in the asset management sector and engages in the mining of digital assets.</p><p style=\"text-align:justify;\">FRMO had 44,022,781 shares of common stock outstanding as of November 30, 2025.</p><p style=\"text-align:justify;\">For more information, visit our website at <a href=\"https://pr.report/j405\" rel=\"nofollow noopener\">www.frmocorp.com</a>.</p><p style=\"text-align:justify;\"><strong>Safe Harbor Statement Under the Private Securities Litigation Reform Act of 1995</strong> - With the exception of historical information, the matters discussed in this press release are forward-looking statements that involve a number of risks and uncertainties. Words like \"believe,\" \"expect\" and \"anticipate\" mean that these are our best estimates as of this writing, but that there can be no assurances that expected or anticipated results or events will actually take place, so our actual future results could differ significantly from those statements. Factors that could cause or contribute to such differences include, but are not limited to: our ability to maintain our competitive advantages, the general economics of the financial industry, our ability to finance growth, our ability to identify and close acquisitions on terms favorable to the Company, and a sustainable market.</p><p style=\"text-align:justify;\">Further information on our risk factors is contained in our quarterly and annual reports as filed on our website <a href=\"https://pr.report/j406\" rel=\"nofollow noopener\">www.frmocorp.com</a> and on <a href=\"https://pr.report/j407\" rel=\"nofollow noopener\">www.otcmarkets.com/stock/FRMO/filings</a>.</p><p><strong>Contact</strong></p><p>Thérèse Byars<br/>Corporate Secretary<br/>Email: <a href=\"mailto:tbyars@frmocorp.com\" rel=\"nofollow noopener\">tbyars@frmocorp.com</a><br/>Telephone: 646-495-7337<br/><a href=\"https://pr.report/j408\" rel=\"nofollow noopener\">www.frmocorp.com</a></p><p><strong><u>Information Regarding Non-GAAP Measures</u></strong></p><p>Net income or loss attributable to the Company excluding the effect of unrealized gain or loss from equity securities and digital assets is net income or loss attributable to the Company exclusive of unrealized gains or losses from equity securities and digital assets, net of tax. Net income or loss attributable to the Company is the GAAP measure most closely comparable to net income attributable to the Company excluding the effect of unrealized gain or loss from equity securities and digital assets.</p><p>Management uses net income or loss attributable to the Company excluding the effect of unrealized gain or loss from equity securities and digital assets, along with other measures, to gauge the Company's performance and evaluate results, which can be skewed when including unrealized gain or loss from equity securities and digital assets, which may vary significantly between periods. Net income or loss attributable to the Company excluding the effect of unrealized gain or loss from equity securities is provided as supplemental information, and is not a substitute for net income or loss attributable to the Company and does not reflect the Company's overall profitability.</p><p>The following table reconciles the net income or loss attributable to the Company excluding the effect of unrealized gain or loss from equity securities and digital assets to net income or loss attributable to the Company for the periods indicated:</p><a href=\"https://app.accessnewswire.com/imagelibrary/0e2e1ad0-77f2-426e-aa0a-19505937fb66/1142101/table-3.png\" rel=\"nofollow noopener\"><img loading=\"lazy\" src=\"https://app.accessnewswire.com/imagelibrary/0e2e1ad0-77f2-426e-aa0a-19505937fb66/1142101/table-3.png\" style=\"width:728px;text-align:center;margin:0.9em auto;\"/></a><div></div><div></div><div></div><p><strong>SOURCE:</strong> FRMO Corp</p><br/><br/>View the original <a href=\"https://www.accessnewswire.com/newsroom/en/banking-and-financial-services/frmo-corp.-announces-fiscal-2026-second-quarter-results-and-conferen-1142101\" rel=\"nofollow noopener\">press release</a> on ACCESS Newswire<br/><br/><img height=\"0\" loading=\"lazy\" src=\"https://app.accessnewswire.com/img.ashx?id=1142101\" width=\"0\"/></article>",
            "link": "https://www.stocktitan.net/news/FRMO/frmo-corp-announces-fiscal-2026-second-quarter-results-and-szp7ml9bp9a7.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 02:00:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ultra Clean Prices Upsized $525.0 Million Convertible Senior Notes Offering | UCTT Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.ca.hayard\">HAYWARD, Calif.</location></span>, <span class=\"legendSpanClass\">Feb. 26, 2026</span> /PRNewswire/ -- Ultra Clean Holdings, Inc. (Nasdaq: <a class=\"symbol-link\" href=\"/overview/UCTT/\" title=\"View UCTT stock overview\">UCTT</a>) today announced the pricing of its offering of <money><money>$525.0 million</money></money> aggregate principal amount of <percent>0.00%</percent> convertible senior notes due 2031 (the \"notes\") in a private offering to persons reasonably believed to be qualified institutional buyers pursuant to Rule 144A under the Securities Act of 1933, as amended (the \"Securities Act\"). The offering size was increased from the previously announced offering size of <money><money>$400.0 million</money></money> aggregate principal amount of notes. The issuance and sale of the notes are scheduled to settle on March 3, 2026, subject to customary closing conditions. Ultra Clean also granted the initial purchasers of the notes an option to purchase, for settlement within a period of 13 days from, and including, the date the notes are first issued, up to an additional <money><money>$75.0 million</money></money> principal amount of notes.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\"><p><a href=\"https://mma.prnewswire.com/media/582701/Ultra_Clean_Holdings_Logo.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"(PRNewsfoto/Ultra Clean Holdings, Inc.)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/582701/Ultra_Clean_Holdings_Logo.jpg\" title=\"(PRNewsfoto/Ultra Clean Holdings, Inc.)\"/></a></p></div><p>Ultra Clean estimates that the net proceeds from the offering will be approximately <money><money>$511.1 million</money></money> (or approximately <money><money>$584.2 million</money></money> if the initial purchasers fully exercise their option to purchase additional notes), after deducting the initial purchasers' discounts and commissions and estimated offering expenses. Ultra Clean intends to use the net proceeds from the offering as follows:</p><ul type=\"disc\"><li>approximately <money><money>$21.9 million</money></money> of the net proceeds from the offering to fund the cost of entering into the capped call transactions described below;</li><li>approximately <money><money>$40.0 million</money></money> of the net proceeds from the offering to repurchase 672,608 shares of its common stock; and</li><li>the remainder for working capital, prepayment of a portion of the company's outstanding term loan under its amended and restated credit agreement or other general corporate purposes.</li></ul><p>If the initial purchasers exercise their option to purchase additional notes, then Ultra Clean intends to use a portion of the additional net proceeds to fund the cost of entering into additional capped call transactions, as described below, and the remainder for the purposes described above.</p><p>The notes will be senior, unsecured obligations of Ultra Clean. The notes will not bear regular interest and the principal amount of the notes will not accrete. The notes will mature on March 15, 2031, unless earlier repurchased, redeemed or converted. Before December 16, 2030, noteholders will have the right to convert their notes only upon the occurrence of certain events. From and after December 16, 2030, noteholders may convert their notes at any time at their election until the close of business on the second scheduled trading day immediately before the maturity date. Ultra Clean will settle conversions in cash and, if applicable, shares of its common stock. The initial conversion rate is 11.8001 shares of common stock per <money><money>$1,000</money></money> principal amount of notes, which represents an initial conversion price of approximately <money><money>$84.75</money></money> per share of common stock. The initial conversion price represents a premium of approximately <percent>42.5%</percent> over the last reported sale price of <money><money>$59.47</money></money> per share of Ultra Clean's common stock on February 26, 2026. The conversion rate and conversion price will be subject to adjustment upon the occurrence of certain events. If a \"make-whole fundamental change\" (as defined in the indenture for the notes) occurs, then Ultra Clean will, in certain circumstances, increase the conversion rate for a specified period of time for holders who convert their notes in connection with that make-whole fundamental change.</p><p>The notes will be redeemable, in whole or in part (subject to certain limitations), for cash at Ultra Clean's option at any time, and from time to time, on or after March 20, 2029 and on or before the 40th scheduled trading day immediately before the maturity date, but only if the last reported sale price per share of Ultra Clean's common stock exceeds <percent>130%</percent> of the conversion price for a specified period of time and certain other conditions are satisfied. The redemption price will be equal to the principal amount of the notes to be redeemed, plus accrued and unpaid special interest and additional interest, if any, to, but excluding, the redemption date. If Ultra Clean calls any or all notes for redemption, then holders of notes called for redemption may convert their notes during the related redemption conversion period, and such conversions will also constitute a make-whole fundamental change with respect to the notes so converted.</p><p>If a \"fundamental change\" (as defined in the indenture for the notes) occurs, then, subject to a limited exception, noteholders may require Ultra Clean to repurchase their notes for cash. The repurchase price will be equal to the principal amount of the notes to be repurchased, plus accrued and unpaid special interest and additional interest, if any, to, but excluding, the applicable repurchase date.</p><p>In connection with the pricing of the notes, Ultra Clean entered into privately negotiated capped call transactions with certain of the initial purchasers or their affiliates and certain other financial institutions (the \"option counterparties\"). The capped call transactions will cover, subject to anti-dilution adjustments substantially similar to those applicable to the notes, the number of shares of Ultra Clean's common stock initially underlying the notes. If the initial purchasers exercise their option to purchase additional notes, Ultra Clean expects to enter into additional capped call transactions with the option counterparties.</p><p>The cap price of the capped call transactions will initially be <money><money>$104.07</money>25</money> per share, which represents a premium of <percent>75.0%</percent> over the last reported sale price of Ultra Clean's common stock of <money><money>$59.47</money></money> per share on February 26, 2026, and is subject to certain adjustments under the terms of the capped call transactions.</p><p>The capped call transactions are expected generally to reduce the potential dilution to Ultra Clean's common stock upon any conversion of the notes and/or offset any potential cash payments Ultra Clean is required to make in excess of the principal amount of converted notes, as the case may be, upon conversion of the notes. If, however, the market price per share of Ultra Clean's common stock, as measured under the terms of the capped call transactions, exceeds the cap price of the capped call transactions, there would nevertheless be dilution and/or there would not be an offset of such potential cash payments, in each case, to the extent that such market price exceeds the cap price of the capped call transactions.</p><p>Ultra Clean has been advised that, in connection with establishing their initial hedges of the capped call transactions, the option counterparties or their respective affiliates expect to enter into various derivative transactions with respect to Ultra Clean's common stock and/or purchase shares of Ultra Clean's common stock concurrently with or shortly after the pricing of the notes. This activity could increase (or reduce the size of any decrease in) the market price of Ultra Clean's common stock or the notes at that time.</p><p>In addition, the option counterparties or their respective affiliates may modify their hedge positions by entering into or unwinding various derivatives with respect to Ultra Clean's common stock and/or purchasing or selling Ultra Clean's common stock or other securities of Ultra Clean in secondary market transactions following the pricing of the notes and prior to the maturity of the notes (and (x) are likely to do so during the relevant valuation period under the capped call transactions and (y) are likely to do so following any early conversion or repurchase of the notes by Ultra Clean, if Ultra Clean elects to unwind a corresponding portion of the capped call transactions in connection with such early conversion or repurchase). This activity could also cause or avoid an increase or a decrease in the market price of Ultra Clean's common stock or the notes, which could affect the ability to convert the notes and, to the extent the activity occurs during any observation period related to a conversion of notes, it could affect the number of shares of common stock and value of the consideration that noteholders will receive upon conversion of the notes.</p><p>Concurrently with the pricing of the notes, Ultra Clean entered into privately negotiated transactions with or through one of the initial purchasers of the notes in this offering to use approximately <money><money>$40.0 million</money></money> of the net proceeds from the notes offering to repurchase shares of Ultra Clean's common stock at a purchase price of <money><money>$59.47</money></money> per share. These share repurchases could increase (or reduce the size of any decrease in) the market price of Ultra Clean's common stock or the notes, and could result in a higher effective conversion price for the notes. The offering of the notes is not contingent upon the repurchase of any common stock.</p><p>The offer and sale of the notes and any shares of common stock issuable upon conversion of the notes have not been, and will not be, registered under the Securities Act or any other securities laws, and the notes and any such shares cannot be offered or sold except pursuant to an exemption from, or in a transaction not subject to, the registration requirements of the Securities Act and any other applicable securities laws. This press release does not constitute an offer to sell, or the solicitation of an offer to buy, the notes or any shares of common stock issuable upon conversion of the notes, nor will there be any sale of the notes or any such shares, in any state or other jurisdiction in which such offer, sale or solicitation would be unlawful.</p><p><b>Forward-Looking Statements</b></p><p>This press release includes forward-looking statements, including statements regarding the completion of the offering and the share repurchases, the expected amount and intended use of the net proceeds and the effects of entering into the capped call transactions described above. Forward-looking statements represent Ultra Clean's current expectations regarding future events and are subject to known and unknown risks and uncertainties that could cause actual results to differ materially from those implied by the forward-looking statements. Among those risks and uncertainties are market conditions, the satisfaction of the closing conditions related to the offering and risks relating to Ultra Clean's business, including those described in periodic reports that Ultra Clean files from time to time with the SEC. Ultra Clean may not consummate the offering described in this press release and, if the offering is consummated, cannot provide any assurances regarding its ability to effectively apply the net proceeds as described above. The forward-looking statements included in this press release speak only as of the date of this press release, and Ultra Clean does not undertake to update the statements included in this press release for subsequent developments, except as may be required by law.</p><p><b>Contact</b></p><p>Rhonda Bennetto<br/>SVP Investor Relations<br/><a href=\"mailto:rbennetto@uct.com\" rel=\"nofollow noopener\">rbennetto@uct.com</a></p><p>SOURCE Ultra Clean Holdings, Inc.</p></div></article>",
            "link": "https://www.stocktitan.net/news/UCTT/ultra-clean-prices-upsized-525-0-million-convertible-senior-notes-hcw2099ibqb5.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 04:41:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "InterContinental Hotels Group PLC Announces Transaction in Own Shares - February 27 | IHG Stock News",
            "description": "<article class=\"article\"><p><strong id=\"dateline\">LONDON, UK / <a href=\"https://www.accessnewswire.com/\" rel=\"nofollow noopener\">ACCESS Newswire</a> / February 27, 2026 / </strong>The Company announces that on 26 February 2026 it purchased the following number of its ordinary shares of 20<sup>340/399 </sup>pence each through Goldman Sachs International (\"<strong>GSI</strong>\") on the London Stock Exchange in accordance with the authority granted by shareholders at the Company's Annual General Meeting on 8 May 2025 (the \"<strong>Purchase</strong>\"). The Purchase was effected pursuant to instructions issued by the Company on 17 February 2026, as announced on 17 February 2026.</p><table style=\"width:100%\"><tbody><tr><td style=\"padding:0in .5pt;vertical-align:top;width:72.0%;\"><p>Date of purchase:</p></td><td style=\"padding:0in .5pt;vertical-align:top;width:26.86%;\"><p>26 February 2026</p></td></tr><tr><td style=\"padding:0in .5pt;vertical-align:top;width:72.0%;\"></td><td style=\"padding:0in .5pt;vertical-align:top;width:26.86%;\"></td></tr><tr><td style=\"padding:0in .5pt;vertical-align:top;width:72.0%;\"><p>Aggregate number of ordinary shares purchased:</p></td><td style=\"padding:0in .5pt;vertical-align:top;width:26.86%;\"><p>30,000</p></td></tr><tr><td style=\"padding:0in .5pt;vertical-align:top;width:72.0%;\"></td><td style=\"padding:0in .5pt;vertical-align:top;width:26.86%;\"></td></tr><tr><td style=\"padding:0in .5pt;vertical-align:top;width:72.0%;\"><p>Lowest price paid per share:</p></td><td style=\"padding:0in .5pt;vertical-align:top;width:26.86%;\"><p><money>$ 139.60</money>00</p></td></tr><tr><td style=\"padding:0in .5pt;vertical-align:top;width:72.0%;\"></td><td style=\"padding:0in .5pt;vertical-align:top;width:26.86%;\"></td></tr><tr><td style=\"padding:0in .5pt;vertical-align:top;width:72.0%;\"><p>Highest price paid per share:</p></td><td style=\"padding:0in .5pt;vertical-align:top;width:26.86%;\"><p><money>$ 142.95</money>00</p></td></tr><tr><td style=\"padding:0in .5pt;vertical-align:top;width:72.0%;\"></td><td style=\"padding:0in .5pt;vertical-align:top;width:26.86%;\"></td></tr><tr><td style=\"padding:0in .5pt;vertical-align:top;width:72.0%;\"><p>Average price paid per share:</p></td><td style=\"padding:0in .5pt;vertical-align:top;width:26.86%;\"><p><money>$ 141.51</money>37</p></td></tr></tbody></table><p>The Company intends to cancel the purchased shares.</p><p>Following the above transaction, the Company has 150,980,048 ordinary shares in issue (excluding 5,481,782 held in treasury).</p><p>A full breakdown of the individual purchases by GSI is included below.</p><p><a href=\"https://pr.report/j44e\" rel=\"nofollow noopener\">http://www.rns-pdf.londonstockexchange.com/rns/6111U_1-2026-2-26.pdf</a></p><p>Enquiries to:</p><p>InterContinental Hotels Group PLC:</p><p>Investor Relations: Stuart Ford (+44 (0)7823 828 739); Kate Carpenter (+44 (0) 7825 655 702); Joe Simpson (+44 (0)7976 862 072)</p><p>Media Relations: Neil Maidment (+44 (0)7970 668 250); Mike Ward (+44 (0)7795 257 407)</p><p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" rel=\"nofollow noopener\">rns@lseg.com</a> or visit <a href=\"https://pr.report/j44f\" rel=\"nofollow noopener\">www.rns.com</a>.</p><p><strong>SOURCE: </strong>InterContinental Hotels Group PLC</p><br/><br/>View the original <a href=\"https://www.accessnewswire.com/newsroom/en/travel/intercontinental-hotels-group-plc-announces-transaction-in-own-shares-february-27-1142143\" rel=\"nofollow noopener\">press release</a> on ACCESS Newswire<br/><br/><img height=\"0\" loading=\"lazy\" src=\"https://app.accessnewswire.com/img.ashx?id=1142143\" width=\"0\"/></article>",
            "link": "https://www.stocktitan.net/news/IHG/inter-continental-hotels-group-plc-announces-transaction-in-own-2qshyaaciw8o.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 07:25:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tidewater Announces Earnings Release and Conference Call | TDW Stock News",
            "description": "<article class=\"article\"><p> <location idsrc=\"xmltag.org\" value=\"LU/us.tx.houstn\">HOUSTON</location>--(BUSINESS WIRE)--Tidewater Inc. (NYSE: <a class=\"symbol-link\" href=\"/overview/TDW/\" title=\"View TDW stock overview\">TDW</a>) (“Tidewater” or the “Company”) announced today that it will release financial results for the three and twelve months ending December 31, 2025, on Monday, March 2, 2026, after market close. An earnings conference call has been scheduled for Tuesday, March 3, 2026, at 8:00 a.m. Central Time, during which President and Chief Executive Officer Quintin Kneen will discuss results for the three and twelve months ending December 31, 2025.</p><p>Investors and interested parties may listen to the earnings conference call via telephone by calling +1.800.715.9871 if calling from the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> or <location idsrc=\"xmltag.org\" value=\"LC/ca\">Canada</location> (+1.647.932.3411 if calling from outside the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location>) and provide Conference ID: <b>8745688 </b>prior to the scheduled start time. A live webcast of the call will also be available in the Investor Relations section of Tidewater’s website at <span class=\"bwuline\"><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Finvestor.tdw.com%2F&amp;esheet=54434971&amp;newsitemid=20260226972147&amp;lan=en-US&amp;anchor=investor.tdw.com&amp;index=1&amp;md5=fb63be6449b62df163970a9371101520\" rel=\"nofollow noopener\" shape=\"rect\">investor.tdw.com</a></span>.</p><p>A replay of the conference call will be available beginning at 11:00 a.m. Central Time on March 3, 2026. To access the replay, access the Investor Relations section of Tidewater’s website at <span class=\"bwuline\"><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Finvestor.tdw.com%2F&amp;esheet=54434971&amp;newsitemid=20260226972147&amp;lan=en-US&amp;anchor=investor.tdw.com&amp;index=2&amp;md5=c941021191d54eaf6597938a52525436\" rel=\"nofollow noopener\" shape=\"rect\">investor.tdw.com</a></span>.</p><p>The conference call will contain forward-looking statements in addition to statements of historical fact. The actual achievement of any forecasted results or the unfolding of future economic or business developments in a way anticipated or projected by the Company involves numerous risks and uncertainties that may cause the Company’s actual performance to be materially different from that stated or implied in the forward-looking statements. Such risks and uncertainties include, among other things, risks associated with the general nature of the oilfield service industry and other factors discussed within the “Risk Factors” section of Tidewater’s most recent Forms 10-Q and 10-K.</p><p>Tidewater owns and operates the largest fleet of offshore support vessels in the industry, with more than 70 years of experience supporting offshore energy exploration, production and offshore wind activities worldwide. To learn more, visit <span class=\"bwuline\"><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.tdw.com&amp;esheet=54434971&amp;newsitemid=20260226972147&amp;lan=en-US&amp;anchor=www.tdw.com&amp;index=3&amp;md5=cc54fe261ee494aa85a3edd168a0c60d\" rel=\"nofollow noopener\" shape=\"rect\">www.tdw.com</a></span>.</p><p><img alt=\"\" loading=\"lazy\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226972147r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\"/><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20260226972147/en/\" rel=\"nofollow noopener\">https://www.businesswire.com/news/home/20260226972147/en/</a></span></p><p>West P. Gotcher<br/>Senior Vice President – Strategy, Corporate Development &amp; Investor Relations<br/>+1.713.470.5285<br/><a href=\"mailto:ir@tdw.com\" rel=\"nofollow noopener\" shape=\"rect\">ir@tdw.com</a></p><p>Source: Tidewater Inc.</p></article>",
            "link": "https://www.stocktitan.net/news/TDW/tidewater-announces-earnings-release-and-conference-aagc4v8q3v71.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 03:09:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Orosur Mining Inc Announces Total Voting Rights | OROXF Stock News",
            "description": "<article class=\"article\"><p><strong id=\"dateline\">LONDON, UK / <a href=\"https://www.accessnewswire.com/\" rel=\"nofollow noopener\">ACCESS Newswire</a> / February 27, 2026 / </strong><strong>Orosur Mining Inc. (\"Orosur\" or \"the Company\") (AIM:OMI)(TSXV:OMI),</strong> a minerals explorer and developer with projects in Colombia and Argentina, advises that during February 2026, the Company has issued 1,316,949 new common shares of no par value each (\"Common Shares\") for a total consideration of US<money>$110,703</money> following the exercise of 1,016,949 warrants at a price of US<money>$0.05</money>58 and 300,000 warrants at a price of Cdn<money>$0.25</money> respectively from its block listing announced January 14, 2026.</p><p>For the purposes of the Disclosure Guidance and Transparency Rules, the Company has 394,547,125 Common Shares in issue<strong>. This figure includes the 85,000 Common Shares scheduled to be admitted to trading on 2<sup>nd</sup> March, as announced on 26<sup>th</sup> February 2026.</strong> Shareholders may use this figure as the denominator for the calculations by which they will determine if they are required to notify their interest in, or a change in their interest in, the share capital of the Company under the FCA's Disclosure and Transparency Rules.</p><p><strong>For further information, visit </strong><a href=\"https://pr.report/j43z\" rel=\"nofollow noopener\"><strong>www.orosur.ca</strong></a><strong>, follow on X @orosurm or please contact:</strong></p><p><strong>Orosur Mining Inc</strong></p><p>Louis Castro, Chairman <br/>Brad George, CEO<br/><a href=\"mailto:info@orosur.ca\" rel=\"nofollow noopener\">info@orosur.ca</a><br/>Tel: +1 (778) 373-0100</p><p><strong>SP Angel Corporate Finance LLP - Nomad &amp; Joint Broker</strong></p><p>Jeff Keating / Jen Clarke / Caroline Rowe / Devik Mehta<br/>Tel: +44 (0) 20 3470 0470</p><p><strong>Turner Pope Investments (TPI) Ltd</strong> - <strong>Joint Broker</strong></p><p>Andy Thacker/Guy McDougall<br/>Tel: +44 (0)20 3657 0050</p><p><strong>Flagstaff Communications and Investor Communications</strong></p><p>Tim Thompson<br/>Fergus Mellon<br/>Allison Allfrey<br/><a href=\"mailto:orosur@flagstaffcomms.com\" rel=\"nofollow noopener\">orosur@flagstaffcomms.com</a><br/>Tel: +44 (0)207 129 1474</p><p>The information contained within this announcement is deemed by the Company to constitute inside information as stipulated under the Market Abuse Regulations (EU) No. 596/2014 ('MAR') which has been incorporated into UK law by the European Union (Withdrawal) Act 2018. Upon the publication of this announcement via Regulatory Information Service ('RIS'), this inside information is now considered to be in the public domain.</p><p>Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</p><p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" rel=\"nofollow noopener\">rns@lseg.com</a> or visit <a href=\"https://pr.report/j440\" rel=\"nofollow noopener\">www.rns.com</a>.</p><p><strong>SOURCE: </strong>Orosur Mining Inc</p><br/><br/>View the original <a href=\"https://www.accessnewswire.com/newsroom/en/metals-and-mining/orosur-mining-inc-announces-total-voting-rights-1142139\" rel=\"nofollow noopener\">press release</a> on ACCESS Newswire<br/><br/><img height=\"0\" loading=\"lazy\" src=\"https://app.accessnewswire.com/img.ashx?id=1142139\" width=\"0\"/></article>",
            "link": "https://www.stocktitan.net/news/OROXF/orosur-mining-inc-announces-total-voting-pgz5wrkoyk8c.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 07:20:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Guardian Metal Resources PLC - Registration Statement Filed for Proposed U.S. IPO | GMTLF Stock News",
            "description": "<article class=\"article\"><p><i><strong>Guardian Metal files registration statement for proposed initial public offering in the United States</strong></i></p><p><strong id=\"dateline\">LODON, UK / <a href=\"https://www.accessnewswire.com/\" rel=\"nofollow noopener\">ACCESS Newswire</a> / February 27, 2026 / </strong>Guardian Metal Resources plc (LON:GMET)(OTCQB:GMTLF), a US-focused exploration-stage critical minerals company with a portfolio of tungsten exploration projects located inNevada, US, is pleased to announce that it has filed a registration statement on Form F-1 (the \"Registration Statement\") with the U.S. Securities and Exchange Commission (the \"SEC\") relating to a proposed initial public offering (\"IPO\") in the United States of its American Depositary Shares (\"ADSs\").</p><p>All ADSs to be sold in the proposed IPO will be offered by Guardian Metal. Guardian Metal intends to apply to list its ADSs on the NYSE American under the ticker symbol \"GMTL\". The number of ADSs to be offered and the pricing terms for the proposed IPO have not yet been determined. The offering is subject to market conditions, and there can be no assurance as to whether, or when, the offering may be completed or as to the actual size or terms of the offering.</p><p>BMO Capital Markets Corp. will act as book-running manager for the proposed offering.</p><p>The Registration Statement relating to the ADSs has been filed with the SEC but has not yet become effective. The ADSs may not be sold nor may offers to buy be accepted prior to the time the Registration Statement becomes effective.</p><p>The Registration Statement can be accessed through the SEC's EDGAR database and contains further information relating to Guardian Metal.</p><p><i>This announcement does not constitute or form part of an offer to sell or issue, or a solicitation of an offer to subscribe for or buy securities. Neither this announcement nor anything contained herein shall form the basis of, or be relied upon in connection with, any offer, solicitation, sale or commitment whatsoever in any jurisdiction in which such offer, solicitation, sale or commitment would be unlawful prior to registration or qualification under the securities laws of that jurisdiction.</i></p><p><i>The securities referred to in this announcement are to be offered only by means of a prospectus. When available, copies of the preliminary prospectus can be obtained from BMO Capital Markets Corp., Attn: Equity Syndicate Department, 151 W 42nd Street, 32nd Floor, New York, NY 10036.</i></p><p><strong>This announcement contains inside information for the purposes of Article 7 of EU Regulation 596/2014 (which forms part of domestic UK law pursuant to the European Union (Withdrawal) Act 2018).</strong></p><p><strong>Forward Looking Statements</strong></p><p>This announcement contains forward-looking statements relating to expected or anticipated future events and anticipated results that are forward-looking in nature and, as a result, are subject to certain risks and uncertainties, such as general economic, market and business conditions, competition for qualified staff, the regulatory process and actions, technical issues, new legislation, uncertainties resulting from potential delays or changes in plans, uncertainties resulting from working in a new political jurisdiction, uncertainties regarding the results of exploration, uncertainties regarding the timing and granting of prospecting rights, uncertainties regarding the timing and granting of regulatory and other third party consents and approvals, uncertainties regarding Guardian Metal's or any third party's ability to execute and implement future plans, and the occurrence of unexpected events.</p><p>The information contained in this announcement is for background purposes only and does not purport to be full or complete. No reliance may or should be placed by any person for any purpose on the information contained in this announcement or its accuracy, fairness or completeness. The information in this announcement is subject to change.</p><p>For further information visit <a href=\"https://eur01.safelinks.protection.outlook.com/?url=http%3A%2F%2Fwww.guardianmetalresources.com%2F&amp;data=05%7C02%7CIvan.Briechle%40berenberg.com%7C00f8da6b9ebe494759a408de16cf75af%7Cf8a4d5212a2d4e94ab56260dada38157%7C0%7C0%7C638973277459723926%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=YCUT5g%2FIzKmUMa8S8T%2FXjZycrbY%2FtedE6ZaVAn%2BDcEM%3D&amp;reserved=0\" rel=\"nofollow noopener\">www.guardianmetalresources.com</a> or contact the following:</p><table style=\"width:100%\"><tbody><tr><td style=\"border:1.0pt solid windowtext;padding:0in 5.4pt;vertical-align:top;width:58.18%;\"><p><strong>Guardian Metal Resources plc</strong></p><p>Oliver Friesen (CEO)</p></td><td style=\"border-bottom-style:solid;border-border-left-style:none;border-right-style:solid;border-top-style:solid;border-width:1.0pt;padding:0in 5.4pt;vertical-align:top;width:40.78%;\"><p>Tel: +44 (0) 20 7078 8496</p></td></tr><tr><td style=\"border-bottom-style:solid;border-border-left-style:solid;border-right-style:solid;border-top-style:none;border-width:1.0pt;padding:0in 5.4pt;vertical-align:top;width:58.18%;\"><p><strong>Cairn Financial Advisers LLP</strong></p><p>Nominated Adviser</p><p>Sandy Jamieson/Jo Turner/Louise O'Driscoll</p></td><td style=\"border-bottom:1.0pt solid windowtext;border-left-style:none;border-right:1.0pt solid windowtext;border-top-style:none;padding:0in 5.4pt;vertical-align:top;width:40.78%;\"><p>Tel: +44 (0) 20 7213 0880</p></td></tr><tr><td style=\"border-bottom-style:solid;border-border-left-style:solid;border-right-style:solid;border-top-style:none;border-width:1.0pt;padding:0in 5.4pt;vertical-align:top;width:58.18%;\"><p><strong>Berenberg</strong></p><p>Joint Broker and Financial Adviser</p><p>Jennifer Lee/Ivan Briechle</p></td><td style=\"border-bottom:1.0pt solid windowtext;border-left-style:none;border-right:1.0pt solid windowtext;border-top-style:none;padding:0in 5.4pt;vertical-align:top;width:40.78%;\"><p>Tel: +44 (0) 20 3207 7800</p></td></tr><tr><td style=\"border-bottom-style:solid;border-border-left-style:solid;border-right-style:solid;border-top-style:none;border-width:1.0pt;padding:0in 5.4pt;vertical-align:top;width:58.18%;\"><p><strong>Tamesis Partners LLP</strong></p><p>Joint Broker</p><p>Charlie Bendon/Richard Greenfield</p></td><td style=\"border-bottom:1.0pt solid windowtext;border-left-style:none;border-right:1.0pt solid windowtext;border-top-style:none;padding:0in 5.4pt;vertical-align:top;width:40.78%;\"><p>Tel: +44 (0) 20 3882 2868</p></td></tr><tr><td style=\"border-bottom-style:solid;border-border-left-style:solid;border-right-style:solid;border-top-style:none;border-width:1.0pt;padding:0in 5.4pt;vertical-align:top;width:58.18%;\"><p><strong>Tavistock</strong></p><p>Financial PR</p><p>Emily Moss/Josephine Clerkin</p></td><td style=\"border-bottom:1.0pt solid windowtext;border-left-style:none;border-right:1.0pt solid windowtext;border-top-style:none;padding:0in 5.4pt;vertical-align:top;width:40.78%;\"><p>Tel: +44 (0) 7920 3150 /</p><p>+44 (0) 7788 554035</p><p><a href=\"mailto:guardianmetal@tavistock.co.uk\" rel=\"nofollow noopener\">guardianmetal@tavistock.co.uk</a></p></td></tr></tbody></table><p><strong>About Guardian Metal Resources</strong></p><p>Guardian Metal Resources PLC (LON:GMET)(OTCQX:GMTLF) is a US-focused exploration-stage critical minerals company with a portfolio of tungsten exploration projects located in Nevada, US. Its principal tungsten asset is the Pilot Mountain project, followed by the Tempiute project, which are both situated in historic tungsten districts with well-known occurrences of scheelite-bearing skarn mineralization that have seen prior tungsten mining activity by third parties.</p><p>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact <a href=\"mailto:rns@lseg.com\" rel=\"nofollow noopener\">rns@lseg.com</a> or visit <a href=\"https://pr.report/j447\" rel=\"nofollow noopener\">www.rns.com</a>.</p><p><strong>SOURCE:</strong> Guardian Metal Resources PLC</p><br/><br/>View the original <a href=\"https://www.accessnewswire.com/newsroom/en/metals-and-mining/guardian-metal-resources-plc-registration-statement-filed-for-proposed-u.s.-ipo-1142141\" rel=\"nofollow noopener\">press release</a> on ACCESS Newswire<br/><br/><img height=\"0\" loading=\"lazy\" src=\"https://app.accessnewswire.com/img.ashx?id=1142141\" width=\"0\"/></article>",
            "link": "https://www.stocktitan.net/news/GMTLF/guardian-metal-resources-plc-registration-statement-filed-for-5co3srhbmejm.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 07:20:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FRMO Corp. Completes Restatement of Previously Issued Financial Statements | FRMO Stock News",
            "description": "<article class=\"article\"><p><strong id=\"dateline\">WHITE PLAINS, NY / <a href=\"https://www.accessnewswire.com/\" rel=\"nofollow noopener\">ACCESS Newswire</a> / February 26, 2026 / </strong>FRMO Corp. (the \"Company\" or \"<a class=\"symbol-link\" href=\"/overview/FRMO/\" title=\"View FRMO stock overview\">FRMO</a>\") (OTC PINK:FRMO) today announced the filing of its restated financial statements for the fiscal years ending May 31, 2025 and 2024 and the financial information for each of the interim periods included within those years, and the Company's quarterly financial statements as of and for the three months ended August 31, 2025 (the \"Affected Periods\").</p><p>The Company also plans to file its quarterly report as of and for the three and six months ended November 30, 2025 on February 26, 2026, which will bring the Company back into compliance with the OTC Markets Group's (\"OTC\") annual and quarterly filing requirements. The Company anticipates that it will file its quarterly report for the three and nine months ended February 28, 2026 no later than 45 days after the end of the fiscal quarter, in accordance with the OTC's quarterly reporting obligations.</p><p>\"Completing this restatement, which brings the Company back into full compliance with reporting and listing requirements, marks an important milestone in our ongoing work to enhance stakeholder confidence,\" said Murray Stahl, Chief Executive Officer of <a class=\"symbol-link\" href=\"/overview/FRMO/\" title=\"View FRMO stock overview\">FRMO</a>. \"Looking ahead, our focus is a continued commitment to execution and maintaining the highest standards of compliance. With the restatement behind us, we believe the company is well positioned as we enter our next phase of growth.\"</p><p>The Company determined that a restatement was required to correct the valuation of deferred tax liabilities and the provision for income taxes in the Company's financial statements. The restatements did not change cash and cash equivalents, total assets, net income or loss from operations before the provision of income taxes, cash paid for income taxes, or cash flows from operations. The following tables present the restatements of the provision for income taxes and the deferred tax liability for each quarterly reporting date in each of the Affected Periods.</p><div style=\"page-break-after:always;\"><span style=\"display:none;\"> </span></div><p><a href=\"https://app.accessnewswire.com/imagelibrary/9d665ec4-b6ab-459c-8ce1-187a7f2a5d2a/1142100/frmo-provision-022626.jpg\" rel=\"nofollow noopener\"><img loading=\"lazy\" src=\"https://app.accessnewswire.com/imagelibrary/9d665ec4-b6ab-459c-8ce1-187a7f2a5d2a/1142100/frmo-provision-022626.jpg\" width=\"655\"/></a></p><p><a href=\"https://app.accessnewswire.com/imagelibrary/d7102cc7-2ff3-4bd9-952f-c26b7208532c/1142100/frmo-deferred-022626.jpg\" rel=\"nofollow noopener\"><img loading=\"lazy\" src=\"https://app.accessnewswire.com/imagelibrary/d7102cc7-2ff3-4bd9-952f-c26b7208532c/1142100/frmo-deferred-022626.jpg\" width=\"649\"/></a></p><p><i>(Components may not sum due to rounding)</i></p><div style=\"page-break-after:always;\"><span style=\"display:none;\"> </span></div><p><a href=\"https://app.accessnewswire.com/imagelibrary/834df96b-57a6-43d3-9a81-e430cb1fad78/1142100/frmo-condensed-022626.jpg\" rel=\"nofollow noopener\"><img loading=\"lazy\" src=\"https://app.accessnewswire.com/imagelibrary/834df96b-57a6-43d3-9a81-e430cb1fad78/1142100/frmo-condensed-022626.jpg\" width=\"657\"/></a></p><div style=\"page-break-after:always;\"><span style=\"display:none;\"> </span></div><p><a href=\"https://app.accessnewswire.com/imagelibrary/5caee2c3-7672-48ec-ae54-25cc72a17bf4/1142100/frmo-statements-022626.jpg\" rel=\"nofollow noopener\"><img loading=\"lazy\" src=\"https://app.accessnewswire.com/imagelibrary/5caee2c3-7672-48ec-ae54-25cc72a17bf4/1142100/frmo-statements-022626.jpg\" width=\"681\"/></a></p><div style=\"page-break-after:always;\"><span style=\"display:none;\"> </span></div><p><a href=\"https://app.accessnewswire.com/imagelibrary/4635a5b8-bae1-4d0c-a98a-b5afce1afe12/1142100/frmo-balance-022626.jpg\" rel=\"nofollow noopener\"><img loading=\"lazy\" src=\"https://app.accessnewswire.com/imagelibrary/4635a5b8-bae1-4d0c-a98a-b5afce1afe12/1142100/frmo-balance-022626.jpg\" width=\"601\"/></a></p><div style=\"page-break-after:always;\"><span style=\"display:none;\"> </span></div><p><a href=\"https://app.accessnewswire.com/imagelibrary/a05f4cb3-b59b-4368-93e3-c313f027510a/1142100/frmo-income-022626.jpg\" rel=\"nofollow noopener\"><img loading=\"lazy\" src=\"https://app.accessnewswire.com/imagelibrary/a05f4cb3-b59b-4368-93e3-c313f027510a/1142100/frmo-income-022626.jpg\" width=\"716\"/></a></p><div style=\"page-break-after:always;\"><span style=\"display:none;\"> </span></div><p><strong>About <a class=\"symbol-link\" href=\"/overview/FRMO/\" title=\"View FRMO stock overview\">FRMO</a> Corp.</strong><br/>FRMO Corp. is an intellectual capital firm that provides consulting and advisory services in the asset management sector and engages in the mining of digital assets.</p><p>For more information, visit our website at <a href=\"https://pr.report/j3zx\" rel=\"nofollow noopener\">www.frmocorp.com</a>.</p><p><strong>Safe Harbor Statement Under the Private Securities Litigation Reform Act of 1995</strong> - With the exception of historical information, the matters discussed in this press release are forward-looking statements that involve a number of risks and uncertainties. Words like \"believe,\" \"expect\" and \"anticipate\" mean that these are our best estimates as of this writing, but that there can be no assurances that expected or anticipated results or events will actually take place, so our actual future results could differ significantly from those statements. Factors that could cause or contribute to such differences include, but are not limited to: our ability to maintain our competitive advantages, the general economics of the financial industry, our ability to finance growth, our ability to identify and close acquisitions on terms favorable to the Company, and a sustainable market.</p><p>Further information on our risk factors is contained in our quarterly and annual reports as filed on our website <a href=\"https://pr.report/j3zy\" rel=\"nofollow noopener\">www.frmocorp.com</a> and on <a href=\"https://pr.report/j3zz\" rel=\"nofollow noopener\">www.otcmarkets.com/stock/FRMO/filings</a>.</p><p><strong>Contact</strong><br/>Thérèse Byars<br/>Corporate Secretary<br/>Email: <a href=\"mailto:tbyars@frmocorp.com\" rel=\"nofollow noopener\">tbyars@frmocorp.com</a><br/>Telephone: 646-495-7337<br/><a href=\"https://pr.report/j400\" rel=\"nofollow noopener\">www.frmocorp.com</a></p><p><strong>SOURCE: </strong>FRMO Corp</p><br/><br/>View the original <a href=\"https://www.accessnewswire.com/newsroom/en/banking-and-financial-services/frmo-corp.-completes-restatement-of-previously-issued-financial-stat-1142100\" rel=\"nofollow noopener\">press release</a> on ACCESS Newswire<br/><br/><img height=\"0\" loading=\"lazy\" src=\"https://app.accessnewswire.com/img.ashx?id=1142100\" width=\"0\"/></article>",
            "link": "https://www.stocktitan.net/news/FRMO/frmo-corp-completes-restatement-of-previously-issued-financial-4otrj2n0mxg3.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 01:55:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Buenaventura Announces Fourth Quarter and Full Year 2025 Results | BK Stock News",
            "description": "<article class=\"article\"><p> <location idsrc=\"xmltag.org\" value=\"LU/pe..lima\">LIMA, Peru</location>--(BUSINESS WIRE)--Compañia de Minas Buenaventura S.A.A. (“Buenaventura” or “the Company”) (NYSE: <a class=\"symbol-link\" href=\"/overview/BVN/\" title=\"View BVN stock overview\">BVN</a>; Lima Stock Exchange: BUE.LM), Peru’s largest publicly-traded precious metals mining company, today announced results for the fourth quarter (4Q25) and full year (FY25) ended December 31, 2025. All figures have been prepared in accordance with IFRS (International Financial Reporting Standards) on a non-GAAP basis and are stated in <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> dollars (US$).</p><p><b>Fourth Quarter and Full Year 2025 Highlights:</b></p><ul class=\"bwlistdisc\"><li>Buenaventura's 4Q25 consolidated silver production increased by <percent>2%</percent> YoY driven by increased production at Tambomayo. Lead production increased by <percent>58%</percent> YoY and zinc production increased by <percent>43%</percent> YoY, as mining activities at Uchucchacua remained focused on polymetallic stopes during the quarter. Gold production decreased by <percent>11%</percent> YoY due to decreased output primarily at Tambomayo. Copper production was in line with 4Q24 levels.</li><li>4Q25 EBITDA from direct operations was <money>US<money>$ 353.5 million</money></money>, compared to <money>US<money>$ 93.4 million</money></money> reported in 4Q24. FY25 EBITDA from direct operations reached <money>US<money>$ 811.9 million</money></money>, compared to <money>US<money>$ 431.2 million</money></money> reported in FY24, which excluded the sale of Chaupiloma Royalty Company.</li><li>4Q25 net income reached <money>US<money>$ 383.6 million</money></money>, compared to <money>US<money>$ 33.6 million</money></money> in the same period of 2024. FY25 net income was <money>US<money>$ 782.1 million</money></money>, compared to <money>US<money>$ 402.7 million</money></money> in FY24, which included the sale of the Chaupiloma Royalty Company.</li><li>4Q25 CAPEX related to San Gabriel totaled <money>US<money>$153.4 million</money></money>, primarily allocated to the completion of the processing plant construction.</li><li>Buenaventura ended the year with a cash position of <money>US<money>$ 529.8 million</money></money>, while net debt amounted to <money>US<money>$ 179.8 million</money></money>, resulting in a leverage ratio of 0.22x.</li><li>On January 29, 2026, subsequent to the quarter’s end, Buenaventura received US <money><money>$97.9 million</money></money> in dividends related to its stake in Cerro Verde.</li><li>Buenaventura’s Board of Directors has proposed a dividend payment of <money>US<money>$ 0.99</money>04</money> per share/ADS.</li></ul><p><b>Financial Highlights </b>(in millions of US$, excluding EPS)<b>:</b></p><table cellspacing=\"0\" class=\"bwtablemarginb bwblockalignl bwwidth100\"><tr><td class=\"bwrightsingle bwsinglebottom bwwidth28 bwalignl bwpadl1\" colspan=\"1\" rowspan=\"1\"><p class=\"bwalignl bwcellpmargin\"> </p></td><td class=\"bwrightsingle bwpadl0 bwsinglebottom bwpadr0 bwvertalignb bwpadb3 bwrowaltcolor1 bwwidth12 bwalignc bwtopsingle\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\"><b>4Q25</b></p></td><td class=\"bwrightsingle bwpadl0 bwsinglebottom bwpadr0 bwvertalignb bwpadb3 bwrowaltcolor1 bwwidth12 bwalignc bwtopsingle\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\"><b>4Q24</b></p></td><td class=\"bwrightsingle bwpadl0 bwsinglebottom bwrowaltcolor1 bwwidth12 bwalignc bwtopsingle\" colspan=\"1\" rowspan=\"1\"><p class=\"bwalignc bwcellpmargin\"><b>Var %</b></p></td><td class=\"bwrightsingle bwpadl0 bwsinglebottom bwrowaltcolor1 bwwidth12 bwalignc bwtopsingle\" colspan=\"1\" rowspan=\"1\"><p class=\"bwalignc bwcellpmargin\"><b>FY25</b></p></td><td class=\"bwrightsingle bwpadl0 bwsinglebottom bwrowaltcolor1 bwwidth12 bwalignc bwtopsingle\" colspan=\"1\" rowspan=\"1\"><p class=\"bwalignc bwcellpmargin\"><b>FY24</b></p></td><td class=\"bwrightsingle bwpadl0 bwsinglebottom bwrowaltcolor1 bwwidth12 bwalignc bwtopsingle\" colspan=\"1\" rowspan=\"1\"><p class=\"bwalignc bwcellpmargin\"><b>Var %</b></p></td></tr><tr><td class=\"bwsinglebottom bwleftsingle bwrightsingle bwrowaltcolor1 bwwidth28 bwalignl bwpadl1\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignl\"><b>Total Revenues</b></p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwrowaltcolor1 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\">623.4</p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwrowaltcolor1 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\">299.6</p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwrowaltcolor1 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\"><b><percent>108%</percent></b></p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwrowaltcolor1 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\">1,731.6</p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwrowaltcolor1 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\">1,154.6</p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwrowaltcolor1 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\"><b><percent>50%</percent></b></p></td></tr><tr><td class=\"bwsinglebottom bwleftsingle bwrightsingle bwwidth28 bwalignl bwpadl1\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignl\"><b>Operating Income</b></p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\">297.2</p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\">45.8</p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\"><b><percent>549%</percent></b></p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\">633.2</p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\">445.7</p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\"><b><percent>42%</percent></b></p></td></tr><tr><td class=\"bwsinglebottom bwleftsingle bwrightsingle bwrowaltcolor1 bwwidth28 bwalignl bwpadl1\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignl\"><b>EBITDA Direct Operations <sup>(1)</sup></b></p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwrowaltcolor1 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\">353.5</p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwrowaltcolor1 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\">93.4</p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwrowaltcolor1 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\"><b><percent>279%</percent></b></p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwrowaltcolor1 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\">811.9</p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwrowaltcolor1 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\">431.2</p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwrowaltcolor1 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\"><b><percent>88%</percent></b></p></td></tr><tr><td class=\"bwsinglebottom bwleftsingle bwrightsingle bwwidth28 bwalignl bwpadl1\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignl\"><b>EBITDA Including Affiliates <sup>(1)</sup></b></p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\">555.3</p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\">185.9</p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\"><b><percent>199%</percent></b></p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\">1,392.6</p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\">850.2</p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\"><b><percent>64%</percent></b></p></td></tr><tr><td class=\"bwsinglebottom bwleftsingle bwrightsingle bwrowaltcolor1 bwwidth28 bwalignl bwpadl1\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignl\"><b>Net Income <sup>(2)</sup></b></p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwrowaltcolor1 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\">383.6</p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwrowaltcolor1 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\">33.6</p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwrowaltcolor1 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\"><b>1,<percent>041%</percent></b></p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwrowaltcolor1 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\">782.1</p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwrowaltcolor1 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\">402.7</p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwrowaltcolor1 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\"><b><percent>94%</percent></b></p></td></tr><tr><td class=\"bwsinglebottom bwleftsingle bwrightsingle bwwidth28 bwalignl bwpadl1\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignl\"><b>EPS<sup> (3)</sup></b></p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\">1.51</p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\">0.13</p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\"><b>1,<percent>041%</percent></b></p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\">3.08</p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\">1.59</p></td><td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwvertalignb bwpadb3 bwwidth12 bwalignc\" colspan=\"1\" rowspan=\"1\"><p class=\"bwcellpmargin bwalignc\"><b><percent>94%</percent></b></p></td></tr></table><ol class=\"bwlistdecimal\"><li>Does not include <money>US<money>$ 208.9 million</money></money> from the sale of Chaupiloma Royalty Company in 3Q24.</li><li>Net Income attributable to owners of the parent.</li><li>As of December 31, 2025, Buenaventura had a weighted average number of shares outstanding of 253,986,867.</li></ol><p>For a full version of Compañía de Minas Buenaventura Fourth Quarter 2025 Earnings Release, please visit: <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fbuenaventura.com%2Finformes-y-reportes&amp;esheet=54434970&amp;newsitemid=20260226583825&amp;lan=en-US&amp;anchor=https%3A%2F%2Fbuenaventura.com%2Finformes-y-reportes&amp;index=1&amp;md5=c0c0b8327ff27170e7bf63352ac7cb15\" rel=\"nofollow noopener\" shape=\"rect\">https://buenaventura.com/informes-y-reportes</a></p><p><b><span class=\"bwuline\">CONFERENCE CALL INFORMATION:</span></b></p><p>Compañia de Minas Buenaventura will host a conference call on Friday, February 27, 2026, to discuss these results at 10:00 am Eastern Time / 10:00 a.m. Lima Time.</p><p>To participate in the conference call, please dial:</p><p class=\"bwalignc\"><b>Toll-Free US:<br/></b>+1 844 481 2914</p><p class=\"bwalignc\"><b>Toll International:<br/></b>+1 412 317 0697</p><p class=\"bwalignc\"><b>Passcode:<br/></b>Please ask to be joined into the Compañía de Minas Buenaventura’s call.</p><p class=\"bwalignc\"><b>Live Webcast: </b><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fevent.choruscall.com%2Fmediaframe%2Fwebcast.html%3Fwebcastid%3DpN3H6eAC&amp;esheet=54434970&amp;newsitemid=20260226583825&amp;lan=en-US&amp;anchor=Click+here&amp;index=2&amp;md5=bb322b9523b09e2bbabb9088561756ba\" rel=\"nofollow noopener\" shape=\"rect\"><b>Click here</b></a></p><p class=\"bwalignc\">If you would prefer to receive a call rather than dial-in, please use the following link 10-15 minutes prior to the conference call start time:<br/>Call Me Link:<b> </b><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fhd.choruscall.com%2F%3F%24Y2FsbG1lPXRydWUmcGFzc2NvZGU9JmluZm89Y29tcGFueSZyPXRydWUmYj0xNg%3D%3D&amp;esheet=54434970&amp;newsitemid=20260226583825&amp;lan=en-US&amp;anchor=Click+Here&amp;index=3&amp;md5=bdd110aaf43fcdb7632328cf34dfb93e\" rel=\"nofollow noopener\" shape=\"rect\">Click Here</a><br/>Passcode: 7581884</p><p><i>Participants who do not wish to be interrupted to have their information gathered may have Chorus Call dial out to them by clicking on the above link, filling in the information, and pressing the green phone button at the bottom. The phone number provided will be automatically called and connected to the conference without any interruption to the participant. (Please note: Participants will be joined directly to the conference and will hear hold music until the call begins. No confirmation message will be played when joined.)</i></p><p><b>Company Description</b></p><p>Compañía de Minas Buenaventura S.A.A. is Peru’s largest, publicly traded precious and base metals company and a major holder of mining rights in <location idsrc=\"xmltag.org\" value=\"LC/pe\">Peru</location>. The Company is engaged in the exploration, mining development, processing and commercialization of gold, silver and other base metals through wholly-owned mines and its participation in joint venture projects. Buenaventura currently operates several mines in <location idsrc=\"xmltag.org\" value=\"LC/pe\">Peru</location> (Orcopampa*, Uchucchacua*, Julcani*, Tambomayo*, La Zanja*, El Brocal and Coimolache).</p><p>The Company owns <percent>19.58%</percent> of Sociedad Minera Cerro Verde, a major Peruvian copper producer (a partnership with Freeport-McMorRan Inc. and Sumitomo Corporation).</p><p>For a printed version of the Company’s 2024 Form 20-F, please contact the investor relations contacts on page 1 of this report or download the PDF format file from the Company’s web site at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.buenaventura.com&amp;esheet=54434970&amp;newsitemid=20260226583825&amp;lan=en-US&amp;anchor=www.buenaventura.com&amp;index=4&amp;md5=d744cafac00172cda2362f9f1b797997\" rel=\"nofollow noopener\" shape=\"rect\">www.buenaventura.com</a>.</p><p>(*) Operations wholly owned by Buenaventura</p><p><b>Note on Forward-Looking Statements</b></p><p>This press release and related conference call contain, in addition to historical information, forward-looking statements including statements related to the Company’s ability to manage its business and liquidity during and after the COVID-19 pandemic, the impact of the COVID-19 pandemic on the Company’s results of operations, including net revenues, earnings and cash flows, the Company’s ability to reduce costs and capital spending in response to the COVID-19 pandemic if needed, the Company’s balance sheet, liquidity and inventory position throughout and following the COVID-19 pandemic, the Company’s prospects for financial performance, growth and achievement of its long-term growth algorithm following the COVID-19 pandemic, future dividends and share repurchases.</p><p>This press release may also contain forward-looking information (as defined in the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> Private Securities Litigation Reform Act of 1995) that involve risks and uncertainties, including those concerning the Company’s, Cerro Verde’s costs and expenses, results of exploration, the continued improving efficiency of operations, prevailing market prices of gold, silver, copper and other metals mined, the success of joint ventures, estimates of future explorations, development and production, subsidiaries’ plans for capital expenditures, estimates of reserves and Peruvian political, economic, social and legal developments. These forward-looking statements reflect the Company’s view with respect to the Company’s, Cerro Verde’s future financial performance. Actual results could differ materially from those projected in the forward-looking statements as a result of a variety of factors discussed elsewhere in this Press Release.</p><p><img alt=\"\" loading=\"lazy\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226583825r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\"/><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20260226583825/en/\" rel=\"nofollow noopener\">https://www.businesswire.com/news/home/20260226583825/en/</a></span></p><p><b>Contacts in <location idsrc=\"xmltag.org\" value=\"LU/pe..lima\">Lima</location>:</b><br/>Daniel Dominguez, Chief Financial Officer<br/>(511) 419 2540</p><p>Sebastián <location idsrc=\"xmltag.org\" value=\"LU/es..valnca\">Valencia</location>, Head of Investor Relations<br/>(511) 419 2591 / <a href=\"mailto:sebastian.valencia@buenaventura.pe\" rel=\"nofollow noopener\" shape=\"rect\">sebastian.valencia@buenaventura.pe</a></p><p><b>Contact in NY:</b><br/>Barbara Cano<br/>(646) 452 2334<br/><a href=\"mailto:barbara@inspirgroup.com\" rel=\"nofollow noopener\" shape=\"rect\">barbara@inspirgroup.com</a></p><p>Company Website: <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fbuenaventura.com%2Fen%2Finversionista%2F&amp;esheet=54434970&amp;newsitemid=20260226583825&amp;lan=en-US&amp;anchor=https%3A%2F%2Fbuenaventura.com%2Fen%2Finversionista%2F&amp;index=5&amp;md5=afc172e21629be63319b3d68465157b7\" rel=\"nofollow noopener\" shape=\"rect\">https://buenaventura.com/en/inversionista/</a></p><p>Source: Compañia de Minas Buenaventura S.A.A.</p></article>",
            "link": "https://www.stocktitan.net/news/BK/buenaventura-announces-fourth-quarter-and-full-year-2025-curf9u1te6z6.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 02:51:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S. International Trade Commission Reaffirms GoPro's Patent Claim, Prevents Importation of Insta360's Infringing Products | GPRO Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\">SAN MATEO, Calif.</span>, <span class=\"legendSpanClass\">Feb. 26, 2026</span> /PRNewswire/ -- <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629008-1&amp;h=3941662693&amp;u=https%3A%2F%2Fgopro.com%2Fen%2Fus&amp;a=GoPro\" rel=\"nofollow noopener\" target=\"_blank\">GoPro</a>, Inc. (NASDAQ: <a class=\"symbol-link\" href=\"/overview/GPRO/\" title=\"View GPRO stock overview\">GPRO</a>) today announced that the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> International Trade Commission (ITC) has upheld the administrative law judge's earlier ruling that Insta360 imported and sold products in <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location> that infringe on GoPro's intellectual property. This marks a significant reaffirmation of GoPro's design patent rights following the initial determination issued on July 11, 2025.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\"><p><a href=\"https://mma.prnewswire.com/media/2448228/GoPro_Almost_Black_Logo.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"GoPro (PRNewsfoto/GoPro, Inc.)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/2448228/GoPro_Almost_Black_Logo.jpg\" title=\"GoPro (PRNewsfoto/GoPro, Inc.)\"/></a></p></div><p>The ITC confirmed that Insta360's action camera products infringe GoPro's design patent for its iconic HERO camera, reinforcing the integrity of GoPro's visual identity in the marketplace. The ITC issued a Limited Exclusion Order to <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> Customs and Border Protection to prevent further importation of Insta360's infringing products, as well as a Cease and Desist Order to Insta360 prohibiting further importation, sale, and marketing of Insta360's infringing products. The Orders will be effective after Presidential Review.</p><p>The ITC's finding of design patent infringement comes on the heels of several decisions from the Patent Trial and Appeal Board (PTAB) late last year, which upheld the validity of multiple GoPro utility patents. The PTAB rejected three separate Insta360 challenges to patents covering GoPro's ground-breaking HyperSmooth technology.<br/><br/>GoPro's intellectual property enforcement campaign, including recent positive rulings from the PTAB reaffirming the validity of GoPro's patents, reinforces the strength of GoPro's intellectual property portfolio and highlights GoPro's long-standing record of category-defining innovation, supported by more than 1,500 <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> patents.<br/><br/>\"Innovation is at the heart of everything we do at GoPro. When competitors imitate instead of innovate, we have no choice but to take action to ensure creators everywhere benefit from products built on original ideas, not imitation,\" said Nicholas Woodman, GoPro's founder and CEO. \"By protecting our intellectual property, we can keep pushing boundaries and delivering the industry-leading, breakthrough experiences customers expect from GoPro.\"</p><p><b>About GoPro, Inc. (NASDAQ: <a class=\"symbol-link\" href=\"/overview/GPRO/\" title=\"View GPRO stock overview\">GPRO</a>)<br/></b>GoPro helps the world capture and share itself in immersive and exciting ways.</p><p>Connect with GoPro on <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629008-1&amp;h=3000671977&amp;u=https%3A%2F%2Fwww.instagram.com%2Fgopro%2F&amp;a=Instagram\" rel=\"nofollow noopener\" target=\"_blank\">Instagram</a>, <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629008-1&amp;h=2031958670&amp;u=https%3A%2F%2Fwww.youtube.com%2Fc%2FGoPro&amp;a=YouTube\" rel=\"nofollow noopener\" target=\"_blank\">YouTube</a>, <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629008-1&amp;h=782276298&amp;u=https%3A%2F%2Fwww.tiktok.com%2F%40gopro%3Flang%3Den&amp;a=TikTok\" rel=\"nofollow noopener\" target=\"_blank\">TikTok</a>, <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629008-1&amp;h=3802322004&amp;u=https%3A%2F%2Fwww.facebook.com%2Fgopro%2F&amp;a=Facebook\" rel=\"nofollow noopener\" target=\"_blank\">Facebook</a>, <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629008-1&amp;h=593171794&amp;u=https%3A%2F%2Fx.com%2FGoPro&amp;a=X\" rel=\"nofollow noopener\" target=\"_blank\">X</a>, <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629008-1&amp;h=2021612585&amp;u=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fgopro_3%2Fposts%2F%3FfeedView%3Dall&amp;a=LinkedIn\" rel=\"nofollow noopener\" target=\"_blank\">LinkedIn</a>, and GoPro's blog, <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629008-1&amp;h=4089349428&amp;u=https%3A%2F%2Fgopro.com%2Fen%2Fus%2Fnews&amp;a=The+Current\" rel=\"nofollow noopener\" target=\"_blank\">The Current</a>. Members of the press can access official logos and imagery on our <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629008-1&amp;h=3669737439&amp;u=http%3A%2F%2Fbrand.gopro.com%2F&amp;a=press+portal\" rel=\"nofollow noopener\" target=\"_blank\">press portal</a>. For more information, visit <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629008-1&amp;h=2694901125&amp;u=http%3A%2F%2Fgopro.com%2F&amp;a=GoPro.com\" rel=\"nofollow noopener\" target=\"_blank\">GoPro.com</a>. </p><p>GoPro, HERO, MAX and their respective logos are trademarks or registered trademarks of GoPro, Inc. in <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location> and other countries.</p><p>SOURCE GoPro, Inc.</p></div></article>",
            "link": "https://www.stocktitan.net/news/GPRO/u-s-international-trade-commission-reaffirms-go-pro-s-patent-claim-9zdjmjcb6hoc.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 04:12:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LSI Industries Prices Public Offering of Common Stock | LSI Stock News",
            "description": "<article class=\"article\"><p> <location idsrc=\"xmltag.org\" value=\"LU/us.oh.cincin\">CINCINNATI</location>--(BUSINESS WIRE)--<a class=\"symbol-link\" href=\"/overview/LSI/\" title=\"View LSI stock overview\">LSI</a> Industries Inc. (Nasdaq: <a class=\"symbol-link\" href=\"/overview/LYTS/\" title=\"View LYTS stock overview\">LYTS</a>, “LSI” or the “Company”) a leading <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> based manufacturer of commercial lighting and display solutions, announced today that it has priced its previously announced underwritten public offering.</p><p>The Company is offering 4,600,000 shares of its common stock at a public offering price of <money><money>$19.75</money></money> per share. The gross proceeds to <a class=\"symbol-link\" href=\"/overview/LSI/\" title=\"View LSI stock overview\">LSI</a> from the offering, before deducting the underwriting discounts and commissions and offering expenses, are expected to be approximately <money><money>$90 million</money></money>. <a class=\"symbol-link\" href=\"/overview/LSI/\" title=\"View LSI stock overview\">LSI</a> has granted the underwriters a 30-day option to purchase up to an additional 690,000 shares of its common stock at the public offering price, less underwriting discounts and commissions. The offering is expected to close on or about March 2, 2026, subject to the satisfaction of customary closing conditions. All of the shares of common stock are being offered by LSI.</p><p>LSI intends to use the net proceeds from this offering to implement its growth and acquisition strategy, including (i) payment of a portion of the purchase price for its proposed Royston Group acquisition pursuant to the Agreement and Plan of Merger, dated February 20, 2026, by and between LSI and Royston Group; (ii) repayment of borrowings under the proposed Senior Secured Credit Facility Commitment Letter, dated January 21, 2026, by and between LSI, PNC Capital Markets LLC, and PNC Bank, National Association, to be used to fund the purchase price of the Royston Group acquisition, which is expected to close in the third quarter of LSI’s 2026 fiscal year; and/or (iii) for general working capital and corporate purposes.</p><p>Oppenheimer &amp; Co. and Craig-Hallum are acting as joint lead book-running managers for the offering. H.C. Wainwright &amp; Co. and Texas Capital Securities are acting as co-managers for the offering.</p><p>A shelf registration statement on Form S-3 relating to the shares of common stock to be issued in the offering was filed with the Securities and Exchange Commission (“SEC”) and is effective. The securities may be offered only by means of a prospectus, including a prospectus supplement, forming a part of the effective registration statement. A preliminary prospectus supplement and accompanying prospectus relating to and describing the terms of the offering was filed with the SEC on February 25, 2026. The final prospectus supplement and the accompanying prospectus relating to the offering will be filed with the SEC. Copies of the final prospectus supplement and the accompanying prospectus relating to the securities being offered may also be obtained, when available, from Oppenheimer &amp; Co. Inc., Attention: Syndicate Prospectus Department, 85 Broad Street, 26th Floor, <location idsrc=\"xmltag.org\" value=\"LU/us.ny.nyc\">New York, NY</location> 10004, or by telephone at (212) 667-8563, or by email at <a href=\"mailto:EquityProspectus@opco.com\" rel=\"nofollow noopener\" shape=\"rect\">EquityProspectus@opco.com</a> or Craig-Hallum Capital Group LLC, 222 South Ninth Street, Suite 350, <location idsrc=\"xmltag.org\" value=\"LU/us.mn.minnea\">Minneapolis, MN</location> 55402, Attn: Equity Capital Markets, or by telephone at (612) 334-6300, or by email at <a href=\"mailto:prospectus@chlm.com\" rel=\"nofollow noopener\" shape=\"rect\">prospectus@chlm.com</a>. Electronic copies of the final prospectus supplement and accompanying prospectus will also be available on the SEC's website at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.sec.gov&amp;esheet=54435001&amp;newsitemid=20260226530764&amp;lan=en-US&amp;anchor=http%3A%2F%2Fwww.sec.gov&amp;index=1&amp;md5=a25847a90dfb163da93b50230601979a\" rel=\"nofollow noopener\" shape=\"rect\">http://www.sec.gov</a>.</p><p>This press release shall not constitute an offer to sell or the solicitation of an offer to buy these securities, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.</p><p><b>ABOUT LSI INDUSTRIES</b></p><p>Headquartered in <location idsrc=\"xmltag.org\" value=\"LU/us.oh.cincin\">Cincinnati</location>, LSI is a publicly held company traded over the NASDAQ Stock Exchange under the symbol <a class=\"symbol-link\" href=\"/overview/LYTS/\" title=\"View LYTS stock overview\">LYTS</a>. The Company manufactures advanced lighting, graphics, and display solutions across strategic vertical markets. The Company’s American-made products, which include non-residential indoor and outdoor lighting, print graphics, digital graphics, refrigerated and custom displays, help create value for customer brands and enhance the consumer experience. LSI also provides comprehensive project management services in support of large-scale product rollouts. The Company employs approximately 2,000 people at 18 manufacturing plants in <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location> and <location idsrc=\"xmltag.org\" value=\"LC/ca\">Canada</location>.</p><p><b>FORWARD-LOOKING STATEMENTS</b></p><p>This press release contains statements that, to the extent they are not recitations of historical fact, constitute “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. All such statements are intended to be covered by the safe harbor provisions for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995 and this statement is included for purposes of such safe harbor provisions.</p><p>“Forward-looking” statements, as such term is defined by the SEC in its rules, regulations and releases, represent our expectations or beliefs, including, but not limited to, statements concerning our expectations regarding the offering of common stock, including the expected use of proceeds, our expectation that we will complete the offering, our operations, economic performance, financial condition, growth and acquisition strategies, investments and future operational plans. Without limiting the generality of the foregoing, words such as “may,” “will,” “expect,” “believe,” “anticipate,” “intend,” “forecast,” “seek,” “plan,” “predict,” “project,” “could,” “estimate,” “might,” “continue,” “seeking” or the negative or other variations thereof or comparable terminology are intended to identify forward-looking statements.</p><p>These statements speak only as of the date of this press release and we undertake no ongoing obligation, other than that imposed by law, to update these statements. These statements relate to, among other things, our intent, belief or current expectations with respect to the offering of common stock, the anticipated use of proceeds from the offering and other statements relating to the offering. You are cautioned that any such forward-looking statements are not guarantees of future performance and involve significant risks and uncertainties, certain of which are beyond our control, and that actual results may differ materially from those contained in or implied by the forward-looking statements as a result of various factors, some of which are unknown, including, without limitation, risks related to:</p><ul class=\"bwlistdisc\"><li>our ability to complete the offering of common stock on favorable terms or at all;</li><li>reliance on key customers;</li><li>global economic and political conditions;</li><li>product demand and market acceptance risks;</li><li>competition from existing and new competitors;</li><li>our ability to consummate, successfully integrate, and achieve the strategic and other objectives, including any expected synergies, relating to pending acquisitions, including the acquisition of Royston Group and other recently completed acquisitions;</li><li>prolonged periods of inflation and our ability to mitigate the impact thereof;</li><li>our ability to mitigate the impacts of increased costs related to tariffs;</li><li>technology and cybersecurity threats and incidents;</li><li>our outstanding indebtedness;</li><li>market volatility in the debt and equity capital markets;</li><li>our ability to continue to pay dividends at current levels or at all;</li><li>our published financial guidance;</li><li>our expected use of proceeds from the offering; and</li><li>the other factors identified in our reports filed or expected to be filed with the SEC, including our Annual Report on Form 10-K for the year ended June 30, 2025 and our Quarterly Reports on Form 10-Q for the quarterly periods ended September 30, 2025 and December 31, 2025.</li></ul><p>You are advised, however, to consult any further disclosures we make on related subjects in our periodic reports on Forms 10-K, 10-Q or 8-K filed with or furnished to the SEC.</p><p><img alt=\"\" loading=\"lazy\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226530764r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\"/><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20260226530764/en/\" rel=\"nofollow noopener\">https://www.businesswire.com/news/home/20260226530764/en/</a></span></p><p><b>INVESTOR CONTACT</b><br/>Noel Ryan or Bill Seymour<br/><a href=\"mailto:LYTS@vallumadvisors.com\" rel=\"nofollow noopener\" shape=\"rect\">LYTS@vallumadvisors.com</a></p><p>Source: LSI Industries Inc.</p></article>",
            "link": "https://www.stocktitan.net/news/LSI/lsi-industries-prices-public-offering-of-common-d1nxg1udq0q0.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 02:50:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Changes to the UBS Board of Directors | UBS Stock News",
            "description": "<article class=\"article\"><p><b>Agustín Carstens and Luca Maestri nominated for election to the Board of Directors of <a class=\"symbol-link\" href=\"/overview/UBS/\" title=\"View UBS stock overview\">UBS</a> Group AG and <a class=\"symbol-link\" href=\"/overview/UBS/\" title=\"View UBS stock overview\">UBS</a> AG at the 2026 Annual General Meetings in April</b></p><ul class=\"bwlistdisc\"><li><b>William C. Dudley and Jeanette Wong will not stand for re-election</b></li><li><b>As previously announced, Vice Chairman Lukas Gähwiler will be stepping down from the Board and Markus Ronner was nominated for election to the Board</b> </li></ul><p>    ZURICH &amp; <location idsrc=\"xmltag.org\" value=\"LU/ch..basel\">BASEL, Switzerland</location>--(BUSINESS WIRE)--Regulatory News:</p><p>Ad hoc announcement pursuant to article 53 of the SIX Exchange Regulation Listing Rules</p><p>The Board of Directors of <a class=\"symbol-link\" href=\"/overview/UBS/\" title=\"View UBS stock overview\">UBS</a> Group AG (NYSE:UBS) (SWX:UBSN) announces today the nomination of Agustín Carstens and Luca Maestri for election to the Board at the Annual General Meeting (AGM) on 15 April 2026. William C. Dudley and Jeanette Wong have decided not to stand for re-election.</p><p>Agustín Carstens (born 1958) served as General Manager of the Bank of International Settlements (BIS) from 2017 to June 2025. Prior to that, he was Governor of the Bank of <location idsrc=\"xmltag.org\" value=\"LC/mx\">Mexico</location> from 2010 to 2017. During his time as Governor, he was a Member of the BIS Board and chaired the Global Economy Meeting and the Economic Consultative Committee. Mr. Carstens also chaired the International Monetary and Financial Committee, the policy advisory committee of the International Monetary Fund (IMF), from 2015 to 2017. Earlier in his career, he served as <location idsrc=\"xmltag.org\" value=\"LC/mx\">Mexico's</location> Finance Minister and as Deputy Managing Director at the IMF. From 2000 to 2003, he was <location idsrc=\"xmltag.org\" value=\"LC/mx\">Mexico's</location> Deputy Finance Minister after holding the position of Executive Director at the IMF. Mr. Carstens began his career in 1980 at the Bank of <location idsrc=\"xmltag.org\" value=\"LC/mx\">Mexico</location>. He holds a Master’s degree and a PhD in Economics from the University of <location idsrc=\"xmltag.org\" value=\"LU/us.il.chicgo\">Chicago</location>. He is a citizen of <location idsrc=\"xmltag.org\" value=\"LC/mx\">Mexico</location>. Mr. Carstens is a highly respected and distinguished professional with extensive experience in financial regulation and monetary policy, built over a long and accomplished career.</p><p>Luca Maestri (born 1963) is currently Vice President of Apple Inc’s Corporate Services, reporting to the CEO. Previously, he was Apple’s CFO for more than a decade after joining the firm in 2013 as Vice President and Corporate Controller. Prior to that, he served as Executive Vice President and CFO at Xerox Corporation. From 2008 to 2011, he was Senior Vice President and CFO at Nokia Siemens Networks. Mr. Maestri spent two decades at General Motors (GM), holding various finance leadership roles across multiple countries, including CFO for GM Europe based in <location idsrc=\"xmltag.org\" value=\"LU/ch..zurich\">Zurich</location> and CFO for GM Brazil in <location idsrc=\"xmltag.org\" value=\"LU/br..saopau\">Sao Paulo</location>. He also led the Fiat Alliance at GM Europe. His experience spans assignments in <location idsrc=\"xmltag.org\" value=\"LC/th\">Thailand</location>, <location idsrc=\"xmltag.org\" value=\"LC/sg\">Singapore</location>, <location idsrc=\"xmltag.org\" value=\"LC/ie\">Ireland</location>, <location idsrc=\"xmltag.org\" value=\"LC/ch\">Switzerland</location>, <location idsrc=\"xmltag.org\" value=\"LC/it\">Italy</location>, <location idsrc=\"xmltag.org\" value=\"LC/de\">Germany</location>, <location idsrc=\"xmltag.org\" value=\"LC/br\">Brazil</location> and <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location>. Mr. Maestri holds a Bachelor’s degree in Economics from Luiss University in Rome and a Master’s degree in Management from <location idsrc=\"xmltag.org\" value=\"LU/us.ma.boston\">Boston</location> University. He is a citizen of <location idsrc=\"xmltag.org\" value=\"LC/it\">Italy</location> and <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location>. Mr. Maestri is a highly renowned executive and leader in the technology industry.</p><p>UBS Chairman Colm Kelleher commented: “I am delighted to share the nomination of Agustín Carstens and Luca Maestri for election to the Board. The addition of these two highly experienced leaders will further strengthen the Board’s expertise, bringing outstanding regulatory knowledge and extensive CFO skills. This follows the earlier announcement of former UBS Group Executive Board member Markus Ronner’s nomination as Vice Chairman. I very much look forward to collaborating with them on the Board.”</p><p>As previously communicated, Lukas Gähwiler has decided, after an exceptionally successful career spanning 45 years, to retire from his role as Vice Chairman of the Board of Directors and concluding his long career in banking. He was appointed Vice Chairman in 2022 and acted as UBS’s representative within Switzerland’s leading trade associations and financial industry bodies. Furthermore, as the final Chairman of Credit Suisse AG, he played an instrumental role in overseeing the seamless integration of Credit Suisse into UBS.</p><p>William C. Dudley and Jeanette Wong have also decided to step down after seven years on the Board. During this time, Mr. Dudley served on the Corporate Culture and Responsibility Committee, the Risk Committee and the Governance and Nominating Committee. Ms. Wong was a member of the Audit Committee, the Corporate Culture and Responsibility Committee and the Compensation Committee.</p><p>Chairman Colm Kelleher and the members of the Board extend their gratitude to Lukas Gähwiler, William C. Dudley and Jeanette Wong for their unwavering commitment and significant contributions over the past years.</p><p><img alt=\"\" loading=\"lazy\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226055790r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\"/><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20260226055790/en/\" rel=\"nofollow noopener\">https://www.businesswire.com/news/home/20260226055790/en/</a></span></p><p><b>UBS Group AG and UBS AG</b></p><p>Investor contact<br/><location idsrc=\"xmltag.org\" value=\"LC/ch\">Switzerland</location>: +41-44-234 41 00<br/></p><p>Media contact<br/><location idsrc=\"xmltag.org\" value=\"LC/ch\">Switzerland</location>: +41-44-234 85 00<br/><location idsrc=\"xmltag.org\" value=\"LC/gb\">UK</location>: +44-207-567 47 14<br/><location idsrc=\"xmltag.org\" value=\"LR/am\">Americas</location>: +1-212-882 58 58<br/>APAC: +852-297-1 82 00<br/></p><p><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.ubs.com%2Fmedia&amp;esheet=54434775&amp;newsitemid=20260226055790&amp;lan=en-US&amp;anchor=www.ubs.com%2Fmedia&amp;index=1&amp;md5=18777c1e3cbea33a8dcefdd265df27e3\" rel=\"nofollow noopener\" shape=\"rect\">www.ubs.com/media</a></p><p>Source: UBS Group AG</p></article>",
            "link": "https://www.stocktitan.net/news/UBS/changes-to-the-ubs-board-of-768xchqpuglo.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 05:45:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        }
    ]
}