{
    "data": [
        {
            "title": "American Eagle Announces $23 Million Strategic Investment Backed by Eric Sprott | AMEGF Stock News",
            "description": "<article class=\"article\"><p><b>Highlights</b>:</p><ul><li>The investment adds a third strategic investor, when combined with investments by mining companies South32 Group Operations PTY Ltd. and Teck Resources Limited</li><li>The Offering funds significantly expanded drill programs for 2026 and 2027 at the Company's NAK copper-gold porphyry project (the \"Nak\") near Smithers, BC</li><li>No warrants will be issued in connection with the Offering</li><li>American Eagle will issue these shares at <money>$1.20</money> CAD</li></ul><p>Toronto, Ontario--(Newsfile Corp. - February 27, 2026) - American Eagle Gold Corp. (TSXV: AE) (OTCQB: <a class=\"symbol-link\" href=\"/overview/AMEGF/\" title=\"View AMEGF stock overview\">AMEGF</a>) (\"American Eagle\" or the \"Company\") is pleased to announce that it intends to complete a financing for aggregate gross proceeds up to C<money>$34,540,000</money>, consisting of approximately: (i) up to 19,200,000 common shares to be issued on a premium flow-through basis (each, an \"FT Share\") at a price of C<money>$1.20</money> per FT Share (\"Charity FT Offering\") for proceeds of C<money>$23,040,000</money>; and (ii) up to 14,935,065 common shares (each, a \"Share\") at a price of C<money>$0.77</money> per Share for proceeds of up to C<money>$11,500,000</money> (the \"Concurrent Offering\" and with the Charity FT Offering are the \"Offering\"). </p><p>Eric Sprott, through a 2176423 Ontrio Ltd., a corporation beneficially owned and controlled by him, has agreed to acquire an approximate <percent>9.9%</percent> equity interest in the Company,  prior to the decisions of Teck and South32 who have certain equity participaton rights as detailed below, through the purchase of 19,200,000 common shares underlying the Charity FT Offering at a back-end price of <money>$0.77</money> per share. The investment represents C<money>$23,040,000</money> of the Charity FT Offering gross proceeds.</p><p>\"We're very pleased to welcome Eric Sprott as another strategic, long-term investor on the register. What makes his participation particularly notable is that it's rare for him to back copper stories. We're proud to have him alongside Teck, South32, and Orecap as foundational, long-term shareholders,\" state Anthony Moreau, CEO of American Eagle.</p><p>\"NAK has truly caught my attention. I believe the grade and length of the intervals are exceptional, and the gold grade is the icing on the cake. I believe this is one of the best undeveloped porphyrys in Canada,\" stated Eric Sprott. </p><p><b>Participation Rights for Teck and South32</b></p><p>American Eagle has previously agreed to grant South32 and Teck certain investor rights, including an equity participation right in equity financings as well as dilutive events to maintain its pro-rata ownership in the Company. Should these shareholders choose to maintain their rights, American Eagle would complete up to a <money>$11.5 million</money> concurrent offering. The Concurrent Offering is to accommodate these rights and additional subscribers and it not a committed amount. Further information will be provided when South 32 and Teck have confirmed their participation intentions to the Company. There is no assurance that either South 32 or Teck will participate in the Offering, or  maintain their proportionate equity ownership in the Company.</p><p>American Eagle will use the proceeds to thoroughly test its thesis at NAK and build on the successes of its 2026 and 2027 drill program, which expanded NAK's scale and identified additional high-grade zones, as well as for general corporate purposes and working capital.</p><p>The FT Shares will qualify as \"flow-through shares\" within the meaning of the Income Tax Act (Canada) (the \"Tax Act\"). An amount equal to the gross proceeds from the issuance of the FT Shares will be used to incur, on the Company's Canadian mineral exploration properties, eligible resource exploration expenses that will qualify as (i) \"Canadian exploration expenses\" (as defined in the Tax Act), (ii) \"flow-through critical mineral mining expenditures\" (as defined in subsection 127(9) of the Tax Act), and (iii) \"BC flow-through mining expenditures\" for purchasers in British Columbia (collectively, the \"Qualifying Expenditures\"). The Qualifying Expenditures, in an aggregate amount not less than the gross proceeds raised from the issuance of the FT Shares, will be incurred on or before December 31, 2027 and will be renounced by the Company to the initial purchasers of the FT Shares with an effective date no later than December 31, 2026. In the event that the Company is unable to renounce the full issue price of the FT Shares on or prior to December 31, 2026 and/or if the Qualifying Expenditures are reduced by the Canada Revenue Agency, the Company will indemnify each initial purchaser for the additional taxes payable by such subscriber to the extent permitted by the Tax Act as a result of the Company's failure to renounce the Qualifying Expenditures as agreed. </p><p>Upon closing this Offering (assuming both the Charity FT Offering and Concurrent Offering are completed), American Eagle will have over C<money>$50 million</money> in cash on its balance sheet, and the Company will be fully funded for substantial drill program expansions in 2026 and 2027. </p><p>No warrants are included in the Offering.  The Company will pay a commission or finder's fee of up to <percent>1%</percent> in connection with the Offering. The Company reserves the right to alter the Concurrent Offering to include a premium flow-through component. Closing of the Offering is expected to occur on, or about,  March 20, 2026 (the \"Closing Date\"), subject to satisfaction of the closing conditions for the benefit of the parties,  the receipt of all necessary regulatory approvals and acceptance of the TSX Venture Exchange. The Shares will be subject to a statutory hold period of four months plus a day following the Closing Date.</p><p>This news release does not constitute an offer to sell or a solicitation of an offer to buy nor shall there be any sale of any of the securities in any jurisdiction in which such offer, solicitation or sale would be unlawful. The securities have not been, and will not be, registered under the United States Securities Act of 1933, as amended (the \"U.S. Securities Act\"), or the securities laws of any state of the United States, and may not be offered or sold in the United States or to, or for the account or benefit of, U.S. persons (as defined in Regulation S under the U.S. Securities Act) absent registration under the U.S. Securities Act and applicable state securities laws or an exemption from such registration requirements.</p><p><b>About American Eagle's NAK Project</b></p><p>The NAK Project lies within the Babine copper-gold porphyry district of central British Columbia. It has excellent infrastructure through all-season roads and is close to the towns of Smithers, Houston, and Burns Lake, B.C., which lie along a major rail line and Provincial Highway 16. Historical drilling and geophysical, geological, and geochemical work at NAK, which began in the 1960's, tested only to shallow depths. Still, the work revealed a very large near-surface copper-gold system that measures over 1.5 km x 1.5 km. Drilling completed by American Eagle in 2022, 2023, and 2024 returned significant intervals of high-grade copper-gold mineralization that reached beyond and much deeper than the historical drilling, indicating that zones of near-surface and deeper mineralization, locally with considerably higher grades, exist within the broader NAK property mineralizing system. American Eagle Gold completed an aggressive 31,500 metre drill program in 2025 designed to expand and improve the mineral footprint; assays are currently being received.   </p><p>For the latest videos from American Eagle, Ore Group, and all things mining, subscribe to our YouTube Chanel: <a href=\"https://api.newsfilecorp.com/redirect/no2D8TMegy\" rel=\"nofollow noopener\">youtube.com/@theoregroup</a></p><p><b>About American Eagle Gold Corp.</b></p><p>American Eagle is focused on exploring its NAK copper-gold porphyry project in west-central British Columbia, Canada. </p><p>American Eagle Gold Corp<br/>Toronto, Ontario</p><div id=\"contactInfo\"><p><b>Anthony Moreau, Chief Executive Officer</b></p><p>416.644.1567<br/><a href=\"mailto:amoreau@oregroup.ca\" rel=\"nofollow noopener\">amoreau@oregroup.ca</a><br/><a href=\"https://api.newsfilecorp.com/redirect/KLpPRfJKje\" rel=\"nofollow noopener\">www.americaneaglegold.ca</a> </p></div><p><b>Q.P. Statement</b></p><p>Mark Bradley, B.Sc., M.Sc., P.Geo., a Certified Professional Geologist and 'qualified person' for the purposes of Canada's National Instrument 43-101 Standards of Disclosure for Mineral Properties, has verified and approved the information contained in this news release.</p><p><b>Forward-Looking Statements</b></p><p>Certain information in this press release may contain forward-looking statements. Forward-looking statements in this press release include, but are not limited to, statements regarding whether the Company will be able to complete the Offering as anticipated, the receipt of regulatory approval, including the approval of the TSX Venture Exchange, to complete the Offering, the intended use of proceeds and intended drill program or its anticipated results at the Company's NAK project, the ability of the Company to make the qualifying expenditures as anticipated by management, and other matters ancillary or incidental to the foregoing. This information is based on current expectations that are subject to significant risks and uncertainties that are difficult to predict. Therefore, actual results might differ materially from those suggested in forward-looking statements. American Eagle Gold Corp. assumes no obligation to update the forward-looking statements or to update the reasons why actual results could differ from those reflected in the forward looking-statements unless and until required by securities laws applicable to American Eagle Gold Corp. Additional information identifying risks and uncertainties is contained in filings by American Eagle Gold Corp. with Canadian securities regulators, which filings are available under American Eagle Gold Corp. profile at <a href=\"https://api.newsfilecorp.com/redirect/EZ2k8ujYXR\" rel=\"nofollow noopener\">www.sedarplus.ca</a>.</p><p><i><b>Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the TSX Venture Exchange policies) accept responsibility for the adequacy or accuracy of this release.</b></i></p><p id=\"corporateNewsLogoContainer\"><img alt=\"Corporate Logo\" id=\"corporateNewsLogo\" loading=\"lazy\" src=\"https://images.newsfilecorp.com/files/9283/285744_e83d63b3149bebb1_logo.jpg\"/></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/xEjmMcK8ML\" rel=\"nofollow noopener\">https://www.newsfilecorp.com/release/285744</a></p><p><img alt=\"\" loading=\"lazy\" src=\"https://api.newsfilecorp.com/newsinfo/285744/375\"/></p></article>",
            "link": "https://www.stocktitan.net/news/AMEGF/american-eagle-announces-23-million-strategic-investment-backed-by-cc5u0dkkg95b.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:41:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "IQVIA Releases its 2025 Sustainability Report | IQV Stock News",
            "description": "<article class=\"article\"><p> <location idsrc=\"xmltag.org\" value=\"LU/us.nc.resark\">RESEARCH TRIANGLE PARK, N.C.</location>--(BUSINESS WIRE)--IQVIA Holdings Inc. (NYSE: <a class=\"symbol-link\" href=\"/overview/IQV/\" title=\"View IQV stock overview\">IQV</a>), a leading global provider of clinical research services, commercial insights and healthcare intelligence to the life sciences and healthcare industries, today published its 2025 Sustainability Report. The report highlights IQVIA’s progress across its People, Public and Planet pillars, consistent with the company’s mission to accelerate innovation for a healthier world.</p><p>IQVIA’s 2025 Sustainability Report can be downloaded at: <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.iqvia.com%2F-%2Fmedia%2Fiqvia%2Fpdfs%2Fabout-us%2Fsustainability%2Fiqvia-2025-sustainability-report.pdf&amp;esheet=54434801&amp;newsitemid=20260227193090&amp;lan=en-US&amp;anchor=https%3A%2F%2Fwww.iqvia.com%2F-%2Fmedia%2Fiqvia%2Fpdfs%2Fabout-us%2Fsustainability%2Fiqvia-2025-sustainability-report.pdf&amp;index=1&amp;md5=c7c800229b91386d0ae14f411bf22ff0\" rel=\"nofollow noopener\" shape=\"rect\">https://www.iqvia.com/-/media/iqvia/pdfs/about-us/sustainability/iqvia-2025-sustainability-report.pdf</a>. Highlights from the report include:</p><ul class=\"bwlistdisc\"><li><b>Investments in the company’s employees. </b>IQVIA’s approximately 93,000 employees worldwide are central to delivering on the company’s mission. In 2025, IQVIA accelerated learning and development opportunities through expanded AI and data analytics upskilling, generating more than 230,000 employee engagements with AI learning resources. More than 2,000 employees participated in leadership development programs, strengthening IQVIA’s global leadership pipeline. Efforts to listen to and act on employee feedback continued to reflect strong employee engagement, with IQVIA exceeding Fortune 500 benchmarks across key metrics.</li><li><b>Innovation in AI and technology. </b>IQVIA advanced its AI strategy by expanding key partnerships to strengthen ecosystem interoperability and launching new AI-enabled solutions for internal use and external offerings. Guided by its AI Governance Council and Center for Defensible Data and AI, IQVIA remains committed to the responsible use of AI, with strong foundations in privacy, regulatory compliance and patient safety through its IQVIA Healthcare-grade AI<sup>®</sup> capabilities.</li><li><b>Access to healthcare. </b>Patients remain at the center of the research IQVIA supports. IQVIA continued to broaden access to clinical trials and improve the representation of underserved patient populations worldwide. In 2025, this included activating sites in <location idsrc=\"xmltag.org\" value=\"LC/br\">Brazil</location> and <location idsrc=\"xmltag.org\" value=\"LC/ar\">Argentina</location> for a global acute coronary syndrome trial. Together, these sites enrolled 5,700 participants toward a global target of 47,000, helping ensure patients from the region are represented in large-scale cardiovascular research. IQVIA also expanded its global network of Prime Sites to 56 high-performing clinical trial centers, adding locations in <location idsrc=\"xmltag.org\" value=\"LC/br\">Brazil</location>, <location idsrc=\"xmltag.org\" value=\"LC/it\">Italy</location> and <location idsrc=\"xmltag.org\" value=\"LC/jp\">Japan</location>.</li><li><b>Global health. </b>Leveraging its global scale and scientific expertise, IQVIA supported public health initiatives addressing some of the world’s most complex challenges. In 2025, IQVIA collaborated with governments, global health organizations and industry partners to respond to disease outbreaks, advance digital health strategies and strengthen healthcare systems.</li><li><b>Environmental impact. </b>IQVIA continued to reduce the environmental footprint of research and operations across its business. Its ongoing commitment to the My Green Lab<sup>®</sup> program, with <percent>100%</percent> of its global laboratory network obtaining My Green Lab certification, remained a key element of IQVIA’s approach to more sustainable research. IQVIA also redesigned clinical trial test kits to use at least <percent>98%</percent> recycled materials, reduced packaging emissions in cold chain logistics by <percent>70%</percent> and expanded ISO 14001 and 45001 certifications across laboratories.</li><li><b>External recognition. </b>IQVIA was regularly recognized externally for its work. Among multiple notable awards in 2025, IQVIA was named to the 2026 <i>Fortune</i><sup>®</sup> World’s Most Admired Companies<sup>™</sup> list for the ninth year in a row and ranked No. 1 in its category for the fifth consecutive year; IQVIA scored “outstanding” — the highest distinction — in TIME’s inaugural ranking of the World’s Top HealthTech companies in 2025; IQVIA’s Health Research Space won the award for best mobile app for patient engagement from the MedTech Breakthrough Awards; IQVIA was the only clinical research organization to achieve top ranking in the Everest Group’s “AI-deas to Action: Operationalizing Generative AI in Life Sciences” report<i>; </i>and IQVIA received five Human Capital Management Excellence Awards<sup>®</sup> from Brandon Hall Group, recognizing its commitment to developing and investing in its employees.</li></ul><p><b>About IQVIA</b></p><p>IQVIA (NYSE:<a class=\"symbol-link\" href=\"/overview/IQV/\" title=\"View IQV stock overview\">IQV</a>) is a leading global provider of clinical research services, commercial insights and healthcare intelligence to the life sciences and healthcare industries. IQVIA’s portfolio of solutions are powered by IQVIA Connected Intelligence<sup>™</sup> to deliver actionable insights and services built on high-quality health data, Healthcare-grade AI<sup>®</sup>, advanced analytics, the latest technologies and extensive domain expertise. IQVIA is committed to using AI responsibly, with AI-powered capabilities built on best-in-class approaches to privacy, regulatory compliance and patient safety, and delivering AI to the high standards of trust, scalability and precision demanded by the industry. With approximately 93,000 employees in over 100 countries, including experts in healthcare, life sciences, data science, technology and operational excellence, IQVIA is dedicated to accelerating the development and commercialization of innovative medical treatments to help improve patient outcomes and population health worldwide.</p><p>IQVIA is a global leader in protecting individual patient privacy. The company uses a wide variety of privacy-enhancing technologies and safeguards to protect individual privacy while generating and analyzing information on a scale that helps healthcare stakeholders identify disease patterns and correlate with the precise treatment path and therapy needed for better outcomes. IQVIA’s insights and execution capabilities help biotech, medical device and pharmaceutical companies, medical researchers, government agencies, payers and other healthcare stakeholders tap into a deeper understanding of diseases, human behaviors and scientific advances in an effort to advance their path toward cures. To learn more, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.iqvia.com&amp;esheet=54434801&amp;newsitemid=20260227193090&amp;lan=en-US&amp;anchor=www.iqvia.com&amp;index=2&amp;md5=0d9f01bf498075c748b2c64227a07acd\" rel=\"nofollow noopener\" shape=\"rect\">www.iqvia.com</a>.</p><p>IQVIAFIN</p><p><img alt=\"\" loading=\"lazy\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260227193090r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\"/><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20260227193090/en/\" rel=\"nofollow noopener\">https://www.businesswire.com/news/home/20260227193090/en/</a></span></p><p>Kerri Joseph, IQVIA Investor Relations (<a href=\"mailto:kerri.joseph@iqvia.com\" rel=\"nofollow noopener\" shape=\"rect\">kerri.joseph@iqvia.com</a>)<br/>+1.973.541.3558</p><p>Alissa Maupin, IQVIA Media Relations (<a href=\"mailto:alissa.maupin1@iqvia.com\" rel=\"nofollow noopener\" shape=\"rect\">alissa.maupin1@iqvia.com</a>)<br/>+1.919.923.6785</p><p>Source: IQVIA</p></article>",
            "link": "https://www.stocktitan.net/news/IQV/iqvia-releases-its-2025-sustainability-d5jr9v9fvcju.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:47:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SOL Strategies Announces Proposed Board Transition | STKE Stock News",
            "description": "<article class=\"article\"><p>Refreshed Board Slate Having Support of Requisitioning Shareholders to be Proposed at AGM</p><p>Toronto, Ontario--(Newsfile Corp. - February 27, 2026) - SOL Strategies Inc. (CSE: HODL) (NASDAQ: <a class=\"symbol-link\" href=\"/overview/STKE/\" title=\"View STKE stock overview\">STKE</a>) (\"SOL Strategies\" or the \"Company\"), one of the first publicly traded companies dedicated to growing and building the Solana economy, today announced a refreshed board slate to be presented to shareholders at its <a href=\"https://api.newsfilecorp.com/redirect/OARYzI2D18\" rel=\"nofollow noopener\">Annual General Meeting of Shareholders</a> (AGM) on March 31, 2026, as well as the resolution of recently raised shareholder concerns.</p><p>The Company's proposed board slate for the upcoming AGM includes two new independent directors: Laszlo \"Les\" Borsai and Dennis Logan. Both bring significant expertise in digital assets, corporate finance, and public company governance. The remainder of the proposed slate will include five of the Company's incumbent directors, being Luis Berruga (Chairman), Michael Hubbard (Interim Chief Executive Officer), Jon Matonis, Rubsun Ho, and Jose Calderon.</p><p>Additionally, Ungad Chadda announced he will not stand for reelection at the AGM. Following the AGM, Mr. Logan will be appointed to the Company's Audit Committee in Mr. Chadda's place. Mr. Chadda will continue to support the Company as a Special Advisor to the Board for a six-month transition period, providing counsel on audit and regulatory matters.</p><p>The proposed board changes reflect the cooperation agreement (the \"Cooperation Agreement\") entered into with concerned shareholders Max Kaplan and Tony Guoga (the \"Concerned Shareholders\") following a constructive dialogue and collaborative review of their concerns, a copy of which will be filed under the Company's profile at <a href=\"https://api.newsfilecorp.com/redirect/PqE04ugAzO\" rel=\"nofollow noopener\">www.sedarplus.ca</a>. The concerned shareholders have agreed to vote in favour of the proposed board slate at the AGM. In the event that either Mr. Logan or Mr. Borsai is unable or unwilling to serve on the Board during the 12 months following the AGM, the Concerned Shareholders will have the right, in the case of Mr. Logan, to appoint a replacement director, and in the case of Mr. Borsai, to work with the Company to determine a replacement director agreeable to both the Company and the Concerned Shareholders. </p><p>The Cooperation Agreement also provides that, no later than as soon as reasonably practicable following the Meeting, Michael Hubbard will be appointed as full-time Chief Executive Officer and Steve Ehrlich, currently the Company's Head of Capital Markets, will be appointed as Chief Strategy Officer.</p><p>\"We value open communication with our shareholders and appreciate the constructive engagement that led to this agreement,\" <i><b>said Michael Hubbard, Interim Chief Executive Officer of SOL Strategies</b></i>. \"Our focus remains on executing our infrastructure strategy and delivering value for stakeholders. This resolution and bringing Les and Dennis on board strengthen our governance while letting us stay focused on execution.\"</p><p>\"I want to thank Ungad for his services and contributions,\" <i><b>said Luis Berruga, Chairman of the Board</b></i>. \"It is under his chairmanship of the audit committee that the company obtained a successful PCAOB audit and NASDAQ listing. He will remain engaged as an advisor to ensure continuity, which matters. I'm also excited to welcome Les and Dennis, whose combined expertise in digital assets and capital markets positions us well for what's next.\"</p><p>The Concerned Shareholders have confirmed to the Company that they are not, and have not been, acting jointly or in concert with each other or any other person or company for the purposes of Canadian securities laws in connection with their respective investments in the Company or the matters contemplated by the Cooperation Agreement.</p><p><b>Proposed New Directors</b></p><p><b>Laszlo \"Les\" Borsai </b>brings extensive experience at the intersection of digital assets and entertainment. An early participant in the cryptocurrency industry, Borsai advised Ripple Labs beginning in 2013 and made early-stage investments in Ethereum, XRP, Tezos, and NFT projects. He co-founded Wave Digital Assets in 2018, an SEC-registered investment advisory firm specializing in digital asset venture capital and wealth management.</p><p><b>Dennis Logan </b>is a financial executive with deep experience in corporate finance and public company management. He currently serves as Chief Financial Officer of American Tungsten Corp., Sterling Metals Corp. and BTU Metals Corp., and has held CFO roles at multiple public companies, including Planet 13 Holdings Inc. Mr. Logan is a CPA, CA (Chartered Accountant) and a Member of CPA Ontario (formerly the Institute of Chartered Accountants of Ontario).</p><p>The Company will publish its management information circular for the Annual General Meeting in early March, which will include the complete proposed slate of directors and recommendations for shareholder consideration.</p><p><b>About SOL Strategies</b></p><p>SOL Strategies Inc. (CSE: HODL) (NASDAQ: <a class=\"symbol-link\" href=\"/overview/STKE/\" title=\"View STKE stock overview\">STKE</a>) is a Canadian investment company that operates at the forefront of blockchain innovation. Specializing in the Solana ecosystem, the company provides strategic investments and infrastructure solutions to enable the next generation of decentralized applications.</p><p>To learn more about SOL Strategies, please visit <a href=\"https://api.newsfilecorp.com/redirect/wE4Q8sB0gw\" rel=\"nofollow noopener\">www.solstrategies.io</a>. A copy of this news release and all the Company's related material documents regarding the Company may be obtained under the Company's profile on SEDAR+ at <a href=\"https://api.newsfilecorp.com/redirect/gJYgEU581K\" rel=\"nofollow noopener\">www.sedarplus.ca</a> and EDGAR at <a href=\"https://api.newsfilecorp.com/redirect/ppYV7I5XBr\" rel=\"nofollow noopener\">www.sec.gov</a>.</p><div id=\"contactInfo\"><p><b>Investor Contact:</b></p><p>Doug Harris, Chief Financial Officer, 416-480-2488</p><p>John Ragozzino, CFA, <a href=\"mailto:solstrategies@icrinc.com\" rel=\"nofollow noopener\">solstrategies@icrinc.com</a>, 203-682-8284</p><p><b>Media Contact: <a href=\"mailto:solstrategies@scrib3.co\" rel=\"nofollow noopener\">solstrategies@scrib3.co</a></b></p></div><p><b>Cautionary Note Regarding Forward-Looking Information:</b></p><p>Neither the Canadian Securities Exchange nor its Market Regulator (as that term is defined in the policies of the Canadian Securities Exchange) accepts responsibility for the adequacy or accuracy of this release.</p><p>This news release contains \"forward-looking information\" within the meaning of applicable securities laws. All statements other than statements of historical fact may be forward‐looking statements and information. More particularly and without limitation, this news release contains forward‐looking statements and information relating to the Company's or the Company's management team's expectations, hopes, beliefs, intentions or strategies regarding the future, and expectations regarding the characteristics, value drivers, and anticipated benefits of the Company's business plans and operations related thereto. Forward-looking information can also be identified by the use of forward-looking terminology such as \"plans\", \"expects\" or \"does not expect\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\" or \"does not anticipate\", or \"believes\", or variations of such words and phrases or indicates that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will be\" taken, \"occur\" or \"be achieved\".</p><p>Forward-looking statements in this news release include statements regarding the holding of the Annual General Meeting, the publication of the management information circular, the election of directors, the support of concerned shareholders for the Company's recommended proposals, and Mr. Chadda's continued service as a Special Advisor to the Board. There is no assurance that the Company's plans or objectives will be implemented as set out herein, or at all. Forward-looking information is based on certain factors and assumptions the Company believes to be reasonable at the time such statements are made and is subject to known and unknown risks, uncertainties, and other factors that may cause the actual results, level of activity, performance, or achievements of the Company to be materially different from those expressed or implied by such forward-looking information.</p><p>The purpose of forward-looking information is to provide the reader with a description of management's expectations, and such forward-looking information may not be appropriate for any other purpose. There can be no assurance that such forward-looking information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such information. Accordingly, readers should not place undue reliance on forward-looking information. Forward-looking statements are made based on management's beliefs, estimates, and opinions on the date that statements are made, and the Company undertakes no obligation to update forward-looking statements if these beliefs, estimates, and opinions or other circumstances should change, except as required by law. Investors are cautioned against attributing undue certainty to forward-looking statements.</p><p><b>Disclaimer:</b></p><p>SOL Strategies is an independent organization in the Solana ecosystem. SOL Strategies is not affiliated with, owned by, or under common control with Solana Foundation (the \"Foundation\"), and the Foundation has not entered into any association, partnership, joint venture, employee, or agency relationship with SOL Strategies.</p><p>None of the Foundation or its council members, officers, agents or make any representations or warranties, recommendations, endorsements or promises with respect to the accuracy of any statements made, information provided, or action taken by SOL Strategies and expressly disclaim any and all liability arising from or related to any such statements, information or action.</p><p id=\"corporateNewsLogoContainer\"><img alt=\"Corporate Logo\" id=\"corporateNewsLogo\" loading=\"lazy\" src=\"https://images.newsfilecorp.com/files/5283/285748_a8e5a449447d7ab1_logo.jpg\"/></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/YE3jxsMbBn\" rel=\"nofollow noopener\">https://www.newsfilecorp.com/release/285748</a></p><p><img alt=\"\" loading=\"lazy\" src=\"https://api.newsfilecorp.com/newsinfo/285748/375\"/></p></article>",
            "link": "https://www.stocktitan.net/news/STKE/sol-strategies-announces-proposed-board-y470ciphjw51.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:46:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gold Port Advances Access Strategy at Groete Gold Copper Project | GPOTF Stock News",
            "description": "<article class=\"article\"><p><strong id=\"dateline\">VANCOUVER, BRITISH COLUMBIA / <a href=\"https://www.accessnewswire.com/\" rel=\"nofollow noopener\">ACCESS Newswire</a> / February 27, 2026 / </strong><strong>Gold Port Corporation </strong>(CSE:GPO)(OTCQB:GPOTF) (\"Gold Port\" or the \"Company\") is pleased to provide a corporate update.</p><p>The Company had previously identified and announced a contractor and had previously announced the construction of the road access to the Groete Gold Copper project located in Guyana S.A. The program requires the completion of approximately 13 kilometers of dirt road access including some bridge and drainage construction. After several attempts and additional issues with the project, the Company has decided to pivot and purchase heavy equipment and complete the road development with existing staff. The effort will require an excavator and other heavy equipment which will also be key equipment during the drill program on site. The equipment acquisition is being completed, and road work is expected to begin in the immediate future.</p><p>Upon road completion, the camp will be re-structured using Company owned modular system currently in storage in Guyana. With the camp completed, a Company owned MP Explorer track mounted core rig will be moved to site to initiate a drill program.</p><p><strong>Company President and C.E.O. Adrian F. C. Hobkirk is quoted:</strong></p><p>\"After consideration of existing proposals and ongoing issues with the previously announced construction, management determined the most cost and time-effective approach is to conclude an equipment purchase and have the Company complete the access road. The new heavy support equipment will be vital to the successful completion of the upcoming drill program.\"</p><p><strong>About Gold Port Corporation</strong></p><p>Gold Port Resources Corporation (GPO) is focused on the further exploration and development of the <percent>100%</percent> owned Groete Gold Copper Project (the \"Project\"), located in Guyana, South America. The current focus of the Company is to enhance the NI 43-101 inferred gold copper resource defined at the Project to a higher resource classification, and to potentially expand the total mineral inventory. The Project was last explored in 2012, which included a drill program that allowed the calculation of an Inferred Mineral Resource of 1.57 million gold equivalent ounces (gold plus copper) within 74 million tonnes, at a grade of 0.66 grams per tonne gold copper equivalent. A cut-off grade of 0.25 gold equivalent grams per tonne, a gold price of US<money>$1,275</money> per ounce and copper price of US<money>$3.00</money> per pound was used in the calculation of the Inferred Mineral Resource. Details of the Mineral Resource are contained in a National Instrument 43-101 report titled, <a href=\"https://pr.report/j54r\" rel=\"nofollow noopener\"><i>Technical Report and Updated Mineral Resource Estimate on the Groete Gold Copper Deposit, Groete Property, Guyana, South America</i></a> by P&amp;E Mining Consultants Inc., dated April 16, 2019, available on SEDAR and the Company website at <a href=\"https://pr.report/j54s\" rel=\"nofollow noopener\">www.goldportcorporation.com</a>.</p><p><strong>On behalf of the Board of Directors </strong><br/><br/><strong>Adrian F. C. Hobkirk</strong><br/>President, CEO and Director</p><p>T: 954-684-8040<br/>E: <a href=\"mailto:info@goldportcorporation.com\" rel=\"nofollow noopener\">info@goldportcorporation.com</a><br/>W: <a href=\"https://pr.report/j54t\" rel=\"nofollow noopener\">www.goldportcorporation.com</a></p><p><i>No stock exchange or securities regulatory authority has reviewed or accepted responsibility for the adequacy or accuracy of this release.</i></p><p>This news release contains certain \"forward-looking statements\" within the meaning of Section 21E of the United States Securities and Exchange Act of 1934, as amended. Except for statements of historical fact relating to the Company, certain information contained herein constitutes forward-looking statements. Forward-looking statements are based upon opinions and estimates of management on the date the statements are made and are subject to a variety of risks and uncertainties and other factors which could cause actual results to differ materially from those projected in the forward-looking statements. The reader is cautioned not to place undue reliance on forward- looking statements. We seek safe harbor.</p><p>The securities issued pursuant to the Offering have not, nor will they be registered under the United States Securities Act of 1933, as amended, and may not be offered or sold within the United States or to, or for the account or benefit of, U.S. persons in the absence of U.S. registration or an applicable exemption from the U.S. registration requirements. This news release shall not constitute an offer to sell or the solicitation of an offer to buy nor shall there be any sale of the securities in the United States or in any other jurisdiction in which such offer, solicitation or sale would be unlawful.</p><p><strong>SOURCE:</strong> Gold Port Corporation</p><br/><br/>View the original <a href=\"https://www.accessnewswire.com/newsroom/en/metals-and-mining/gold-port-advances-access-strategy-at-groete-gold-copper-project-1142132\" rel=\"nofollow noopener\">press release</a> on ACCESS Newswire<br/><br/><img height=\"0\" loading=\"lazy\" src=\"https://app.accessnewswire.com/img.ashx?id=1142132\" width=\"0\"/></article>",
            "link": "https://www.stocktitan.net/news/GPOTF/gold-port-advances-access-strategy-at-groete-gold-copper-zpuvqviiqgl1.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:42:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "JOHN HANCOCK TAX-ADVANTAGED DIVIDEND INCOME FUND NOTICE TO SHAREHOLDERS - SOURCES OF DISTRIBUTION UNDER SECTION 19(a) | HTD Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.ma.boston\">BOSTON</location></span>, <span class=\"legendSpanClass\">Feb. 27, 2026</span> /PRNewswire/ - John Hancock Tax-Advantaged Dividend Income Fund (NYSE: <a class=\"symbol-link\" href=\"/overview/HTD/\" title=\"View HTD stock overview\">HTD</a>) (the \"Fund\"), a closed-end fund managed by John Hancock Investment Management LLC and subadvised by Manulife Investment Management (US) LLC, announced today sources of its monthly distribution of <money><money>$0.15</money>80</money> per share paid to all shareholders of record as of February 12, 2026, pursuant to the Fund's managed distribution plan. This press release is issued as required by an exemptive order granted to the Fund by the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> Securities and Exchange Commission.   </p><p><b>Notification of Sources of Distribution</b></p><p>This notice provides shareholders of the John Hancock Tax-Advantaged Dividend Income Fund (NYSE: <a class=\"symbol-link\" href=\"/overview/HTD/\" title=\"View HTD stock overview\">HTD</a>) with important information concerning the distribution declared on February 2, 2026, and payable on February 27, 2026. No action is required on your part.</p><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Distribution Period:</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">February 2026</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Distribution Amount Per Common Share:</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.15</money>80</money></span></p></td></tr></table></div><p>The following table sets forth the estimated sources of the current distribution, payable February 27, 2026, and the cumulative distributions paid this fiscal year to date from the following sources: net investment income; net realized short term capital gains; net realized long term capital gains; and return of capital or other capital source. All amounts are expressed on a per common share basis and as a percentage of the distribution amount.</p><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen5\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><u>For the period 02/01/2026-02/28/2026</u></span></p><p class=\"prnml4\"><span class=\"prnews_span\"> </span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen5\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"> </span></p><p class=\"prnml4\"><span class=\"prnews_span\"><u>For the fiscal year-to-date period <br/>11/01/2025-02/28/2026 </u><sup>1</sup></span></p><p class=\"prnml4\"><span class=\"prnews_span\"> </span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Source</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Current <br/>Distribution ($)</span></p></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">% Breakdown <br/>of the Current <br/>Distribution</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Total Cumulative <br/>Distributions ($)</span></p></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">% Breakdown <br/>of the Total <br/>Cumulative <br/>Distributions </span></p></td></tr><tr><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Net Investment Income</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.1147</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">73 %</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.4495</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">71 %</span></p></td></tr><tr><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Net Realized Short- Term Capital Gains</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.0035</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">2 %</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.0121</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">2 %</span></p></td></tr><tr><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Net Realized Long- Term Capital Gains</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.0398</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">25 %</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.1704</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">27 %</span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Return of Capital or Other Capital Source</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.0000</span></p></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0 %</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.0000</span></p></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0 %</span></p></td></tr><tr><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"> </span></p><p class=\"prnml4\"><span class=\"prnews_span\">Total per common share </span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.1580</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">100 %</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.6320</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">100 %</span></p></td></tr><tr><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen14\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen14\" colspan=\"1\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen2\" colspan=\"6\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"> </span></p><p class=\"prnml4\"><span class=\"prnews_span\">____________________<br/><sup>1</sup> The Fund's current fiscal year began on November 1, 2025 and will end on October 31, 2026.</span></p><p class=\"prnml4\"><span class=\"prnews_span\"> </span></p><p class=\"prnml4\"><span class=\"prnews_span\">Average annual total return (in relation to NAV) for the 5 years ended on January 31, 2026</span></p></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">11.28 %</span></p></td></tr><tr><td class=\"prngen11\" colspan=\"6\" rowspan=\"1\"><br/></td><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen2\" colspan=\"6\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Annualized current distribution rate expressed as a percentage of NAV as of January 31, 2026</span></p></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">7.21 %</span></p></td></tr><tr><td class=\"prngen11\" colspan=\"6\" rowspan=\"1\"><br/></td><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen2\" colspan=\"6\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Cumulative total return (in relation to NAV) for the fiscal year through January 31, 2026</span></p></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">3.29 %</span></p></td></tr><tr><td class=\"prngen11\" colspan=\"6\" rowspan=\"1\"><br/></td><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen2\" colspan=\"6\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Cumulative fiscal year-to-date distribution rate expressed as a percentage of NAV as of January 31, 2026</span></p></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">2.40 %</span></p></td></tr></table></div><p>You should not draw any conclusions about the Fund's investment performance from the amount of this distribution or from the terms of the Fund's managed distribution plan.</p><p>The Fund estimates that it has distributed more than its income and net realized capital gains; therefore, a portion of your distribution may be a return of capital.  A return of capital may occur, for example, when some or all of the money that you invested in the Fund is paid back to you.  A return of capital distribution does not necessarily reflect the Fund's investment performance and should not be confused with \"yield\" or \"income.\"</p><p>The amounts and sources of distributions reported in this Notice are only estimates and are not being provided for tax reporting purposes. The actual amounts and sources of the amounts for tax reporting purposes will depend upon the Fund's investment experience during the remainder of its fiscal year and may be subject to changes based on tax regulations.  The Fund will send you a Form 1099-DIV for the calendar year that will tell you how to report these distributions for federal income tax purposes.</p><p>The Fund has declared the February 2026 distribution pursuant to the Fund's managed distribution plan (the \"Plan\").  Under the Plan, the Fund makes fixed monthly distributions in the amount of <money><money>$0.15</money>80</money> per share, which will continue to be paid monthly until further notice.</p><p>If you have questions or need additional information, please contact your financial professional or call the Manulife John Hancock Closed-End Fund Information Line at 1-800-843-0090, Monday through Friday between 8:00 a.m. and 7:00 p.m., Eastern Time.</p><p><i>Statements in this press release that are not historical facts are forward-looking statements as defined by <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location> securities laws. You should exercise caution in interpreting and relying on forward-looking statements because they are subject to uncertainties and other factors which are, in some cases, beyond the Fund's control and could cause actual results to differ materially from those set forth in the forward-looking statements.</i></p><p><i>An investor should consider a Fund's investment objectives, risks, charges and expenses carefully before investing.</i></p><p><b>About Manulife John Hancock Investments <br/></b>We serve investors through a unique multimanager approach, complementing our extensive in-house capabilities with an unrivaled network of specialized asset managers, backed by some of the most rigorous investment oversight in the industry. The result is a diverse lineup of time-tested investments from a premier asset manager with a heritage of financial stewardship.</p><p><b>About Manulife Wealth &amp; Asset Management <br/></b>As part of Manulife Financial Corporation, Manulife Wealth &amp; Asset Management provides global investment, financial advice, and retirement plan services to 19 million individuals, institutions, and retirement plan members worldwide. Our mission is to make decisions easier and lives better by empowering people today to invest for a better tomorrow. As a committed partner to our clients and as a responsible steward of investor capital, we offer a heritage of risk management, deep expertise across public and private markets, and comprehensive retirement plan services. We seek to provide better investment and impact outcomes and to help people confidently save and invest for a more secure financial future. Not all offerings are available in all jurisdictions. For additional information, please visit manulifeim.com.</p><p>Media Contact:<br/>Gordon Haight <br/>(617) 572-0034</p><p>Investor Contact:<br/>(800) 843-0090</p><p>SOURCE John Hancock Investment Management</p></div></article>",
            "link": "https://www.stocktitan.net/news/HTD/john-hancock-tax-advantaged-dividend-income-fund-notice-to-gjui4ivou204.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:44:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "JOHN HANCOCK PREMIUM DIVIDEND FUND NOTICE TO SHAREHOLDERS - SOURCES OF DISTRIBUTION UNDER SECTION 19(a) | PDT Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.ma.boston\">BOSTON</location></span>, <span class=\"legendSpanClass\">Feb. 27, 2026</span> /PRNewswire/ - John Hancock Premium Dividend Fund (NYSE: <a class=\"symbol-link\" href=\"/overview/PDT/\" title=\"View PDT stock overview\">PDT</a>) (the \"Fund\"), a closed-end fund managed by John Hancock Investment Management LLC and subadvised by Manulife Investment Management (US) LLC, announced today sources of its monthly distribution of <money><money>$0.08</money>25</money> per share paid to all shareholders of record as of February 12, 2026, pursuant to the Fund's managed distribution plan. This press release is issued as required by an exemptive order granted to the Fund by the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> Securities and Exchange Commission.</p><p><b>Notification of Sources of Distribution</b></p><p>This notice provides shareholders of the John Hancock Premium Dividend Fund (NYSE: <a class=\"symbol-link\" href=\"/overview/PDT/\" title=\"View PDT stock overview\">PDT</a>) with important information concerning the distribution declared on February 2, 2026, and payable on February 27, 2026. No action is required on your part.</p><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Distribution Period:                                                      </span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">February 2026</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Distribution Amount Per Common Share:      </span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.08</money>25</money></span></p></td></tr></table></div><p>The following table sets forth the estimated sources of the current distribution, payable February 27, 2026, and the cumulative distributions paid this fiscal year to date from the following sources: net investment income; net realized short term capital gains; net realized long term capital gains; and return of capital or other capital source. All amounts are expressed on a per common share basis and as a percentage of the distribution amount.</p><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen5\" colspan=\"3\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><u>For the period 02/01/2026-02/28/2026</u></span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen5\" colspan=\"3\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><u>For the fiscal year-to-date period <br/>11/01/2025-02/28/2026 </u><sup>1</sup></span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Source</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen8\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Current <br/>Distribution ($)</span></p></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen10\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">% Breakdown<br/>of the Current<br/>Distribution</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen8\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Total Cumulative<br/>Distributions ($)</span></p></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen10\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">% Breakdown<br/>of the Total<br/>Cumulative<br/>Distributions </span></p></td></tr><tr><td class=\"prngen11\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Net Investment Income</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.0609</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen14\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">74 %</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.2405</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen14\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">73 %</span></p></td></tr><tr><td class=\"prngen11\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Net Realized Short- Term Capital Gains</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.0007</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen14\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1 %</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.0164</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen14\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">5 %</span></p></td></tr><tr><td class=\"prngen11\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Net Realized Long- Term Capital Gains</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.0209</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen14\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">25 %</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.0731</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen14\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">22 %</span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Return of Capital or Other Capital Source</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen15\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.0000</span></p></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen10\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0 %</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen15\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.0000</span></p></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen10\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0 %</span></p></td></tr><tr><td class=\"prngen11\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Total per common share </span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.0825</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen14\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">100 %</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.3300</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen14\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">100 %</span></p></td></tr><tr><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen15\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen16\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen15\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen16\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen11\" colspan=\"7\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">_______________________________</span></p><p class=\"prnml4\"><span class=\"prnews_span\"><sup>1</sup> The Fund's current fiscal year began on November 1, 2025 and will end on October 31, 2026.</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen3\" colspan=\"7\" rowspan=\"1\"><br/></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen15\" colspan=\"1\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen11\" colspan=\"7\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Average annual total return (in relation to NAV) for the 5 years ended on January 31, 2026</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen8\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">9.97 %</span></p></td></tr><tr><td class=\"prngen12\" colspan=\"7\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen11\" colspan=\"7\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Annualized current distribution rate expressed as a percentage of NAV as of January 31, 2026</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen8\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">6.88 %</span></p></td></tr><tr><td class=\"prngen12\" colspan=\"7\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen11\" colspan=\"7\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Cumulative total return (in relation to NAV) for the fiscal year through January 31, 2026</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen8\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">4.77 %</span></p></td></tr><tr><td class=\"prngen12\" colspan=\"7\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen11\" colspan=\"7\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Cumulative fiscal year-to-date distribution rate expressed as a percentage of NAV as of January 31, 2026</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen8\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">2.29 %</span></p></td></tr></table></div><p>You should not draw any conclusions about the Fund's investment performance from the amount of this distribution or from the terms of the Fund's managed distribution plan.</p><p>The Fund estimates that it has distributed more than its income and net realized capital gains; therefore, a portion of your distribution may be a return of capital. A return of capital may occur, for example, when some or all of the money that you invested in the Fund is paid back to you. A return of capital distribution does not necessarily reflect the Fund's investment performance and should not be confused with \"yield\" or \"income.\"</p><p>The amounts and sources of distributions reported in this Notice are only estimates and are not being provided for tax reporting purposes. The actual amounts and sources of the amounts for tax reporting purposes will depend upon the Fund's investment experience during the remainder of its fiscal year and may be subject to changes based on tax regulations. The Fund will send you a Form 1099-DIV for the calendar year that will tell you how to report these distributions for federal income tax purposes.</p><p>The Fund has declared the February 2026 distribution pursuant to the Fund's managed distribution plan (the \"Plan\"). Under the Plan, the Fund makes fixed monthly distributions in the amount of <money><money>$0.08</money>25</money> per share, which will continue to be paid monthly until further notice.</p><p>If you have questions or need additional information, please contact your financial professional or call the Manulife John Hancock Closed-End Fund Information Line at 1-800-843-0090, Monday through Friday between 8:00 a.m. and 7:00 p.m., Eastern Time.</p><p><i>Statements in this press release that are not historical facts are forward-looking statements as defined by <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location> securities laws. You should exercise caution in interpreting and relying on forward-looking statements because they are subject to uncertainties and other factors which are, in some cases, beyond the Fund's control and could cause actual results to differ materially from those set forth in the forward-looking statements.</i></p><p><i>An investor should consider a Fund's investment objectives, risks, charges and expenses carefully before investing.</i></p><p><b>About Manulife John Hancock Investments </b></p><p>We serve investors through a unique multimanager approach, complementing our extensive in-house capabilities with an unrivaled network of specialized asset managers, backed by some of the most rigorous investment oversight in the industry. The result is a diverse lineup of time-tested investments from a premier asset manager with a heritage of financial stewardship.</p><p><b>About Manulife Wealth &amp; Asset Management </b></p><p>As part of Manulife Financial Corporation, Manulife Wealth &amp; Asset Management provides global investment, financial advice, and retirement plan services to 19 million individuals, institutions, and retirement plan members worldwide. Our mission is to make decisions easier and lives better by empowering people today to invest for a better tomorrow. As a committed partner to our clients and as a responsible steward of investor capital, we offer a heritage of risk management, deep expertise across public and private markets, and comprehensive retirement plan services. We seek to provide better investment and impact outcomes and to help people confidently save and invest for a more secure financial future. Not all offerings are available in all jurisdictions. For additional information, please visit manulife.com.</p><p>Media Contact: <br/>Gordon Haight<br/>(617) 572-0034</p><p>Investor Contact:<br/>(800) 843-0090</p><p>SOURCE John Hancock Investment Management</p></div></article>",
            "link": "https://www.stocktitan.net/news/PDT/john-hancock-premium-dividend-fund-notice-to-shareholders-sources-of-guu8kmo35sex.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:44:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NEUBERGER REAL ESTATE SECURITIES INCOME FUND ANNOUNCES MONTHLY DISTRIBUTION | NRO Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.ny.nyc\">NEW YORK</location></span>, <span class=\"legendSpanClass\">Feb. 27, 2026</span> /PRNewswire/ -- Neuberger Real Estate Securities Income Fund Inc. (<b>NYSE American: NRO</b>) (the \"Fund\") has announced a distribution declaration of <money><money>$0.03</money>12</money> per share of common stock. The distribution announced today is payable on March 31, 2026, has a record date of March 16, 2026, and has an ex-date of March 16, 2026.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\"><p><a href=\"https://mma.prnewswire.com/media/75472/neuberger_berman_group_llc_logo.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"Neuberger Berman Logo (PRNewsFoto/Neuberger Berman Group LLC)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/75472/neuberger_berman_group_llc_logo.jpg\" title=\"Neuberger Berman Logo (PRNewsFoto/Neuberger Berman Group LLC)\"/></a></p></div><p>Under its level distribution policy, the Fund anticipates that it will make regular monthly distributions, subject to market conditions, of <money><money>$0.03</money>12</money> per share of common stock, unless further action is taken to determine another amount. There is no assurance that the Fund will always be able to pay a distribution of any particular amount or that a distribution will consist of only net investment income. The Fund's ability to maintain its current distribution rate will depend on a number of factors, including the amount and stability of income received from its investments, availability of capital gains, the amount of leverage employed by the Fund, the cost of leverage and the level of other Fund fees and expenses.</p><p>The distribution announced today, as well as future distributions, may consist of net investment income, net realized capital gains and return of capital. In compliance with Section 19 of the Investment Company Act of 1940, as amended, a notice would be provided for any distribution that does not consist solely of net investment income. The notice would be for informational purposes and not for tax reporting purposes, and would disclose, among other things, estimated portions of the distribution, if any, consisting of net investment income, capital gains and return of capital. The final determination of the source and tax characteristics of all distributions paid in 2026 will be made after the end of the year.</p><p><b>About Neuberger </b></p><p>Neuberger is an employee-owned, private, independent investment manager founded in 1939 with approximately 3,000 employees across 27 countries. The firm manages <money><money>$563 billion</money></money> of equities, fixed income, private equity, real estate and hedge fund portfolios for global institutions, advisors and individuals. Neuberger's investment philosophy is founded on active management, fundamental research and engaged ownership. The firm is proud to be recognized for its commitment to its two constituents, clients and employees. Again in 2025, we were named Best Asset Manager for Institutional Investors in the US (Crisil Coalition Greenwich) and the #1 Best Place to Work in Money Management (Pensions &amp; Investments, firms with more than 1,000 employees). Neuberger has no corporate parent or unaffiliated external shareholders. Visit <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629291-4&amp;h=3294740042&amp;u=http%3A%2F%2Fwww.nb.com%2F&amp;a=www.nb.com\" rel=\"nofollow noopener\" target=\"_blank\">www.nb.com</a> for more information, including <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629291-4&amp;h=705745777&amp;u=http%3A%2F%2Fwww.nb.com%2Fdisclosure-global-communications&amp;a=www.nb.com%2Fdisclosure-global-communications\" rel=\"nofollow noopener\" target=\"_blank\">www.nb.com/disclosure-global-communications</a> for information on awards. Data as of December 31, 2025.</p><p>Statements made in this release that look forward in time involve risks and uncertainties. Such risks and uncertainties include, without limitation, the adverse effect from a decline in the securities markets or a decline in the Fund's performance, a general downturn in the economy, competition from other closed end investment companies, changes in government policy or regulation, inability of the Fund's investment adviser to attract or retain key employees, inability of the Fund to implement its investment strategy, inability of the Fund to manage rapid expansion and unforeseen costs and other effects related to legal proceedings or investigations of governmental and self-regulatory organizations.</p><p><b>Contact: <br/></b>Neuberger Berman Investment Advisers LLC <br/>Investor Information<br/>(877) 461-1899</p><p>SOURCE Neuberger Berman</p></div></article>",
            "link": "https://www.stocktitan.net/news/NRO/neuberger-real-estate-securities-income-fund-announces-monthly-3ympp0sln048.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:30:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Quaker Houghton Announces Quarterly Dividend | KWR Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.pa.conken\">CONSHOHOCKEN, Pa.</location></span>, <span class=\"legendSpanClass\">Feb. 27, 2026</span> /PRNewswire/ -- The Board of Directors of Quaker Houghton (NYSE: <a class=\"symbol-link\" href=\"/overview/KWR/\" title=\"View KWR stock overview\">KWR</a>) today declared a quarterly cash dividend of <money><money>$0.50</money>8</money> per share, payable on April 30, 2026, to shareholders of record at the close of business on April 16, 2026.</p><p><b>About Quaker Houghton<br/></b>Quaker Houghton is the global leader in industrial process fluids. With a presence around the world, including operations in over 25 countries, our customers include thousands of the world's most advanced and specialized steel, aluminum, automotive, aerospace, offshore, container, mining, and metalworking companies. Our high-performing, innovative and sustainable solutions are backed by best-in-class technology, deep process knowledge and customized services. With approximately 4,700 employees, including chemists, engineers and industry experts, we partner with our customers to improve their operations so they can run even more efficiently, even more effectively, whatever comes next. Quaker Houghton is headquartered in <location idsrc=\"xmltag.org\" value=\"LU/us.pa.conken\">Conshohocken, Pennsylvania</location>, located near <location idsrc=\"xmltag.org\" value=\"LU/us.pa.phldph\">Philadelphia</location> in <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location>. Visit quakerhoughton.com to learn more.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder7266\"><p><a href=\"https://mma.prnewswire.com/media/967587/Quaker_Houghton_tagline_Logo.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"Quaker Houghton (PRNewsfoto/Quaker Houghton)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/967587/Quaker_Houghton_tagline_Logo.jpg\" title=\"Quaker Houghton (PRNewsfoto/Quaker Houghton)\"/></a></p></div><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder0\"></div><p>SOURCE Quaker Houghton</p></div></article>",
            "link": "https://www.stocktitan.net/news/KWR/quaker-houghton-announces-quarterly-fybp9v10o8uz.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:30:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Burcon Closes Second Tranche of Non-Brokered Private Placement of Convertible Debentures of up to $6.9 Million | BRCNF Stock News",
            "description": "<article class=\"article\"><p>Vancouver, British Columbia--(Newsfile Corp. - February 27, 2026) - Burcon NutraScience Corporation (TSX: BU) (OTCQB: <a class=\"symbol-link\" href=\"/overview/BRCNF/\" title=\"View BRCNF stock overview\">BRCNF</a>) (\"<b>Burcon</b>\" or the \"<b>Company</b>\"), a global technology leader in plant-based protein innovation, is pleased to announce the closing of the second tranche of its previously announced non-brokered private placement (see news releases of the Company dated January 2, 2026 and January 9, 2026) of convertible debentures (the <b>\"Convertible Debentures\"</b>) for an aggregate principal amount of <money>$6.9 million</money> (the <b>\"Private Placement\"</b>). </p><p>Under the second tranche, Burcon issued Convertible Debentures in the aggregate principal amount of <money>$2.75 million</money>. To date, insiders of the Company have subscribed for Convertible Debentures totaling <money>$2.7 million</money> in principal amount under the first and second tranches and Burcon has closed an aggregate of <money>$4 million</money> principal amount under the Private Placement. The Company expects to close the final tranche of the Private Placement prior to April 24, 2026.</p><p>\"The successful closing of the cash portion of our financing marks an important milestone for Burcon,\" said Kip Underwood, Burcon's Chief Executive Officer. \"With the full targeted cash proceeds now secured, we have strengthened our balance sheet and enhanced our ability to scale production and accelerate commercial execution. The remaining loan conversion component is a non-cash transaction and will further align stakeholders as we continue building long-term value.\"</p><p><b>Convertible Debentures Details</b></p><table border=\"0\" cellpadding=\"3\" cellspacing=\"0\" style=\"width: 100%; border-collapse: collapse; border-width: 1px; border-style: solid; border-\"><tbody><tr><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\"><b>Tranche</b></td><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\"><b>Principal Amount</b></td><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\"><b>Closing Date</b></td><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\"><b>Component</b></td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\">First Tranche</td><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\"><money>$1.25 million</money></td><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\">December 31, 2025</td><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\">Cash</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\">Second Tranche</td><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\"><money>$2.75 million</money></td><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\">February 27, 2026</td><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\">Cash</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\">Final Tranche</td><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\"><money>$2.90 million</money></td><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\">Prior to April 24, 2026</td><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\">Non-cash loan conversion</td></tr></tbody></table><p> </p><p>The Convertible Debentures terms and use the net proceeds from the Private Placement are set out in the Company's news release dated January 2, 2026. The Company did not pay any finder's fee in connection with the Private Placement. The Company has received an aggregate of <money>$4 million</money> in cash from the closing of the first and second tranches of the Private Placement. As disclosed in the Company's management proxy circular dated January 12, 2026, the Company expects that <money>$2.3 million</money> of the Private Placement will be paid by way of an offset from a loan due to an insider of the Company. A further <money>$600,000</money> of the Private Placement is expected to be paid by way of an offset from a loan due to an insider of the Company. </p><p>The issuance of Convertible Debentures to insiders under the Private Placement will be considered a related party transaction under Multilateral Instrument 61-101. The Company intends to rely on exemptions from the formal valuation and minority shareholder approval requirements provided under sections 5.5(a) and 5.7(1)(a) of Multilateral Instrument 61-101 on the basis that the participation in the Private Placement by insiders does not exceed <percent>25%</percent> of the Company's market capitalization.</p><p>The securities being offered under the Private Placement have not been and will not be registered under the United States Securities Act of 1933, as amended,  or any state securities laws and may not be offered or sold in the United States or to, or for the account or benefit of, U.S. persons absent registration or an applicable exemption from the registration requirements. This press release does not constitute an offer to sell or the solicitation of an offer to buy nor will there be any sale of the securities in any State in which such offer, solicitation or sale would be unlawful.</p><p><b>About Burcon NutraScience Corporation</b></p><p>Burcon is a global technology leader in high-performance plant-based proteins for the food and beverage industry. Our commercial ingredients offer superior taste, texture, and functionality—ideal for formulators seeking next-generation protein solutions. Backed by over two decades of innovation, Burcon holds an extensive patent portfolio covering novel proteins derived from pea, canola, soy, hemp, sunflower, and other plant sources. As a key player in the rapidly growing plant-based market, Burcon is committed to sustainability and to creating best-in-class protein solutions that are better for people and the planet. Learn more at <a href=\"https://api.newsfilecorp.com/redirect/y4vbQcbZYx\" rel=\"nofollow noopener\">www.burcon.ca</a>.</p><p><b>Forward-Looking Information Cautionary Statement</b></p><p>The TSX has not reviewed and does not accept responsibility for the adequacy of the content of the information contained herein. This press release contains forward-looking statements or forward-looking information within the meaning of the U.S. Private Securities Litigation Reform Act of 1995 and applicable Canadian securities legislation. Forward-looking statements or forward-looking information involve risks, uncertainties and other factors that could cause actual results, performances, prospects and opportunities to differ materially from those expressed or implied by such forward-looking statements. Forward-looking statements or forward-looking information can be identified by words such as \"anticipate,\" \"aim\", \"intend,\" \"plan,\" \"goal,\" \"project,\" \"estimate,\" \"expect,\" \"believe,\" \"future,\" \"likely,\" \"may,\" \"should,\" \"could,\" \"will\" and similar references to future periods. All statements included in this release, other than statements of historical fact, are forward-looking statements. There can be no assurance that such statements will prove to be accurate, and actual results and future events could differ materially from those anticipated in such statements or information. Important factors that could cause actual results to differ materially from Burcon's plans and expectations include the implementation of our business model and growth strategies; trends and competition in our industry our future business development, financial condition and results of operations and our ability to obtain financing cost-effectively; potential changes of government regulations, and other risks and factors detailed herein and from time to time in the filings made by Burcon with securities regulators and stock exchanges, including in the section entitled \"Risk Factors\" in Burcon's annual information form for the year ended March 31, 2025 and its other public filings with Canadian securities regulators on SEDAR+ at <a href=\"https://api.newsfilecorp.com/redirect/1KQaouRb3K\" rel=\"nofollow noopener\">www.sedarplus.ca</a>. This list is not exhaustive of the factors that may affect any of the Company's forward-looking statements or information.  Any forward-looking statement or information speaks only as of the date on which it was made, and, except as may be required by applicable securities laws, Burcon disclaims any intent or obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise. Although Burcon believes the assumptions inherent in the forward-looking statements are reasonable, forward-looking statements are not guarantees of future performance, and, accordingly, investors should not rely on such statements.</p><div id=\"contactInfo\"><p><b>Industry and Investor Contact<br/></b>Paul Lam<br/>Director, Investor Relations and Communications<br/>Burcon NutraScience Corporation<br/>490 - 999 West Broadway, Vancouver, BC, V5Z 1K5<br/>Tel (604) 733-0896, Toll-free (888) 408-7960<br/><a href=\"mailto:plam@burcon.ca\" rel=\"nofollow noopener\">plam@burcon.ca</a> <a href=\"https://api.newsfilecorp.com/redirect/A8qvespveJ\" rel=\"nofollow noopener\">www.burcon.ca</a> </p><p><b>Media Contact:<br/></b>Steve Campbell, APR<br/>President<br/>Campbell &amp; Company Public Relations<br/>Tel (604) 888-5267<br/><a href=\"mailto:TECH@CCOM-PR.COM\" rel=\"nofollow noopener\">TECH@CCOM-PR.COM</a></p></div><p id=\"corporateNewsLogoContainer\"><img alt=\"Corporate Logo\" id=\"corporateNewsLogo\" loading=\"lazy\" src=\"https://images.newsfilecorp.com/files/1725/285731_46c255e354a2bad2_logo.jpg\"/></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/ZEjWPTMz81\" rel=\"nofollow noopener\">https://www.newsfilecorp.com/release/285731</a></p><p><img alt=\"\" loading=\"lazy\" src=\"https://api.newsfilecorp.com/newsinfo/285731/375\"/></p></article>",
            "link": "https://www.stocktitan.net/news/BRCNF/burcon-closes-second-tranche-of-non-brokered-private-placement-of-qqyjpu7i49ar.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:37:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FMC Corporation Announces Election of Michael F. Barry to Board of Directors | FMC Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder3291\"><p><a href=\"https://mma.prnewswire.com/media/2922351/Michael_F_Barry.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/2922351/Michael_F_Barry.jpg\" title=\"\"/></a></p></div><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.pa.phldph\">PHILADELPHIA</location></span>, <span class=\"legendSpanClass\">Feb. 27, 2026</span> /PRNewswire/ -- <a class=\"symbol-link\" href=\"/overview/FMC/\" title=\"View FMC stock overview\">FMC</a> Corporation (NYSE: <a class=\"symbol-link\" href=\"/overview/FMC/\" title=\"View FMC stock overview\">FMC</a>), a leading global agricultural sciences company, today announced the election of Michael F. Barry to the company's Board of Directors, effective February 27, 2026. He will serve on the Audit and Compensation and Human Capital committees.</p><p>Barry brings more than three decades of global leadership experience in the specialty chemicals industry to <a class=\"symbol-link\" href=\"/overview/FMC/\" title=\"View FMC stock overview\">FMC</a>'s Board. He currently serves as chairman of the Board of Directors of Quaker Houghton and previously served as chief executive officer and president of Quaker Houghton until his retirement in November 2021.</p><p>\"We are pleased to welcome Michael to the FMC Board of Directors,\" said Pierre Brondeau, FMC chairman, chief executive officer and president. \"Michael has led through complex industry cycles and brings proven experience navigating strategic transformations. His perspective will be invaluable as FMC embarks on its 2026 strategic priorities.\"</p><p>Barry joined Quaker in 1998 and held a series of senior leadership roles, including chief financial officer, before being appointed chief executive officer in 2008 and chairman in 2009. During his tenure as chief executive officer, the company grew revenue from <money><money>$451 million</money></money> in 2009 to <money><money>$1.8 billion</money></money> in 2021. Under his leadership, Quaker Houghton completed 27 strategic acquisitions. Most notably, Barry led the 2019 combination of Quaker Chemical and Houghton International, which doubled the company's revenue and global footprint, creating one of the world's largest industrial process fluids companies.</p><p>\"I welcome the opportunity to join FMC's Board of Directors,\" said Barry. \"FMC has a strong foundation, and I look forward to working with the board and management team to create long-term value for our shareholders, customers and employees at this pivotal juncture for the company.\"</p><p>Barry brings significant board experience, having served on the boards of Rogers Corporation and Arcadium Lithium plc (formerly Livent Corporation), where he held leadership roles on the Audit and Compensation committees.</p><p><b>About FMC</b></p><p>FMC Corporation is a global agricultural sciences company dedicated to helping growers produce food, feed, fiber and fuel for an expanding world population while adapting to a changing environment. FMC's innovative crop protection solutions – including biologicals, crop nutrition, digital and precision agriculture – enable growers and crop advisers to address their toughest challenges economically while protecting the environment. FMC is committed to discovering new herbicide, insecticide and fungicide active ingredients, product formulations and pioneering technologies that are consistently better for the planet. Visit fmc.com to learn more and follow us on <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629353-1&amp;h=2111848183&amp;u=https%3A%2F%2Fwww.linkedin.com%2Fschool%2Ffmc-corporation%2F&amp;a=LinkedIn\" rel=\"nofollow noopener\" target=\"_blank\">LinkedIn</a><sup>®</sup>.</p><p><i>Statement under the Safe Harbor Provisions of the Private Securities Litigation Reform Act of 1995: FMC and its representatives may from time to time make written or oral statements that are \"forward-looking\" and provide other than historical information, including statements contained in this press release, in FMC's other filings with the SEC, and in presentations, reports or letters to FMC stockholders. In some cases, FMC has identified these forward-looking statements by such words or phrases as \"outlook,\" \"will likely result,\" \"look forward to,\"\"is confident that,\" \"expect,\" \"expects,\" \"should,\" \"could,\" \"may,\" \"will continue to,\" \"believe,\" \"believes,\" \"anticipates,\" \"predicts,\" \"forecasts,\" \"estimates,\" \"projects,\" \"potential,\" \"intends\" or similar expressions identifying \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995, including the negative of those words or phrases. Such forward-looking statements are based on our current views and assumptions regarding future events, future business conditions and the outlook for the company based on currently available information. The forward-looking statements involve known and unknown risks, uncertainties and other factors that may cause actual results to be materially different from any results, levels of activity, performance or achievements expressed or implied by any forward-looking statement. These statements are qualified by reference to the risk factors included in Part I, Item 1A of our Annual Report on Form 10-K for the year ended December 31, 2025 (the \"2024 Form 10-K\"), the section captioned \"Forward-Looking Information\" in Part II of the 2025 Form 10- K and to similar risk factors and cautionary statements in all other reports and forms filed with the Securities and Exchange Commission (\"SEC\"). We wish to caution readers not to place undue reliance on any such forward-looking statements, which speak only as of the date made. Forward-looking statements are qualified in their entirety by the above cautionary statement. We specifically decline to undertake any obligation, and specifically disclaim any duty, to publicly update or revise any forward-looking statements that have been made to reflect events or circumstances after the date of such statements or to reflect the occurrence of anticipated or unanticipated events, except as may be required by law.</i></p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder0\"><p><a href=\"https://mma.prnewswire.com/media/331912/fmc_corporation_logo.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"FMC Corporation Logo. (PRNewsFoto/FMC Corporation)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/331912/fmc_corporation_logo.jpg\" title=\"FMC Corporation Logo. (PRNewsFoto/FMC Corporation)\"/></a></p></div><p>SOURCE FMC Corporation</p></div></article>",
            "link": "https://www.stocktitan.net/news/FMC/fmc-corporation-announces-election-of-michael-f-barry-to-board-of-dyzontd20u99.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:30:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BlackRock Utilities, Infrastructure, & Power Opportunities Trust (BUI) Announces Terms of Rights Offering | BUI Stock News",
            "description": "<article class=\"article\"><p> </p><p> <location idsrc=\"xmltag.org\" value=\"LU/us.ny.nyc\">NEW YORK</location>--(BUSINESS WIRE)--BlackRock Utilities, Infrastructure, &amp; Power Opportunities Trust (NYSE: <a class=\"symbol-link\" href=\"/overview/BUI/\" title=\"View BUI stock overview\">BUI</a>) (the \"Fund\") today announced the terms of transferable rights (\"Rights\") to be issued to the holders of the Fund's common shares of beneficial interest (par value <money><money>$0.00</money>1</money> per share) (\"Shares\") as of March 9, 2026 (the \"Record Date\"). Holders of Rights will be entitled to subscribe for additional Shares (the \"Offer\") at a discount to the market price of the Shares.</p><p>After considering a number of factors, including potential benefits and costs, the Fund’s Board of Trustees (the “Board”) and the Fund's investment adviser, BlackRock Advisors, LLC (the \"Adviser\"), have determined that it is in the best interests of both the Fund and its shareholders to conduct the Offer and increase the assets of the Fund available to take advantage of existing and future investment opportunities that are consistent with the Fund’s investment objectives to provide total return and income through a combination of current income and long-term capital appreciation.</p><p><b>All expenses of the Offer will be borne by the Adviser, and not by the Fund or any of the Fund's shareholders.</b></p><p>The Adviser believes this is an attractive time to raise additional assets for the Fund based on several factors, including the following potential benefits:</p><ul class=\"bwlistdisc\"><li><b>Infrastructure: </b>Infrastructure<b> </b>sits at the intersection of three structural mega forces - the Artificial Intelligence buildout, national security priorities, and the transition to a lower carbon economy - creating sustained investment opportunities. Additionally, listed infrastructure valuations are attractive relative to history, providing a compelling entry point for new capital.<br/><br/></li><li><b>Utilities:</b> Utilities have a pressing need to raise significant capital. Rising power demand and reshoring of power supply chains are stressing existing grids and triggering the largest utility capex cycle in decades, and the Adviser believes the Fund is well-positioned to deploy capital into these opportunities.<br/><br/></li><li><b>Reward</b>: Rights provide shareholders with an opportunity to buy new shares below market price or potentially realize value from the sale of Rights.<br/><br/></li><li><b>No offering fees</b>: The Adviser, not the Fund, is paying for the expenses of the Offer.<br/><br/></li><li><b>Lower expense ratio</b>: The Offer is anticipated to spread fixed operating costs across a larger asset base.<br/><br/></li><li><b>Enhanced liquidity</b>: The Offer creates the potential for increased trading volume and liquidity of Shares.</li></ul><p><b>The Fund expects to maintain its current distribution level following the Offer.</b> Shares issued pursuant to the Offer will be entitled to receive the monthly distribution expected to be payable in April 2026, but will <span class=\"bwuline\">not</span> be eligible for the distribution payable in March 2026.</p><p>Certain key terms of the Offer include:</p><ul class=\"bwlistdisc\"><li><b>Rights ratio:</b> Holders of Shares on the Record Date (\"Record Date Shareholders\") will receive one Right for each outstanding Share owned on the Record Date. Rights entitle the holder to purchase one new Share for every 4 Rights exercised (1-for-4); however, any Record Date Shareholder who owns fewer than four Shares as of the Record Date will be entitled to subscribe for one Share. Fractional Shares will not be issued upon the exercise of Rights.<br/><br/></li><li><b>Pricing formula:</b> The subscription price per Share (the \"Subscription Price\") will be determined on the expiration date of the Offer, which is currently expected to be April 2, 2026, unless extended by the Fund (the \"Expiration Date\"), and will be equal to <percent>95%</percent> of the average of the last reported sales price per Share on the New York Stock Exchange (the \"NYSE\") on the Expiration Date and each of the four (4) immediately preceding trading days provided that, if such price is equal to or above net asset value (“NAV”) at the Expiration Date, it shall be reduced to <money><money>$0.01</money></money> below NAV on the Expiration Date (the \"Formula Price\"). If, however, the Formula Price is less than <percent>95%</percent> of the Fund's NAV per Share at the close of trading on the NYSE on the Expiration Date, the Subscription Price will be <percent>95%</percent> of the Fund's NAV per Share at the close of trading on the NYSE on the Expiration Date. The Subscription Price will be determined by the Fund on the Expiration Date.<br/><br/></li><li><b>Over-subscription privilege:</b> Record Date Shareholders who fully exercise all Rights issued to them can subscribe, subject to certain limitations and allotment, for any additional Shares which were not subscribed for by other holders of Rights at the Subscription Price, provided that the Board may eliminate this over-subscription privilege. Investors who are not Record Date Shareholders but who otherwise acquire Rights in the secondary market are not entitled to participate in the over-subscription privilege. If sufficient Shares are available, all Record Date Shareholders' over-subscription requests will be honored in full. If these requests exceed available Shares, they will be allocated pro rata among those fully exercising Record Date Shareholders who over-subscribe based on the number of Rights originally issued to them by the Fund.<br/><br/></li><li><b>Transferable rights:</b> Rights are transferable and are expected to be admitted for trading on the NYSE under the symbol \"<a class=\"symbol-link\" href=\"/overview/BUI/\" title=\"View BUI stock overview\">BUI</a> RT\" during the course of the Offer and will cease trading April 1, 2026, one trading day before the Expiration Date. During this time, Record Date Shareholders may choose to sell their Rights if they do not intend to subscribe for additional Shares.</li></ul><p>The Offer will be made only by means of a prospectus supplement and accompanying prospectus. The Fund expects to mail subscription certificates evidencing the Rights and a copy of the prospectus supplement and accompanying prospectus for the Offer to Record Date Shareholders within <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location> shortly following the Record Date. To exercise their Rights, shareholders who hold their Shares through a broker, custodian or trust company should contact such entity to forward their instructions to either exercise or sell their Rights on their behalf. Shareholders who do not hold Shares through a broker, custodian, or trust company should forward their instructions to either exercise or sell their Rights by completing the subscription certificate and delivering it to the subscription agent for the Offer, together with their payment, at one of the locations indicated on the subscription certificate or in the prospectus supplement.</p><p><b>The information in this press release is not complete and is subject to change. This document is not an offer to sell any securities and is not soliciting an offer to buy any securities in any jurisdiction where the offer or sale is not permitted. This document is not an offering, which can only be made by a prospectus. Investors should consider the Fund's investment objective, risks, charges and expenses carefully before investing. The Fund's prospectus supplement and accompanying prospectus will contain this and additional information about the Fund and additional information about the Offer, and should be read carefully before investing. For further information regarding the Offer, or to obtain a prospectus supplement and the accompanying prospectus, when available, please contact the Fund's information agent:</b></p><p>Georgeson LLC<br/>51 West 52nd Street, 6th Floor<br/><location idsrc=\"xmltag.org\" value=\"LU/us.ny.nyc\">New York, NY</location> 10019<br/>1-866-946-8126</p><p>The Fund’s at-the-market offering of Shares will be terminated prior to the commencement of the Offer.</p><p><b>About BlackRock</b></p><p>BlackRock’s purpose is to help more and more people experience financial well-being. As a fiduciary to investors and a leading provider of financial technology, we help millions of people build savings that serve them throughout their lives by making investing easier and more affordable. For additional information on BlackRock, please visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.blackrock.com%2Fcorporate&amp;esheet=54435616&amp;newsitemid=20260227268068&amp;lan=en-US&amp;anchor=www.blackrock.com%2Fcorporate&amp;index=1&amp;md5=e1d700e7eff395fc20e3fd691d91246b\" rel=\"nofollow noopener\" shape=\"rect\">www.blackrock.com/corporate</a>.</p><p><b>Availability of Fund Updates</b></p><p>BlackRock will update performance and certain other data for the Fund on a monthly basis on its website in the “Closed-end Funds” section of <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.blackrock.com&amp;esheet=54435616&amp;newsitemid=20260227268068&amp;lan=en-US&amp;anchor=www.blackrock.com&amp;index=2&amp;md5=8bd756a9ded812e48f3aa41ea53d4d35\" rel=\"nofollow noopener\" shape=\"rect\">www.blackrock.com</a> as well as certain other material information as necessary from time to time. Investors and others are advised to check the website for updated performance information and the release of other material information about the Fund. This reference to BlackRock’s website is intended to allow investors public access to information regarding the Fund and does not, and is not intended to, incorporate BlackRock’s website in this release.</p><p><b>Forward-Looking Statements</b></p><p>This press release, and other statements that BlackRock or the Fund may make, may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act, with respect to the Fund’s or BlackRock’s future financial or business performance, strategies or expectations. Forward-looking statements are typically identified by words or phrases such as “trend,” “potential,” “opportunity,” “pipeline,” “believe,” “comfortable,” “expect,” “anticipate,” “current,” “intention,” “estimate,” “position,” “assume,” “outlook,” “continue,” “remain,” “maintain,” “sustain,” “seek,” “achieve,” and similar expressions, or future or conditional verbs such as “will,” “would,” “should,” “could,” “may” or similar expressions.</p><p>BlackRock cautions that forward-looking statements are subject to numerous assumptions, risks and uncertainties, which change over time. Forward-looking statements speak only as of the date they are made, and BlackRock assumes no duty to and does not undertake to update forward-looking statements. Actual results could differ materially from those anticipated in forward-looking statements and future results could differ materially from historical performance.</p><p>With respect to the Fund, the following factors, among others, could cause actual events to differ materially from forward-looking statements or historical performance: (1) changes and volatility in political, economic or industry conditions, the interest rate environment, foreign exchange rates or financial and capital markets, which could result in changes in demand for the Fund or in the Fund’s net asset value; (2) the relative and absolute investment performance of the Fund and its investments; (3) the impact of increased competition; (4) the unfavorable resolution of any legal proceedings; (5) the extent and timing of any distributions or share repurchases; (6) the impact, extent and timing of technological changes; (7) the impact of legislative and regulatory actions and reforms, and regulatory, supervisory or enforcement actions of government agencies relating to the Fund or BlackRock, as applicable; (8) terrorist activities, international hostilities, health epidemics and/or pandemics and natural disasters, which may adversely affect the general economy, domestic and local financial and capital markets, specific industries or BlackRock; (9) BlackRock’s ability to attract and retain highly talented professionals; (10) the impact of BlackRock electing to provide support to its products from time to time; and (11) the impact of problems at other financial institutions or the failure or negative performance of products at other financial institutions.</p><p>Annual and Semi-Annual Reports and other regulatory filings of the Fund with the Securities and Exchange Commission (“SEC”) are accessible on the SEC's website at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.sec.gov&amp;esheet=54435616&amp;newsitemid=20260227268068&amp;lan=en-US&amp;anchor=www.sec.gov&amp;index=3&amp;md5=625fcf5715617d38482741850f9ca373\" rel=\"nofollow noopener\" shape=\"rect\"><b>www.sec.gov</b></a><b> </b>and on BlackRock’s website at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.blackrock.com&amp;esheet=54435616&amp;newsitemid=20260227268068&amp;lan=en-US&amp;anchor=www.blackrock.com&amp;index=4&amp;md5=344b0a242201ac54406b78f112e6899c\" rel=\"nofollow noopener\" shape=\"rect\"><b>www.blackrock.com</b></a>, and may discuss these or other factors that affect the Fund. The information contained on BlackRock’s website is not a part of this press release.</p><p><img alt=\"\" loading=\"lazy\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260227268068r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\"/><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20260227268068/en/\" rel=\"nofollow noopener\">https://www.businesswire.com/news/home/20260227268068/en/</a></span></p><p><b>1-800-882-0052</b></p><p>Source: BlackRock Closed-End Funds</p></article>",
            "link": "https://www.stocktitan.net/news/BUI/black-rock-utilities-infrastructure-power-opportunities-trust-bui-0opptjo8mgau.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:32:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Federated Hermes, Inc. files annual report on Form 10-K with U.S. Securities and Exchange Commission | FHI Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.pa.pittbr\">PITTSBURGH</location></span>, <span class=\"legendSpanClass\">Feb. 27, 2026</span> /PRNewswire/ -- Federated Hermes, Inc. (NYSE: <a class=\"symbol-link\" href=\"/overview/FHI/\" title=\"View FHI stock overview\">FHI</a>), a global leader in active investing, today filed its annual report on Form 10-K with the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> Securities and Exchange Commission for the fiscal year ended Dec. 31, 2025.</p><p>Federated Hermes makes available all of its annual report documents and provides access to its other SEC filings on its website, either directly or via a link to EDGAR. For more information visit the About section of <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629564-1&amp;h=1775129875&amp;u=https%3A%2F%2Fwww.federatedhermes.com%2Fus%2Fhome.do&amp;a=FederatedHermes.com%2Fus\" rel=\"nofollow noopener\" target=\"_blank\">FederatedHermes.com/us</a> and select SEC Filings.</p><p>Federated Hermes, Inc. (NYSE: <a class=\"symbol-link\" href=\"/overview/FHI/\" title=\"View FHI stock overview\">FHI</a>) is a global leader in active investment management, with <money><money>$902.6 billion</money></money> in assets under management, as of Dec. 31, 2025. We deliver investment solutions that help investors target a broad range of outcomes and provide equity, fixed-income, alternative/private markets, multi-asset and liquidity management strategies to more than 11,000 institutions and intermediaries worldwide. Our clients include corporations, government entities, insurance companies, foundations and endowments, banks and broker/dealers. Headquartered in <location idsrc=\"xmltag.org\" value=\"LU/us.pa.pittbr\">Pittsburgh</location>, Federated Hermes has more than 2,000 employees in <location idsrc=\"xmltag.org\" value=\"LU/gb.eng.london\">London</location>, <location idsrc=\"xmltag.org\" value=\"LU/us.ny.nyc\">New York</location>, <location idsrc=\"xmltag.org\" value=\"LU/us.ma.boston\">Boston</location> and offices worldwide. For more information, visit <b><a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629564-1&amp;h=1775129875&amp;u=https%3A%2F%2Fwww.federatedhermes.com%2Fus%2Fhome.do&amp;a=FederatedHermes.com%2Fus\" rel=\"nofollow noopener\" target=\"_blank\">FederatedHermes.com/us</a></b>.</p><p class=\"prntac\">###</p><p>SOURCE Federated Hermes, Inc.</p></div></article>",
            "link": "https://www.stocktitan.net/news/FHI/federated-hermes-inc-files-annual-report-on-form-10-k-with-u-s-m1tfhq8kjdi2.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:33:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Royal Caribbean Group announces completion of offering of $1.25 billion senior unsecured notes due 2033 and $1.25 billion senior unsecured notes due 2038 | RCL Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.fl.miami\">MIAMI</location></span>, <span class=\"legendSpanClass\">Feb. 27, 2026</span> /PRNewswire/ -- Royal Caribbean Cruises Ltd. (NYSE: <a class=\"symbol-link\" href=\"/overview/RCL/\" title=\"View RCL stock overview\">RCL</a>) (the \"Company\") today announced that it has completed its registered public offering of <money><money>$1.25 billion</money></money> aggregate principal amount of <percent>4.750%</percent> senior unsecured notes due 2033 (the \"2033 Notes\") and <money><money>$1.25 billion</money></money> aggregate principal amount of <percent>5.250%</percent> senior unsecured notes due 2038 (the \"2038 Notes\" and, together with the 2033 Notes, the \"Notes\"). The 2033 Notes will mature on May 15, 2033 and the 2038 Notes will mature on February 27, 2038, unless earlier redeemed or repurchased.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\"><p><a href=\"https://mma.prnewswire.com/media/2866601/Royal_Caribbean_Group_Logo.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"RCG logo blue (PRNewsfoto/Royal Caribbean Group)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/2866601/Royal_Caribbean_Group_Logo.jpg\" title=\"RCG logo blue (PRNewsfoto/Royal Caribbean Group)\"/></a></p></div><p>The Company intends to use the net proceeds from the sale of the Notes to refinance its senior notes maturing in 2026 and any remaining net proceeds to repay existing indebtedness, which may include term loans.</p><p>J.P. Morgan Securities LLC, Morgan Stanley &amp; Co. LLC and PNC Capital Markets LLC acted as lead book-running managers for the offering.</p><p>The Notes were offered and sold pursuant to an automatic shelf registration statement (including a prospectus) that was filed by the Company with the Securities and Exchange Commission on February 29, 2024, and became effective upon filing.</p><p>\"Completing these offerings at competitive long‑term rates reinforces the depth of investor confidence in our credit and strengthens our financial foundation,\" said Naftali Holtz, Chief Financial Officer of Royal Caribbean Group. \"Extending our maturities and reducing near‑term refinancing needs further enhances our flexibility as we execute our growth and margin initiatives.\"</p><p>This press release shall not constitute an offer to sell or a solicitation of an offer to buy the Notes or any other securities and shall not constitute an offer, solicitation or sale in any jurisdiction in which such offer, solicitation or sale would be unlawful.</p><p><b>Special Note Regarding Forward-Looking Statements</b></p><p>Certain statements in this press release relating to, among other things, the offering and sale of the Notes constitute forward-looking statements under the Private Securities Litigation Reform Act of 1995. These statements include, but are not limited, to: statements regarding terms of the offering of the Notes and the intended use of proceeds. Words such as \"anticipate,\" \"believe,\" \"considering,\" \"could,\" \"driving,\" \"estimate,\" \"expect,\" \"goal,\" \"intend,\" \"may,\" \"plan,\" \"project,\" \"seek,\" \"should,\" \"will,\" \"would\" and similar expressions are intended to help identify forward-looking statements. Forward-looking statements reflect management's current expectations, but they are based on judgments and are inherently uncertain. Furthermore, they are subject to risks, uncertainties and other factors that could cause the Company's actual results, performance or achievements to differ materially from the future results, performance or achievements expressed or implied in those forward-looking statements. Examples of these risks, uncertainties and other factors include, but are not limited to, the following: the impact of the economic and geopolitical environment on key aspects of the Company's business, such as the demand for cruises, passenger spending, and operating costs; changes in operating costs; the unavailability or cost of air service; incidents or adverse publicity concerning the Company's ships, port facilities, land destinations and/or passengers or the cruise vacation industry in general; the effects of weather, climate events and/or natural disasters on the Company's business; risks related to the Company's sustainability activities; the impact of issues at shipyards, including ship delivery delays or ship construction cost increases; shipyard unavailability; unavailability of ports of call; vacation industry competition and increase in industry capacity; inability to manage the Company's cost and capital allocation strategies; the uncertainties of conducting business globally and expanding into new markets and new ventures, including potential acquisitions; issues with travel advisers that sell and market the Company's cruises; reliance on third-party service providers; potential unavailability of insurance coverage; disease outbreaks and increased concern about the risk of illness on the Company's ships or when travelling to or from the Company's ships, which could cause a decrease in demand, guest cancellations, and ship redeployments; the risks and costs related to cyber security attacks, data breaches, protecting the Company's systems and maintaining data integrity and security; uncertainties of a foreign legal system as the Company is not incorporated in <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location>; the Company's ability to obtain sufficient financing or capital to fund its capital expenditures, operations, debt repayments and other financing needs; the Company's expectation and ability to pay a cash dividend on its common stock in the future; changes to the Company's dividend policy; growing anti-tourism sentiments and environmental concerns; changes in <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> or other countries' foreign travel policy; impact of new or changing legislation and regulations (including environmental regulations) or governmental orders on the Company's business; fluctuations in foreign currency exchange rates, fuel prices and interest rates; further impairments of the Company's goodwill, long-lived assets, equity investments and notes receivable; an inability to source crew or provisions and supplies from certain places; the Company's ability to recruit, develop and retain high quality personnel; and pending or threatened litigation, investigations and enforcement actions.</p><p>Forward-looking statements should not be relied upon as predictions of actual results. Undue reliance should not be placed on the forward-looking statements in this release, which are based on information available to the Company on the date hereof. The Company undertakes no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.</p><p><b>About Royal Caribbean Group</b></p><p>Royal Caribbean Group is a leading global vacation company spanning cruise, exclusive destinations, and land-based vacation experiences. The company operates 69 ships sailing to more than 1,000 destinations across all seven continents through its three wholly owned brands -Royal Caribbean, Celebrity Cruises, and Silversea - and a <percent>50%</percent> joint venture interest in TUI Cruises which operates the Mein Schiff and Hapag-Lloyd brands.</p><p>The Group is expanding its portfolio of private destinations from three to eight by 2028 through its Perfect Day and Royal Beach Club collections, and the company will enter river cruising in 2027 with Celebrity River Cruises. Powered by innovative brands, advanced technology, and an industry-leading loyalty program, the company has built a connected vacation ecosystem, turning the vacation of a lifetime into a lifetime of vacations.</p><p>Named to the Fortune World's Most Admired Companies 2026 and Forbes' 2026 Best American Companies lists, Royal Caribbean Group is guided by its mission to deliver the best vacations responsibly.</p><p> </p><p>SOURCE Royal Caribbean Group</p></div></article>",
            "link": "https://www.stocktitan.net/news/RCL/royal-caribbean-group-announces-completion-of-offering-of-1-25-0aeovwdhy20e.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:15:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Great Elm Capital Corp. (“GECC”) Schedules Fourth Quarter and Full Year 2025 Earnings Release and Conference Call | GECC Stock News",
            "description": "<article class=\"article\"><p><strong>Conference Call Scheduled for Tuesday, March 3, 2026 at 8:30 a.m. ET</strong></p><p align=\"justify\">PALM BEACH GARDENS, Fla., Feb.  27, 2026  (GLOBE NEWSWIRE) -- Great Elm Capital Corp. (the “Company” or “GECC”) (NASDAQ: <a class=\"symbol-link\" href=\"/overview/GECC/\" title=\"View GECC stock overview\">GECC</a>), a business development company, today announced that it will release its financial results for the fourth quarter and full year ended December 31, 2025, after the close of market trading on Monday, March 2, 2026. The results will be discussed in a conference call on Tuesday, March 3, 2026, at 8:30 a.m. ET.</p> <table align=\"center\" style=\"border-collapse: collapse; width:75%; border-collapse:collapse ;\"><tr><td style=\"max-width:42%; width:42%; min-width:42%;;border-top: solid black 1pt ; border-left: solid black 1pt ; vertical-align: middle;   text-align: left;   padding-left: 10.0px; vertical-align: bottom ; \">Date/Time:</td><td style=\"max-width:58%; width:58%; min-width:58%;;border-top: solid black 1pt ; border-right: solid black 1pt ; vertical-align: middle;   text-align: left;   padding-left: 10.0px; vertical-align: bottom ; \">Tuesday, March 3, 2026 – 8:30 a.m. ET</td></tr><tr><td style=\"border-left: solid black 1pt ; vertical-align: middle;   text-align: left;   padding-left: 10.0px; vertical-align: bottom ; \">  </td><td style=\"border-right: solid black 1pt ; vertical-align: middle;   text-align: left;   padding-left: 10.0px; vertical-align: bottom ; \"> </td></tr><tr><td style=\"border-left: solid black 1pt ; vertical-align: middle;   text-align: left;   padding-left: 10.0px; vertical-align: bottom ; \">Participant Dial-In Numbers:</td><td style=\"border-right: solid black 1pt ; vertical-align: middle;   text-align: left;   padding-left: 10.0px; vertical-align: bottom ; \"> </td></tr><tr><td style=\"border-left: solid black 1pt ; vertical-align: middle;   text-align: left;   padding-left: 10.0px; vertical-align: bottom ; \">(United States):</td><td style=\"border-right: solid black 1pt ; vertical-align: middle;   text-align: left;   padding-left: 10.0px; vertical-align: bottom ; \">(877) 407-0789</td></tr><tr><td style=\"border-bottom: solid black 1pt ; border-left: solid black 1pt ; vertical-align: middle;   text-align: left;   padding-left: 10.0px; vertical-align: bottom ; \">(International):</td><td style=\"border-right: solid black 1pt ; border-bottom: solid black 1pt ; vertical-align: middle;   text-align: left;   padding-left: 10.0px; vertical-align: bottom ; \">(201) 689-8562</td></tr><tr><td> </td><td style=\"vertical-align: middle;   text-align: left;   padding-left: 10.0px; \"> </td></tr></table> <p align=\"justify\">To access the call, please dial-in approximately five minutes before the start time and, when asked, provide the operator with passcode “GECC”. An accompanying slide presentation will be available in pdf format via the “Events and Presentations” section of Great Elm Capital Corp.’s website <a href=\"https://www.globenewswire.com/Tracker?data=IMtQYkh1b3vD7RX5UghOxYdjDqtc2Gap-NMnHl1AypGw1yU7XKeQWr9Y05akYkqoT-sJfJMANgYHVfoRIdbZri4QMDXxPD_ijYgSFfszbDx7J7xUlFt4aYQ3TnQRlFm2QSD_1SSAMxTAVFIG6Uz2Iw==\" rel=\"nofollow noopener\" target=\"_blank\">here</a> after the issuance of the earnings release.</p> <p align=\"justify\"><strong>Webcast<br/></strong>The call and presentation will also be simultaneously webcast over the internet via the “Events and Presentations” section of GECC’s website or by clicking on the webcast link <a href=\"https://www.globenewswire.com/Tracker?data=IMtQYkh1b3vD7RX5UghOxX7a5QeXr2367w-ECRoyvjjExvUCahMtReKv_hucDGHAMq_wWTXof2GZavnQz8Fi4djKTkJZiDVsiYPbCckB-MdoMwhR9PciIAfgd_mgXePkarRIZld8swRjxaLf-sVFng==\" rel=\"nofollow noopener\" target=\"_blank\">here</a>.</p> <p align=\"justify\"><strong>About Great Elm Capital Corp.<br/></strong>GECC is an externally managed business development company that seeks to generate current income and capital appreciation by investing in debt and income generating equity securities, including investments in specialty finance businesses and CLOs. For additional information, please visit <a href=\"https://www.globenewswire.com/Tracker?data=B7Lwg33t1vRxaT1C6uk36vlAnh5ee955eV1pxvABulDI-iL9kxa9Iw8ML_PmppvxZQeuxk2Qustu3hKMZfZm18ERyw1gEOSCT_Hu3n6KgGWKpJuouAAy1xwif87nH6TCehtF1crmJBSvTOvaMxI6HmArQEyMHZXIgE91vUqMhL4dCFGaZGTf9e6WpJVylzLsV4nf_W5JI1tPVbuujHjYjMnIN8rp6H2m2aU1QxV2gvPrryA-8H0ulUUSD6cRcvFAe-i8nJ_VcV25Y-YQVvRqeA==\" rel=\"nofollow noopener\" target=\"_blank\">http://www.greatelmcc.com</a>.</p> <p><strong>Media &amp; Investor Contact:</strong><br/>Investor Relations <br/><a href=\"https://www.globenewswire.com/Tracker?data=zAQSMtQntr7mWR7jNtJ-lRW6ZtrDy-KLp6SR93yYQ4Ex3Qzt3M5w_51TOuv7SxXkFLiheukWnQwJO1BumD6AXFbbGDS4Qe29YQtEKxq2riF0uVilSW_FFL3c5UqdTWHKy-bV6MT0nNKlvmo1q0HLuA==\" rel=\"nofollow noopener\" target=\"_blank\">investorrelations@greatelmcap.com</a></p> <p>Source: Great Elm Capital Corp.</p> <img alt=\"\" class=\"__GNW8366DE3E__IMG\" loading=\"lazy\" src=\"https://www.globenewswire.com/newsroom/ti?nf=OTY2MzE2OCM3NDYwMTM4IzIwODI5ODk=\"/> <br/><img alt=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\" src=\"https://ml.globenewswire.com/media/YWFiMjViOGUtMDY4OS00NThmLTk3NWMtMGFhYzlkMDNhZjI4LTEwOTQ1NjAtMjAyNi0wMi0yNy1lbg==/tiny/Great-Elm-Capital-Corp-.png\"/></article>",
            "link": "https://www.stocktitan.net/news/GECC/great-elm-capital-corp-gecc-schedules-fourth-quarter-and-full-year-mty1j8vmhx99.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:22:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AMTD Digital Reports Full Year Results with 565.7% Increase in Revenue, 132.7% Increase in Net Income, and 280.2% Increase in Net Assets | HKD Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.ny.paris\">PARIS</location> and <location idsrc=\"xmltag.org\" value=\"LU/us.ny.nyc\">NEW YORK</location> and <location idsrc=\"xmltag.org\" value=\"LU/gb.eng.london\">LONDON</location></span>, <span class=\"legendSpanClass\">Feb. 27, 2026</span> /PRNewswire/ -- AMTD Digital Inc. (\"AMTD Digital\" or the \"Company\") (NYSE: <a class=\"symbol-link\" href=\"/overview/HKD/\" title=\"View HKD stock overview\">HKD</a>), a NYSE-listed company and a subsidiary of AMTD Group Inc., today announced the filing of its annual report on Form 20-F for the fiscal year ended October 31, 2025 with the Securities and Exchange Commission, with summary highlights below:</p><ul type=\"disc\"><li>Total Revenue increased by <percent>565.7%</percent> from <money>US<money>$20.4 million</money></money> to <money>US<money>$136.1 million</money></money></li><li>Total Net Income increased by <percent>132.7%</percent> from <money>US<money>$41.7 million</money></money> to <money>US<money>$97.0</money></money> million </li><li>Total Assets amounted to <money>US<money>$955.4 million</money></money> (<money>US<money>$7.57</money></money>/share)</li><li>Net asset value amounted to <money>US<money>$603.7 million</money></money> (<money>US<money>$4.78</money></money>/share)</li></ul><p>The annual report is available on the Company's investor relations website at <a href=\"https://ir.amtdigital.net/investor-news\" rel=\"nofollow noopener\" target=\"_blank\">https://ir.amtdigital.net/investor-news</a>. The Company will provide a hard copy of its annual report containing the audited consolidated financial statements, free of charge, to its shareholders and ADS holders upon request. Requests should be directed to Investor Relations Office at <a href=\"mailto:ir@amtdigital.net\" rel=\"nofollow noopener\" target=\"_blank\">ir@amtdigital.net</a> .</p><p><b>About AMTD Digital Inc.</b></p><p>AMTD Digital Inc. (NYSE: <a class=\"symbol-link\" href=\"/overview/HKD/\" title=\"View HKD stock overview\">HKD</a>) is a comprehensive digital solutions platform headquartered in <location idsrc=\"xmltag.org\" value=\"LC/fr\">France</location>. Its one-stop digital solutions platform operates key business lines including digital media, content and marketing services, investments as well as hospitality and VIP services. For AMTD Digital's announcements, please visit <a href=\"https://ir.amtdigital.net/investor-news\" rel=\"nofollow noopener\" target=\"_blank\">https://ir.amtdigital.net/investor-news</a>.</p><p><b>For more information, please contact:</b></p><p><b>For AMTD Digital Inc.:</b></p><p>IR Office<br/>AMTD Digital Inc.<br/>EMAIL: <a href=\"mailto:ir@amtdigital.net\" rel=\"nofollow noopener\" target=\"_blank\">ir@amtdigital.net</a></p><p>SOURCE AMTD Digital</p></div></article>",
            "link": "https://www.stocktitan.net/news/HKD/amtd-digital-reports-full-year-results-with-565-7-increase-in-83brh5nslpqt.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:25:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UDR to Participate in 2026 Citi Global Property CEO Conference | UDR Stock News",
            "description": "<article class=\"article\"><p> <location idsrc=\"xmltag.org\" value=\"LU/us.co.denver\">DENVER</location>--(BUSINESS WIRE)--<a class=\"symbol-link\" href=\"/overview/UDR/\" title=\"View UDR stock overview\">UDR</a>, Inc. (the “Company”) (NYSE: <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fir.udr.com%2FStock&amp;esheet=54435329&amp;newsitemid=20260227741127&amp;lan=en-US&amp;anchor=UDR&amp;index=1&amp;md5=a0f8ef5fd15d3da0f4b8b3e23070b7a8\" rel=\"nofollow noopener\" shape=\"rect\">UDR</a>), a leading multifamily real estate investment trust, announced today that Thomas W. Toomey, Chairman, President, and Chief Executive Officer, and the <a class=\"symbol-link\" href=\"/overview/UDR/\" title=\"View UDR stock overview\">UDR</a> Executive Team will host a roundtable discussion at the 2026 Citi Global Property CEO Conference on Tuesday, March 3, 2026, at 11:40 a.m. Eastern Time.</p><p>The Company’s roundtable discussion will be made available as a webcast which can be accessed at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fkvgo.com%2Fciti%2Fudr-march-2026&amp;esheet=54435329&amp;newsitemid=20260227741127&amp;lan=en-US&amp;anchor=https%3A%2F%2Fkvgo.com%2Fciti%2Fudr-march-2026&amp;index=2&amp;md5=1285040b16238212903c4c43141f3257\" rel=\"nofollow noopener\" shape=\"rect\">https://kvgo.com/citi/udr-march-2026</a> as well as on the Investor Relations section of the Company’s website, <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fir.udr.com%2F&amp;esheet=54435329&amp;newsitemid=20260227741127&amp;lan=en-US&amp;anchor=ir.udr.com&amp;index=3&amp;md5=243142169848984ad38cafd95f171a57\" rel=\"nofollow noopener\" shape=\"rect\">ir.udr.com</a>. A replay of the roundtable will be available for 30 days on the Company’s website. A copy of materials provided by the Company at the conference will be available on the Investor Relations section of the Company’s website, under “Presentations &amp; Webcasts.”</p><p><b><span class=\"bwuline\">About <a class=\"symbol-link\" href=\"/overview/UDR/\" title=\"View UDR stock overview\">UDR</a>, Inc.</span></b></p><p>UDR, Inc. (NYSE: <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fir.udr.com%2FStock&amp;esheet=54435329&amp;newsitemid=20260227741127&amp;lan=en-US&amp;anchor=UDR&amp;index=4&amp;md5=c7a95ee62dc9b51d8a25d51ab37802d6\" rel=\"nofollow noopener\" shape=\"rect\">UDR</a>), an S&amp;P 500 company, is a leading multifamily real estate investment trust with a demonstrated performance history of delivering superior and dependable returns by successfully managing, buying, selling, developing and redeveloping attractive real estate properties in targeted <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> markets. As of December 31, 2025, UDR owned or had an ownership position in 60,941 apartment homes, including 300 apartment homes under development. For over 53 years, UDR has delivered long-term value to shareholders, the best standard of service to residents and the highest quality experience for associates.</p><p><img alt=\"\" loading=\"lazy\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260227741127r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\"/><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20260227741127/en/\" rel=\"nofollow noopener\">https://www.businesswire.com/news/home/20260227741127/en/</a></span></p><p><b>Contact: UDR, Inc.</b></p><p>Trent Trujillo<br/><a href=\"mailto:ttrujillo@udr.com\" rel=\"nofollow noopener\" shape=\"rect\">ttrujillo@udr.com</a><br/>720-283-6135</p><p>Source: UDR, Inc.</p></article>",
            "link": "https://www.stocktitan.net/news/UDR/udr-to-participate-in-2026-citi-global-property-ceo-n52sfjpn5dn1.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:16:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sable Offshore Corp. Reports Full Year 2025 Results | SOC Stock News",
            "description": "<article class=\"article\"><p> <location idsrc=\"xmltag.org\" value=\"LU/us.tx.houstn\">HOUSTON</location>--(BUSINESS WIRE)--Sable Offshore Corp. (“Sable,” or the “Company”)(NYSE: <a class=\"symbol-link\" href=\"/overview/SOC/\" title=\"View SOC stock overview\">SOC</a>) today announced its full year 2025 operational and financial results.</p><p><b>2025 Operational and Financial Highlights</b></p><ul class=\"bwlistdisc\"><li>On May 19, 2025, we announced that (i) as of May 15, 2025, we had restarted production at the Santa Ynez Unit and begun flowing oil production to Las Flores Canyon and (ii) we completed our anomaly repair program on Pipeline Segments 324 and 325 of the Santa Ynez Pipeline System as specified by the Consent Decree.</li></ul><ul class=\"bwlistdisc\"><li>On May 23, 2025, we closed an upsized underwritten public offering of 10,000,000 shares of Common Stock at a public offering price of <money><money>$29.50</money></money> per share. The gross proceeds from the offering, before deducting discounts and commissions and estimated expenses, were approximately <money><money>$295.0 million</money></money>.</li></ul><ul class=\"bwlistdisc\"><li>On May 28, 2025, we announced that we successfully completed hydrotests of all segments of the Santa Ynez Pipeline System, satisfying the final operational condition to resume petroleum transportation through Pipeline Segments 324 and 325 as outlined in the Consent Decree.</li></ul><ul class=\"bwlistdisc\"><li>As an alternative to the Santa Ynez Pipeline System, we announced that we are also pursuing an OS&amp;T strategy to provide access to domestic and global markets via shuttle tankers for federal crude oil produced from the Santa Ynez Unit in the Pacific Outer Continental Shelf Area.</li></ul><ul class=\"bwlistdisc\"><li>On November 10, 2025, we entered into subscription agreements to issue 45,454,546 shares of Common Stock in a private placement to institutional investors at a purchase price of <money><money>$5.50</money></money> per share, raising <money><money>$250.0 million</money></money> in gross proceeds.</li></ul><ul class=\"bwlistdisc\"><li>On November 24, 2025, we satisfied all conditions to effectiveness of the Second Amendment to the Senior Secured Term Loan, thereby extending the maturity date of the Senior Secured Term Loan to the earlier of (i) March 31, 2027 or (ii) the date falling 90 days after first sales of hydrocarbons. The Second Amendment increased the interest rate from ten percent (<percent>10%</percent>) per annum to fifteen percent (<percent>15%</percent>) per annum, compounded annually.</li></ul><ul class=\"bwlistdisc\"><li>On December 17, 2025, PHMSA notified us that it concurred with our determination that the Santa Ynez Pipeline System is an interstate pipeline facility under the Pipeline Safety Act, pursuant to which PHMSA is vested with exclusive regulatory authority over interstate pipelines. In its notification, PHMSA additionally states that it considers the Santa Ynez Pipeline System to be an “active” pipeline according to PHMSA regulations.</li></ul><ul class=\"bwlistdisc\"><li>On December 23, 2025, PHMSA issued an emergency special permit for segments of the interstate Santa Ynez Pipeline System (specifically Pipeline Segments 324 and 325), related to cathodic protection and seam weld corrosion along Pipeline Segments 324 and 325.</li></ul><ul class=\"bwlistdisc\"><li>We reported a net loss of <money><money>$410.2 million</money></money>, primarily attributable to production restart related operating expenses, general &amp; administrative expenses, and non-cash interest expense, partially offset by a non-cash change in fair value of warrant liabilities.</li></ul><ul class=\"bwlistdisc\"><li>We ended the year with short-term outstanding debt of <money><money>$921.6 million</money></money>, inclusive of paid-in-kind interest, and a cash and cash equivalents balance of <money><money>$97.7 million</money></money>.</li></ul><p><b>About Sable</b></p><p>Sable Offshore Corp. is an independent oil and gas company, headquartered in <location idsrc=\"xmltag.org\" value=\"LU/us.tx.houstn\">Houston, Texas</location>, focused on responsibly developing the Santa Ynez Unit in federal waters offshore <location idsrc=\"xmltag.org\" value=\"LS/us.ca\">California</location>. The Sable team has extensive experience safely operating in <location idsrc=\"xmltag.org\" value=\"LS/us.ca\">California</location>.</p><p><b>Forward-Looking Statements</b></p><p>The information in this press release includes “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. When used in this press release, the words “could,” “should,” “will,” “may,” “believe,” “anticipate,” “intend,” “estimate,” “expect,” “project,” “continue,” “plan,” “forecast,” “predict,” “potential,” “future,” “outlook,” and “target,” the negative of such terms and other similar expressions are intended to identify forward- looking statements, although not all forward-looking statements will contain such identifying words. These statements are based on the current beliefs and expectations of Sable’s management and are subject to significant risks and uncertainties. Actual results may differ materially from those described in the forward-looking statements. Factors that could cause Sable’s actual results to differ materially from those described in the forward-looking statements include: the ability to recommence sales of oil from the Santa Ynez Unit assets, including the potential implementation of an Offshore Storage and Treating Vessel (“OS&amp;T”) strategy, the cost and time required therefor, and production levels once recommenced; availability of future financing; global economic conditions and inflation; increased operating costs; lack of availability of drilling and production equipment, supplies, services and qualified personnel; geographical concentration of operations; environmental and weather risks; regulatory changes and uncertainties; litigation, complaints and/or adverse publicity; privacy and data protection laws, privacy or data breaches, or loss of data; our ability to comply with laws and regulations applicable to our business; and other one-time events and other factors that can be found in Sable’s Annual Report on Form 10-K for the year ended December 31, 2025, and any subsequent Quarterly Report on Form 10-Q or Current Report on Form 8-K, which are filed with the Securities and Exchange Commission and are available on Sable’s website (<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.sableoffshore.com&amp;esheet=54435591&amp;newsitemid=20260227076859&amp;lan=en-US&amp;anchor=www.sableoffshore.com&amp;index=1&amp;md5=e0510f16d286392f50812ed2a3d0da67\" rel=\"nofollow noopener\" shape=\"rect\">www.sableoffshore.com</a>) and on the Securities and Exchange Commission’s website (<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.sec.gov&amp;esheet=54435591&amp;newsitemid=20260227076859&amp;lan=en-US&amp;anchor=www.sec.gov&amp;index=2&amp;md5=ec73c3bfa3f3a6da298e9abcbb3d9cc5\" rel=\"nofollow noopener\" shape=\"rect\">www.sec.gov</a>). Except as required by applicable law, Sable undertakes no obligation to publicly release the result of any revisions to these forward-looking statements to reflect the impact of events or circumstances that may arise after the date of this press release.</p><p><b>Disclaimers</b></p><p>The Santa Ynez Unit assets restarted production in May 2025. Sable has not sold commercial quantities of hydrocarbons since acquisition of the Santa Ynez Unit. The Santa Ynez Unit was shut in during June of 2015 when the only onshore pipeline transporting hydrocarbons produced from the Santa Ynez Unit to market ceased transportation. Since the May 2025 production restart, the oil produced has been transported via pipeline to storage tanks onshore at Sable’s Las Flores Canyon processing facility where it is being stored pending resumed petroleum transportation through the Santa Ynez Pipeline System or an OS&amp;T vessel. There can be no assurance that the necessary approvals will be obtained that would allow the Company to recommence sales.</p><p><img alt=\"\" loading=\"lazy\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260227076859r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\"/><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20260227076859/en/\" rel=\"nofollow noopener\">https://www.businesswire.com/news/home/20260227076859/en/</a></span></p><p>Investor Contact:<br/>Harrison Breaud<br/>Vice President, Finance &amp; Investor Relations<br/><a href=\"mailto:IR@sableoffshore.com\" rel=\"nofollow noopener\" shape=\"rect\">IR@sableoffshore.com</a><br/>713-579-8111</p><p>Source: Sable Offshore Corp.</p></article>",
            "link": "https://www.stocktitan.net/news/SOC/sable-offshore-corp-reports-full-year-2025-rneoazczjrs3.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:16:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Aberdeen Investments U.S. Closed-End Funds Announce Distribution Payment Details | THQ Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.pa.phldph\">PHILADELPHIA</location></span>, <span class=\"legendSpanClass\">Feb. 27, 2026</span> /PRNewswire/ -- The <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627483-1&amp;h=3190043873&amp;u=https%3A%2F%2Fwww.aberdeeninvestments.com%2Fen-us%2Finvestor%2Finvestment-solutions%2Fclosed-end-funds&amp;a=Aberdeen+Investments+U.S.+Closed-End+Funds\" rel=\"nofollow noopener\" target=\"_blank\">Aberdeen Investments <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> Closed-End Funds</a> (NYSE: <a class=\"symbol-link\" href=\"/overview/ASGI/\" title=\"View ASGI stock overview\">ASGI</a>, <a class=\"symbol-link\" href=\"/overview/THQ/\" title=\"View THQ stock overview\">THQ</a>), (the \"Funds\" or individually the \"Fund\"), today announced that the Funds paid the distributions noted in the table below on February 27, 2026, on a per share basis to all shareholders of record as of February 20, 2026 (ex-dividend date February 20, 2026).</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\"><p><a href=\"https://mma.prnewswire.com/media/2698388/Aberdeen_Investments_Logo.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"Aberdeen Investments (PRNewsfoto/Aberdeen Investments U.S. Closed End Funds)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/2698388/Aberdeen_Investments_Logo.jpg\" title=\"Aberdeen Investments (PRNewsfoto/Aberdeen Investments U.S. Closed End Funds)\"/></a></p></div><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Ticker</b></span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Exchange</b></span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Fund</b></span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Amount</b></span></p></td></tr><tr><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">ASGI</span></p></td><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">NYSE</span></p></td><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">abrdn Global Infrastructure Income Fund</span></p></td><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">$   0.2200</span></p></td></tr><tr><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">THQ</span></p></td><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">NYSE</span></p></td><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">abrdn Healthcare Opportunities Fund</span></p></td><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">$   0.1800</span></p></td></tr></table></div><p>Each Fund has adopted a distribution policy to provide investors with a stable distribution out of current income, supplemented by realized capital gains and, to the extent necessary, paid-in capital.</p><p>Under applicable <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> tax rules, the amount and character of distributable income for each Fund's fiscal year can be finally determined only as of the end of the Fund's fiscal year. However, under Section 19 of the Investment Company Act of 1940, as amended (the \"1940 Act\") and related rules, the Funds may be required to indicate to shareholders the estimated source of certain distributions to shareholders.</p><p>The following tables set forth the estimated amounts of the sources of the distributions for purposes of Section 19 of the 1940 Act and the rules adopted thereunder. The tables have been computed based on generally accepted accounting principles.  The tables include estimated amounts and percentages for the current distributions paid this month as well as for the cumulative distributions paid relating to fiscal year to date, from the following sources: net investment income; net realized short-term capital gains; net realized long-term capital gains; and return of capital. The estimated compositions of the distributions may vary because the estimated composition may be impacted by future income, expenses and realized gains and losses on securities and currencies.</p><p>The Funds' estimated sources of the current distribution paid this month and for its current fiscal year to date are as follows:</p><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen2\" colspan=\"10\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Estimated Amounts of Current Distribution per Share</b></span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Fund</b></span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Distribution Amount</b></span></p></td><td class=\"prngen7\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Net Investment Income</b></span></p></td><td class=\"prngen7\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Net Realized Short-Term Gains**</b></span></p></td><td class=\"prngen7\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Net Realized Long-Term Gains</b></span></p></td><td class=\"prngen8\" colspan=\"2\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Return of Capital</b></span></p></td></tr><tr><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">ASGI</span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.22</money>00</money></span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.01</money>54</money></span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">7 %</span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.06</money>60</money></span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">30 %</span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.13</money>86</money></span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">63 %</span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">-</span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">-</span></p></td></tr><tr><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">THQ</span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.18</money>00</money></span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">-</span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">-</span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.08</money>10</money></span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">45 %</span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.02</money>70</money></span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">15 %</span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.07</money>20</money></span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">40 %</span></p></td></tr></table></div><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen2\" colspan=\"10\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Estimated Amounts of Fiscal Year* to Date Cumulative Distributions per Share</b></span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Fund</b></span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Distribution Amount</b></span></p></td><td class=\"prngen7\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Net Investment Income</b></span></p></td><td class=\"prngen7\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Net Realized Short-Term Gains **</b></span></p></td><td class=\"prngen7\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Net Realized Long-Term Gains</b></span></p></td><td class=\"prngen8\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Return of Capital</b></span></p></td></tr><tr><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">ASGI</span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$1.06</money>00</money></span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.07</money>42</money></span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">7 %</span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.31</money>80</money></span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">30 %</span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.66</money>78</money></span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">63 %</span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">-</span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">-</span></p></td></tr><tr><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">THQ</span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.90</money>00</money></span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">-</span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">-</span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.40</money>50</money></span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">45 %</span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.13</money>50</money></span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">15 %</span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.36</money>00</money></span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">40 %</span></p></td></tr><tr><td class=\"prngen11\" colspan=\"10\" rowspan=\"1\"><p class=\"prnml40\"><span class=\"prnews_span\">* <a class=\"symbol-link\" href=\"/overview/ASGI/\" title=\"View ASGI stock overview\">ASGI</a> and <a class=\"symbol-link\" href=\"/overview/THQ/\" title=\"View THQ stock overview\">THQ</a> have a 9/30 fiscal year end<br/>**includes currency gains<br/></span></p></td></tr></table></div><p>Where the estimated amounts above show a portion of the distribution to be a \"Return of Capital,\" it means that Fund estimates that it has distributed more than its income and capital gains; therefore, a portion of your distribution may be a return of capital. A return of capital may occur for example, when some or all the money that you invested in a Fund is paid back to you. A return of capital distribution does not necessarily reflect the Fund's investment performance and should not be confused with \"yield\" or \"income.\"</p><p><b>The amounts and sources of distributions reported in this notice are only estimates and are not being provided for tax reporting purposes. The final determination of the source of all distributions for the </b><b>current year will only be made after year-end. The actual amounts and sources of the amounts for tax reporting purposes will depend upon the Fund's investment experience during the remainder of the fiscal year and may be subject to change based on tax regulations. After the end of each calendar year, a Form 1099-DIV will be sent to shareholders for the prior calendar year that will tell you how to report these distributions for federal income tax purposes.</b></p><p>The following tables provide the Funds' total return performance based on net asset value (NAV) over various time periods compared to the Funds' annualized and cumulative distribution rates.</p><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen2\" colspan=\"5\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Fund Performance and Distribution Rate Information</b></span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Fund</b></span></p></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Average <br/>Annual Total <br/>Return on NAV<br/> for the 5 Year<br/>Period Ending <br/>1/31/2026¹</b></span></p></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Current Fiscal <br/>Period's <br/>Annualized <br/>Distribution<br/>Rate on NAV</b></span></p></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Cumulative<br/>Total Return<br/>on NAV¹</b></span></p></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Cumulative <br/>Distribution <br/>Rate on NAV²</b></span></p></td></tr><tr><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">ASGI</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">10.76 %</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">11.38 %</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">9.30 %</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">3.79 %</span></p></td></tr><tr><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">THQ</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">5.01 %</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">11.69 %</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">7.34 %</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">3.90 %</span></p></td></tr><tr><td class=\"prngen11\" colspan=\"5\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><sup>1</sup> Return data is net of all Fund expenses and fees and assumes the reinvestment of all distributions reinvested at prices obtained under the Fund's dividend reinvestment plan.<br/><sup>2 </sup>Based on the Fund's NAV as of January 31, 2026.<br/></span></p></td></tr></table></div><p><b>Shareholders should not draw any conclusions about a Fund's investment performance from the amount of the Fund's current distributions or from the terms of the distribution policy (the \"Distribution Policy\").</b></p><p><b>The value at which a closed-end fund stock may trade on a public exchange is a function of external market factors that are not at the control of the Fund's Board or Investment Advisor.  Closed-end Fund shares may therefore trade at a premium or a discount to net asset value at any given time. Shareholders should be aware that a fund trading at a premium to net asset value may not be sustainable and a fund's discount to net asset value, can widen as well as narrow.   Shareholders of a fund trading at a premium who participate in that fund's dividend reinvestment plan should note the reinvestment of distributions may occur at a premium to net asset value.  </b></p><p>While NAV performance may be indicative of the Fund's investment performance, it does not measure the value of a shareholder's investment in the Fund. The value of a shareholder's investment in the Fund is determined by the Fund's market price, which is based on the supply and demand for the Fund's shares in the open market.</p><p>Pursuant to an exemptive order granted by the Securities and Exchange Commission, the Funds may distribute any long-term capital gains more frequently than the limits provided in Section 19(b) under the 1940 Act and Rule 19b-1 thereunder. Therefore, distributions paid by the Funds during the year may include net income, short-term capital gains, long-term capital gains and/or a return of capital. Net income dividends and short-term capital gain dividends, while generally taxable at ordinary income rates, may be eligible, to the extent of qualified dividend income earned by the Funds, to be taxed at a lower rate not to exceed the maximum rate applicable to your long-term capital gains. Distributions made in any calendar year in excess of investment company taxable income and net capital gain are treated as taxable ordinary dividends to the extent of undistributed earnings and profits, and then as a return of capital that reduces the adjusted basis in the shares held. To the extent return of capital distributions exceed the adjusted basis in the shares held, capital gain is recognized with a holding period based on the period the shares have been held at the date such amount is received.</p><p>The payment of distributions in accordance with the Distribution Policy may result in a decrease in the Fund's net assets. A decrease in the Fund's net assets may cause an increase in the Fund's annual operating expense ratio and a decrease in the Fund's market price per share to the extent the market price correlates closely to the Fund's net asset value per share. The Distribution Policy may also negatively affect the Fund's investment activities to the extent that the Fund is required to hold larger cash positions than it typically would hold or to the extent that the Fund must liquidate securities that it would not have sold, for the purpose of paying the distribution. Each Fund's Board has the right to amend, suspend or terminate the Distribution Policy at any time. The amendment, suspension or termination of the Distribution Policy may affect the Fund's market price per share. Investors should consult their tax advisor regarding federal, state, and local tax considerations that may be applicable in their particular circumstances.</p><p><u>Circular 230 disclosure</u>:  To ensure compliance with requirements imposed by the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> Treasury, we inform you that any <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> tax advice contained in this communication (including any attachments) is not intended or written to be used, and cannot be used, for the purpose of (i) avoiding penalties under the Internal Revenue Code or (ii) promoting, marketing or recommending to another party any transaction or matter addressed herein.</p><p>Aberdeen Investments Global is the trade name of Aberdeen's investments business, herein referred to as \"Aberdeen Investments\" or \"Aberdeen\". In <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location>, Aberdeen Investments refers to the following affiliated, registered investment advisers: abrdn Inc., abrdn Investments Limited, and abrdn Asia Limited.\"</p><p>Closed-end funds are traded on the secondary market through one of the stock exchanges. A Fund's investment return and principal value will fluctuate so that an investor's shares may be worth more or less than the original cost. Shares of closed-end funds may trade above (a premium) or below (a discount) the net asset value (NAV) of the fund's portfolio. There is no assurance that a Fund will achieve its investment objective. Past performance does not guarantee future results.</p><p><a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627483-1&amp;h=828577279&amp;u=https%3A%2F%2Fwww.aberdeeninvestments.com%2Fen-us%2Finvestor%2Finvestment-solutions%2Fclosed-end-funds&amp;a=Closed+end+funds+%7C+Aberdeen\" rel=\"nofollow noopener\" target=\"_blank\">Closed end funds | Aberdeen</a></p><p>SOURCE Aberdeen Investments <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> Closed End Funds</p></div></article>",
            "link": "https://www.stocktitan.net/news/THQ/aberdeen-investments-u-s-closed-end-funds-announce-distribution-9i2831nrxmf8.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:17:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MAA to Participate in the 2026 Citi Global Property CEO Conference | MAA Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.tn.gerown\">GERMANTOWN, Tenn.</location></span>, <span class=\"legendSpanClass\">Feb. 27, 2026</span> /PRNewswire/ -- Mid-America Apartment Communities, Inc., or <a class=\"symbol-link\" href=\"/overview/MAA/\" title=\"View MAA stock overview\">MAA</a> (NYSE: <a class=\"symbol-link\" href=\"/overview/MAA/\" title=\"View MAA stock overview\">MAA</a>), today announced that the Company plans to participate in the 2026 Citi Global Property CEO Conference.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\"><p><a href=\"https://mma.prnewswire.com/media/324905/maa_logo.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"MAA logo. (PRNewsFoto/MAA)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/324905/maa_logo.jpg\" title=\"MAA logo. (PRNewsFoto/MAA)\"/></a></p></div><p>During the conference, Brad Hill, President and Chief Executive Officer, along with members of <a class=\"symbol-link\" href=\"/overview/MAA/\" title=\"View MAA stock overview\">MAA</a>'s management team, will host a roundtable discussion on Monday, March 2, 2026, at approximately 9:35 a.m. Eastern Time that is expected to last for approximately 35 minutes.</p><p>A live webcast of the presentation is accessible through the \"For Investors\" page of MAA's website at <a href=\"http://www.maac.com\" rel=\"nofollow noopener\">www.maac.com</a>, and through the following link:  <a href=\"https://kvgo.com/citi/maa-march-2026\" rel=\"nofollow noopener\">https://kvgo.com/citi/maa-march-2026</a>.</p><p>The webcast replay will be available on the \"For Investors\" page of MAA's website after the conclusion of the live event. </p><p><b>About MAA<br/></b>MAA is a self-administered real estate investment trust (REIT) and member of the S&amp;P 500. MAA owns or has ownership interest in apartment communities primarily throughout the Southeast, Southwest and Mid-Atlantic regions of the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> focused on delivering strong, full-cycle investment performance. For further details, please refer to the \"For Investors\" page at <a href=\"http://www.maac.com\" rel=\"nofollow noopener\">www.maac.com</a> or contact Investor Relations at <a href=\"mailto:investor.relations@maac.com\" rel=\"nofollow noopener\" xmlns=\"http://www.w3.org/1999/xhtml\">investor.relations@maac.com</a>.</p><p>SOURCE MAA</p></div></article>",
            "link": "https://www.stocktitan.net/news/MAA/maa-to-participate-in-the-2026-citi-global-property-ceo-ktdjhccy804z.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:15:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Camden Property Trust Announces Participation in Citi’s 2026 Global Property CEO Conference and Provides First Quarter 2026 Operating Update | CPT Stock News",
            "description": "<article class=\"article\"><p> <location idsrc=\"xmltag.org\" value=\"LU/us.tx.houstn\">HOUSTON</location>--(BUSINESS WIRE)--Camden Property Trust (NYSE:<a class=\"symbol-link\" href=\"/overview/CPT/\" title=\"View CPT stock overview\">CPT</a>) (the “Company”) announced today that the Company will participate in Citi’s 2026 Global Property CEO Conference. Camden’s roundtable discussion has been scheduled for Tuesday, March 3, 2026, at 1:30 PM Eastern Time. The event will be webcast live in a listen-only mode at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.camdenliving.com%2F&amp;esheet=54435280&amp;newsitemid=20260227144964&amp;lan=en-US&amp;anchor=camdenliving.com&amp;index=1&amp;md5=4c74f17d5580f72128ee3483337546a8\" rel=\"nofollow noopener\" shape=\"rect\">camdenliving.com</a> in the Investors section, and an audio archive will be available on the Company’s website shortly after the event concludes.</p><p>A copy of Camden’s most recent investor presentation can be found in the Investors section of the Company’s website and includes updates related to recent real estate and capital markets transactions. Camden also provided an update on first quarter 2026 operating trends, indicating that performance to date is in line with guidance provided in early February in conjunction with the Company’s fourth quarter 2025 earnings release.</p><p>In addition to historical information, this press release contains forward-looking statements under the federal securities law. These statements are based on current expectations, estimates, and projections about the industry and markets in which Camden operates, management's beliefs, and assumptions made by management. Forward-looking statements are not guarantees of future performance and involve certain risks and uncertainties which are difficult to predict. Factors which may cause the Company’s actual results or performance to differ materially from those contemplated by forward-looking statements are described under the heading “Risk Factors” in Camden’s Annual Report on Form 10-K and in other filings with the Securities and Exchange Commission (SEC). Forward-looking statements made in today’s press release represent management’s current opinions at the time of this publication, and the Company assumes no obligation to update or supplement these statements because of subsequent events.</p><p>Camden Property Trust, an S&amp;P 500 Company, is a real estate company primarily engaged in the ownership, management, development, redevelopment, acquisition, and construction of multifamily apartment communities. Camden owns and operates 171 properties containing 58,254 apartment homes across <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location>. Upon completion of 3 properties currently under development, the Company’s portfolio will increase to 59,416 apartment homes in 174 properties. Camden has been recognized as one of the 100 Best Companies to Work For® by FORTUNE magazine for 18 consecutive years, most recently ranking #18.</p><p>For additional information, please contact Camden’s Investor Relations Department at (713) 354-2787 or access our website at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.camdenliving.com%2F&amp;esheet=54435280&amp;newsitemid=20260227144964&amp;lan=en-US&amp;anchor=camdenliving.com&amp;index=2&amp;md5=a7e8fd4b884e4cccf37beb16da5bf23e\" rel=\"nofollow noopener\" shape=\"rect\">camdenliving.com</a>.</p><p><img alt=\"\" loading=\"lazy\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260227144964r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\"/><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20260227144964/en/\" rel=\"nofollow noopener\">https://www.businesswire.com/news/home/20260227144964/en/</a></span></p><p>Kim Callahan, 713-354-2549</p><p>Source: Camden Property Trust</p></article>",
            "link": "https://www.stocktitan.net/news/CPT/camden-property-trust-announces-participation-in-citi-s-2026-global-clmdlqizzkgg.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:15:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        }
    ]
}