{
    "data": [
        {
            "title": "FMC Corporation Declares Quarterly Dividend | FMC Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder8639\"><p><a href=\"https://mma.prnewswire.com/media/331912/fmc_corporation_logo.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"FMC Corporation Logo. (PRNewsFoto/FMC Corporation)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/331912/fmc_corporation_logo.jpg\" title=\"FMC Corporation Logo. (PRNewsFoto/FMC Corporation)\"/></a></p></div><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.pa.phldph\">PHILADELPHIA</location></span>, <span class=\"legendSpanClass\">Feb. 27, 2026</span> /PRNewswire/ -- <a class=\"symbol-link\" href=\"/overview/FMC/\" title=\"View FMC stock overview\">FMC</a> Corporation (NYSE: <a class=\"symbol-link\" href=\"/overview/FMC/\" title=\"View FMC stock overview\">FMC</a>) announced today that its board of directors declared a regular quarterly dividend of <money>8 cents</money> per share, payable on April 16, 2026, to shareholders of record as of the close of business on March 31, 2026. </p><p><b>About FMC</b></p><p>FMC Corporation is a global agricultural sciences company dedicated to helping growers produce food, feed, fiber and fuel for an expanding world population while adapting to a changing environment. <a class=\"symbol-link\" href=\"/overview/FMC/\" title=\"View FMC stock overview\">FMC</a>'s innovative crop protection solutions – including biologicals, crop nutrition, digital and precision agriculture – enable growers and crop advisers to address their toughest challenges economically while protecting the environment. FMC is committed to discovering new herbicide, insecticide and fungicide active ingredients, product formulations and pioneering technologies that are consistently better for the planet. Visit fmc.com to learn more and follow us on LinkedIn<sup>®</sup>.</p><p><i>Statement under the Safe Harbor Provisions of the Private Securities Litigation Reform Act of 1995: FMC and its representatives may from time to time make written or oral statements that are \"forward-looking\" and provide other than historical information, including statements contained in this press release, in FMC's other filings with the SEC, and in presentations, reports or letters to FMC stockholders.</i></p><p><i>In some cases, FMC has identified these forward-looking statements by such words or phrases as \"outlook\", \"will likely result,\" \"is confident that,\" \"expect,\" \"expects,\" \"should,\" \"could,\" \"may,\" \"will continue to,\" \"believe,\" \"believes,\" \"anticipates,\" \"predicts,\" \"forecasts,\" \"estimates,\" \"projects,\" \"potential,\" \"intends\" or similar expressions identifying \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995, including the negative of those words or phrases. Such forward-looking statements are based on our current views and assumptions regarding future events, future business conditions and the outlook for the company based on currently available information. The forward-looking statements involve known and unknown risks, uncertainties and other factors that may cause actual results to be materially different from any results, levels of activity, performance or achievements expressed or implied by any forward-looking statement. These statements are qualified by reference to the risk factors included in Part I, Item 1A of our Annual Report on Form 10-K for the year ended December 31, 2025 (the \"2025 Form 10-K\"), the section captioned \"Forward-Looking Information\" in Part II of the 2025 Form 10-K and to similar risk factors and cautionary statements in all other reports and forms filed with the Securities and Exchange Commission (\"SEC\"). We wish to caution readers not to place undue reliance on any such forward-looking statements, which speak only as of the date made. Forward-looking statements are qualified in their entirety by the above cautionary statement. </i></p><p><i>We specifically decline to undertake any obligation, and specifically disclaims any duty, to publicly update or revise any forward-looking statements that have been made to reflect events or circumstances after the date of such statements or to reflect the occurrence of anticipated or unanticipated events, except as may be required by law.</i></p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder0\"></div><p>SOURCE FMC Corporation</p></div></article>",
            "link": "https://www.stocktitan.net/news/FMC/fmc-corporation-declares-quarterly-v8vk3uc6usz8.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 22:00:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FLAGSTAR BANK, N.A. ANNOUNCES JUNE 9TH DATE FOR ITS 2026 ANNUAL MEETING OF SHAREHOLDERS | FLG Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.ny.hiclle\">HICKSVILLE, N.Y.</location></span>, <span class=\"legendSpanClass\">Feb. 27, 2026</span> /PRNewswire/ -- Flagstar Bank, N.A. (NYSE: <a class=\"symbol-link\" href=\"/overview/FLG/\" title=\"View FLG stock overview\">FLG</a>) (the \"Bank\") today announced that Tuesday, June 9, 2026, has been established as the date of its 2026 Annual Meeting of Shareholders.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\"><p><a href=\"https://mma.prnewswire.com/media/2799307/Flagstar_Bank_NA_Logo.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"Flagstar Bank, N.A. Logo (PRNewsfoto/Flagstar Bank, N.A.)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/2799307/Flagstar_Bank_NA_Logo.jpg\" title=\"Flagstar Bank, N.A. Logo (PRNewsfoto/Flagstar Bank, N.A.)\"/></a></p></div><p>The meeting will be held in a virtual format only, via live webcast, beginning at 10:00 a.m. Eastern Time.</p><p>The record date for voting at the Annual Meeting has been set as April 10, 2026. Shareholders of the Bank as of the record date will be entitled to receive notice of, and vote at, the Annual Meeting.</p><p>Further details regarding the Annual Meeting, including how to participate in the Annual Meeting, will be included in the Bank's Proxy Statement and Notice of Annual Meeting of Shareholders that will be sent to shareholders and also filed with the Office of the Comptroller of the Currency (\"OCC\") and made available on its website at <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628584-1&amp;h=3554966546&amp;u=https%3A%2F%2Fwww.occ.gov%2F&amp;a=www.occ.gov\" rel=\"nofollow noopener\" target=\"_blank\">www.occ.gov</a>. We also voluntarily file with the Securities and Exchange Commission (\"SEC\"), and our filings there may be found at <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628584-1&amp;h=401562052&amp;u=https%3A%2F%2Fwww.sec.gov%2F&amp;a=www.sec.gov\" rel=\"nofollow noopener\" target=\"_blank\">www.sec.gov</a>. Details on the Annual Meeting will also be made available on the Bank's website at ir.flagstar.com.</p><p><b><u>Flagstar Bank, N.A.</u></b></p><p>Flagstar Bank, N.A. is one of the largest regional banks in the country and is headquartered in <location idsrc=\"xmltag.org\" value=\"LU/us.ny.hiclle\">Hicksville, New York</location>. At December 31, 2025, the Bank had <money><money>$87.5 billion</money></money> of assets, <money><money>$61.0 billion</money></money> of loans, deposits of <money><money>$66</money></money>.0 billion, and total stockholders' equity of <money><money>$8.1 billion</money></money>. Flagstar Bank, N.A. operates approximately 340 locations across ten states, with strong footholds in the greater <location idsrc=\"xmltag.org\" value=\"LS/us.ny\">New York</location>/<location idsrc=\"xmltag.org\" value=\"LS/us.nj\">New Jersey</location> metropolitan region and in the upper Midwest, along with a significant presence in fast-growing markets in <location idsrc=\"xmltag.org\" value=\"LS/us.fl\">Florida</location> and the West Coast.</p><p><b><u>Cautionary Statements Regarding Forward-Looking Statements</u></b></p><p>This release may include forward‐looking statements by us and our authorized officers pertaining to such matters as our goals, beliefs, intentions, and expectations regarding, among other things: (a) revenues, earnings, loan production, asset quality, liquidity position, capital levels, risk analysis, divestitures, acquisitions, and other material transactions, among other matters; (b) the future costs and benefits of the actions we may take; (c) our assessments of credit risk and probable losses on loans and associated allowances and reserves; (d) our assessments of interest rate and other market risks; (e) our ability to achieve profitability goals within projected timeframes and to execute on our strategic plan, including the sufficiency of our internal resources, procedures and systems; (f) our ability to attract, incentivize, and retain key personnel and the roles of key personnel; (g) our ability to achieve our financial and other strategic goals, including those related to our recent holding company reorganization, which was completed in October 2025 (the \"Reorganization\"), our merger with Flagstar Bancorp, Inc., which was completed in December 2022, our acquisition of substantial portions of the former Signature Bank through an FDIC-assisted transaction, which was completed in March 2023, and our ability to comply with the heightened regulatory standards with respect to governance and risk management programs to which we are subject as a national bank with assets of <money><money>$50 billion</money></money> or more; (h) the impact of the <money><money>$1.05 billion</money></money> capital raise we completed in March 2024; (i) our past material weaknesses in internal control over financial reporting; (j) the conversion or exchange of shares of our preferred stock; (k) the payment of dividends on shares of our capital stock, including adjustments to the amount of dividends payable on shares of our preferred stock; (l) the availability of equity and dilution of existing equity holders associated with future equity awards and stock issuances; (m) the effects of the reverse stock split we effected in July 2024; and (n) the impact of the 2024 sale of our mortgage servicing operations, third party mortgage loan origination business, and mortgage warehouse business.</p><p>Forward‐looking statements are typically identified by such words as \"believe,\" \"expect,\" \"anticipate,\" \"intend,\" \"outlook,\" \"estimate,\" \"forecast,\" \"project,\" \"should,\" \"confident,\" and other similar words and expressions, and are subject to numerous assumptions, risks, and uncertainties, which change over time. Accordingly, actual results or future events could differ, possibly materially, from those anticipated in our statements, and our future performance could differ materially from our historical results. Further, forward‐looking statements speak only as of the date they are made; we do not assume any duty, and do not undertake, to update our forward‐looking statements.</p><p>Our forward‐looking statements are subject to, among others, the following principal risks and uncertainties: general economic conditions and trends, either nationally or locally; conditions in the securities, credit and financial markets; changes in interest rates; changes in deposit flows, and in the demand for deposit, loan, and investment products and other financial services; changes in real estate values; changes in the quality or composition of our loan or investment portfolios, including associated allowances and reserves; changes in future allowance for credit losses, including changes required under relevant accounting and regulatory requirements; the ability to pay future dividends; changes in our capital management and balance sheet strategies and our ability to successfully implement such strategies; our ability to achieve the anticipated benefits of the Reorganization; changes in our Board of Directors and our executive management team; changes in our strategic plan, including changes in our internal resources, procedures and systems, and our ability to successfully implement such plan; changes in competitive pressures among financial institutions or from non‐financial institutions; changes in legislation, regulations, and policies; the impacts of tariffs, sanctions and other trade policies of <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location> and its global trading counterparts; the outcome of federal, state, and local elections and the resulting economic and other impact on the areas in which we conduct business; the impact of changing political conditions or federal government shutdowns; the imposition of restrictions on our operations by bank regulators; the outcome of pending or threatened litigation, or of investigations or any other matters before regulatory agencies, whether currently existing or commencing in the future; our ability to comply with heightened regulatory standards with respect to governance and risk management programs to which we are subject as a national bank with assets of <money><money>$50 billion</money></money> or more; the restructuring of our mortgage business; our ability to recognize anticipated cost savings and enhanced efficiencies with respect to our balance sheet and expense reduction strategies; the impact of failures or disruptions in or breaches of our operational or security systems, data or infrastructure, or those of third parties, including as a result of cyberattacks or campaigns; the impact of natural disasters, extreme weather events, civil unrest, international military conflict, terrorism or other geopolitical events; and a variety of other matters which, by their nature, are subject to significant uncertainties and/or are beyond our control. Our forward-looking statements are also subject to the following principal risks and uncertainties with respect to our merger with Flagstar Bancorp, which was completed in December 2022, and our acquisition of substantial portions of the former Signature Bank through an FDIC-assisted transaction, which was completed in March 2023: the possibility that the anticipated benefits of the transactions will not be realized when expected or at all; the possibility of increased legal and compliance costs, including with respect to any litigation or regulatory actions related to the business practices of acquired companies or the combined business; diversion of management's attention from ongoing business operations and opportunities; the possibility that we may be unable to achieve expected synergies and operating efficiencies in or as a result of the transactions within the expected timeframes or at all; and revenues following the transactions may be lower than expected.</p><p>More information regarding some of these factors is provided in the Risk Factors section of our Annual Report on Form 10‐K for the year ended December 31, 2025 and in other securities reports that we file. Our forward‐looking statements may also be subject to other risks and uncertainties, including those we may discuss in this news release, during investor presentations, or in our securities disclosure filings, which are accessible on our website, on the OCC's website at <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628584-1&amp;h=3554966546&amp;u=https%3A%2F%2Fwww.occ.gov%2F&amp;a=www.occ.gov\" rel=\"nofollow noopener\" target=\"_blank\">www.occ.gov</a> and on the SEC's website, <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628584-1&amp;h=401562052&amp;u=https%3A%2F%2Fwww.sec.gov%2F&amp;a=www.sec.gov\" rel=\"nofollow noopener\" target=\"_blank\">www.sec.gov</a>.</p><p><b>Investor Contact: </b></p><p>Salvatore J. DiMartino <br/>(516) 683-4286</p><p>SOURCE Flagstar Bank, National Association</p></div></article>",
            "link": "https://www.stocktitan.net/news/FLG/flagstar-bank-n-a-announces-june-9th-date-for-its-2026-annual-cboawcgc63pb.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 22:06:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SITE Centers Announces Sale of FlatAcres MarketCenter | SITC Stock News",
            "description": "<article class=\"article\"><p> <location idsrc=\"xmltag.org\" value=\"LU/us.oh.beaood\">BEACHWOOD, Ohio</location>--(BUSINESS WIRE)--SITE Centers Corp. (NYSE: <a class=\"symbol-link\" href=\"/overview/SITC/\" title=\"View SITC stock overview\">SITC</a>) announced today the sale of FlatAcres MarketCenter (<location idsrc=\"xmltag.org\" value=\"LU/us.co.parker\">Parker, CO</location>) for approximately <money><money>$24.4 million</money></money>, prior to closing costs, prorations and other closing adjustments.</p><p><b>About SITE Centers Corp.</b></p><p>SITE Centers is an owner and manager of open-air shopping centers. The Company is a self-administered and self-managed REIT operating as a fully integrated real estate company and is publicly traded on the New York Stock Exchange under the ticker symbol <a class=\"symbol-link\" href=\"/overview/SITC/\" title=\"View SITC stock overview\">SITC</a>. Additional information about the Company is available at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.sitecenters.com%2F&amp;esheet=54435664&amp;newsitemid=20260227971220&amp;lan=en-US&amp;anchor=www.sitecenters.com&amp;index=1&amp;md5=df02e9bca0cc8d371f036bd02adeed10\" rel=\"nofollow noopener\" shape=\"rect\">www.sitecenters.com</a>. To be included in the Company’s e-mail distributions for press releases and other investor news, please click <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.sitecenters.com%2Finvestors%2Finformation-request%2Femail-alerts&amp;esheet=54435664&amp;newsitemid=20260227971220&amp;lan=en-US&amp;anchor=here&amp;index=2&amp;md5=7f718a156b732d41d5f3bed6654345a9\" rel=\"nofollow noopener\" shape=\"rect\">here</a>.</p><p><img alt=\"\" loading=\"lazy\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260227971220r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\"/><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20260227971220/en/\" rel=\"nofollow noopener\">https://www.businesswire.com/news/home/20260227971220/en/</a></span></p><p>For additional information:<br/>Gerry Morgan, EVP and Chief Financial Officer<br/>216-755-5500</p><p>Source: SITE Centers Corp.</p></article>",
            "link": "https://www.stocktitan.net/news/SITC/site-centers-announces-sale-of-flat-acres-market-m3wqkkg3nzdj.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 22:08:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Defence Therapeutics Announces Private Placement of Units for Proceeds of up to $11 Million | DTCFF Stock News",
            "description": "<article class=\"article\"><p>Montreal, Quebec--(Newsfile Corp. - February 27, 2026) - Defence Therapeutics Inc. (CSE: DTC) (OTCQB: <a class=\"symbol-link\" href=\"/overview/DTCFF/\" title=\"View DTCFF stock overview\">DTCFF</a>) (FSE: DTC) (\"Defence\" or the \"Company\"), a publicly traded biotechnology and precision intracellular drug-delivery company, is pleased to announce the launch of a private placement (the \"<b>Private Placement</b>\") of up to 20,000,000 units (the \"<b>Units</b>\") at a price of <money>$0.55</money> per Unit, for aggregate gross proceeds to Defence of up to <money>$11,000,000.</money> Each Unit will be comprised of one common share (each, a \"<b>Share</b>\") and one common share purchase warrant (\"<b>Warrants</b>\"). Each Warrant will entitle its holder to acquire an additional common share of the Company at a price of <money>$0.65</money> per share for 24 months following the date of issuance.</p><p>The Company has executed a binding term sheet with two arm's length institutional investors (collectively, the \"<b>Investors</b>\") in connection with the Private Placement for aggregate gross proceeds of <money>$6,000,000</money> (CAD) (the \"<b>Investors' Proceeds</b>\"). In connection with the Private Placement, the Investors' Proceeds and the Units will be deposited in escrow in advance of closing pursuant to an escrow agreement (the \"<b>Escrow Agreement</b>\"). Upon closing, the Units will be released from escrow and delivered to the Investors or as they may direct, and the Investors' Proceeds will be released from escrow and deposited as credit support pursuant to an ISDA Credit Support Annex, and released to the Company in monthly cash tranches of <money>$333,333</money> (CAD) over an 18-month period (the \"<b>Term</b>\"), pursuant to the terms and conditions of a sharing agreement (the \"<b>Sharing Agreement</b>\") to be dated and executed on the closing of the Private Placement. Settlements under the Sharing Agreement shall commence five months after closing. </p><p>Pursuant to the Sharing Agreement, Shares will be released in equal monthly installments of approximately 606,060 Shares over the 18-month Term, with each release contingent upon the corresponding cash payment being delivered to the Company. The Sharing Agreement shall provide that the Company's economic interest will be determined in 18 monthly settlement tranches as measured against a benchmark price of <money>$0.73</money>32 (CAD) per Share (the \"<b>Benchmark Price</b>\"). If, at the time of settlement, the settlement price (determined monthly based on a 20-day volume-weighted average trading price of the Company's shares on the CSE) exceeds the Benchmark Price, the Company shall receive more than <percent>100%</percent> of the monthly settlement due, on a pro rata basis, with no upper limit on additional proceeds. If the settlement price is below the Benchmark Price, the Company will receive less than <percent>100%</percent> of the monthly settlement due, on a pro rata basis. In no event will a decline in the settlement price result in an increase in the number of Shares being issued to the Investors. As a result, the Company may ultimately receive more or materially less than the original proceeds of <money>$6,000,000. T</money>he final amount received will depend on the Company's future share price, which is subject to market fluctuations and may vary over time. Accordingly, there is no assurance as to the total amount the Company will receive under the Sharing Agreement. </p><p>All 10,909,091 Warrants to be issued shall be exercisable at an exercise price of <money>$0.65</money> (CAD) per Share for a period of 24 months following the date of issuance. The Warrants will include an equity blocker provision that prohibits the holder from exercising any portion of the Warrants if such exercise would result in the holder owning more than <percent>9.99%</percent> of the Company's outstanding Shares.</p><p>The Investors will receive a corporate finance fee of <money>$360,000</money> (CAD) in connection with the Sharing Agreement, payable in cash or via the issuance of 654,546 Units at the Private Placement price, at the election of the Company (the \"<b>Fee</b>\").</p><p>The Company has agreed to pay a non-refundable deposit of <money>$65,000</money> (CAD) (the \"<b>Deposit</b>\") upon receipt of approval from the CSE in connection with the Private Placement. The Deposit shall be satisfied by the issuance of 118,182 Units at the Private Placement price. </p><p>Defence intends to use the proceeds from the Private Placement to advance its Antibody Drug Conjugate (\"ADC\") and Radiopharmaceutical programs, to develop partnerships and for working capital purposes. The Company may pay a finder's fee in connection with the offering to eligible arm's-length finders in accordance with the policies of the Canadian Securities Exchanges. </p><p>Pursuant to applicable Canadian securities laws and in accordance with the Exchange policies, all securities issued under this Private Placement will be subject to applicable resale restrictions under applicable securities laws. The closing of the Private Placement is expected on or about March 6, 2026, subject to the approval of the CSE.  </p><p>The Units described herein have not been, and will not be, registered under the <i>U.S. Securities Act</i> or any state securities laws, and accordingly, may not be offered or sold within the United States except in compliance with the registration requirements of the <i>U.S. Securities Act</i> and applicable state securities requirements or pursuant to exemptions there from. This press release does not constitute an offer to sell or a solicitation to buy any securities in any jurisdiction.</p><p><u><b>About Defence Therapeutics:<br/></b></u>Defence Therapeutics is a publicly traded biotechnology company committed to making cancer treatment more effective and safer. Using its Accum<sup>®</sup> precision drug delivery platform, Defence is working to enhance the potency of ADCs and other complex biologics at lower doses, with the goal of reducing side effects and improving access to advanced therapies. By pursing cutting edge science, and collaborating with pharma and biotech partners, Defence strives to bring transformative therapies to patients who need them most. To learn more about Defence Therapeutics and explore partnering opportunities, please visit <a href=\"https://api.newsfilecorp.com/redirect/y4vbJSbZDE\" rel=\"nofollow noopener\">www.defencetherapeutics.com</a> or contact <a href=\"mailto:info@defencetherapeutics.com\" rel=\"nofollow noopener\">info@defencetherapeutics.com</a>.</p><div id=\"contactInfo\"><p>For further information:<br/>Defence Therapeutics<br/>Sebastien Plouffe<br/>CEO, Founder and Director<br/>P: (514) 947-2272<br/><a href=\"mailto:Splouffe@defencetherapeutics.com\" rel=\"nofollow noopener\">Splouffe@defencetherapeutics.com</a> <br/><a href=\"https://api.newsfilecorp.com/redirect/1KQayiRb4k\" rel=\"nofollow noopener\">www.defencetherapeutics.com</a></p></div><p><b>Cautionary Statement Regarding \"Forward-Looking\" Information<br/></b>This release includes certain statements that may be deemed \"forward-looking statements\". All statements in this release, other than statements of historical facts, that address events or developments that the Company expects to occur, are forward-looking statements. Forward-looking statements are statements that are not historical facts and are generally, but not always, identified by the words \"expects\", \"plans\", \"anticipates\", \"believes\", \"intends\", \"estimates\", \"projects\", \"potential\" and similar expressions, or that events or conditions \"will\", \"would\", \"may\", \"could\" or \"should\" occur. Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results may differ materially from those in the forward-looking statements. Factors that could cause the actual results to differ materially from those in forward-looking statements include regulatory actions, market prices, and continued availability of capital and financing, and general economic, market or business conditions. Investors are cautioned that any such statements are not guarantees of future performance and actual results or developments may differ materially from those projected in the forward-looking statements. Forward-looking statements are based on the beliefs, estimates and opinions of the Company's management on the date the statements are made. Except as required by applicable securities laws, the Company undertakes no obligation to update these forward-looking statements in the event that management's beliefs, estimates or opinions, or other factors, should change.</p><p>Neither the CSE nor its market regulator, as that term is defined in the policies of the CSE, accepts responsibility for the adequacy or accuracy of this release.</p><p id=\"corporateNewsLogoContainer\"><img alt=\"Corporate Logo\" id=\"corporateNewsLogo\" loading=\"lazy\" src=\"https://images.newsfilecorp.com/files/8000/285714_2017078dc44e0af6_logo.jpg\"/></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/A8qvATpv8x\" rel=\"nofollow noopener\">https://www.newsfilecorp.com/release/285714</a></p><p><img alt=\"\" loading=\"lazy\" src=\"https://api.newsfilecorp.com/newsinfo/285714/375\"/></p></article>",
            "link": "https://www.stocktitan.net/news/DTCFF/defence-therapeutics-announces-private-placement-of-units-for-xwm4afi9tbzq.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 22:00:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump Media & Technology Group Reports Full-Year 2025 Results | DJT Stock News",
            "description": "<article class=\"article\"><p align=\"center\">~ <em><money>$2.5 Billion</money> in Financial Assets </em>~<br/>~ <em>Positive Operating Cash Flow for 2025 </em>~<br/>~ $<em>44 Million in Cash Proceeds from Options Strategy</em> ~</p> <p>SARASOTA, Fla., Feb.  27, 2026  (GLOBE NEWSWIRE) -- Trump Media and Technology Group Corp. (Nasdaq: <a class=\"symbol-link\" href=\"/overview/DJT/\" title=\"View DJT stock overview\">DJT</a>) (\"TMTG\" or the \"Company\"), operator of the social media platform Truth Social, the video streaming service Truth+, and the financial services and FinTech brand Truth.Fi, announced its financial results for the full year ending on December 31, 2025. These results are included in TMTG's Annual Report on Form 10-K that will be filed with the Securities and Exchange Commission (the \"SEC\") today.</p> <p>TMTG closed 2025 with financial assets of approximately <money>$2.5 billion</money> comprising cash, restricted cash, short-term investments, equity securities, note receivable, digital assets, and digital assets pledged—more than tripling the Company’s <money>$776.8 million</money> in financial assets at the end of 2024. These holdings position TMTG to continue pursuing all its key strategic objectives including:</p> <ul type=\"disc\"><li style=\"margin-bottom:8pt;\">continuing to implement its mergers and acquisitions strategy;</li><li style=\"margin-bottom:8pt;\">further expanding the Truth Social and Truth+ platforms;  </li><li style=\"margin-bottom:8pt;\">robustly growing the Truth.Fi brand including its newly launched slates of exchange traded funds (\"ETFs\") and separately managed accounts (“SMAs”); and</li><li style=\"margin-bottom:8pt;\">continuing to integrate the Company’s cryptocurrency strategy into its operations and financial planning.<br/><br/></li></ul> <p>The Company achieved a milestone by reporting positive operating cash flow of <money>$14.8 million</money> for 2025, including positive and growing cash flow in each of the last three quarters—as compared to a <money>$61.0 million</money> operating cash outflow for 2024. Having achieved positive operating cash flow for a calendar year less than two years after going public, TMTG believes its diversification, acquisitions, and growth strategies position the Company for future revenue growth and long-term shareholder value creation.</p> <p>Furthermore, as part of its bitcoin treasury hedging activities, TMTG earned <money>$44.0 million</money> in cash proceeds through its covered-put options strategy.</p> <p>TMTG CEO and Chairman Devin Nunes said,\"TMTG has entered a crucial period in our expansion and diversification. Since going public in March 2024, our financial assets have grown from roughly <money>$200 million</money> to approximately <money>$2.5 billion</money> at the end of 2025. We now have positive operating cash flow bolstered partly by the cash proceeds from our options strategy. The strength of our balance sheet has enabled the company to rigorously carry out our mergers and acquisitions strategy while launching new products and services such as our Truth.Fi financial products. We look forward to continuing our momentum in 2026 and beyond, positioning TMTG as a leader in the America First economy.\"</p> <p>For 2025, TMTG had a <money>$712.3 million</money> consolidated net loss, most of which comprised unrealized losses stemming from a drop in the price of digital assets and digital asset related securities. This included non-cash losses related to changes in the fair value of digital assets and digital assets pledged (<money>$403.2 million</money>) and non-cash losses stemming from the fair value mark to market of digital asset related securities (<money>$178.8 million</money>). The figure also includes <money>$59.2 million</money> in non-cash stock-based compensation and <money>$27.0 million</money> in non-cash interest expense on outstanding debt, leading to consolidated adjusted EBITDA loss of <money>$664.4 million</money>. The Company posted <money>$3.7 million</money> in revenue for the year.</p> <p><strong>About TMTG</strong></p> <p>The mission of Trump Media is to end Big Tech's s assault on free speech by opening up the Internet and giving people their voices back. Trump Media operates Truth Social, a social media platform established as a safe harbor for free expression amid increasingly harsh censorship by Big Tech corporations; Truth+, a TV streaming platform focusing on family friendly live TV channels and on-demand content; and Truth.Fi, a financial services and FinTech brand incorporating America First investment vehicles.</p> <p><strong>Investor Relations Contact </strong></p> <p>Shannon Devine (MZ Group | Managing Director - MZ North America) Email: <a href=\"https://www.globenewswire.com/Tracker?data=b2PLLFMTgLCRY9qq0DLPn5U2r3nccjWNvYhu4ZZWocb8MmjiKTcUAiPXxRrrWokbk423-1vz4y9500yjQRzkvyvSE9kCYFNjg_j2oHwsLSJv5Fj71U3fgp8N2OX6W13e\" rel=\"nofollow noopener\" target=\"_blank\">shannon.devine@mzgroup.us</a></p> <p><strong>Media Contact </strong></p> <p>press@tmtgcorp.com</p> <p><strong>Important Information About the Proposed Transaction and Where to Find It </strong></p> <p>In connection with TMTG’s merger with TAE Technologies (the \"Proposed Transaction\"), TMTG intends to file with the U.S. Securities and Exchange Commission (the \"SEC\") a registration statement on Form S-4 to register the common stock of TMTG (\"TMTG Shares\") to be issued in connection with the Proposed Transaction. The registration statement will include a document that serves as a proxy statement and prospectus of TMTG and consent solicitation statement of TAE (the \"proxy statement/prospectus and consent solicitation statement\"), and TMTG will file other documents regarding the Proposed Transaction with the SEC. This document is not a substitute for the registration statement, the proxy statement/prospectus and consent solicitation statement, or any other document that TMTG may file with the SEC. BEFORE MAKING ANY VOTING DECISION, INVESTORS AND SECURITY HOLDERS ARE URGED TO READ THE REGISTRATION STATEMENT, THE PROXY STATEMENT/PROSPECTUS AND CONSENT SOLICITATION STATEMENT, AND ANY OTHER RELEVANT DOCUMENTS THAT MAY BE FILED WITH THE SEC, AS WELL AS ANY AMENDMENTS OR SUPPLEMENTS TO THOSE DOCUMENTS, CAREFULLY AND IN THEIR ENTIRETY IF AND WHEN THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION ABOUT TMTG AND TAE, THE PROPOSED TRANSACTION, THE RISKS RELATED THERETO, AND RELATED MATTERS.</p> <p>After the registration statement has been declared effective, a definitive proxy statement will be mailed to the shareholders of TMTG (the \"TMTG Shareholders\") and a prospectus and consent solicitation statement will be sent to the stockholders of TAE. Investors and security holders will be able to obtain free copies of the registration statement and the proxy statement/prospectus and consent solicitation statement, as each may be amended or supplemented from time to time, and other relevant documents filed by TMTG with the SEC (if and when they become available) through the website maintained by the SEC at www.sec.gov. Copies of documents filed with the SEC by TMTG, including the proxy statement/prospectus and consent solicitation statement (when available), will be available free of charge from TMTG's website at tmtgcorp.com under the \"Investors\" tab.</p> <p><strong>Participants in the Solicitation </strong></p> <p>TMTG and certain of its directors and executive officers and TAE and certain of its directors and executive officers, may be deemed to be participants in the solicitation of proxies from the TMTG Shareholders with respect to the Proposed Transaction under the rules of the SEC. Information regarding the names, affiliations and interests of certain of TMTG's directors and executive officers in the solicitation by reading TMTG's Annual Report on Form 10-K for the fiscal year ended December 31, 2025 filed with the SEC on February 27, 2026, TMTG's subsequent Quarterly Reports on Form 10-Q filed with the SEC, TMTG's definitive proxy statement for the 2025 annual meeting of shareholders filed with the SEC on March 18, 2025 and the proxy statement/prospectus and consent solicitation statement and other relevant materials filed with the SEC in connection with the Proposed Transaction when they become available. Free copies of these documents may be obtained as described in the paragraphs above. Information regarding the persons who may, under the rules of the SEC, be deemed participants in the solicitation of the TMTG Shareholders in connection with the Proposed Transaction, including a description of their direct and indirect interests, by security holdings or otherwise, will also be set forth in the proxy statement/prospectus and consent solicitation statement and other relevant materials when filed with the SEC.</p> <p><strong>Cautionary Statement About Forward-Looking Statements </strong></p> <p>This communication contains forward-looking statements within the meaning of the U.S. federal securities laws, including regarding, among other things, the plans, strategies, and prospects, both business and financial, of TMTG, its current expectations and projections about future events such as TMTG's Proposed Transaction with TAE, TMTG's ability to consummate the Proposed Transaction, the benefits of the Proposed Transaction and the combined company's future financial performance, as well as the combined company's strategy, future operations, estimated financial position, estimated revenues and losses, projected costs, prospects, plans and objectives of management. These statements are based on current expectations and assumptions and are subject to risks and uncertainties that could cause actual results to differ materially. Words such as \"anticipate,\" \"believe,\" \"expect,\" \"intend,\" \"may,\" \"plan,\" \"project,\" \"should,\" \"will\" and similar expressions are intended to identify forward-looking statements, though not all forward-looking statements contain these identifying words, and the absence of these words does not mean that a statement is not forward-looking. Forward-looking statements are predictions, projections and other statements about future events or conditions that are based on current expectations and assumptions and, as a result, are subject to risks and uncertainties. Many factors could cause future results, performance or achievements expressed or implied by the forward-looking statements to differ materially from the forward-looking statements in this communication, including, but not limited to, risks related to TMTG's or TAE's ability to demonstrate and execute on commercial viability of its technology; legal proceedings; ability to obtain financing on acceptable terms or at all; changes in digital asset valuations; disruption to TMTG's operations; TMTG's ability to develop and maintain key strategic relationships; competition in TMTG's industry; ability to access required materials at acceptable costs; delays in the development and manufacturing of fusion power plants and related technology; ability to manage growth effectively; possibility of incurring losses in the future and not being able to achieve or maintain profitability; potential generation capacities of specific reactor designs; regulatory outlook; future market conditions; success of strategic partnerships; developments in the capital and credit markets; future financial, operational and cost performance; revenue generation; demand for nuclear energy; economic outlook and public perception of the nuclear energy industry; changes in laws or regulations; ability to obtain required regulatory approvals on a timely basis or at al; ability to protect intellectual property; adverse economic or competitive conditions; and other risks and uncertainties. In addition, TMTG cautions you that the forward-looking statements contained in this communication are subject to the following factors: (i) the occurrence of any event, change or other circumstances that could delay site selection or the Proposed Transaction or give rise to the termination of the agreements related thereto; (ii) the outcome of any legal proceedings that may be instituted against TMTG or TAE with respect to site selection or the Proposed Transaction; (iii) the inability to complete the Proposed Transaction due to the failure to obtain approval of the shareholders of TMTG or TAE, or other conditions to closing in the merger agreement; (iv) the risk that the Proposed Transaction disrupts TMTG's current plans and operations as a result of the announcement of the Proposed Transaction; (v) TMTG's ability to realize the anticipated benefits of the Proposed Transaction, which may be affected by, among other things, competition and the ability of TMTG to grow and manage growth profitably following the Proposed Transaction; and (vi) costs related to the Proposed Transaction, site selection or construction. The forward-looking statements in this press release are based upon information available to TMTG as of the date of this press release and, while TMTG believes such information forms a reasonable basis for such statements, these statements are inherently uncertain, and you are cautioned not to unduly rely upon these statements. Except as required by applicable law, TMTG does not plan to publicly update or revise any forward-looking statements contained in this press release, whether as a result of any new information, future events or otherwise. Additional information concerning these and other factors that may impact the operations and projections discussed herein can be found in TMTG's periodic filings with the SEC, including TMTG's Annual Report on Form 10-K for the fiscal year ended December 31, 2025, TMTG's subsequent Quarterly Reports on Form 10-Q and in the Form S-4, when filed, and in other documents filed by TMTG from time to time with the SEC. TMTG's SEC filings are available publicly on the SEC's website at www.sec.gov. These filings do or will identify and address other important risks and uncertainties that could cause actual events and results to differ materially from those contained in the forward-looking statements. There may be additional risks that TMTG presently knows or that TMTG currently believes are immaterial that could also cause actual results to differ from those contained in the forward-looking statements.</p> <p>Forward-looking statements speak only as of the date they are made. Readers are cautioned not to put undue reliance on forward-looking statements, and TMTG assumes no obligation and does not intend to update or revise these forward‑looking statements, whether as a result of new information, future events, or otherwise. TMTG does not give any assurance that TMTG will achieve its expectations. The inclusion of any statement in this communication does not constitute an admission by TMTG or any other person that the events or circumstances described in such statement are material.</p> <p><strong>No Offer or Solicitation </strong></p> <p>This communication is not intended to and does not constitute an offer to buy or sell or the solicitation of an offer to buy or sell any securities, or a solicitation of any vote or approval, nor shall there be any sale of securities in any jurisdiction in which such offer, solicitation, or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. No offer of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the Securities Act of 1933, as amended.</p> <img alt=\"\" class=\"__GNW8366DE3E__IMG\" loading=\"lazy\" src=\"https://www.globenewswire.com/newsroom/ti?nf=OTY2MzE4NCM3NDYwMTM3IzIyMjUyMDg=\"/> <br/><img alt=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\" src=\"https://ml.globenewswire.com/media/MWMwMWM3MGYtZGM1My00MjAyLTk3NjctZTRlY2E3NDI1OGNjLTEyMzY3NjEtMjAyNi0wMi0yNy1lbg==/tiny/Trump-Media-Technology-Group.png\"/></article>",
            "link": "https://www.stocktitan.net/news/DJT/trump-media-technology-group-reports-full-year-2025-4mvfx7xljcai.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 22:05:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sturm, Ruger & Company, Inc. to Report Fourth Quarter and Year-End 2025 Financial Results on Monday, March 2 | RGR Stock News",
            "description": "<article class=\"article\"><p> <location idsrc=\"xmltag.org\" value=\"LU/us.nc.maydan\">MAYODAN, N.C.</location>--(BUSINESS WIRE)--Sturm, Ruger &amp; Company, Inc. (NYSE: <a class=\"symbol-link\" href=\"/overview/RGR/\" title=\"View RGR stock overview\">RGR</a>) will announce its financial results for the fourth quarter and year-end 2025 and file its Annual Report on Form 10-K on Monday, March 2, 2026, after the close of the stock market.</p><p>That evening, Sturm, Ruger will host a webcast at 4:30 p.m. ET to discuss the fourth quarter and year-end 2025 operating results. Interested parties can listen to the webcast via <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fevents.q4inc.com%2Fattendee%2F795010980&amp;esheet=54435267&amp;newsitemid=20260227495435&amp;lan=en-US&amp;anchor=this+link&amp;index=1&amp;md5=87d5cdf2ed3f2b4ec795bc667170f6c1\" rel=\"nofollow noopener\" shape=\"rect\"><b>this link</b></a> or by visiting <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fruger.com%2Fcorporate&amp;esheet=54435267&amp;newsitemid=20260227495435&amp;lan=en-US&amp;anchor=Ruger.com%2Fcorporate&amp;index=2&amp;md5=f5087e84d701b19088f27d847f5be848\" rel=\"nofollow noopener\" shape=\"rect\"><b>Ruger.com/corporate</b></a>. Those who wish to ask questions during the webcast will need to <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fevents.q4inc.com%2Fanalyst%2F795010980%3Fpwd%3Dn8I1hhOj&amp;esheet=54435267&amp;newsitemid=20260227495435&amp;lan=en-US&amp;anchor=pre-register&amp;index=3&amp;md5=84ad880284c65f3eae1865c5189de64f\" rel=\"nofollow noopener\" shape=\"rect\"><b>pre-register</b></a> prior to the meeting.</p><p>The Form 10-K will be available on the SEC website at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.sec.gov&amp;esheet=54435267&amp;newsitemid=20260227495435&amp;lan=en-US&amp;anchor=SEC.gov&amp;index=4&amp;md5=490992c84242e63e8ec9ef64b4f27299\" rel=\"nofollow noopener\" shape=\"rect\"><b>SEC.gov</b></a> and the Ruger website at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fruger.com%2Fcorporate&amp;esheet=54435267&amp;newsitemid=20260227495435&amp;lan=en-US&amp;anchor=Ruger.com%2Fcorporate&amp;index=5&amp;md5=ae67f02cb98df61f3e7d6a34c241eaa7\" rel=\"nofollow noopener\" shape=\"rect\"><b>Ruger.com/corporate</b></a> as soon as practicable after the filing. Concurrent with the filing of the Form 10-K, an earnings release containing the 2025 financial statements will be issued. We urge investors to read our complete Form 10-K in order to have adequate information to make informed investment decisions.</p><p class=\"bwalignc\"><i>About Sturm, Ruger &amp; Co., Inc.</i></p><p class=\"bwalignc\"><i>Sturm, Ruger &amp; Co., Inc. is one of the nation's leading manufacturers of rugged, reliable firearms for the commercial sporting market. With products made in America, Ruger offers consumers almost 800 variations of more than 40 product lines, across the Ruger, Marlin and Glenfield brands. For over 75 years, Sturm, Ruger &amp; Co., Inc. has been a model of corporate and community responsibility. Our motto, \"Arms Makers for Responsible Citizens®,\" echoes our commitment to these principles as we work hard to deliver quality and innovative firearms.</i></p><p class=\"bwalignc\"><i>The Company may, from time to time, make forward-looking statements and projections concerning future expectations. Such statements are based on current expectations and are subject to certain qualifying risks and uncertainties, such as market demand, sales levels of firearms, anticipated castings sales and earnings, the need for external financing for operations or capital expenditures, the results of pending litigation against the Company, the impact of future firearms control and environmental legislation, and accounting estimates, any one or more of which could cause actual results to differ materially from those projected. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date made. The Company undertakes no obligation to publish revised forward-looking statements to reflect events or circumstances after the date such forward-looking statements are made or to reflect the occurrence of subsequent unanticipated events.</i></p><p class=\"bwalignc\"><i>Sturm, Ruger &amp; Co., Inc. \"Arms Makers for Responsible Citizens®\"</i></p><p><img alt=\"\" loading=\"lazy\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260227495435r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\"/><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20260227495435/en/\" rel=\"nofollow noopener\">https://www.businesswire.com/news/home/20260227495435/en/</a></span></p><p>Sturm, Ruger &amp; Co., Inc.<br/>700 S Ayersville Rd<br/><location idsrc=\"xmltag.org\" value=\"LU/us.nc.maydan\">Mayodan, NC</location> 27027<br/><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.ruger.com&amp;esheet=54435267&amp;newsitemid=20260227495435&amp;lan=en-US&amp;anchor=www.ruger.com&amp;index=6&amp;md5=f4555473c32c301bee0b1883c4b2293a\" rel=\"nofollow noopener\" shape=\"rect\">www.ruger.com</a><br/>203-259-7843</p><p>Source: Sturm, Ruger &amp; Company, Inc.</p></article>",
            "link": "https://www.stocktitan.net/news/RGR/sturm-ruger-company-inc-to-report-fourth-quarter-and-year-end-2025-4nm1y2m687c5.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 22:05:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Elong Power Holding Limited Announces Closing of US$7.0 Million Public Offering | ELPW Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/cn..beijng\">BEIJING</location></span>, <span class=\"legendSpanClass\">Feb. 27, 2026</span> /PRNewswire/ -- Elong Power Holding Limited (<span id=\"spanHghlt36f5\">NASDAQ</span>: <a class=\"symbol-link\" href=\"/overview/ELPW/\" title=\"View ELPW stock overview\">ELPW</a>) (\"Elong Power\" or the \"Company\"), a provider of high power battery technologies for commercial and specialty alternative energy vehicles and energy storage systems, today announced the closing of its underwritten public offering (the \"Offering\") of 21,700,000 Units on a firm commitment basis, at a price of <money>US<money>$0.32</money>31</money> per Unit. Each Unit consists of one Class A ordinary share, par value of <money>US<money>$0.00</money>016</money> per share (each a \"Class A Ordinary Share\"), of the Company and one common warrant (each a \"Common Warrant\") to purchase one Class A Ordinary Share.</p><p>Each Common Warrant will expire three years from the date of issuance, and is exercisable immediately on the date of issuance at an exercise price of <money>US<money>$0.32</money>31</money> per share, subject to adjustment on March 3, 2026 and March 6, 2026 to the price that is equal to <percent>70%</percent> and <percent>50%</percent>, respectively, of the initial exercise price of the Common Warrants, and the number of Class A Ordinary Shares underlying the Common Warrants will be proportionately increased. The Common Warrants may also be exercised on a zero cash exercise option pursuant to which the holder may exchange each Common Warrant for twice the number of Class A Ordinary Shares issuable on a cash exercise of such Common Warrant.</p><p>The Company has granted the underwriter a 45-day option to purchase up to 3,255,000 additional Class A Ordinary Shares and/or 3,255,000 additional Common Warrants, at its respective public offering price less underwriting discounts and commissions, to cover any over-allotment. On February 27, 2026, the underwriter partially exercised such option with respect to 3,255,000 Common Warrants.</p><p>The company received total gross proceeds of approximately <money>US<money>$7.0 million</money></money>, before deducting underwriting discounts and other offering expenses. The Company intends to use the proceeds from the Offering for general corporate purposes and working capital.</p><p>Maxim Group LLC acted as the exclusive underwriter. Ortoli Rosenstadt LLP acted as <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> securities counsel to the Company, and Pryor Cashman LLP acted as <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> securities counsel to the underwriter, in connection with the Offering.</p><p>A registration statement on F-1 (File No. 333-293527) was filed with the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> Securities and Exchange Commission (\"SEC\") and was declared effective by the SEC on February 25, 2026. The Offering was made only by means of a prospectus forming part of the effective registration statements. A final prospectus relating to the Offering was filed with the SEC and is available on the SEC's website at <a href=\"http://www.sec.gov/\" rel=\"nofollow noopener\" target=\"_blank\">www.sec.gov</a>.</p><p>This press release has been prepared for informational purposes only and shall not constitute an offer to sell or the solicitation of an offer to buy any securities, and no sale of these securities may be made in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or other jurisdiction.</p><p><b>About Elong Power</b></p><p>Elong Power Holding Limited, a <location idsrc=\"xmltag.org\" value=\"LC/ky\">Cayman Islands</location> exempted company, is committed to the research and development, manufacturing, sales and service of high-power lithium-ion batteries for electric vehicles and construction machinery, as well as large-capacity, long-cycle lithium-ion batteries for energy storage systems. Elong Power is led by Ms. Xiaodan Liu, Elong Power's Chairwoman and CEO.</p><p>Elong Power has a comprehensive product and technology system that includes battery cells, modules, system integration, and battery management system development, based on high-power lithium-ion batteries and battery system products for long-cycle energy storage devices. Elong Power offers advanced energy applications and full life cycle services. Its product portfolio includes products utilizing lithium manganese oxide and lithium iron phosphate, among others, to meet the needs of high-power applications and energy storage applications in various scenarios.</p><p><b>Forward-looking Statements</b></p><p>This press release may contain \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934, including statements regarding the benefits of the transaction, the anticipated timing of the transaction, the products offered by Elong Power and the markets in which it operates, and Elong Power's projected future results. These forward-looking statements generally are identified by the words \"believe,\" \"project,\" \"expect,\" \"anticipate,\" \"estimate,\" \"intend,\" \"strategy,\" \"future,\" \"opportunity,\" \"plan,\" \"may,\" \"should,\" \"will,\" \"would,\" \"will be,\" \"will continue,\" \"will likely result,\" and similar expressions. Forward-looking statements are predictions, projections and other statements about future events that are based on current expectations and assumptions and, as a result, are subject to risks and uncertainties. Many factors could cause actual future events to differ materially from the forward-looking statements in this document, including, but not limited to: the ability of Elong Power to maintain the listing of its securities on Nasdaq; the fact that the price of Elong Power's securities may be volatile due to a variety of factors, including changes in the competitive and highly regulated industries in which Elong Power operates; variations in performance across competitors; changes in laws and regulations affecting Elong Power's business and changes in its capital structure; the ability to implement business plans, meet forecasts and other expectations; its need for substantial additional funds; the parties' dependence on third-party suppliers; risks relating to the results of research and development activities, market and other conditions; its ability to attract, integrate, and retain key personnel; risks related to its growth strategy; risks related to patent and intellectual property matters; and the ability to obtain, perform under and maintain financing and strategic agreements and relationships. Accordingly, these forward-looking statements do not constitute guarantees of future performance, and you are cautioned not to place undue reliance on these forward-looking statements. Risks regarding Elong Power's business are described in detail in Elong Power's SEC filings which are available on the SEC's website at <a href=\"https://www.sec.gov\" rel=\"nofollow noopener\" target=\"_blank\">www.sec.gov</a>, including in Elong Power's Annual Report on Form 20-F and Elong Power's subsequent filings with the SEC. These forward-looking statements speak only as of the date hereof, and Elong Power expressly disclaims any obligation or undertaking to release publicly any updates or revisions to any forward-looking statements contained herein to reflect any change in our expectations or any changes in events, conditions, or circumstances on which any such statement is based, except as required by law.</p><p><b>For investor and media inquiries, please contact:</b></p><p>Elong Power Investor Contact<br/><b><a href=\"mailto:ir@elongpower.com\" rel=\"nofollow noopener\" target=\"_blank\">ir@elongpower.com</a></b></p><p>SOURCE Elong Power Holding Limited</p></div></article>",
            "link": "https://www.stocktitan.net/news/ELPW/elong-power-holding-limited-announces-closing-of-us-7-0-million-44rhn20abv3d.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:30:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NEUBERGER ENERGY INFRASTRUCTURE AND INCOME FUND ANNOUNCES MONTHLY DISTRIBUTION | NML Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.ny.nyc\">NEW YORK</location></span>, <span class=\"legendSpanClass\">Feb. 27, 2026</span> /PRNewswire/ -- Neuberger Energy Infrastructure and Income Fund Inc. (<b>NYSE American: NML</b>) (the \"Fund\") has announced a distribution declaration of <money><money>$0.05</money>84</money> per share of common stock. The distribution announced today is payable on March 31, 2026, has a record date of March 16, 2026, and has an ex-date of March 16, 2026.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\"><p><a href=\"https://mma.prnewswire.com/media/75472/neuberger_berman_group_llc_logo.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"Neuberger Berman Logo (PRNewsFoto/Neuberger Berman Group LLC)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/75472/neuberger_berman_group_llc_logo.jpg\" title=\"Neuberger Berman Logo (PRNewsFoto/Neuberger Berman Group LLC)\"/></a></p></div><p>The Fund currently intends to make regular monthly cash distributions to holders of its common stock at a fixed rate per share, to be determined based on the projected net rate of return of the Fund's investments as well as other factors, subject to ongoing review and adjustment from time to time. The Fund currently intends to pay its regular monthly distributions out of its distributable cash flow, which generally consists of (1) cash and paid-in-kind distributions from master limited partnerships (\"MLPs\") or their affiliates, dividends from common stocks, interest from debt instruments and income from other investments held by the Fund less (2) current or accrued operating expenses, including leverage costs, if any, and taxes on its taxable income.</p><p>The Fund expects that a portion of its distributions to stockholders will constitute a non-taxable return of capital. A \"return of capital\" is a distribution by the Fund which represents a return of a common stockholder's original investment and should not be confused with a dividend. To the extent the Fund pays a return of capital, a common stockholder's basis in Fund shares will be reduced, which will increase a capital gain or reduce a capital loss upon sale of those shares. There is no assurance that the Fund will always be able to pay a distribution of any particular amount, or that a distribution will consist solely of the Fund's current and accumulated earnings and profits. </p><p>In compliance with Section 19 of the Investment Company Act of 1940, as amended, a notice would be provided for any distribution that does not consist solely of net investment income. The notice would be for informational purposes and not for tax reporting purposes, and would disclose, among other things, estimated portions of the distribution, if any, consisting of net investment income, capital gains and return of capital. The final determination of the source and tax characteristics of all distributions paid in 2026 will be made after the end of the year.</p><p>The Fund is subject to federal income tax on its taxable income, unlike most investment companies. Any taxes paid by the Fund will reduce the amount available to pay distributions to stockholders, and therefore investors in the Fund will likely receive lower distributions than if they invested directly in MLPs.</p><p><b>About Neuberger </b></p><p>Neuberger is an employee-owned, private, independent investment manager founded in 1939 with approximately 3,000 employees across 27 countries. The firm manages <money><money>$563 billion</money></money> of equities, fixed income, private equity, real estate and hedge fund portfolios for global institutions, advisors and individuals. Neuberger's investment philosophy is founded on active management, fundamental research and engaged ownership. The firm is proud to be recognized for its commitment to its two constituents, clients and employees. Again in 2025, we were named Best Asset Manager for Institutional Investors in the US (Crisil Coalition Greenwich) and the #1 Best Place to Work in Money Management (Pensions &amp; Investments, firms with more than 1,000 employees). Neuberger has no corporate parent or unaffiliated external shareholders. Visit <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629291-3&amp;h=2684408707&amp;u=http%3A%2F%2Fwww.nb.com%2F&amp;a=www.nb.com\" rel=\"nofollow noopener\" target=\"_blank\">www.nb.com</a> for more information, including <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629291-3&amp;h=1316077240&amp;u=http%3A%2F%2Fwww.nb.com%2Fdisclosure-global-communications&amp;a=www.nb.com%2Fdisclosure-global-communications\" rel=\"nofollow noopener\" target=\"_blank\">www.nb.com/disclosure-global-communications</a> for information on awards. Data as of December 31, 2025.</p><p>Statements made in this release that look forward in time involve risks and uncertainties. Such risks and uncertainties include, without limitation, the adverse effect from a decline in the securities markets or a decline in the Fund's performance, a general downturn in the economy, competition from other closed end investment companies, changes in government policy or regulation, inability of the Fund's investment adviser to attract or retain key employees, inability of the Fund to implement its investment strategy, inability of the Fund to manage rapid expansion and unforeseen costs and other effects related to legal proceedings or investigations of governmental and self-regulatory organizations.</p><p><b>Contact:<br/></b><span>Neuberger</span><span> Berman Investment Advisers LLC<br/></span>Investor Information<br/>(877) 461-1899</p><p>SOURCE Neuberger Berman</p></div></article>",
            "link": "https://www.stocktitan.net/news/NML/neuberger-energy-infrastructure-and-income-fund-announces-monthly-llr0a4zpcnpf.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:30:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "StoneCo Announces Successful Closing of Linx Sale | STNE Stock News",
            "description": "<article class=\"article\"><p>George Town, Grand Cayman--(Newsfile Corp. - February 27, 2026) - StoneCo Ltd. (NASDAQ: <a class=\"symbol-link\" href=\"/overview/STNE/\" title=\"View STNE stock overview\">STNE</a>) (\"Stone\" or \"the Company\") today announced the successful closing of Linx sale, following the satisfaction of all closing conditions, including regulatory approval without restrictions from the Brazilian Administrative Council for Economic Defense (CADE) on February 20<sup>th</sup>, 2026. </p><p>Stone continues to serve its clients' software needs through its robust partnership program and native horizontal business management solutions fully integrated within the Stone ecosystem.</p><p>Further information regarding the proceeds distribution will be provided in the 4Q25 earnings call on March 02<sup>nd</sup>, 2026.</p><p><b>About StoneCo</b></p><p>Stone Co. is a leading provider of financial technology solutions that empower merchants to conduct commerce seamlessly across multiple channels and help them grow their businesses with our payments, banking, and credit solutions.</p><p><b>Forward-Looking Statements</b></p><p>This press release contains \"forward-looking statements\" within the meaning of the \"safe harbor\" provisions of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are made as of the date they were first issued and were based on current expectations, estimates, forecasts and projections as well as the beliefs and assumptions of management. These statements identify prospective information and may include words such as \"believe,\" \"may,\" \"will,\" \"aim,\" \"estimate,\" \"continue,\" \"anticipate,\" \"intend,\" \"expect,\" \"forecast,\" \"plan,\" \"predict,\" \"project,\" \"potential,\" \"aspiration,\" \"objectives,\" \"should,\" \"purpose,\" \"belief,\" and similar, or variations of, or the negative of such words and expressions, although not all forward-looking statements contain these identifying words.</p><p>Forward-looking statements are subject to a number of risks and uncertainties, many of which involve factors or circumstances that are beyond Stone's control.</p><p>Stone's actual results could differ materially from those stated or implied in forward-looking statements due to a number of factors, including but not limited to: more intense competition than expected, lower addition of new clients, regulatory measures, more investments in our business than expected, and our inability to execute successfully upon our strategic initiatives, among other factors.</p><div id=\"contactInfo\"><p><b>Contact:</b></p><p>Investor Relations<br/><a href=\"mailto:investors@stone.co\" rel=\"nofollow noopener\">investors@stone.co</a></p></div><p id=\"corporateNewsLogoContainer\"><img alt=\"Corporate Logo\" id=\"corporateNewsLogo\" loading=\"lazy\" src=\"https://images.newsfilecorp.com/files/10984/285751_9608ced3e41f6acb_logo.jpg\"/></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/kXYRYcY8AG\" rel=\"nofollow noopener\">https://www.newsfilecorp.com/release/285751</a></p><p><img alt=\"\" loading=\"lazy\" src=\"https://api.newsfilecorp.com/newsinfo/285751/375\"/></p></article>",
            "link": "https://www.stocktitan.net/news/STNE/stone-co-announces-successful-closing-of-linx-kpscspmj9zf0.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:41:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "American Eagle Announces $23 Million Strategic Investment Backed by Eric Sprott | AMEGF Stock News",
            "description": "<article class=\"article\"><p><b>Highlights</b>:</p><ul><li>The investment adds a third strategic investor, when combined with investments by mining companies South32 Group Operations PTY Ltd. and Teck Resources Limited</li><li>The Offering funds significantly expanded drill programs for 2026 and 2027 at the Company's NAK copper-gold porphyry project (the \"Nak\") near Smithers, BC</li><li>No warrants will be issued in connection with the Offering</li><li>American Eagle will issue these shares at <money>$1.20</money> CAD</li></ul><p>Toronto, Ontario--(Newsfile Corp. - February 27, 2026) - American Eagle Gold Corp. (TSXV: AE) (OTCQB: <a class=\"symbol-link\" href=\"/overview/AMEGF/\" title=\"View AMEGF stock overview\">AMEGF</a>) (\"American Eagle\" or the \"Company\") is pleased to announce that it intends to complete a financing for aggregate gross proceeds up to C<money>$34,540,000</money>, consisting of approximately: (i) up to 19,200,000 common shares to be issued on a premium flow-through basis (each, an \"FT Share\") at a price of C<money>$1.20</money> per FT Share (\"Charity FT Offering\") for proceeds of C<money>$23,040,000</money>; and (ii) up to 14,935,065 common shares (each, a \"Share\") at a price of C<money>$0.77</money> per Share for proceeds of up to C<money>$11,500,000</money> (the \"Concurrent Offering\" and with the Charity FT Offering are the \"Offering\"). </p><p>Eric Sprott, through a 2176423 Ontrio Ltd., a corporation beneficially owned and controlled by him, has agreed to acquire an approximate <percent>9.9%</percent> equity interest in the Company,  prior to the decisions of Teck and South32 who have certain equity participaton rights as detailed below, through the purchase of 19,200,000 common shares underlying the Charity FT Offering at a back-end price of <money>$0.77</money> per share. The investment represents C<money>$23,040,000</money> of the Charity FT Offering gross proceeds.</p><p>\"We're very pleased to welcome Eric Sprott as another strategic, long-term investor on the register. What makes his participation particularly notable is that it's rare for him to back copper stories. We're proud to have him alongside Teck, South32, and Orecap as foundational, long-term shareholders,\" state Anthony Moreau, CEO of American Eagle.</p><p>\"NAK has truly caught my attention. I believe the grade and length of the intervals are exceptional, and the gold grade is the icing on the cake. I believe this is one of the best undeveloped porphyrys in Canada,\" stated Eric Sprott. </p><p><b>Participation Rights for Teck and South32</b></p><p>American Eagle has previously agreed to grant South32 and Teck certain investor rights, including an equity participation right in equity financings as well as dilutive events to maintain its pro-rata ownership in the Company. Should these shareholders choose to maintain their rights, American Eagle would complete up to a <money>$11.5 million</money> concurrent offering. The Concurrent Offering is to accommodate these rights and additional subscribers and it not a committed amount. Further information will be provided when South 32 and Teck have confirmed their participation intentions to the Company. There is no assurance that either South 32 or Teck will participate in the Offering, or  maintain their proportionate equity ownership in the Company.</p><p>American Eagle will use the proceeds to thoroughly test its thesis at NAK and build on the successes of its 2026 and 2027 drill program, which expanded NAK's scale and identified additional high-grade zones, as well as for general corporate purposes and working capital.</p><p>The FT Shares will qualify as \"flow-through shares\" within the meaning of the Income Tax Act (Canada) (the \"Tax Act\"). An amount equal to the gross proceeds from the issuance of the FT Shares will be used to incur, on the Company's Canadian mineral exploration properties, eligible resource exploration expenses that will qualify as (i) \"Canadian exploration expenses\" (as defined in the Tax Act), (ii) \"flow-through critical mineral mining expenditures\" (as defined in subsection 127(9) of the Tax Act), and (iii) \"BC flow-through mining expenditures\" for purchasers in British Columbia (collectively, the \"Qualifying Expenditures\"). The Qualifying Expenditures, in an aggregate amount not less than the gross proceeds raised from the issuance of the FT Shares, will be incurred on or before December 31, 2027 and will be renounced by the Company to the initial purchasers of the FT Shares with an effective date no later than December 31, 2026. In the event that the Company is unable to renounce the full issue price of the FT Shares on or prior to December 31, 2026 and/or if the Qualifying Expenditures are reduced by the Canada Revenue Agency, the Company will indemnify each initial purchaser for the additional taxes payable by such subscriber to the extent permitted by the Tax Act as a result of the Company's failure to renounce the Qualifying Expenditures as agreed. </p><p>Upon closing this Offering (assuming both the Charity FT Offering and Concurrent Offering are completed), American Eagle will have over C<money>$50 million</money> in cash on its balance sheet, and the Company will be fully funded for substantial drill program expansions in 2026 and 2027. </p><p>No warrants are included in the Offering.  The Company will pay a commission or finder's fee of up to <percent>1%</percent> in connection with the Offering. The Company reserves the right to alter the Concurrent Offering to include a premium flow-through component. Closing of the Offering is expected to occur on, or about,  March 20, 2026 (the \"Closing Date\"), subject to satisfaction of the closing conditions for the benefit of the parties,  the receipt of all necessary regulatory approvals and acceptance of the TSX Venture Exchange. The Shares will be subject to a statutory hold period of four months plus a day following the Closing Date.</p><p>This news release does not constitute an offer to sell or a solicitation of an offer to buy nor shall there be any sale of any of the securities in any jurisdiction in which such offer, solicitation or sale would be unlawful. The securities have not been, and will not be, registered under the United States Securities Act of 1933, as amended (the \"U.S. Securities Act\"), or the securities laws of any state of the United States, and may not be offered or sold in the United States or to, or for the account or benefit of, U.S. persons (as defined in Regulation S under the U.S. Securities Act) absent registration under the U.S. Securities Act and applicable state securities laws or an exemption from such registration requirements.</p><p><b>About American Eagle's NAK Project</b></p><p>The NAK Project lies within the Babine copper-gold porphyry district of central British Columbia. It has excellent infrastructure through all-season roads and is close to the towns of Smithers, Houston, and Burns Lake, B.C., which lie along a major rail line and Provincial Highway 16. Historical drilling and geophysical, geological, and geochemical work at NAK, which began in the 1960's, tested only to shallow depths. Still, the work revealed a very large near-surface copper-gold system that measures over 1.5 km x 1.5 km. Drilling completed by American Eagle in 2022, 2023, and 2024 returned significant intervals of high-grade copper-gold mineralization that reached beyond and much deeper than the historical drilling, indicating that zones of near-surface and deeper mineralization, locally with considerably higher grades, exist within the broader NAK property mineralizing system. American Eagle Gold completed an aggressive 31,500 metre drill program in 2025 designed to expand and improve the mineral footprint; assays are currently being received.   </p><p>For the latest videos from American Eagle, Ore Group, and all things mining, subscribe to our YouTube Chanel: <a href=\"https://api.newsfilecorp.com/redirect/no2D8TMegy\" rel=\"nofollow noopener\">youtube.com/@theoregroup</a></p><p><b>About American Eagle Gold Corp.</b></p><p>American Eagle is focused on exploring its NAK copper-gold porphyry project in west-central British Columbia, Canada. </p><p>American Eagle Gold Corp<br/>Toronto, Ontario</p><div id=\"contactInfo\"><p><b>Anthony Moreau, Chief Executive Officer</b></p><p>416.644.1567<br/><a href=\"mailto:amoreau@oregroup.ca\" rel=\"nofollow noopener\">amoreau@oregroup.ca</a><br/><a href=\"https://api.newsfilecorp.com/redirect/KLpPRfJKje\" rel=\"nofollow noopener\">www.americaneaglegold.ca</a> </p></div><p><b>Q.P. Statement</b></p><p>Mark Bradley, B.Sc., M.Sc., P.Geo., a Certified Professional Geologist and 'qualified person' for the purposes of Canada's National Instrument 43-101 Standards of Disclosure for Mineral Properties, has verified and approved the information contained in this news release.</p><p><b>Forward-Looking Statements</b></p><p>Certain information in this press release may contain forward-looking statements. Forward-looking statements in this press release include, but are not limited to, statements regarding whether the Company will be able to complete the Offering as anticipated, the receipt of regulatory approval, including the approval of the TSX Venture Exchange, to complete the Offering, the intended use of proceeds and intended drill program or its anticipated results at the Company's NAK project, the ability of the Company to make the qualifying expenditures as anticipated by management, and other matters ancillary or incidental to the foregoing. This information is based on current expectations that are subject to significant risks and uncertainties that are difficult to predict. Therefore, actual results might differ materially from those suggested in forward-looking statements. American Eagle Gold Corp. assumes no obligation to update the forward-looking statements or to update the reasons why actual results could differ from those reflected in the forward looking-statements unless and until required by securities laws applicable to American Eagle Gold Corp. Additional information identifying risks and uncertainties is contained in filings by American Eagle Gold Corp. with Canadian securities regulators, which filings are available under American Eagle Gold Corp. profile at <a href=\"https://api.newsfilecorp.com/redirect/EZ2k8ujYXR\" rel=\"nofollow noopener\">www.sedarplus.ca</a>.</p><p><i><b>Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the TSX Venture Exchange policies) accept responsibility for the adequacy or accuracy of this release.</b></i></p><p id=\"corporateNewsLogoContainer\"><img alt=\"Corporate Logo\" id=\"corporateNewsLogo\" loading=\"lazy\" src=\"https://images.newsfilecorp.com/files/9283/285744_e83d63b3149bebb1_logo.jpg\"/></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/xEjmMcK8ML\" rel=\"nofollow noopener\">https://www.newsfilecorp.com/release/285744</a></p><p><img alt=\"\" loading=\"lazy\" src=\"https://api.newsfilecorp.com/newsinfo/285744/375\"/></p></article>",
            "link": "https://www.stocktitan.net/news/AMEGF/american-eagle-announces-23-million-strategic-investment-backed-by-cc5u0dkkg95b.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:41:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "IQVIA Releases its 2025 Sustainability Report | IQV Stock News",
            "description": "<article class=\"article\"><p> <location idsrc=\"xmltag.org\" value=\"LU/us.nc.resark\">RESEARCH TRIANGLE PARK, N.C.</location>--(BUSINESS WIRE)--IQVIA Holdings Inc. (NYSE: <a class=\"symbol-link\" href=\"/overview/IQV/\" title=\"View IQV stock overview\">IQV</a>), a leading global provider of clinical research services, commercial insights and healthcare intelligence to the life sciences and healthcare industries, today published its 2025 Sustainability Report. The report highlights IQVIA’s progress across its People, Public and Planet pillars, consistent with the company’s mission to accelerate innovation for a healthier world.</p><p>IQVIA’s 2025 Sustainability Report can be downloaded at: <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.iqvia.com%2F-%2Fmedia%2Fiqvia%2Fpdfs%2Fabout-us%2Fsustainability%2Fiqvia-2025-sustainability-report.pdf&amp;esheet=54434801&amp;newsitemid=20260227193090&amp;lan=en-US&amp;anchor=https%3A%2F%2Fwww.iqvia.com%2F-%2Fmedia%2Fiqvia%2Fpdfs%2Fabout-us%2Fsustainability%2Fiqvia-2025-sustainability-report.pdf&amp;index=1&amp;md5=c7c800229b91386d0ae14f411bf22ff0\" rel=\"nofollow noopener\" shape=\"rect\">https://www.iqvia.com/-/media/iqvia/pdfs/about-us/sustainability/iqvia-2025-sustainability-report.pdf</a>. Highlights from the report include:</p><ul class=\"bwlistdisc\"><li><b>Investments in the company’s employees. </b>IQVIA’s approximately 93,000 employees worldwide are central to delivering on the company’s mission. In 2025, IQVIA accelerated learning and development opportunities through expanded AI and data analytics upskilling, generating more than 230,000 employee engagements with AI learning resources. More than 2,000 employees participated in leadership development programs, strengthening IQVIA’s global leadership pipeline. Efforts to listen to and act on employee feedback continued to reflect strong employee engagement, with IQVIA exceeding Fortune 500 benchmarks across key metrics.</li><li><b>Innovation in AI and technology. </b>IQVIA advanced its AI strategy by expanding key partnerships to strengthen ecosystem interoperability and launching new AI-enabled solutions for internal use and external offerings. Guided by its AI Governance Council and Center for Defensible Data and AI, IQVIA remains committed to the responsible use of AI, with strong foundations in privacy, regulatory compliance and patient safety through its IQVIA Healthcare-grade AI<sup>®</sup> capabilities.</li><li><b>Access to healthcare. </b>Patients remain at the center of the research IQVIA supports. IQVIA continued to broaden access to clinical trials and improve the representation of underserved patient populations worldwide. In 2025, this included activating sites in <location idsrc=\"xmltag.org\" value=\"LC/br\">Brazil</location> and <location idsrc=\"xmltag.org\" value=\"LC/ar\">Argentina</location> for a global acute coronary syndrome trial. Together, these sites enrolled 5,700 participants toward a global target of 47,000, helping ensure patients from the region are represented in large-scale cardiovascular research. IQVIA also expanded its global network of Prime Sites to 56 high-performing clinical trial centers, adding locations in <location idsrc=\"xmltag.org\" value=\"LC/br\">Brazil</location>, <location idsrc=\"xmltag.org\" value=\"LC/it\">Italy</location> and <location idsrc=\"xmltag.org\" value=\"LC/jp\">Japan</location>.</li><li><b>Global health. </b>Leveraging its global scale and scientific expertise, IQVIA supported public health initiatives addressing some of the world’s most complex challenges. In 2025, IQVIA collaborated with governments, global health organizations and industry partners to respond to disease outbreaks, advance digital health strategies and strengthen healthcare systems.</li><li><b>Environmental impact. </b>IQVIA continued to reduce the environmental footprint of research and operations across its business. Its ongoing commitment to the My Green Lab<sup>®</sup> program, with <percent>100%</percent> of its global laboratory network obtaining My Green Lab certification, remained a key element of IQVIA’s approach to more sustainable research. IQVIA also redesigned clinical trial test kits to use at least <percent>98%</percent> recycled materials, reduced packaging emissions in cold chain logistics by <percent>70%</percent> and expanded ISO 14001 and 45001 certifications across laboratories.</li><li><b>External recognition. </b>IQVIA was regularly recognized externally for its work. Among multiple notable awards in 2025, IQVIA was named to the 2026 <i>Fortune</i><sup>®</sup> World’s Most Admired Companies<sup>™</sup> list for the ninth year in a row and ranked No. 1 in its category for the fifth consecutive year; IQVIA scored “outstanding” — the highest distinction — in TIME’s inaugural ranking of the World’s Top HealthTech companies in 2025; IQVIA’s Health Research Space won the award for best mobile app for patient engagement from the MedTech Breakthrough Awards; IQVIA was the only clinical research organization to achieve top ranking in the Everest Group’s “AI-deas to Action: Operationalizing Generative AI in Life Sciences” report<i>; </i>and IQVIA received five Human Capital Management Excellence Awards<sup>®</sup> from Brandon Hall Group, recognizing its commitment to developing and investing in its employees.</li></ul><p><b>About IQVIA</b></p><p>IQVIA (NYSE:<a class=\"symbol-link\" href=\"/overview/IQV/\" title=\"View IQV stock overview\">IQV</a>) is a leading global provider of clinical research services, commercial insights and healthcare intelligence to the life sciences and healthcare industries. IQVIA’s portfolio of solutions are powered by IQVIA Connected Intelligence<sup>™</sup> to deliver actionable insights and services built on high-quality health data, Healthcare-grade AI<sup>®</sup>, advanced analytics, the latest technologies and extensive domain expertise. IQVIA is committed to using AI responsibly, with AI-powered capabilities built on best-in-class approaches to privacy, regulatory compliance and patient safety, and delivering AI to the high standards of trust, scalability and precision demanded by the industry. With approximately 93,000 employees in over 100 countries, including experts in healthcare, life sciences, data science, technology and operational excellence, IQVIA is dedicated to accelerating the development and commercialization of innovative medical treatments to help improve patient outcomes and population health worldwide.</p><p>IQVIA is a global leader in protecting individual patient privacy. The company uses a wide variety of privacy-enhancing technologies and safeguards to protect individual privacy while generating and analyzing information on a scale that helps healthcare stakeholders identify disease patterns and correlate with the precise treatment path and therapy needed for better outcomes. IQVIA’s insights and execution capabilities help biotech, medical device and pharmaceutical companies, medical researchers, government agencies, payers and other healthcare stakeholders tap into a deeper understanding of diseases, human behaviors and scientific advances in an effort to advance their path toward cures. To learn more, visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.iqvia.com&amp;esheet=54434801&amp;newsitemid=20260227193090&amp;lan=en-US&amp;anchor=www.iqvia.com&amp;index=2&amp;md5=0d9f01bf498075c748b2c64227a07acd\" rel=\"nofollow noopener\" shape=\"rect\">www.iqvia.com</a>.</p><p>IQVIAFIN</p><p><img alt=\"\" loading=\"lazy\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260227193090r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\"/><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20260227193090/en/\" rel=\"nofollow noopener\">https://www.businesswire.com/news/home/20260227193090/en/</a></span></p><p>Kerri Joseph, IQVIA Investor Relations (<a href=\"mailto:kerri.joseph@iqvia.com\" rel=\"nofollow noopener\" shape=\"rect\">kerri.joseph@iqvia.com</a>)<br/>+1.973.541.3558</p><p>Alissa Maupin, IQVIA Media Relations (<a href=\"mailto:alissa.maupin1@iqvia.com\" rel=\"nofollow noopener\" shape=\"rect\">alissa.maupin1@iqvia.com</a>)<br/>+1.919.923.6785</p><p>Source: IQVIA</p></article>",
            "link": "https://www.stocktitan.net/news/IQV/iqvia-releases-its-2025-sustainability-d5jr9v9fvcju.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:47:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SOL Strategies Announces Proposed Board Transition | STKE Stock News",
            "description": "<article class=\"article\"><p>Refreshed Board Slate Having Support of Requisitioning Shareholders to be Proposed at AGM</p><p>Toronto, Ontario--(Newsfile Corp. - February 27, 2026) - SOL Strategies Inc. (CSE: HODL) (NASDAQ: <a class=\"symbol-link\" href=\"/overview/STKE/\" title=\"View STKE stock overview\">STKE</a>) (\"SOL Strategies\" or the \"Company\"), one of the first publicly traded companies dedicated to growing and building the Solana economy, today announced a refreshed board slate to be presented to shareholders at its <a href=\"https://api.newsfilecorp.com/redirect/OARYzI2D18\" rel=\"nofollow noopener\">Annual General Meeting of Shareholders</a> (AGM) on March 31, 2026, as well as the resolution of recently raised shareholder concerns.</p><p>The Company's proposed board slate for the upcoming AGM includes two new independent directors: Laszlo \"Les\" Borsai and Dennis Logan. Both bring significant expertise in digital assets, corporate finance, and public company governance. The remainder of the proposed slate will include five of the Company's incumbent directors, being Luis Berruga (Chairman), Michael Hubbard (Interim Chief Executive Officer), Jon Matonis, Rubsun Ho, and Jose Calderon.</p><p>Additionally, Ungad Chadda announced he will not stand for reelection at the AGM. Following the AGM, Mr. Logan will be appointed to the Company's Audit Committee in Mr. Chadda's place. Mr. Chadda will continue to support the Company as a Special Advisor to the Board for a six-month transition period, providing counsel on audit and regulatory matters.</p><p>The proposed board changes reflect the cooperation agreement (the \"Cooperation Agreement\") entered into with concerned shareholders Max Kaplan and Tony Guoga (the \"Concerned Shareholders\") following a constructive dialogue and collaborative review of their concerns, a copy of which will be filed under the Company's profile at <a href=\"https://api.newsfilecorp.com/redirect/PqE04ugAzO\" rel=\"nofollow noopener\">www.sedarplus.ca</a>. The concerned shareholders have agreed to vote in favour of the proposed board slate at the AGM. In the event that either Mr. Logan or Mr. Borsai is unable or unwilling to serve on the Board during the 12 months following the AGM, the Concerned Shareholders will have the right, in the case of Mr. Logan, to appoint a replacement director, and in the case of Mr. Borsai, to work with the Company to determine a replacement director agreeable to both the Company and the Concerned Shareholders. </p><p>The Cooperation Agreement also provides that, no later than as soon as reasonably practicable following the Meeting, Michael Hubbard will be appointed as full-time Chief Executive Officer and Steve Ehrlich, currently the Company's Head of Capital Markets, will be appointed as Chief Strategy Officer.</p><p>\"We value open communication with our shareholders and appreciate the constructive engagement that led to this agreement,\" <i><b>said Michael Hubbard, Interim Chief Executive Officer of SOL Strategies</b></i>. \"Our focus remains on executing our infrastructure strategy and delivering value for stakeholders. This resolution and bringing Les and Dennis on board strengthen our governance while letting us stay focused on execution.\"</p><p>\"I want to thank Ungad for his services and contributions,\" <i><b>said Luis Berruga, Chairman of the Board</b></i>. \"It is under his chairmanship of the audit committee that the company obtained a successful PCAOB audit and NASDAQ listing. He will remain engaged as an advisor to ensure continuity, which matters. I'm also excited to welcome Les and Dennis, whose combined expertise in digital assets and capital markets positions us well for what's next.\"</p><p>The Concerned Shareholders have confirmed to the Company that they are not, and have not been, acting jointly or in concert with each other or any other person or company for the purposes of Canadian securities laws in connection with their respective investments in the Company or the matters contemplated by the Cooperation Agreement.</p><p><b>Proposed New Directors</b></p><p><b>Laszlo \"Les\" Borsai </b>brings extensive experience at the intersection of digital assets and entertainment. An early participant in the cryptocurrency industry, Borsai advised Ripple Labs beginning in 2013 and made early-stage investments in Ethereum, XRP, Tezos, and NFT projects. He co-founded Wave Digital Assets in 2018, an SEC-registered investment advisory firm specializing in digital asset venture capital and wealth management.</p><p><b>Dennis Logan </b>is a financial executive with deep experience in corporate finance and public company management. He currently serves as Chief Financial Officer of American Tungsten Corp., Sterling Metals Corp. and BTU Metals Corp., and has held CFO roles at multiple public companies, including Planet 13 Holdings Inc. Mr. Logan is a CPA, CA (Chartered Accountant) and a Member of CPA Ontario (formerly the Institute of Chartered Accountants of Ontario).</p><p>The Company will publish its management information circular for the Annual General Meeting in early March, which will include the complete proposed slate of directors and recommendations for shareholder consideration.</p><p><b>About SOL Strategies</b></p><p>SOL Strategies Inc. (CSE: HODL) (NASDAQ: <a class=\"symbol-link\" href=\"/overview/STKE/\" title=\"View STKE stock overview\">STKE</a>) is a Canadian investment company that operates at the forefront of blockchain innovation. Specializing in the Solana ecosystem, the company provides strategic investments and infrastructure solutions to enable the next generation of decentralized applications.</p><p>To learn more about SOL Strategies, please visit <a href=\"https://api.newsfilecorp.com/redirect/wE4Q8sB0gw\" rel=\"nofollow noopener\">www.solstrategies.io</a>. A copy of this news release and all the Company's related material documents regarding the Company may be obtained under the Company's profile on SEDAR+ at <a href=\"https://api.newsfilecorp.com/redirect/gJYgEU581K\" rel=\"nofollow noopener\">www.sedarplus.ca</a> and EDGAR at <a href=\"https://api.newsfilecorp.com/redirect/ppYV7I5XBr\" rel=\"nofollow noopener\">www.sec.gov</a>.</p><div id=\"contactInfo\"><p><b>Investor Contact:</b></p><p>Doug Harris, Chief Financial Officer, 416-480-2488</p><p>John Ragozzino, CFA, <a href=\"mailto:solstrategies@icrinc.com\" rel=\"nofollow noopener\">solstrategies@icrinc.com</a>, 203-682-8284</p><p><b>Media Contact: <a href=\"mailto:solstrategies@scrib3.co\" rel=\"nofollow noopener\">solstrategies@scrib3.co</a></b></p></div><p><b>Cautionary Note Regarding Forward-Looking Information:</b></p><p>Neither the Canadian Securities Exchange nor its Market Regulator (as that term is defined in the policies of the Canadian Securities Exchange) accepts responsibility for the adequacy or accuracy of this release.</p><p>This news release contains \"forward-looking information\" within the meaning of applicable securities laws. All statements other than statements of historical fact may be forward‐looking statements and information. More particularly and without limitation, this news release contains forward‐looking statements and information relating to the Company's or the Company's management team's expectations, hopes, beliefs, intentions or strategies regarding the future, and expectations regarding the characteristics, value drivers, and anticipated benefits of the Company's business plans and operations related thereto. Forward-looking information can also be identified by the use of forward-looking terminology such as \"plans\", \"expects\" or \"does not expect\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\" or \"does not anticipate\", or \"believes\", or variations of such words and phrases or indicates that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will be\" taken, \"occur\" or \"be achieved\".</p><p>Forward-looking statements in this news release include statements regarding the holding of the Annual General Meeting, the publication of the management information circular, the election of directors, the support of concerned shareholders for the Company's recommended proposals, and Mr. Chadda's continued service as a Special Advisor to the Board. There is no assurance that the Company's plans or objectives will be implemented as set out herein, or at all. Forward-looking information is based on certain factors and assumptions the Company believes to be reasonable at the time such statements are made and is subject to known and unknown risks, uncertainties, and other factors that may cause the actual results, level of activity, performance, or achievements of the Company to be materially different from those expressed or implied by such forward-looking information.</p><p>The purpose of forward-looking information is to provide the reader with a description of management's expectations, and such forward-looking information may not be appropriate for any other purpose. There can be no assurance that such forward-looking information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such information. Accordingly, readers should not place undue reliance on forward-looking information. Forward-looking statements are made based on management's beliefs, estimates, and opinions on the date that statements are made, and the Company undertakes no obligation to update forward-looking statements if these beliefs, estimates, and opinions or other circumstances should change, except as required by law. Investors are cautioned against attributing undue certainty to forward-looking statements.</p><p><b>Disclaimer:</b></p><p>SOL Strategies is an independent organization in the Solana ecosystem. SOL Strategies is not affiliated with, owned by, or under common control with Solana Foundation (the \"Foundation\"), and the Foundation has not entered into any association, partnership, joint venture, employee, or agency relationship with SOL Strategies.</p><p>None of the Foundation or its council members, officers, agents or make any representations or warranties, recommendations, endorsements or promises with respect to the accuracy of any statements made, information provided, or action taken by SOL Strategies and expressly disclaim any and all liability arising from or related to any such statements, information or action.</p><p id=\"corporateNewsLogoContainer\"><img alt=\"Corporate Logo\" id=\"corporateNewsLogo\" loading=\"lazy\" src=\"https://images.newsfilecorp.com/files/5283/285748_a8e5a449447d7ab1_logo.jpg\"/></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/YE3jxsMbBn\" rel=\"nofollow noopener\">https://www.newsfilecorp.com/release/285748</a></p><p><img alt=\"\" loading=\"lazy\" src=\"https://api.newsfilecorp.com/newsinfo/285748/375\"/></p></article>",
            "link": "https://www.stocktitan.net/news/STKE/sol-strategies-announces-proposed-board-y470ciphjw51.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:46:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gold Port Advances Access Strategy at Groete Gold Copper Project | GPOTF Stock News",
            "description": "<article class=\"article\"><p><strong id=\"dateline\">VANCOUVER, BRITISH COLUMBIA / <a href=\"https://www.accessnewswire.com/\" rel=\"nofollow noopener\">ACCESS Newswire</a> / February 27, 2026 / </strong><strong>Gold Port Corporation </strong>(CSE:GPO)(OTCQB:GPOTF) (\"Gold Port\" or the \"Company\") is pleased to provide a corporate update.</p><p>The Company had previously identified and announced a contractor and had previously announced the construction of the road access to the Groete Gold Copper project located in Guyana S.A. The program requires the completion of approximately 13 kilometers of dirt road access including some bridge and drainage construction. After several attempts and additional issues with the project, the Company has decided to pivot and purchase heavy equipment and complete the road development with existing staff. The effort will require an excavator and other heavy equipment which will also be key equipment during the drill program on site. The equipment acquisition is being completed, and road work is expected to begin in the immediate future.</p><p>Upon road completion, the camp will be re-structured using Company owned modular system currently in storage in Guyana. With the camp completed, a Company owned MP Explorer track mounted core rig will be moved to site to initiate a drill program.</p><p><strong>Company President and C.E.O. Adrian F. C. Hobkirk is quoted:</strong></p><p>\"After consideration of existing proposals and ongoing issues with the previously announced construction, management determined the most cost and time-effective approach is to conclude an equipment purchase and have the Company complete the access road. The new heavy support equipment will be vital to the successful completion of the upcoming drill program.\"</p><p><strong>About Gold Port Corporation</strong></p><p>Gold Port Resources Corporation (GPO) is focused on the further exploration and development of the <percent>100%</percent> owned Groete Gold Copper Project (the \"Project\"), located in Guyana, South America. The current focus of the Company is to enhance the NI 43-101 inferred gold copper resource defined at the Project to a higher resource classification, and to potentially expand the total mineral inventory. The Project was last explored in 2012, which included a drill program that allowed the calculation of an Inferred Mineral Resource of 1.57 million gold equivalent ounces (gold plus copper) within 74 million tonnes, at a grade of 0.66 grams per tonne gold copper equivalent. A cut-off grade of 0.25 gold equivalent grams per tonne, a gold price of US<money>$1,275</money> per ounce and copper price of US<money>$3.00</money> per pound was used in the calculation of the Inferred Mineral Resource. Details of the Mineral Resource are contained in a National Instrument 43-101 report titled, <a href=\"https://pr.report/j54r\" rel=\"nofollow noopener\"><i>Technical Report and Updated Mineral Resource Estimate on the Groete Gold Copper Deposit, Groete Property, Guyana, South America</i></a> by P&amp;E Mining Consultants Inc., dated April 16, 2019, available on SEDAR and the Company website at <a href=\"https://pr.report/j54s\" rel=\"nofollow noopener\">www.goldportcorporation.com</a>.</p><p><strong>On behalf of the Board of Directors </strong><br/><br/><strong>Adrian F. C. Hobkirk</strong><br/>President, CEO and Director</p><p>T: 954-684-8040<br/>E: <a href=\"mailto:info@goldportcorporation.com\" rel=\"nofollow noopener\">info@goldportcorporation.com</a><br/>W: <a href=\"https://pr.report/j54t\" rel=\"nofollow noopener\">www.goldportcorporation.com</a></p><p><i>No stock exchange or securities regulatory authority has reviewed or accepted responsibility for the adequacy or accuracy of this release.</i></p><p>This news release contains certain \"forward-looking statements\" within the meaning of Section 21E of the United States Securities and Exchange Act of 1934, as amended. Except for statements of historical fact relating to the Company, certain information contained herein constitutes forward-looking statements. Forward-looking statements are based upon opinions and estimates of management on the date the statements are made and are subject to a variety of risks and uncertainties and other factors which could cause actual results to differ materially from those projected in the forward-looking statements. The reader is cautioned not to place undue reliance on forward- looking statements. We seek safe harbor.</p><p>The securities issued pursuant to the Offering have not, nor will they be registered under the United States Securities Act of 1933, as amended, and may not be offered or sold within the United States or to, or for the account or benefit of, U.S. persons in the absence of U.S. registration or an applicable exemption from the U.S. registration requirements. This news release shall not constitute an offer to sell or the solicitation of an offer to buy nor shall there be any sale of the securities in the United States or in any other jurisdiction in which such offer, solicitation or sale would be unlawful.</p><p><strong>SOURCE:</strong> Gold Port Corporation</p><br/><br/>View the original <a href=\"https://www.accessnewswire.com/newsroom/en/metals-and-mining/gold-port-advances-access-strategy-at-groete-gold-copper-project-1142132\" rel=\"nofollow noopener\">press release</a> on ACCESS Newswire<br/><br/><img height=\"0\" loading=\"lazy\" src=\"https://app.accessnewswire.com/img.ashx?id=1142132\" width=\"0\"/></article>",
            "link": "https://www.stocktitan.net/news/GPOTF/gold-port-advances-access-strategy-at-groete-gold-copper-zpuvqviiqgl1.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:42:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "JOHN HANCOCK TAX-ADVANTAGED DIVIDEND INCOME FUND NOTICE TO SHAREHOLDERS - SOURCES OF DISTRIBUTION UNDER SECTION 19(a) | HTD Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.ma.boston\">BOSTON</location></span>, <span class=\"legendSpanClass\">Feb. 27, 2026</span> /PRNewswire/ - John Hancock Tax-Advantaged Dividend Income Fund (NYSE: <a class=\"symbol-link\" href=\"/overview/HTD/\" title=\"View HTD stock overview\">HTD</a>) (the \"Fund\"), a closed-end fund managed by John Hancock Investment Management LLC and subadvised by Manulife Investment Management (US) LLC, announced today sources of its monthly distribution of <money><money>$0.15</money>80</money> per share paid to all shareholders of record as of February 12, 2026, pursuant to the Fund's managed distribution plan. This press release is issued as required by an exemptive order granted to the Fund by the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> Securities and Exchange Commission.   </p><p><b>Notification of Sources of Distribution</b></p><p>This notice provides shareholders of the John Hancock Tax-Advantaged Dividend Income Fund (NYSE: <a class=\"symbol-link\" href=\"/overview/HTD/\" title=\"View HTD stock overview\">HTD</a>) with important information concerning the distribution declared on February 2, 2026, and payable on February 27, 2026. No action is required on your part.</p><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Distribution Period:</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">February 2026</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Distribution Amount Per Common Share:</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.15</money>80</money></span></p></td></tr></table></div><p>The following table sets forth the estimated sources of the current distribution, payable February 27, 2026, and the cumulative distributions paid this fiscal year to date from the following sources: net investment income; net realized short term capital gains; net realized long term capital gains; and return of capital or other capital source. All amounts are expressed on a per common share basis and as a percentage of the distribution amount.</p><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen5\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><u>For the period 02/01/2026-02/28/2026</u></span></p><p class=\"prnml4\"><span class=\"prnews_span\"> </span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen5\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"> </span></p><p class=\"prnml4\"><span class=\"prnews_span\"><u>For the fiscal year-to-date period <br/>11/01/2025-02/28/2026 </u><sup>1</sup></span></p><p class=\"prnml4\"><span class=\"prnews_span\"> </span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Source</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Current <br/>Distribution ($)</span></p></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">% Breakdown <br/>of the Current <br/>Distribution</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Total Cumulative <br/>Distributions ($)</span></p></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">% Breakdown <br/>of the Total <br/>Cumulative <br/>Distributions </span></p></td></tr><tr><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Net Investment Income</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.1147</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">73 %</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.4495</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">71 %</span></p></td></tr><tr><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Net Realized Short- Term Capital Gains</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.0035</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">2 %</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.0121</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">2 %</span></p></td></tr><tr><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Net Realized Long- Term Capital Gains</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.0398</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">25 %</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.1704</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">27 %</span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Return of Capital or Other Capital Source</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.0000</span></p></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0 %</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.0000</span></p></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0 %</span></p></td></tr><tr><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"> </span></p><p class=\"prnml4\"><span class=\"prnews_span\">Total per common share </span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.1580</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">100 %</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.6320</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">100 %</span></p></td></tr><tr><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen14\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen14\" colspan=\"1\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen2\" colspan=\"6\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"> </span></p><p class=\"prnml4\"><span class=\"prnews_span\">____________________<br/><sup>1</sup> The Fund's current fiscal year began on November 1, 2025 and will end on October 31, 2026.</span></p><p class=\"prnml4\"><span class=\"prnews_span\"> </span></p><p class=\"prnml4\"><span class=\"prnews_span\">Average annual total return (in relation to NAV) for the 5 years ended on January 31, 2026</span></p></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">11.28 %</span></p></td></tr><tr><td class=\"prngen11\" colspan=\"6\" rowspan=\"1\"><br/></td><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen2\" colspan=\"6\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Annualized current distribution rate expressed as a percentage of NAV as of January 31, 2026</span></p></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">7.21 %</span></p></td></tr><tr><td class=\"prngen11\" colspan=\"6\" rowspan=\"1\"><br/></td><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen2\" colspan=\"6\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Cumulative total return (in relation to NAV) for the fiscal year through January 31, 2026</span></p></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">3.29 %</span></p></td></tr><tr><td class=\"prngen11\" colspan=\"6\" rowspan=\"1\"><br/></td><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen2\" colspan=\"6\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Cumulative fiscal year-to-date distribution rate expressed as a percentage of NAV as of January 31, 2026</span></p></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">2.40 %</span></p></td></tr></table></div><p>You should not draw any conclusions about the Fund's investment performance from the amount of this distribution or from the terms of the Fund's managed distribution plan.</p><p>The Fund estimates that it has distributed more than its income and net realized capital gains; therefore, a portion of your distribution may be a return of capital.  A return of capital may occur, for example, when some or all of the money that you invested in the Fund is paid back to you.  A return of capital distribution does not necessarily reflect the Fund's investment performance and should not be confused with \"yield\" or \"income.\"</p><p>The amounts and sources of distributions reported in this Notice are only estimates and are not being provided for tax reporting purposes. The actual amounts and sources of the amounts for tax reporting purposes will depend upon the Fund's investment experience during the remainder of its fiscal year and may be subject to changes based on tax regulations.  The Fund will send you a Form 1099-DIV for the calendar year that will tell you how to report these distributions for federal income tax purposes.</p><p>The Fund has declared the February 2026 distribution pursuant to the Fund's managed distribution plan (the \"Plan\").  Under the Plan, the Fund makes fixed monthly distributions in the amount of <money><money>$0.15</money>80</money> per share, which will continue to be paid monthly until further notice.</p><p>If you have questions or need additional information, please contact your financial professional or call the Manulife John Hancock Closed-End Fund Information Line at 1-800-843-0090, Monday through Friday between 8:00 a.m. and 7:00 p.m., Eastern Time.</p><p><i>Statements in this press release that are not historical facts are forward-looking statements as defined by <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location> securities laws. You should exercise caution in interpreting and relying on forward-looking statements because they are subject to uncertainties and other factors which are, in some cases, beyond the Fund's control and could cause actual results to differ materially from those set forth in the forward-looking statements.</i></p><p><i>An investor should consider a Fund's investment objectives, risks, charges and expenses carefully before investing.</i></p><p><b>About Manulife John Hancock Investments <br/></b>We serve investors through a unique multimanager approach, complementing our extensive in-house capabilities with an unrivaled network of specialized asset managers, backed by some of the most rigorous investment oversight in the industry. The result is a diverse lineup of time-tested investments from a premier asset manager with a heritage of financial stewardship.</p><p><b>About Manulife Wealth &amp; Asset Management <br/></b>As part of Manulife Financial Corporation, Manulife Wealth &amp; Asset Management provides global investment, financial advice, and retirement plan services to 19 million individuals, institutions, and retirement plan members worldwide. Our mission is to make decisions easier and lives better by empowering people today to invest for a better tomorrow. As a committed partner to our clients and as a responsible steward of investor capital, we offer a heritage of risk management, deep expertise across public and private markets, and comprehensive retirement plan services. We seek to provide better investment and impact outcomes and to help people confidently save and invest for a more secure financial future. Not all offerings are available in all jurisdictions. For additional information, please visit manulifeim.com.</p><p>Media Contact:<br/>Gordon Haight <br/>(617) 572-0034</p><p>Investor Contact:<br/>(800) 843-0090</p><p>SOURCE John Hancock Investment Management</p></div></article>",
            "link": "https://www.stocktitan.net/news/HTD/john-hancock-tax-advantaged-dividend-income-fund-notice-to-gjui4ivou204.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:44:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "JOHN HANCOCK PREMIUM DIVIDEND FUND NOTICE TO SHAREHOLDERS - SOURCES OF DISTRIBUTION UNDER SECTION 19(a) | PDT Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.ma.boston\">BOSTON</location></span>, <span class=\"legendSpanClass\">Feb. 27, 2026</span> /PRNewswire/ - John Hancock Premium Dividend Fund (NYSE: <a class=\"symbol-link\" href=\"/overview/PDT/\" title=\"View PDT stock overview\">PDT</a>) (the \"Fund\"), a closed-end fund managed by John Hancock Investment Management LLC and subadvised by Manulife Investment Management (US) LLC, announced today sources of its monthly distribution of <money><money>$0.08</money>25</money> per share paid to all shareholders of record as of February 12, 2026, pursuant to the Fund's managed distribution plan. This press release is issued as required by an exemptive order granted to the Fund by the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> Securities and Exchange Commission.</p><p><b>Notification of Sources of Distribution</b></p><p>This notice provides shareholders of the John Hancock Premium Dividend Fund (NYSE: <a class=\"symbol-link\" href=\"/overview/PDT/\" title=\"View PDT stock overview\">PDT</a>) with important information concerning the distribution declared on February 2, 2026, and payable on February 27, 2026. No action is required on your part.</p><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Distribution Period:                                                      </span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">February 2026</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Distribution Amount Per Common Share:      </span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.08</money>25</money></span></p></td></tr></table></div><p>The following table sets forth the estimated sources of the current distribution, payable February 27, 2026, and the cumulative distributions paid this fiscal year to date from the following sources: net investment income; net realized short term capital gains; net realized long term capital gains; and return of capital or other capital source. All amounts are expressed on a per common share basis and as a percentage of the distribution amount.</p><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen5\" colspan=\"3\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><u>For the period 02/01/2026-02/28/2026</u></span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen5\" colspan=\"3\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><u>For the fiscal year-to-date period <br/>11/01/2025-02/28/2026 </u><sup>1</sup></span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Source</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen8\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Current <br/>Distribution ($)</span></p></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen10\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">% Breakdown<br/>of the Current<br/>Distribution</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen8\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Total Cumulative<br/>Distributions ($)</span></p></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen10\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">% Breakdown<br/>of the Total<br/>Cumulative<br/>Distributions </span></p></td></tr><tr><td class=\"prngen11\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Net Investment Income</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.0609</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen14\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">74 %</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.2405</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen14\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">73 %</span></p></td></tr><tr><td class=\"prngen11\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Net Realized Short- Term Capital Gains</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.0007</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen14\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1 %</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.0164</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen14\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">5 %</span></p></td></tr><tr><td class=\"prngen11\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Net Realized Long- Term Capital Gains</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.0209</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen14\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">25 %</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.0731</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen14\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">22 %</span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Return of Capital or Other Capital Source</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen15\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.0000</span></p></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen10\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0 %</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen15\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.0000</span></p></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen10\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0 %</span></p></td></tr><tr><td class=\"prngen11\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Total per common share </span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.0825</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen14\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">100 %</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.3300</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen14\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">100 %</span></p></td></tr><tr><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen15\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen16\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen15\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen16\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen11\" colspan=\"7\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">_______________________________</span></p><p class=\"prnml4\"><span class=\"prnews_span\"><sup>1</sup> The Fund's current fiscal year began on November 1, 2025 and will end on October 31, 2026.</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen3\" colspan=\"7\" rowspan=\"1\"><br/></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen15\" colspan=\"1\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen11\" colspan=\"7\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Average annual total return (in relation to NAV) for the 5 years ended on January 31, 2026</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen8\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">9.97 %</span></p></td></tr><tr><td class=\"prngen12\" colspan=\"7\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen11\" colspan=\"7\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Annualized current distribution rate expressed as a percentage of NAV as of January 31, 2026</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen8\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">6.88 %</span></p></td></tr><tr><td class=\"prngen12\" colspan=\"7\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen11\" colspan=\"7\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Cumulative total return (in relation to NAV) for the fiscal year through January 31, 2026</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen8\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">4.77 %</span></p></td></tr><tr><td class=\"prngen12\" colspan=\"7\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen11\" colspan=\"7\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Cumulative fiscal year-to-date distribution rate expressed as a percentage of NAV as of January 31, 2026</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen8\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">2.29 %</span></p></td></tr></table></div><p>You should not draw any conclusions about the Fund's investment performance from the amount of this distribution or from the terms of the Fund's managed distribution plan.</p><p>The Fund estimates that it has distributed more than its income and net realized capital gains; therefore, a portion of your distribution may be a return of capital. A return of capital may occur, for example, when some or all of the money that you invested in the Fund is paid back to you. A return of capital distribution does not necessarily reflect the Fund's investment performance and should not be confused with \"yield\" or \"income.\"</p><p>The amounts and sources of distributions reported in this Notice are only estimates and are not being provided for tax reporting purposes. The actual amounts and sources of the amounts for tax reporting purposes will depend upon the Fund's investment experience during the remainder of its fiscal year and may be subject to changes based on tax regulations. The Fund will send you a Form 1099-DIV for the calendar year that will tell you how to report these distributions for federal income tax purposes.</p><p>The Fund has declared the February 2026 distribution pursuant to the Fund's managed distribution plan (the \"Plan\"). Under the Plan, the Fund makes fixed monthly distributions in the amount of <money><money>$0.08</money>25</money> per share, which will continue to be paid monthly until further notice.</p><p>If you have questions or need additional information, please contact your financial professional or call the Manulife John Hancock Closed-End Fund Information Line at 1-800-843-0090, Monday through Friday between 8:00 a.m. and 7:00 p.m., Eastern Time.</p><p><i>Statements in this press release that are not historical facts are forward-looking statements as defined by <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location> securities laws. You should exercise caution in interpreting and relying on forward-looking statements because they are subject to uncertainties and other factors which are, in some cases, beyond the Fund's control and could cause actual results to differ materially from those set forth in the forward-looking statements.</i></p><p><i>An investor should consider a Fund's investment objectives, risks, charges and expenses carefully before investing.</i></p><p><b>About Manulife John Hancock Investments </b></p><p>We serve investors through a unique multimanager approach, complementing our extensive in-house capabilities with an unrivaled network of specialized asset managers, backed by some of the most rigorous investment oversight in the industry. The result is a diverse lineup of time-tested investments from a premier asset manager with a heritage of financial stewardship.</p><p><b>About Manulife Wealth &amp; Asset Management </b></p><p>As part of Manulife Financial Corporation, Manulife Wealth &amp; Asset Management provides global investment, financial advice, and retirement plan services to 19 million individuals, institutions, and retirement plan members worldwide. Our mission is to make decisions easier and lives better by empowering people today to invest for a better tomorrow. As a committed partner to our clients and as a responsible steward of investor capital, we offer a heritage of risk management, deep expertise across public and private markets, and comprehensive retirement plan services. We seek to provide better investment and impact outcomes and to help people confidently save and invest for a more secure financial future. Not all offerings are available in all jurisdictions. For additional information, please visit manulife.com.</p><p>Media Contact: <br/>Gordon Haight<br/>(617) 572-0034</p><p>Investor Contact:<br/>(800) 843-0090</p><p>SOURCE John Hancock Investment Management</p></div></article>",
            "link": "https://www.stocktitan.net/news/PDT/john-hancock-premium-dividend-fund-notice-to-shareholders-sources-of-guu8kmo35sex.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:44:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NEUBERGER REAL ESTATE SECURITIES INCOME FUND ANNOUNCES MONTHLY DISTRIBUTION | NRO Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.ny.nyc\">NEW YORK</location></span>, <span class=\"legendSpanClass\">Feb. 27, 2026</span> /PRNewswire/ -- Neuberger Real Estate Securities Income Fund Inc. (<b>NYSE American: NRO</b>) (the \"Fund\") has announced a distribution declaration of <money><money>$0.03</money>12</money> per share of common stock. The distribution announced today is payable on March 31, 2026, has a record date of March 16, 2026, and has an ex-date of March 16, 2026.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\"><p><a href=\"https://mma.prnewswire.com/media/75472/neuberger_berman_group_llc_logo.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"Neuberger Berman Logo (PRNewsFoto/Neuberger Berman Group LLC)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/75472/neuberger_berman_group_llc_logo.jpg\" title=\"Neuberger Berman Logo (PRNewsFoto/Neuberger Berman Group LLC)\"/></a></p></div><p>Under its level distribution policy, the Fund anticipates that it will make regular monthly distributions, subject to market conditions, of <money><money>$0.03</money>12</money> per share of common stock, unless further action is taken to determine another amount. There is no assurance that the Fund will always be able to pay a distribution of any particular amount or that a distribution will consist of only net investment income. The Fund's ability to maintain its current distribution rate will depend on a number of factors, including the amount and stability of income received from its investments, availability of capital gains, the amount of leverage employed by the Fund, the cost of leverage and the level of other Fund fees and expenses.</p><p>The distribution announced today, as well as future distributions, may consist of net investment income, net realized capital gains and return of capital. In compliance with Section 19 of the Investment Company Act of 1940, as amended, a notice would be provided for any distribution that does not consist solely of net investment income. The notice would be for informational purposes and not for tax reporting purposes, and would disclose, among other things, estimated portions of the distribution, if any, consisting of net investment income, capital gains and return of capital. The final determination of the source and tax characteristics of all distributions paid in 2026 will be made after the end of the year.</p><p><b>About Neuberger </b></p><p>Neuberger is an employee-owned, private, independent investment manager founded in 1939 with approximately 3,000 employees across 27 countries. The firm manages <money><money>$563 billion</money></money> of equities, fixed income, private equity, real estate and hedge fund portfolios for global institutions, advisors and individuals. Neuberger's investment philosophy is founded on active management, fundamental research and engaged ownership. The firm is proud to be recognized for its commitment to its two constituents, clients and employees. Again in 2025, we were named Best Asset Manager for Institutional Investors in the US (Crisil Coalition Greenwich) and the #1 Best Place to Work in Money Management (Pensions &amp; Investments, firms with more than 1,000 employees). Neuberger has no corporate parent or unaffiliated external shareholders. Visit <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629291-4&amp;h=3294740042&amp;u=http%3A%2F%2Fwww.nb.com%2F&amp;a=www.nb.com\" rel=\"nofollow noopener\" target=\"_blank\">www.nb.com</a> for more information, including <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629291-4&amp;h=705745777&amp;u=http%3A%2F%2Fwww.nb.com%2Fdisclosure-global-communications&amp;a=www.nb.com%2Fdisclosure-global-communications\" rel=\"nofollow noopener\" target=\"_blank\">www.nb.com/disclosure-global-communications</a> for information on awards. Data as of December 31, 2025.</p><p>Statements made in this release that look forward in time involve risks and uncertainties. Such risks and uncertainties include, without limitation, the adverse effect from a decline in the securities markets or a decline in the Fund's performance, a general downturn in the economy, competition from other closed end investment companies, changes in government policy or regulation, inability of the Fund's investment adviser to attract or retain key employees, inability of the Fund to implement its investment strategy, inability of the Fund to manage rapid expansion and unforeseen costs and other effects related to legal proceedings or investigations of governmental and self-regulatory organizations.</p><p><b>Contact: <br/></b>Neuberger Berman Investment Advisers LLC <br/>Investor Information<br/>(877) 461-1899</p><p>SOURCE Neuberger Berman</p></div></article>",
            "link": "https://www.stocktitan.net/news/NRO/neuberger-real-estate-securities-income-fund-announces-monthly-3ympp0sln048.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:30:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Quaker Houghton Announces Quarterly Dividend | KWR Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.pa.conken\">CONSHOHOCKEN, Pa.</location></span>, <span class=\"legendSpanClass\">Feb. 27, 2026</span> /PRNewswire/ -- The Board of Directors of Quaker Houghton (NYSE: <a class=\"symbol-link\" href=\"/overview/KWR/\" title=\"View KWR stock overview\">KWR</a>) today declared a quarterly cash dividend of <money><money>$0.50</money>8</money> per share, payable on April 30, 2026, to shareholders of record at the close of business on April 16, 2026.</p><p><b>About Quaker Houghton<br/></b>Quaker Houghton is the global leader in industrial process fluids. With a presence around the world, including operations in over 25 countries, our customers include thousands of the world's most advanced and specialized steel, aluminum, automotive, aerospace, offshore, container, mining, and metalworking companies. Our high-performing, innovative and sustainable solutions are backed by best-in-class technology, deep process knowledge and customized services. With approximately 4,700 employees, including chemists, engineers and industry experts, we partner with our customers to improve their operations so they can run even more efficiently, even more effectively, whatever comes next. Quaker Houghton is headquartered in <location idsrc=\"xmltag.org\" value=\"LU/us.pa.conken\">Conshohocken, Pennsylvania</location>, located near <location idsrc=\"xmltag.org\" value=\"LU/us.pa.phldph\">Philadelphia</location> in <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location>. Visit quakerhoughton.com to learn more.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder7266\"><p><a href=\"https://mma.prnewswire.com/media/967587/Quaker_Houghton_tagline_Logo.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"Quaker Houghton (PRNewsfoto/Quaker Houghton)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/967587/Quaker_Houghton_tagline_Logo.jpg\" title=\"Quaker Houghton (PRNewsfoto/Quaker Houghton)\"/></a></p></div><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder0\"></div><p>SOURCE Quaker Houghton</p></div></article>",
            "link": "https://www.stocktitan.net/news/KWR/quaker-houghton-announces-quarterly-fybp9v10o8uz.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:30:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Burcon Closes Second Tranche of Non-Brokered Private Placement of Convertible Debentures of up to $6.9 Million | BRCNF Stock News",
            "description": "<article class=\"article\"><p>Vancouver, British Columbia--(Newsfile Corp. - February 27, 2026) - Burcon NutraScience Corporation (TSX: BU) (OTCQB: <a class=\"symbol-link\" href=\"/overview/BRCNF/\" title=\"View BRCNF stock overview\">BRCNF</a>) (\"<b>Burcon</b>\" or the \"<b>Company</b>\"), a global technology leader in plant-based protein innovation, is pleased to announce the closing of the second tranche of its previously announced non-brokered private placement (see news releases of the Company dated January 2, 2026 and January 9, 2026) of convertible debentures (the <b>\"Convertible Debentures\"</b>) for an aggregate principal amount of <money>$6.9 million</money> (the <b>\"Private Placement\"</b>). </p><p>Under the second tranche, Burcon issued Convertible Debentures in the aggregate principal amount of <money>$2.75 million</money>. To date, insiders of the Company have subscribed for Convertible Debentures totaling <money>$2.7 million</money> in principal amount under the first and second tranches and Burcon has closed an aggregate of <money>$4 million</money> principal amount under the Private Placement. The Company expects to close the final tranche of the Private Placement prior to April 24, 2026.</p><p>\"The successful closing of the cash portion of our financing marks an important milestone for Burcon,\" said Kip Underwood, Burcon's Chief Executive Officer. \"With the full targeted cash proceeds now secured, we have strengthened our balance sheet and enhanced our ability to scale production and accelerate commercial execution. The remaining loan conversion component is a non-cash transaction and will further align stakeholders as we continue building long-term value.\"</p><p><b>Convertible Debentures Details</b></p><table border=\"0\" cellpadding=\"3\" cellspacing=\"0\" style=\"width: 100%; border-collapse: collapse; border-width: 1px; border-style: solid; border-\"><tbody><tr><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\"><b>Tranche</b></td><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\"><b>Principal Amount</b></td><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\"><b>Closing Date</b></td><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\"><b>Component</b></td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\">First Tranche</td><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\"><money>$1.25 million</money></td><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\">December 31, 2025</td><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\">Cash</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\">Second Tranche</td><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\"><money>$2.75 million</money></td><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\">February 27, 2026</td><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\">Cash</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\">Final Tranche</td><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\"><money>$2.90 million</money></td><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\">Prior to April 24, 2026</td><td style=\"border-width: 1px; border-style: solid; border- width: 25%; font-size: 10px;\">Non-cash loan conversion</td></tr></tbody></table><p> </p><p>The Convertible Debentures terms and use the net proceeds from the Private Placement are set out in the Company's news release dated January 2, 2026. The Company did not pay any finder's fee in connection with the Private Placement. The Company has received an aggregate of <money>$4 million</money> in cash from the closing of the first and second tranches of the Private Placement. As disclosed in the Company's management proxy circular dated January 12, 2026, the Company expects that <money>$2.3 million</money> of the Private Placement will be paid by way of an offset from a loan due to an insider of the Company. A further <money>$600,000</money> of the Private Placement is expected to be paid by way of an offset from a loan due to an insider of the Company. </p><p>The issuance of Convertible Debentures to insiders under the Private Placement will be considered a related party transaction under Multilateral Instrument 61-101. The Company intends to rely on exemptions from the formal valuation and minority shareholder approval requirements provided under sections 5.5(a) and 5.7(1)(a) of Multilateral Instrument 61-101 on the basis that the participation in the Private Placement by insiders does not exceed <percent>25%</percent> of the Company's market capitalization.</p><p>The securities being offered under the Private Placement have not been and will not be registered under the United States Securities Act of 1933, as amended,  or any state securities laws and may not be offered or sold in the United States or to, or for the account or benefit of, U.S. persons absent registration or an applicable exemption from the registration requirements. This press release does not constitute an offer to sell or the solicitation of an offer to buy nor will there be any sale of the securities in any State in which such offer, solicitation or sale would be unlawful.</p><p><b>About Burcon NutraScience Corporation</b></p><p>Burcon is a global technology leader in high-performance plant-based proteins for the food and beverage industry. Our commercial ingredients offer superior taste, texture, and functionality—ideal for formulators seeking next-generation protein solutions. Backed by over two decades of innovation, Burcon holds an extensive patent portfolio covering novel proteins derived from pea, canola, soy, hemp, sunflower, and other plant sources. As a key player in the rapidly growing plant-based market, Burcon is committed to sustainability and to creating best-in-class protein solutions that are better for people and the planet. Learn more at <a href=\"https://api.newsfilecorp.com/redirect/y4vbQcbZYx\" rel=\"nofollow noopener\">www.burcon.ca</a>.</p><p><b>Forward-Looking Information Cautionary Statement</b></p><p>The TSX has not reviewed and does not accept responsibility for the adequacy of the content of the information contained herein. This press release contains forward-looking statements or forward-looking information within the meaning of the U.S. Private Securities Litigation Reform Act of 1995 and applicable Canadian securities legislation. Forward-looking statements or forward-looking information involve risks, uncertainties and other factors that could cause actual results, performances, prospects and opportunities to differ materially from those expressed or implied by such forward-looking statements. Forward-looking statements or forward-looking information can be identified by words such as \"anticipate,\" \"aim\", \"intend,\" \"plan,\" \"goal,\" \"project,\" \"estimate,\" \"expect,\" \"believe,\" \"future,\" \"likely,\" \"may,\" \"should,\" \"could,\" \"will\" and similar references to future periods. All statements included in this release, other than statements of historical fact, are forward-looking statements. There can be no assurance that such statements will prove to be accurate, and actual results and future events could differ materially from those anticipated in such statements or information. Important factors that could cause actual results to differ materially from Burcon's plans and expectations include the implementation of our business model and growth strategies; trends and competition in our industry our future business development, financial condition and results of operations and our ability to obtain financing cost-effectively; potential changes of government regulations, and other risks and factors detailed herein and from time to time in the filings made by Burcon with securities regulators and stock exchanges, including in the section entitled \"Risk Factors\" in Burcon's annual information form for the year ended March 31, 2025 and its other public filings with Canadian securities regulators on SEDAR+ at <a href=\"https://api.newsfilecorp.com/redirect/1KQaouRb3K\" rel=\"nofollow noopener\">www.sedarplus.ca</a>. This list is not exhaustive of the factors that may affect any of the Company's forward-looking statements or information.  Any forward-looking statement or information speaks only as of the date on which it was made, and, except as may be required by applicable securities laws, Burcon disclaims any intent or obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise. Although Burcon believes the assumptions inherent in the forward-looking statements are reasonable, forward-looking statements are not guarantees of future performance, and, accordingly, investors should not rely on such statements.</p><div id=\"contactInfo\"><p><b>Industry and Investor Contact<br/></b>Paul Lam<br/>Director, Investor Relations and Communications<br/>Burcon NutraScience Corporation<br/>490 - 999 West Broadway, Vancouver, BC, V5Z 1K5<br/>Tel (604) 733-0896, Toll-free (888) 408-7960<br/><a href=\"mailto:plam@burcon.ca\" rel=\"nofollow noopener\">plam@burcon.ca</a> <a href=\"https://api.newsfilecorp.com/redirect/A8qvespveJ\" rel=\"nofollow noopener\">www.burcon.ca</a> </p><p><b>Media Contact:<br/></b>Steve Campbell, APR<br/>President<br/>Campbell &amp; Company Public Relations<br/>Tel (604) 888-5267<br/><a href=\"mailto:TECH@CCOM-PR.COM\" rel=\"nofollow noopener\">TECH@CCOM-PR.COM</a></p></div><p id=\"corporateNewsLogoContainer\"><img alt=\"Corporate Logo\" id=\"corporateNewsLogo\" loading=\"lazy\" src=\"https://images.newsfilecorp.com/files/1725/285731_46c255e354a2bad2_logo.jpg\"/></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/ZEjWPTMz81\" rel=\"nofollow noopener\">https://www.newsfilecorp.com/release/285731</a></p><p><img alt=\"\" loading=\"lazy\" src=\"https://api.newsfilecorp.com/newsinfo/285731/375\"/></p></article>",
            "link": "https://www.stocktitan.net/news/BRCNF/burcon-closes-second-tranche-of-non-brokered-private-placement-of-qqyjpu7i49ar.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:37:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FMC Corporation Announces Election of Michael F. Barry to Board of Directors | FMC Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder3291\"><p><a href=\"https://mma.prnewswire.com/media/2922351/Michael_F_Barry.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/2922351/Michael_F_Barry.jpg\" title=\"\"/></a></p></div><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.pa.phldph\">PHILADELPHIA</location></span>, <span class=\"legendSpanClass\">Feb. 27, 2026</span> /PRNewswire/ -- <a class=\"symbol-link\" href=\"/overview/FMC/\" title=\"View FMC stock overview\">FMC</a> Corporation (NYSE: <a class=\"symbol-link\" href=\"/overview/FMC/\" title=\"View FMC stock overview\">FMC</a>), a leading global agricultural sciences company, today announced the election of Michael F. Barry to the company's Board of Directors, effective February 27, 2026. He will serve on the Audit and Compensation and Human Capital committees.</p><p>Barry brings more than three decades of global leadership experience in the specialty chemicals industry to <a class=\"symbol-link\" href=\"/overview/FMC/\" title=\"View FMC stock overview\">FMC</a>'s Board. He currently serves as chairman of the Board of Directors of Quaker Houghton and previously served as chief executive officer and president of Quaker Houghton until his retirement in November 2021.</p><p>\"We are pleased to welcome Michael to the FMC Board of Directors,\" said Pierre Brondeau, FMC chairman, chief executive officer and president. \"Michael has led through complex industry cycles and brings proven experience navigating strategic transformations. His perspective will be invaluable as FMC embarks on its 2026 strategic priorities.\"</p><p>Barry joined Quaker in 1998 and held a series of senior leadership roles, including chief financial officer, before being appointed chief executive officer in 2008 and chairman in 2009. During his tenure as chief executive officer, the company grew revenue from <money><money>$451 million</money></money> in 2009 to <money><money>$1.8 billion</money></money> in 2021. Under his leadership, Quaker Houghton completed 27 strategic acquisitions. Most notably, Barry led the 2019 combination of Quaker Chemical and Houghton International, which doubled the company's revenue and global footprint, creating one of the world's largest industrial process fluids companies.</p><p>\"I welcome the opportunity to join FMC's Board of Directors,\" said Barry. \"FMC has a strong foundation, and I look forward to working with the board and management team to create long-term value for our shareholders, customers and employees at this pivotal juncture for the company.\"</p><p>Barry brings significant board experience, having served on the boards of Rogers Corporation and Arcadium Lithium plc (formerly Livent Corporation), where he held leadership roles on the Audit and Compensation committees.</p><p><b>About FMC</b></p><p>FMC Corporation is a global agricultural sciences company dedicated to helping growers produce food, feed, fiber and fuel for an expanding world population while adapting to a changing environment. FMC's innovative crop protection solutions – including biologicals, crop nutrition, digital and precision agriculture – enable growers and crop advisers to address their toughest challenges economically while protecting the environment. FMC is committed to discovering new herbicide, insecticide and fungicide active ingredients, product formulations and pioneering technologies that are consistently better for the planet. Visit fmc.com to learn more and follow us on <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629353-1&amp;h=2111848183&amp;u=https%3A%2F%2Fwww.linkedin.com%2Fschool%2Ffmc-corporation%2F&amp;a=LinkedIn\" rel=\"nofollow noopener\" target=\"_blank\">LinkedIn</a><sup>®</sup>.</p><p><i>Statement under the Safe Harbor Provisions of the Private Securities Litigation Reform Act of 1995: FMC and its representatives may from time to time make written or oral statements that are \"forward-looking\" and provide other than historical information, including statements contained in this press release, in FMC's other filings with the SEC, and in presentations, reports or letters to FMC stockholders. In some cases, FMC has identified these forward-looking statements by such words or phrases as \"outlook,\" \"will likely result,\" \"look forward to,\"\"is confident that,\" \"expect,\" \"expects,\" \"should,\" \"could,\" \"may,\" \"will continue to,\" \"believe,\" \"believes,\" \"anticipates,\" \"predicts,\" \"forecasts,\" \"estimates,\" \"projects,\" \"potential,\" \"intends\" or similar expressions identifying \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995, including the negative of those words or phrases. Such forward-looking statements are based on our current views and assumptions regarding future events, future business conditions and the outlook for the company based on currently available information. The forward-looking statements involve known and unknown risks, uncertainties and other factors that may cause actual results to be materially different from any results, levels of activity, performance or achievements expressed or implied by any forward-looking statement. These statements are qualified by reference to the risk factors included in Part I, Item 1A of our Annual Report on Form 10-K for the year ended December 31, 2025 (the \"2024 Form 10-K\"), the section captioned \"Forward-Looking Information\" in Part II of the 2025 Form 10- K and to similar risk factors and cautionary statements in all other reports and forms filed with the Securities and Exchange Commission (\"SEC\"). We wish to caution readers not to place undue reliance on any such forward-looking statements, which speak only as of the date made. Forward-looking statements are qualified in their entirety by the above cautionary statement. We specifically decline to undertake any obligation, and specifically disclaim any duty, to publicly update or revise any forward-looking statements that have been made to reflect events or circumstances after the date of such statements or to reflect the occurrence of anticipated or unanticipated events, except as may be required by law.</i></p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder0\"><p><a href=\"https://mma.prnewswire.com/media/331912/fmc_corporation_logo.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"FMC Corporation Logo. (PRNewsFoto/FMC Corporation)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/331912/fmc_corporation_logo.jpg\" title=\"FMC Corporation Logo. (PRNewsFoto/FMC Corporation)\"/></a></p></div><p>SOURCE FMC Corporation</p></div></article>",
            "link": "https://www.stocktitan.net/news/FMC/fmc-corporation-announces-election-of-michael-f-barry-to-board-of-dyzontd20u99.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:30:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BlackRock Utilities, Infrastructure, & Power Opportunities Trust (BUI) Announces Terms of Rights Offering | BUI Stock News",
            "description": "<article class=\"article\"><p> </p><p> <location idsrc=\"xmltag.org\" value=\"LU/us.ny.nyc\">NEW YORK</location>--(BUSINESS WIRE)--BlackRock Utilities, Infrastructure, &amp; Power Opportunities Trust (NYSE: <a class=\"symbol-link\" href=\"/overview/BUI/\" title=\"View BUI stock overview\">BUI</a>) (the \"Fund\") today announced the terms of transferable rights (\"Rights\") to be issued to the holders of the Fund's common shares of beneficial interest (par value <money><money>$0.00</money>1</money> per share) (\"Shares\") as of March 9, 2026 (the \"Record Date\"). Holders of Rights will be entitled to subscribe for additional Shares (the \"Offer\") at a discount to the market price of the Shares.</p><p>After considering a number of factors, including potential benefits and costs, the Fund’s Board of Trustees (the “Board”) and the Fund's investment adviser, BlackRock Advisors, LLC (the \"Adviser\"), have determined that it is in the best interests of both the Fund and its shareholders to conduct the Offer and increase the assets of the Fund available to take advantage of existing and future investment opportunities that are consistent with the Fund’s investment objectives to provide total return and income through a combination of current income and long-term capital appreciation.</p><p><b>All expenses of the Offer will be borne by the Adviser, and not by the Fund or any of the Fund's shareholders.</b></p><p>The Adviser believes this is an attractive time to raise additional assets for the Fund based on several factors, including the following potential benefits:</p><ul class=\"bwlistdisc\"><li><b>Infrastructure: </b>Infrastructure<b> </b>sits at the intersection of three structural mega forces - the Artificial Intelligence buildout, national security priorities, and the transition to a lower carbon economy - creating sustained investment opportunities. Additionally, listed infrastructure valuations are attractive relative to history, providing a compelling entry point for new capital.<br/><br/></li><li><b>Utilities:</b> Utilities have a pressing need to raise significant capital. Rising power demand and reshoring of power supply chains are stressing existing grids and triggering the largest utility capex cycle in decades, and the Adviser believes the Fund is well-positioned to deploy capital into these opportunities.<br/><br/></li><li><b>Reward</b>: Rights provide shareholders with an opportunity to buy new shares below market price or potentially realize value from the sale of Rights.<br/><br/></li><li><b>No offering fees</b>: The Adviser, not the Fund, is paying for the expenses of the Offer.<br/><br/></li><li><b>Lower expense ratio</b>: The Offer is anticipated to spread fixed operating costs across a larger asset base.<br/><br/></li><li><b>Enhanced liquidity</b>: The Offer creates the potential for increased trading volume and liquidity of Shares.</li></ul><p><b>The Fund expects to maintain its current distribution level following the Offer.</b> Shares issued pursuant to the Offer will be entitled to receive the monthly distribution expected to be payable in April 2026, but will <span class=\"bwuline\">not</span> be eligible for the distribution payable in March 2026.</p><p>Certain key terms of the Offer include:</p><ul class=\"bwlistdisc\"><li><b>Rights ratio:</b> Holders of Shares on the Record Date (\"Record Date Shareholders\") will receive one Right for each outstanding Share owned on the Record Date. Rights entitle the holder to purchase one new Share for every 4 Rights exercised (1-for-4); however, any Record Date Shareholder who owns fewer than four Shares as of the Record Date will be entitled to subscribe for one Share. Fractional Shares will not be issued upon the exercise of Rights.<br/><br/></li><li><b>Pricing formula:</b> The subscription price per Share (the \"Subscription Price\") will be determined on the expiration date of the Offer, which is currently expected to be April 2, 2026, unless extended by the Fund (the \"Expiration Date\"), and will be equal to <percent>95%</percent> of the average of the last reported sales price per Share on the New York Stock Exchange (the \"NYSE\") on the Expiration Date and each of the four (4) immediately preceding trading days provided that, if such price is equal to or above net asset value (“NAV”) at the Expiration Date, it shall be reduced to <money><money>$0.01</money></money> below NAV on the Expiration Date (the \"Formula Price\"). If, however, the Formula Price is less than <percent>95%</percent> of the Fund's NAV per Share at the close of trading on the NYSE on the Expiration Date, the Subscription Price will be <percent>95%</percent> of the Fund's NAV per Share at the close of trading on the NYSE on the Expiration Date. The Subscription Price will be determined by the Fund on the Expiration Date.<br/><br/></li><li><b>Over-subscription privilege:</b> Record Date Shareholders who fully exercise all Rights issued to them can subscribe, subject to certain limitations and allotment, for any additional Shares which were not subscribed for by other holders of Rights at the Subscription Price, provided that the Board may eliminate this over-subscription privilege. Investors who are not Record Date Shareholders but who otherwise acquire Rights in the secondary market are not entitled to participate in the over-subscription privilege. If sufficient Shares are available, all Record Date Shareholders' over-subscription requests will be honored in full. If these requests exceed available Shares, they will be allocated pro rata among those fully exercising Record Date Shareholders who over-subscribe based on the number of Rights originally issued to them by the Fund.<br/><br/></li><li><b>Transferable rights:</b> Rights are transferable and are expected to be admitted for trading on the NYSE under the symbol \"<a class=\"symbol-link\" href=\"/overview/BUI/\" title=\"View BUI stock overview\">BUI</a> RT\" during the course of the Offer and will cease trading April 1, 2026, one trading day before the Expiration Date. During this time, Record Date Shareholders may choose to sell their Rights if they do not intend to subscribe for additional Shares.</li></ul><p>The Offer will be made only by means of a prospectus supplement and accompanying prospectus. The Fund expects to mail subscription certificates evidencing the Rights and a copy of the prospectus supplement and accompanying prospectus for the Offer to Record Date Shareholders within <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location> shortly following the Record Date. To exercise their Rights, shareholders who hold their Shares through a broker, custodian or trust company should contact such entity to forward their instructions to either exercise or sell their Rights on their behalf. Shareholders who do not hold Shares through a broker, custodian, or trust company should forward their instructions to either exercise or sell their Rights by completing the subscription certificate and delivering it to the subscription agent for the Offer, together with their payment, at one of the locations indicated on the subscription certificate or in the prospectus supplement.</p><p><b>The information in this press release is not complete and is subject to change. This document is not an offer to sell any securities and is not soliciting an offer to buy any securities in any jurisdiction where the offer or sale is not permitted. This document is not an offering, which can only be made by a prospectus. Investors should consider the Fund's investment objective, risks, charges and expenses carefully before investing. The Fund's prospectus supplement and accompanying prospectus will contain this and additional information about the Fund and additional information about the Offer, and should be read carefully before investing. For further information regarding the Offer, or to obtain a prospectus supplement and the accompanying prospectus, when available, please contact the Fund's information agent:</b></p><p>Georgeson LLC<br/>51 West 52nd Street, 6th Floor<br/><location idsrc=\"xmltag.org\" value=\"LU/us.ny.nyc\">New York, NY</location> 10019<br/>1-866-946-8126</p><p>The Fund’s at-the-market offering of Shares will be terminated prior to the commencement of the Offer.</p><p><b>About BlackRock</b></p><p>BlackRock’s purpose is to help more and more people experience financial well-being. As a fiduciary to investors and a leading provider of financial technology, we help millions of people build savings that serve them throughout their lives by making investing easier and more affordable. For additional information on BlackRock, please visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.blackrock.com%2Fcorporate&amp;esheet=54435616&amp;newsitemid=20260227268068&amp;lan=en-US&amp;anchor=www.blackrock.com%2Fcorporate&amp;index=1&amp;md5=e1d700e7eff395fc20e3fd691d91246b\" rel=\"nofollow noopener\" shape=\"rect\">www.blackrock.com/corporate</a>.</p><p><b>Availability of Fund Updates</b></p><p>BlackRock will update performance and certain other data for the Fund on a monthly basis on its website in the “Closed-end Funds” section of <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.blackrock.com&amp;esheet=54435616&amp;newsitemid=20260227268068&amp;lan=en-US&amp;anchor=www.blackrock.com&amp;index=2&amp;md5=8bd756a9ded812e48f3aa41ea53d4d35\" rel=\"nofollow noopener\" shape=\"rect\">www.blackrock.com</a> as well as certain other material information as necessary from time to time. Investors and others are advised to check the website for updated performance information and the release of other material information about the Fund. This reference to BlackRock’s website is intended to allow investors public access to information regarding the Fund and does not, and is not intended to, incorporate BlackRock’s website in this release.</p><p><b>Forward-Looking Statements</b></p><p>This press release, and other statements that BlackRock or the Fund may make, may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act, with respect to the Fund’s or BlackRock’s future financial or business performance, strategies or expectations. Forward-looking statements are typically identified by words or phrases such as “trend,” “potential,” “opportunity,” “pipeline,” “believe,” “comfortable,” “expect,” “anticipate,” “current,” “intention,” “estimate,” “position,” “assume,” “outlook,” “continue,” “remain,” “maintain,” “sustain,” “seek,” “achieve,” and similar expressions, or future or conditional verbs such as “will,” “would,” “should,” “could,” “may” or similar expressions.</p><p>BlackRock cautions that forward-looking statements are subject to numerous assumptions, risks and uncertainties, which change over time. Forward-looking statements speak only as of the date they are made, and BlackRock assumes no duty to and does not undertake to update forward-looking statements. Actual results could differ materially from those anticipated in forward-looking statements and future results could differ materially from historical performance.</p><p>With respect to the Fund, the following factors, among others, could cause actual events to differ materially from forward-looking statements or historical performance: (1) changes and volatility in political, economic or industry conditions, the interest rate environment, foreign exchange rates or financial and capital markets, which could result in changes in demand for the Fund or in the Fund’s net asset value; (2) the relative and absolute investment performance of the Fund and its investments; (3) the impact of increased competition; (4) the unfavorable resolution of any legal proceedings; (5) the extent and timing of any distributions or share repurchases; (6) the impact, extent and timing of technological changes; (7) the impact of legislative and regulatory actions and reforms, and regulatory, supervisory or enforcement actions of government agencies relating to the Fund or BlackRock, as applicable; (8) terrorist activities, international hostilities, health epidemics and/or pandemics and natural disasters, which may adversely affect the general economy, domestic and local financial and capital markets, specific industries or BlackRock; (9) BlackRock’s ability to attract and retain highly talented professionals; (10) the impact of BlackRock electing to provide support to its products from time to time; and (11) the impact of problems at other financial institutions or the failure or negative performance of products at other financial institutions.</p><p>Annual and Semi-Annual Reports and other regulatory filings of the Fund with the Securities and Exchange Commission (“SEC”) are accessible on the SEC's website at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.sec.gov&amp;esheet=54435616&amp;newsitemid=20260227268068&amp;lan=en-US&amp;anchor=www.sec.gov&amp;index=3&amp;md5=625fcf5715617d38482741850f9ca373\" rel=\"nofollow noopener\" shape=\"rect\"><b>www.sec.gov</b></a><b> </b>and on BlackRock’s website at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.blackrock.com&amp;esheet=54435616&amp;newsitemid=20260227268068&amp;lan=en-US&amp;anchor=www.blackrock.com&amp;index=4&amp;md5=344b0a242201ac54406b78f112e6899c\" rel=\"nofollow noopener\" shape=\"rect\"><b>www.blackrock.com</b></a>, and may discuss these or other factors that affect the Fund. The information contained on BlackRock’s website is not a part of this press release.</p><p><img alt=\"\" loading=\"lazy\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260227268068r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\"/><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20260227268068/en/\" rel=\"nofollow noopener\">https://www.businesswire.com/news/home/20260227268068/en/</a></span></p><p><b>1-800-882-0052</b></p><p>Source: BlackRock Closed-End Funds</p></article>",
            "link": "https://www.stocktitan.net/news/BUI/black-rock-utilities-infrastructure-power-opportunities-trust-bui-0opptjo8mgau.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 21:32:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        }
    ]
}