{
    "data": [
        {
            "title": "Riverside Resources Expands Porphyry Copper Targets at Ariel Project, Sonora, Mexico | RVSDF Stock News",
            "description": "<article class=\"article\"><p>Vancouver, British Columbia--(Newsfile Corp. - February 26, 2026) - Riverside Resources Inc. (TSXV: RRI) (OTCQB: <a class=\"symbol-link\" href=\"/overview/RVSDF/\" title=\"View RVSDF stock overview\">RVSDF</a>) (FSE: 5YY0) (\"<b>Riverside</b>\" or the \"<b>Company</b>\"), is pleased to announce early 2026 assay and porphyry Cu exploration results at the <percent>100%</percent>-owned Ariel Copper Project (the \"Ariel Project\" or \"Ariel\") in Sonora, Mexico. Ariel is a drill-permitted, district-scale porphyry copper-gold set of targets located approximately 18 km east-southeast of the La Caridad copper mining complex in the highly productive Laramide-age Arizona-Sonora copper mining belt. </p><p><b>2026 Exploration Highlights</b></p><ul style=\"list-style-type: disc;\"><li><p>High-grade base metals with <percent>5.4%</percent> Pb, 320 g/t Ag in veins both as targets and high-level, lateral indicators for the Ariel Porphyry Cu target</p></li><li><p>Sampling of veins in the north as shown on maps and cross section below link for the upgrade porphyry Cu target linking Maria Luisa and Ariel targets</p></li><li><p>Age dating at Ariel provides similar age to La Caridad and Cananea Mine host rocks further linking the geologic comparisons for the project to major copper districts</p></li><li><p>Applying spectral mineral analysis (near-infrared/short-wave infrared methods) to map alteration minerals commonly associated with porphyry and high-sulphidation systems, including advanced argillic assemblages and breccia-related alteration styles documented at Ariel. </p></li><li><p>Integrating mapping, alteration interpretation, and regional geophysical datasets to prioritize drill collars within permitted areas with full drive-up easy access.</p></li><li><p>Riverside sees the project ready for partnering and moving ahead as it has multiple partnerships with diverse companies on the Riverside portfolio, Ariel is now ready for partnering and drilling toward making a major copper discovery.</p></li></ul><p>Building on Riverside's consolidation of the Ariel Project through acquisition of the adjacent Maria Luisa concessions, the Company has now conducted expanded early 2026 field work and has received high grade silver and lead samples from veins, porphyry style alterations, and turquoise mines that are all part of the advancing target definition work with detailed mapping, sampling, alteration mineral studies summarized in the graphics below.   These high grades are significant because they are comparable to those seen in other major Arizona-Sonora mining camps, where early mining of silver veins later evolved into major copper discoveries at more than a dozen large mines, including Cananea, La Caridad, Bisbee, Resolution, Morenci, and Ray, to name a few.</p><p>\"Riverside early 2026 field program at the Ariel and Maria Luisa mineral concessions now consolidated into a single, fully permitted drill-ready project area found high grade precious and base metals typical of the major copper mines in the region and now the targets at Ariel continue to improve as the Company derisks the project with systematic fieldwork to sharpen targeting and prepare it for partnering and immediate drilling,\" said John-Mark Staude, CEO of Riverside Resources. \"The combination of geologic mapping, geochemistry, alteration mineral studies, and integrated geophysics is providing stronger vectors into the most prospective zones. Ariel remains a compelling, undrilled copper district target in a premier belt, with excellent access, safety and infrastructure. The recent geochemistry continues to enhance the porphyry Cu target potential at Ariel.\"</p><p><b>Exploration Work and Targeting Progress</b></p><p>Riverside has full mineral title for the Ariel property and has advanced copper exploration through database compilations, field mapping, sampling, remote sensing, mineral concession consolidation and regional geophysical data interpretation, leading to the definition of two principal porphyry target areas (Ariel and Maria Luisa). The project has seen limited to no historical drilling to Riverside's knowledge, and the Company considers Ariel a high-quality, drill-stage copper district target with extensive exposed targets and additional areas masked by shallow post-mineral cover. The Project is available for partnership per the Company's business model of project generation; however, the Company could choose to drill the project given the quality exploration district. </p><p><b>Project Highlights</b></p><ul><li><p>District-scale, consolidated footprint: Ariel totals 1,640 hectares (16 km²) across five fully titled concessions in good standing, including the Maria Luisa area, providing multiple priority target zones for drill testing. </p></li><li><p>Two priority target styles defined: Ongoing work continues to refine (1) a porphyry copper target with near surface copper sulphides and oxides, and (2) an epithermal arget interpreted as the upper portion of a porphyry system, consistent with alteration, veining and breccia styles with walk up safe, easy access on private ranch land. </p></li><li><p>Modern scientific exploration tools improving vectoring: Riverside is applying portable geochemical and mineralogical tools (including portable XRF and short-wave/infrared spectral mineral scanning) to distinguish vein and alteration assemblages and prioritize drill-ready areas. </p></li><li><p>Strategically located in the Sonora, Mexico Laramide copper belt and less than 20km from the La Caridad Cu-Mo porphyry mining complex, with additional regional porphyry prospects in the district. </p></li><li><p>Ariel is underlain by Late Cretaceous volcanic rocks of the Tarahumara Formation intruded by Paleocene (ca. 57 Ma) porphyritic intrusions comparable in age to regional porphyry mineralization events similar to many of the mines in the Arizona- Sonora Belt which includes over 10 significant copper operations.</p></li></ul><p><b>2026 Sampling North Area - \"Maria Luisa\" Epithermal Target</b></p><p>New exploration geochemistry results from the early 2026 program for the Maria Luisa part of the Ariel Project have high grade Ag and Pb typical of lateral expressions of porphyry copper like those in Arizona at Resolution, Globe-Miami and Bingham in Utah. Here, silver values reach up to &gt;10 oz/t Ag and Pb values reach up to <percent>5.4%</percent>, along with gold anomalies of up to 0.4 g/t Au, as shown in the Table, Summary Map, and Cross Section figures in this news release.  The sampling showed multiple sets of parallel veining consistent with what is common in major copper districts. Chip samples ranging from 0.5 to 1.5 m were taken by cutting the veins perpendicularly. Some select sample results include:</p><table border=\"0\" cellpadding=\"3\" cellspacing=\"0\" style=\"width: 100%; border-collapse: collapse; border-width: 1px; border-style: solid; border-\"><tbody><tr><td style=\"border-width: 1px; border-style: solid; border- text-align: center;\"><b>Sample Number</b></td><td style=\"border-width: 1px; border-style: solid; border- width: 75%; text-align: center;\"><b>Assays</b></td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- text-align: center;\">RRI-12911</td><td style=\"border-width: 1px; border-style: solid; border- width: 75%; text-align: center;\">0.42 g/t Au, <percent>0.07%</percent>Pb</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- text-align: center;\">RRI-12912</td><td style=\"border-width: 1px; border-style: solid; border- width: 75%; text-align: center;\"><percent>1.36%</percent> Pb, 0.36 g/t Au,</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- text-align: center;\">RRI-12913</td><td style=\"border-width: 1px; border-style: solid; border- width: 75%; text-align: center;\"><percent>3.14%</percent> Pb, <percent>0.14%</percent> Zn</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- text-align: center;\">RRI-12914</td><td style=\"border-width: 1px; border-style: solid; border- width: 75%; text-align: center;\"><percent>1.03%</percent> Pb</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- text-align: center;\">RRI-12918</td><td style=\"border-width: 1px; border-style: solid; border- width: 75%; text-align: center;\">138 g/t Ag, <percent>5.39%</percent> Pb, 0.34 g/t Au</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- text-align: center;\">RRI-1412</td><td style=\"border-width: 1px; border-style: solid; border- width: 75%; text-align: center;\">225 g/t Ag</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- text-align: center;\">RRI-1419</td><td style=\"border-width: 1px; border-style: solid; border- width: 75%; text-align: center;\">320 g/t Ag</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- text-align: center;\">RRI-1425</td><td style=\"border-width: 1px; border-style: solid; border- width: 75%; text-align: center;\">161 g/t Ag</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- text-align: center;\">RRI-1545</td><td style=\"border-width: 1px; border-style: solid; border- width: 75%; text-align: center;\">200 g/t Ag, 0.657 g/t Au, <percent>1%</percent> Pb</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- text-align: center;\">RRI-11122</td><td style=\"border-width: 1px; border-style: solid; border- width: 75%; text-align: center;\">0.5 g/t Au, <percent>0.131%</percent> Pb</td></tr></tbody></table><p> </p><p>Table 1. Highlights of rock sampling in the northern zone of the Ariel project at Maria Luisa target with high silver and lead typical of the Arizona Sonora major copper operating districts by Riverside. </p><p style=\"text-align: center;\"><a href=\"https://images.newsfilecorp.com/files/6101/285478_b6adfa66842e181f_002full.jpg\" rel=\"nofollow noopener\"><img alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/6101/285478_b6adfa66842e181f_002.jpg\" loading=\"lazy\" src=\"https://images.newsfilecorp.com/files/6101/285478_b6adfa66842e181f_002.jpg\" style=\"border-width: 0px;\"/></a><br/><br/>Figure 1. Drone photo looking NNE up the cross-section line from Ariel porphyry in the south toward the yellow loop and the Maria Luisa epithermal shown in blue loop in the north with epithermal Ag-Pb veins and overall distal parts of the drill ready porphyry target.</p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br/><a href=\"https://images.newsfilecorp.com/files/6101/285478_b6adfa66842e181f_002full.jpg\" rel=\"nofollow noopener\">https://images.newsfilecorp.com/files/6101/285478_b6adfa66842e181f_002full.jpg</a></p><p style=\"text-align: center;\"><a href=\"https://images.newsfilecorp.com/files/6101/285478_b6adfa66842e181f_003full.jpg\" rel=\"nofollow noopener\"><img alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/6101/285478_b6adfa66842e181f_003.jpg\" loading=\"lazy\" src=\"https://images.newsfilecorp.com/files/6101/285478_b6adfa66842e181f_003.jpg\" style=\"border-width: 0px;\"/></a><br/><br/>Figure 2: Map of the rock chip assays and sampling locations of recent results and other Riverside assay exploration data with expanded area showing some detail of the Maria Luisa high grade veins.  Rock chip geochemical samples collected in 2026 (red) and similar results from previous sampling (yellow) part of epithermal target in the north and porphyry copper target of Ariel in the south.</p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br/><a href=\"https://images.newsfilecorp.com/files/6101/285478_b6adfa66842e181f_003full.jpg\" rel=\"nofollow noopener\">https://images.newsfilecorp.com/files/6101/285478_b6adfa66842e181f_003full.jpg</a></p><p style=\"text-align: center;\"><a href=\"https://images.newsfilecorp.com/files/6101/285478_b6adfa66842e181f_004full.jpg\" rel=\"nofollow noopener\"><img alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/6101/285478_b6adfa66842e181f_004.jpg\" loading=\"lazy\" src=\"https://images.newsfilecorp.com/files/6101/285478_b6adfa66842e181f_004.jpg\" style=\"border-width: 0px;\"/></a><br/><br/>Figure 3. Schematic section showing copper porphyry in red and epithermal in yellow cross hatch color to the north and over top with assays of &gt;<percent>5%</percent> Pb and &gt;130 gpt Ag typical for the high sulfidation veins potentially emanating from a related porphyry copper</p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br/><a href=\"https://images.newsfilecorp.com/files/6101/285478_b6adfa66842e181f_004full.jpg\" rel=\"nofollow noopener\">https://images.newsfilecorp.com/files/6101/285478_b6adfa66842e181f_004full.jpg</a></p><p><b>QA - QC, Sampling Management</b></p><p>Rock chip sampling at Ariel was taken generally of 1.5m chip channel and select pieces of rock materials from outcrops.  Samples were then shipped for analysis by ACT Labs in Zacatecas, Mexico. Samples were analyzed for by gold fire assay, with pulps analyzed with Inductively Coupled Plasma-Mas Spectrometry (\"ICP-MS\") following four-acid digestion to determine silver, base metals, and pathfinders. Samples were maintained in chain of custody being delivered to the laboratory in sealed bags. Standards and blanks were inserted every 20 samples and the laboratory also did duplicates every 20 samples as additional check on the quality control.  The QA/QC was analyzed with a check for any variations in the standards beyond 2 standard deviations and the standards passed.   Historic samples were analyzed using the same procedures with samples delivered to Bureau Veritas (Hermosillo, Sonora) for gold fire assay, with pulps forwarded to Vancouver, Canada for Inductively Coupled Plasma-Mas Spectrometry (\"ICP-MS\") following four-acid digestion to determine silver, base metals, and pathfinders.</p><p><b>Qualified Person</b></p><p>The technical content of the news release has been reviewed and approved by Freeman Smith, P.Geo. (British Columbia), a qualified person under National Instrument 43-101 who is non-independent and the Vice President Exploration for the Company.</p><p><b>About Riverside Resources Inc.: </b></p><p>Riverside is a well-funded exploration company driven by value generation and discovery. The Company has a strong balance sheet with over C<money>$5,000,000</money> cash, no debt and tight share structure with a strong portfolio of gold-silver, copper, and REE assets and royalties in North America. Further information about Riverside is available on the Company's website at <a href=\"https://api.newsfilecorp.com/redirect/EZ23Mfj8gp\" rel=\"nofollow noopener\">www.rivres.com</a>.</p><p>ON BEHALF OF RIVERSIDE RESOURCES INC.</p><p>\"John-Mark Staude\"<br/><br/>Dr. John-Mark Staude, President &amp; CEO</p><p>For additional information contact:</p><div id=\"contactInfo\"><table border=\"0\" cellpadding=\"0\" cellspacing=\"0\" style=\"text-align: start; width: 100%; border-collapse: collapse;\"><tbody><tr><td>John-Mark Staude<br/>President, CEO<br/>Riverside Resources Inc. <br/><a href=\"mailto:info@rivres.com\" rel=\"nofollow noopener\">info@rivres.com</a><br/>Phone:  (778) 327-6671<br/>Fax:  (778) 327-6675<br/>Web:  <a href=\"https://api.newsfilecorp.com/redirect/xEj0ziKm5r\" rel=\"nofollow noopener\">www.rivres.com</a></td><td style=\"width: 50%; vertical-align: top;\">Eric Negraeff<br/>Investor Relations<br/>Riverside Resources Inc.<br/>Phone: (778) 327-6671<br/>TF: (877) RIV-RES1<br/>Web: <a href=\"https://api.newsfilecorp.com/redirect/7n15guMA2W\" rel=\"nofollow noopener\">www.rivres.com</a></td></tr></tbody></table></div><p> </p><p><i>Certain statements in this press release may be considered forward-looking information. These statements can be identified by the use of forward-looking terminology (e.g., \"expect\",\" estimates\", \"intends\", \"anticipates\", \"believes\", \"plans\"). Such information involves known and unknown risks -- including the availability of funds, the results of financing and exploration activities, the interpretation of exploration results and other geological data, or unanticipated costs and expenses and other risks identified by Riverside in its public securities filings that may cause actual events to differ materially from current expectations. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this press release.</i></p><p><i>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</i></p><p id=\"corporateNewsLogoContainer\"><img alt=\"Corporate Logo\" id=\"corporateNewsLogo\" loading=\"lazy\" src=\"https://images.newsfilecorp.com/files/6101/285478_b6adfa66842e181f_logo.jpg\"/></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/ejYgvUMGY7\" rel=\"nofollow noopener\">https://www.newsfilecorp.com/release/285478</a></p><p><img alt=\"\" loading=\"lazy\" src=\"https://api.newsfilecorp.com/newsinfo/285478/375\"/></p></article>",
            "link": "https://www.stocktitan.net/news/RVSDF/riverside-resources-expands-porphyry-copper-targets-at-ariel-project-6p6uuojlrpuk.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 15:45:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "THE CORMORANT AT 55 SOUTH: SILVERSEA UNVEILS ALL PUBLIC SPACES OF HIGHLY ANTICIPATED SOUTHERNMOST HOTEL | RCL Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p class=\"prntac\"><i>The Cormorant will create the most convenient, comfortable, and seamless way to explore <location idsrc=\"xmltag.org\" value=\"LB/ant\">Antarctica</location></i></p><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.fl.miami\">MIAMI</location></span>, <span class=\"legendSpanClass\">Feb. 26, 2026</span> /PRNewswire/ -- Silversea, the leading experiential luxury and expedition travel brand, has unveiled the interior spaces of its new 150-room hotel, The Cormorant at 55 South, in Puerto Williams, <location idsrc=\"xmltag.org\" value=\"LC/cl\">Chile</location>, designed to streamline travel to one of the world's most remote destinations, while enhancing the overall guest experience. Set to welcome guests in October 2026, The Cormorant at 55 South, named for its unique location and the resilient seabird, will serve as a cornerstone of Silversea's innovative <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628319-1&amp;h=2945706006&amp;u=https%3A%2F%2Fwww.silversea.com%2Flp-antarctica-fly-cruise.html&amp;a=Antarctica+Fly+Cruise\" rel=\"nofollow noopener\" target=\"_blank\">Antarctica Fly Cruise</a> program, offering some of the most diverse polar experiences in luxury travel.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\"><p title=\"The Cormorant at 55 South\"><iframe frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/_eQokB6-aik\" width=\"560\"> </iframe></p></div><p>\"The Cormorant at 55 South represents an exciting new chapter for Silversea, extending our commitment to luxury travel to <location idsrc=\"xmltag.org\" value=\"LB/ant\">Antarctica</location>,\" said Bert Hernandez, president, Silversea. \"This unique property will offer our guests the same hallmark comfort and personalized service they expect while on board our ships and will immerse them in the rich culture, traditions, and natural beauty of the region. The interior spaces are thoughtfully designed to reflect the spirit of this extraordinary destination.\"</p><p><b>FIVE SIGNATURE SPACES INSPIRED BY NATURE AND ADVENTURE</b></p><p>The Cormorant's public spaces are designed to foster relaxation, reflection and discovery, blending Silversea's signature elegance with the raw beauty of Patagonia. Cozy lounges, curated gathering areas, and panoramic views of the surrounding wilderness invite guests to pause and connect with the spirit of the far south.</p><p><b>THE FIREPLACE LOUNGE</b></p><p>Inspired by the region's reverence for fire as a symbol for gathering, hospitality, and storytelling, the fireplace lounge will serve as a place of retreat, with a variety of plush seating, fine wines, and signature cocktails. Sweeping vistas of the Patagonian landscape unfold from the lounge's expansive windows, as guests enjoy the comforting warmth of this one-of-a-kind fireplace.</p><p><b>150 GUEST ROOMS </b></p><p>Each of The Cormorant's 150 guest rooms are thoughtfully appointed, inviting guests to recharge before or after their voyage. Rooms offer serene forest views or water vistas of the Beagle channel, bringing guests closer to the breathtaking natural beauty of Patagonia and immersing them in the landscapes that define this region. The interiors feature warm wood tones and earthy elements, creating an authentic and calming environment. To further this connection, every room will incorporate handcrafted items created by Chilean artisans, adding a unique touch that celebrates local and regional culture.</p><p><b>LATITUDE 55</b></p><p>In addition to spaces honoring the nature of Puerto Williams, guests will enjoy a culinary experience rooted in Chilean flavors, with a dining venue that offers a warm, welcoming atmosphere and menus that celebrate the region's ingredients and traditions. At Latitude 55 – named for its location near the 55th parallel south – menus will celebrate Patagonia's rich flavors, blending regional staples with chef-inspired creations. In the evening, the restaurant turns into a family-style gathering that sparks stories of adventure and anticipation of the journey to come.</p><p><b>BAR SUR</b></p><p>Bar Sur will serve as the social heart of The Cormorant, offering teas and small bites by day and curated wines and spirits by night – all inspired by regional flavors. From wine tastings showcasing Patagonia's viticultural legacy to a guided tasting and hands-on cocktail masterclass of Chilean Pisco, a fragrant, high-proof grape brandy and <location idsrc=\"xmltag.org\" value=\"LC/cl\">Chile's</location> most iconic spirit – every moment captures the essence of exploration.</p><p><b>UNCHARTED</b></p><p>To commemorate their visit to the southernmost hotel on earth, guests can visit Uncharted, The Cormorant's boutique. Here, keepsakes crafted by Chilean artisans, and expedition essentials provide lasting mementos of an extraordinary journey.</p><p><b>A NEW GATEWAY TO <location idsrc=\"xmltag.org\" value=\"LB/ant\">ANTARCTICA</location></b></p><p>Silversea's pioneering Antarctica Fly Cruise itineraries – allowing guests to skip the Drake Passage – will include a hotel stay in <location idsrc=\"xmltag.org\" value=\"LU/cl..santig\">Santiago</location>, followed by a direct charter flight to Puerto Williams, where guests will enjoy a one-night stay at The Cormorant before continuing to King George Island for embarkation. Upon return, guests will again stay overnight at the hotel before flying back to <location idsrc=\"xmltag.org\" value=\"LU/cl..santig\">Santiago</location>.</p><p>Guests will also have the opportunity to explore the natural beauty of Puerto Williams through activities such as nature walks, hiking, kayaking, and wildlife watching, further enriching their expedition experience. The hotel will operate seasonally from October to March, with dedicated staff trained in The Silversea Way, which reflects Silversea's philosophy of personalized service, destination expertise, and thoughtful attention to guest needs, to ensure a consistent and exceptional level of service and hospitality.</p><p><b>LEARN MORE IN THE LATEST EPISODE OF STORIES BY SILVERSEA </b></p><p>In the latest episode of Stories by Silversea, the brand's leaders and project partners go behind the scenes, offering a closer look at the spaces taking shape at The Cormorant and the elevated experiences guests can expect. Watch the episode here: <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628319-1&amp;h=1303837803&amp;u=https%3A%2F%2Fyoutu.be%2F_eQokB6-aik&amp;a=A+Legacy+in+the+Making%3A+Part+3.\" rel=\"nofollow noopener\" target=\"_blank\">A Legacy in the Making: Part 3.</a></p><p>For more information on The Cormorant at 55 South and Silversea's Antarctica Fly Cruise program, visit: <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628319-1&amp;h=3574870736&amp;u=https%3A%2F%2Fwww.silversea.com%2Flp-antarctica-fly-cruise.html&amp;a=https%3A%2F%2Fwww.silversea.com%2Flp-antarctica-fly-cruise.html\" rel=\"nofollow noopener\" target=\"_blank\">https://www.silversea.com/lp-antarctica-fly-cruise.html</a></p><p>Find additional assets in our digital press kit: <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628319-1&amp;h=1729620963&amp;u=https%3A%2F%2Froyalcaribbeangrouppresscenter.com%2Fsilversea%2Fdpk%2Fcormorant&amp;a=https%3A%2F%2Froyalcaribbeangrouppresscenter.com%2Fsilversea%2Fdpk%2Fcormorant\" rel=\"nofollow noopener\" target=\"_blank\">https://royalcaribbeangrouppresscenter.com/silversea/dpk/cormorant</a></p><p><b>Cautionary Statement Concerning Forward-Looking Statements</b><br/>Certain statements in this press release relating to, among other things, expectations on timing, design, and demand for the development of The Cormorant at 55 South, constitute forward-looking statements under the Private Securities Litigation Reform Act of 1995. Words such as \"set,\" \"anticipate,\" \"will,\" \"scheduled,\" and similar expressions are intended to help identify forward-looking statements. Forward-looking statements reflect management's current expectations, are based on judgments, are inherently uncertain and are subject to risks, uncertainties and other factors, which could cause our actual results, performance or achievements to differ materially from the future results, performance or achievements expressed or implied in those forward-looking statements. Examples of these risks, uncertainties and other factors include, but are not limited to, those included under the caption \"Risk Factors\" in our most recent annual report on Form 10-K, as well as our other filings with the SEC, copies of which may be obtained by visiting our Investor Relations website at <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628319-1&amp;h=4229922689&amp;u=http%3A%2F%2Fwww.rclinvestor.com%2F&amp;a=www.rclinvestor.com\" rel=\"nofollow noopener\" target=\"_blank\">www.rclinvestor.com</a> or the SEC's website at <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628319-1&amp;h=1461729417&amp;u=http%3A%2F%2Fwww.sec.gov%2F&amp;a=www.sec.gov\" rel=\"nofollow noopener\" target=\"_blank\">www.sec.gov</a>. Undue reliance should not be placed on the forward-looking statements in this release, which are based on information available to us on the date hereof. We undertake no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.</p><p><b>About Silversea <br/></b>Silversea is the leading experiential luxury and expedition travel brand, offering guests immersive experiences on all seven continents, personalized service, and an innovative culinary offering aboard its 12 intimate ocean and expedition ships. Silversea's itineraries encompass an unparalleled range of destinations worldwide, from the Mediterranean and the <location idsrc=\"xmltag.org\" value=\"LB/car\">Caribbean</location> to the Galápagos, both Polar Regions, and hundreds of fascinating places in between. Set to strengthen its destination leadership starting in 2026, the brand is developing the southernmost hotel on Earth, The Cormorant at 55 South, in Puerto Williams, <location idsrc=\"xmltag.org\" value=\"LC/cl\">Chile</location> – offering guests a uniquely seamless journey to <location idsrc=\"xmltag.org\" value=\"LB/ant\">Antarctica</location>. Silversea brings its like-minded guests closer to their destination in uncompromised comfort, championing the joy of travel, an enriching spirit of discovery, and an enduring commitment to Silversea's signature \"To Finding More\" promise. Silversea is owned and operated by global cruise company Royal Caribbean Group (NYSE: <a class=\"symbol-link\" href=\"/overview/RCL/\" title=\"View RCL stock overview\">RCL</a>). For more information, visit <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628319-1&amp;h=699799231&amp;u=https%3A%2F%2Fwww.silversea.com%2F&amp;a=www.silversea.com\" rel=\"nofollow noopener\" target=\"_blank\">www.silversea.com</a>. Media can stay up to date by visiting the brand's press center.</p><p>Silversea, Otium, S.A.L.T., The Cormorant at 55 South, To Finding More, and the various ship names are registered trademarks of Silversea Cruises Ltd.</p><p><b>About Royal Caribbean Group <br/></b>Royal Caribbean Group (NYSE: <a class=\"symbol-link\" href=\"/overview/RCL/\" title=\"View RCL stock overview\">RCL</a>) is a vacation industry leader with a global fleet of 68 ships across its five brands traveling to all seven continents. With a mission to deliver the best vacations responsibly, Royal Caribbean Group serves millions of guests each year through its portfolio of best-in-class brands, including Royal Caribbean, Celebrity Cruises, and Silversea; and an expanding portfolio of land-based vacation experiences through Perfect Day at CocoCay and Royal Beach Club collection. The company also owns <percent>50%</percent> of a joint venture that operates TUI Cruises and Hapag-Lloyd Cruises. With a rich history of innovating, Royal Caribbean Group continually delivers exciting new products and guest experiences that help shape the future of leisure travel. Learn more at <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628319-1&amp;h=2193607434&amp;u=https%3A%2F%2Fwww.royalcaribbeangroup.com%2F&amp;a=royalcaribbeangroup.com\" rel=\"nofollow noopener\" target=\"_blank\">royalcaribbeangroup.com</a> or <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628319-1&amp;h=2713197219&amp;u=https%3A%2F%2Froyalcaribbeangrouppresscenter.com%2Fsilversea%2Fnews%2Frclinvestor.com&amp;a=rclinvestor.com\" rel=\"nofollow noopener\" target=\"_blank\">rclinvestor.com</a>.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\"><p><a href=\"https://mma.prnewswire.com/media/2921323/Silversea_Cruises_The_Cormorant_at_55_South.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"The Cormorant at 55 South\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/2921323/Silversea_Cruises_The_Cormorant_at_55_South.jpg\" title=\"The Cormorant at 55 South\"/></a></p><p><a href=\"https://mma.prnewswire.com/media/2921324/Silversea_Cruises_The_Cormorant_at_55_South_Bar_Sur.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"The Cormorant at 55 South - Bar Sur\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/2921324/Silversea_Cruises_The_Cormorant_at_55_South_Bar_Sur.jpg\" title=\"The Cormorant at 55 South - Bar Sur\"/></a></p><p><a href=\"https://mma.prnewswire.com/media/2921325/Silversea_Cruises_The_Cormorant_at_55_South_Bedroom.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"The Cormorant at 55 South\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/2921325/Silversea_Cruises_The_Cormorant_at_55_South_Bedroom.jpg\" title=\"The Cormorant at 55 South\"/></a></p><p><a href=\"https://mma.prnewswire.com/media/2921326/Silversea_Cruises_The_Cormorant_at_55_South_Fireplace_Lounge.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"The Cormorant at 55 South - The Fireplace Lounge\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/2921326/Silversea_Cruises_The_Cormorant_at_55_South_Fireplace_Lounge.jpg\" title=\"The Cormorant at 55 South - The Fireplace Lounge\"/></a></p><p><a href=\"https://mma.prnewswire.com/media/2921327/Silversea_Cruises_The_Cormorant_at_55_South_Latitude_55.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"The Cormorant at 55 South - Latitude 55\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/2921327/Silversea_Cruises_The_Cormorant_at_55_South_Latitude_55.jpg\" title=\"The Cormorant at 55 South - Latitude 55\"/></a></p><p><a href=\"https://mma.prnewswire.com/media/2921328/Silversea_Cruises_The_Cormorant_at_55_South_MainLobby.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"The Cormorant at 55 South\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/2921328/Silversea_Cruises_The_Cormorant_at_55_South_MainLobby.jpg\" title=\"The Cormorant at 55 South\"/></a></p><p><a href=\"https://mma.prnewswire.com/media/1488683/Silversea_Cruises_Logo.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"Silversea (PRNewsfoto/Silversea Cruises)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/1488683/Silversea_Cruises_Logo.jpg\" title=\"Silversea (PRNewsfoto/Silversea Cruises)\"/></a></p></div><p>SOURCE Silversea Cruises</p></div></article>",
            "link": "https://www.stocktitan.net/news/RCL/the-cormorant-at-55-south-silversea-unveils-all-public-spaces-of-9sj72l8rkj8w.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 15:49:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TORM plc Long Term Incentive Program | A Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\">HELLERUP, <location idsrc=\"xmltag.org\" value=\"LC/dk\">Denmark</location></span>, <span class=\"legendSpanClass\">Feb. 26, 2026</span> /PRNewswire/ -- In accordance with TORM plc's (Nasdaq: <a class=\"symbol-link\" href=\"/overview/TRMD/\" title=\"View TRMD stock overview\">TRMD</a>) (Nasdaq: <a class=\"symbol-link\" href=\"/overview/TRMD/\" title=\"View TRMD stock overview\">TRMD</a> <a class=\"symbol-link\" href=\"/overview/A/\" title=\"View A stock overview\">A</a>) Remuneration Policy adopted by the Annual General Meeting of TORM plc on 14 April 2021, the Board of Directors has as part of a long-term incentive program decided to grant certain employees (the \"Participants\") Restricted Share Units (\"RSUs\") in the form of restricted stock options. The RSUs aim at incentivizing the Participants to seek to improve the performance of TORM and thereby the TORM share price for the mutual benefit of themselves and the shareholders of TORM.</p><p>For 2025, the Participants will be granted a total of 1,356,087 RSUs and, subject to vesting, each RSU will entitle the holder to acquire one TORM A-share. The RSUs will vest over a three-year period, with one third of the grant amount vesting at each anniversary during the three-year period starting on 01 January 2027. The exercise price for each TORM A-share is <money>DKK 167.14</money>, corresponding to the average of 90 calendar days preceding the publication of TORM plc's 2025 Annual Report plus a <percent>15%</percent> premium. Vested RSUs may be exercised for a period of 360 days from each vesting date.</p><p>In addition to the RSUs granted to the Participants, Executive Director Jacob Meldgaard will be granted a total of 255,200 RSUs on similar terms as outlined above.</p><p>Holders of the RSUs will have no rights as a shareholder with respect to such RSUs until such time as the RSUs vest, are exercised and TORM A-shares are issued. The RSUs include certain adjustment and acceleration provisions, exercise conditions and other terms customary for restricted stock option programs of this nature.</p><p>The theoretical market value of the RSU allocation is calculated at <money>USD 10.9m</money> based on the Black-Scholes model. The key assumptions for the calculation of the market value are:</p><ul type=\"disc\"><li>The strike price is adjusted for future TORM dividends.</li><li>The volatility of the TORM share is estimated at <percent>40%</percent>.</li><li>The risk-free interest rate based upon expiry of the RSUs is based on Danish government bonds with maturity corresponding to the maturity of the individual RSUs. The interest rate is between <percent>1.78%</percent> - <percent>2.01%</percent> depending on maturity.</li><li>A share price of <money>DKK 174.35</money> per A-share at the time of allocation.</li></ul><p>The RSU allocation is expected to affect the P&amp;L statement as follows:</p><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">USDm                              </span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">2026</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">2027</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">2028</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Total                     </span></p></td></tr><tr><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Effect</span></p><p class=\"prnml4\"><span class=\"prnews_span\">                                   </span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">6.2</span></p><p class=\"prnml4\"> </p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">3.3</span></p><p class=\"prnml4\"> </p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1.4</span></p><p class=\"prnml4\"> </p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">10.9</span></p><p class=\"prnml4\"> </p></td></tr></table></div><p><b>Contact</b></p><p>Mikael Bo Larsen, Head of Investor Relations<br/>Tel.: +45 5143 8002</p><p><b>About TORM</b></p><p>TORM is one of the world's leading carriers of refined oil products. TORM operates a fleet of product tanker vessels with a strong commitment to safety. environmental responsibility and customer service. TORM was founded in 1889 and conducts business worldwide. TORM's shares are listed on Nasdaq in <location idsrc=\"xmltag.org\" value=\"LU/dk..cophgn\">Copenhagen</location> and on Nasdaq in <location idsrc=\"xmltag.org\" value=\"LU/us.ny.nyc\">New York</location> (ticker: <a class=\"symbol-link\" href=\"/overview/TRMD/\" title=\"View TRMD stock overview\">TRMD</a> <a class=\"symbol-link\" href=\"/overview/A/\" title=\"View A stock overview\">A</a> and TRMD. ISIN: GB00BZ3CNK81). For further information, please visit <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628359-1&amp;h=4261190326&amp;u=http%3A%2F%2Fwww.torm.com%2F&amp;a=www.torm.com\" rel=\"nofollow noopener\" target=\"_blank\">www.torm.com</a>.</p><p>Safe Harbor Statement as to the Future</p><p>Matters discussed in this release may constitute forward-looking statements. The Private Securities Litigation Reform Act of 1995 provides safe harbor protections for forward-looking statements in order to encourage companies to provide prospective information about their business. Forward-looking statements reflect our current views with respect to future events and financial performance and may include statements concerning plans, objectives, goals, strategies, future events or performance, and underlying assumptions and other statements, which are statements other than statements of historical facts. The Company desires to take advantage of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995 and is including this cautionary statement in connection with this safe harbor legislation. Words such as, but not limited to, \"expects,\" \"anticipates,\" \"intends,\" \"plans,\" \"believes,\" \"estimates,\" \"targets,\" \"projects,\" \"forecasts,\" \"potential,\" \"continue,\" \"possible,\" \"likely,\" \"may,\" \"could,\" \"should\" and similar expressions or phrases may identify forward-looking statements.</p><p>The forward-looking statements in this release are based upon various assumptions, many of which are, in turn, based upon further assumptions, including without limitation, management's examination of historical operating trends, data contained in our records and other data available from third parties. Although the Company believes that these assumptions were reasonable when made, because these assumptions are inherently subject to significant uncertainties and contingencies that are difficult or impossible to predict and are beyond our control, the Company cannot guarantee that it will achieve or accomplish these expectations, beliefs, or projections.</p><p>Important factors that, in our view, could cause actual results to differ materially from those discussed in the forward-looking statements include, but are not limited to, our future operating or financial results; changes in governmental rules and regulations or actions taken by regulatory authorities; inflationary pressure and central bank policies intended to combat overall inflation and rising interest rates and foreign exchange rates; general domestic and international political conditions or events, including \"trade wars\" and the war between <location idsrc=\"xmltag.org\" value=\"LC/ru\">Russia</location> and <location idsrc=\"xmltag.org\" value=\"LC/ua\">Ukraine</location>, the developments in the <location idsrc=\"xmltag.org\" value=\"LR/mde\">Middle East</location>, including the war in <location idsrc=\"xmltag.org\" value=\"LC/il\">Israel</location> and the <location idsrc=\"xmltag.org\" value=\"LC/ps\">Gaza Strip</location>, and the conflict regarding the Houthis' attacks in the Red Sea; international sanctions against Russian oil and oil products; changes in economic and competitive conditions affecting our business, including market fluctuations in charter rates and charterers' abilities to perform under existing time charters; changes in the supply and demand for vessels comparable to ours and the number of newbuildings under construction; the highly cyclical nature of the industry that we operate in; the loss of a large customer or significant business relationship; changes in worldwide oil production and consumption and storage; risks associated with any future vessel construction; our expectations regarding the availability of vessel acquisitions and our ability to complete acquisition transactions planned; availability of skilled crew members other employees and the related labor costs; work stoppages or other labor disruptions by our employees or the employees of other companies in related industries;  effects of new products and new technology in our industry;  new environmental regulations and restrictions; the impact of an interruption in or failure of our information technology and communications systems, including the impact of cyber-attacks, upon our ability to operate; potential conflicts of interest involving members of our Board of Directors and Senior Management; the failure of counterparties to fully perform their contracts with us; changes in credit risk with respect to our counterparties on contracts; adequacy of insurance coverage; our ability to obtain indemnities from customers; changes in laws, treaties or regulations; our incorporation under the laws of <location idsrc=\"xmltag.org\" value=\"LS/gb.eng\">England</location> and <location idsrc=\"xmltag.org\" value=\"LS/gb.wal\">Wales</location> and the different rights to relief that may be available compared to other countries, including <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location>; government requisition of our vessels during a period of war or emergency; the arrest of our vessels by maritime claimants; any further changes in <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> trade policy that could trigger retaliatory actions by the affected countries; the impact of the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> presidential and congressional election results affecting the economy, future government laws and regulations and trade policy matters, such as the imposition of tariffs and other import restrictions; potential disruption of shipping routes due to accidents, climate-related incidents, adverse weather and natural disasters, environmental factors, political events, public health threats, acts by terrorists or acts of piracy on ocean-going vessels; damage to storage and receiving facilities; potential liability from future litigation and potential costs due to environmental damage and vessel collisions; and the length and number of off-hire periods and dependence on third-party managers.</p><p>In the light of these risks and uncertainties, undue reliance should not be placed on forward-looking statements contained in this release because they are statements about events that are not certain to occur as described or at all. These forward-looking statements are not guarantees of our future performance, and actual results and future developments may vary materially from those projected in the forward-looking statements.</p><p>Except to the extent required by applicable law or regulation, the Company undertakes no obligation to release publicly any revisions or updates to these forward-looking statements to reflect events or circumstances after the date of this release or to reflect the occurrence of unanticipated events. Please see TORM's filings with the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> Securities and Exchange Commission for a more complete discussion of certain of these and other risks and uncertainties. The information set forth herein speaks only as of the date hereof, and the Company disclaims any intention or obligation to update any forward-looking statements as a result of developments occurring after the date of this communication.</p><p>This information was brought to you by Cision <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628359-1&amp;h=917635766&amp;u=http%3A%2F%2Fnews.cision.com%2F&amp;a=http%3A%2F%2Fnews.cision.com\" rel=\"nofollow noopener\" target=\"_blank\">http://news.cision.com</a></p><p><a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628359-1&amp;h=2133450448&amp;u=https%3A%2F%2Fnews.cision.com%2Ftorm-plc%2Fr%2Ftorm-plc-long-term-incentive-program%2Cc4313548&amp;a=https%3A%2F%2Fnews.cision.com%2Ftorm-plc%2Fr%2Ftorm-plc-long-term-incentive-program%2Cc4313548\" rel=\"nofollow noopener\" target=\"_blank\">https://news.cision.com/torm-plc/r/torm-plc-long-term-incentive-program,c4313548</a></p><p>The following files are available for download:</p><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\"><tr><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><a class=\"prnews_a\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628359-1&amp;h=518954109&amp;u=https%3A%2F%2Fmb.cision.com%2FMain%2F21247%2F4313548%2F3955106.pdf&amp;a=https%3A%2F%2Fmb.cision.com%2FMain%2F21247%2F4313548%2F3955106.pdf\" rel=\"nofollow noopener\" target=\"_blank\">https://mb.cision.com/Main/21247/4313548/3955106.pdf</a></span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">03-2026 TORM plc Long Term Incentive Program</span></p></td></tr></table></div><p>SOURCE Torm PLC</p></div></article>",
            "link": "https://www.stocktitan.net/news/A/torm-plc-long-term-incentive-svkwi8495106.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 15:50:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cohen & Company Announces Appointment of Pawel Skonieczka as Managing Director to Lead Coverage of Space Technology, Aerospace, & Communications Infrastructure in Capital Markets Segment | COHN Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.ny.nyc\">NEW YORK</location></span>, <span class=\"legendSpanClass\">Feb. 26, 2026</span> /PRNewswire/ -- After nearly doubling deal flow and closing <money><money>$43 billion</money></money> in transactions in 2025, Cohen &amp; Company Capital Markets (\"CCM\"), a division of Cohen &amp; Company Securities, LLC, an indirect, controlled subsidiary of Cohen &amp; Company Inc. (NYSE American: <a class=\"symbol-link\" href=\"/overview/COHN/\" title=\"View COHN stock overview\">COHN</a>), announced the appointment of Pawel Skonieczka as a Managing Director to lead the expansion of the firm's advisory capabilities across Space Technology, Aerospace, and Communications Infrastructure.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\"><p><a href=\"https://mma.prnewswire.com/media/2921344/Cohen_and_Company_Financial_Group_Logo.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"Cohen &amp; Company Financial Group\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/2921344/Cohen_and_Company_Financial_Group_Logo.jpg\" title=\"Cohen &amp; Company Financial Group\"/></a></p></div><p>Mr. Skonieczka brings nearly two decades of experience advising public and private companies, financial sponsors, and strategic investors across M&amp;A, equity and debt capital markets transactions. His appointment underscores the firm's strategic investments in high-growth industries such as Space Technology and related sectors.</p><p>\"The Space economy is evolving from early-stage innovation to scaled industrial deployment,\" said Mr. Skonieczka. \"Disciplined capital allocation, consolidation and strategic M&amp;A will drive the next phase of the sector evolution. Cohen &amp; Company's bespoke M&amp;A advisory and capital market solutions make it uniquely positioned to support founders, sponsors, private and public companies in navigating this dynamic landscape.\"</p><p>Prior to joining the firm, Mr. Skonieczka spent nearly a decade at Deutsche Bank, where he led global coverage of the Space Technology sector across launch, manufacturing, satellite operators, and downstream applications. He advised clients on strategic transactions, capital formation, and corporate finance initiatives, and played a central role in building the firm's Space sector franchise. He founded and hosted the annual Deutsche Bank Global Space Summit and also represented the firm on webinars and panels at industry conferences. Mr. Skonieczka also covered the broader Communications sector during his tenure.</p><p>\"Space has moved from an emerging sector to core infrastructure,\" said Jerry Serowik, Senior Managing Director and Head of CCM. \"The next phase will be driven by consolidation, scale, and disciplined capital deployment. All areas where our advisory platform is well-positioned. Pawel brings a rare combination of global sector experience and hands-on M&amp;A and capital markets expertise that today's space companies increasingly require.\"</p><p>Earlier in his career, Mr. Skonieczka held roles at Macquarie Capital in the Leveraged Finance and Financial Sponsors group and at KPMG in the Economic and Valuation Services practice. His background across advisory, leveraged finance, and valuation provides clients with a differentiated perspective on capital structure, strategic decision-making, and value creation.</p><p>Mr. Skonieczka holds an MBA from Columbia Business School and a Bachelor of Science in Finance, Economics, and Applied Mathematics from Rutgers University.</p><p><b>About Cohen &amp; Company</b></p><p>Cohen &amp; Company (the \"Company\") is a financial services company specializing in an expanding range of capital markets and asset management services. Cohen &amp; Company's operating segments are Capital Markets, Asset Management, and Principal Investing. The Capital Markets segment consists of sales, trading, gestation repo financing, new issue placements in corporate and securitized products, underwriting, and advisory services, operating primarily through Cohen &amp; Company's subsidiaries Cohen &amp; Company Securities, LLC (\"Cohen Securities\") in <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location> and Cohen &amp; Company Financial (<location idsrc=\"xmltag.org\" value=\"LR/eur\">Europe</location>) S.A. in <location idsrc=\"xmltag.org\" value=\"LR/eur\">Europe</location>. A division of Cohen Securities, CCM is the Company's full-service boutique investment bank providing capital markets and SPAC advisory services to corporations, financial sponsors, investors, and institutions. The Capital Markets business segment also includes investment returns on financial instruments that the Company has received as consideration for investment banking and new issue services provided by CCM. The Asset Management segment manages and services assets through investment funds, managed accounts, joint ventures, and collateralized debt obligations. As of December 31, 2025, the Company had approximately <money><money>$1.4 billion</money></money> of assets under management in primarily fixed income assets in a variety of asset classes including European bank and insurance trust preferred securities, debt issued by small and medium sized European, <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location>, and Bermudian insurance and reinsurance companies, and servicing commercial real estate loans. The Principal Investing segment is comprised primarily of investments the Company has made for the purpose of earning an investment return rather than investments made to support its trading or other capital markets business activity. For more information, please visit <u><a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628341-1&amp;h=3808779999&amp;u=http%3A%2F%2Fwww.cohenandcompany.com%2F&amp;a=www.cohenandcompany.com\" rel=\"nofollow noopener\" target=\"_blank\">www.cohenandcompany.com</a></u>.</p><p><b>About Cohen &amp; Company Capital Markets</b></p><p>Cohen &amp; Company Capital Markets, a division of Cohen &amp; Company Securities, LLC, is a full-service boutique investment bank delivering bulge-bracket expertise through a senior-led, client-aligned advisory model. The firm provides strategic counsel and execution capabilities across M&amp;A advisory, capital markets, and SPAC transactions, serving middle-market and growth companies navigating complex, high-stakes decisions. CCM's differentiated approach emphasizes deep sector knowledge, institutional-quality execution, and direct access to capital across public and private markets. The firm maintains a conflict-free, independent platform designed to align advisor incentives with long-term client outcomes. For more information, please visit <u><a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628341-1&amp;h=338579907&amp;u=http%3A%2F%2Fwww.cohencm.com%2F&amp;a=www.cohencm.com\" rel=\"nofollow noopener\" target=\"_blank\">www.cohencm.com</a></u>.</p><p>SOURCE Cohen &amp; Company Inc</p></div></article>",
            "link": "https://www.stocktitan.net/news/COHN/cohen-company-announces-appointment-of-pawel-skonieczka-as-managing-l38azzqadib5.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 15:43:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Lemonade to Attend The Citizens Technology Conference | LMND Stock News",
            "description": "<article class=\"article\"><p> <location idsrc=\"xmltag.org\" value=\"LU/us.ny.nyc\">NEW YORK</location>--(BUSINESS WIRE)--Lemonade (NYSE: <a class=\"symbol-link\" href=\"/overview/LMND/\" title=\"View LMND stock overview\">LMND</a>), the digital insurance company powered by AI and social impact, today announced that Chief Financial Officer, Tim Bixby, is scheduled to present at The Citizens Technology Conference in <location idsrc=\"xmltag.org\" value=\"LU/us.ca.sanfrn\">San Francisco</location> on Tuesday, March 3, 2026, at 9:30 AM PST, and will also hold investor meetings at the event.</p><p>Mr. Bixby’s presentation will be live via webcast, and will be available for 90 days after the broadcast. Register to view the webcast via the following <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fevent.summitcast.com%2Fview%2FT4CQTTCBJdGa9nQQkYNnai%2Fguest_book%3Fsession_id%3D7FUURhjEm8RRbkXF4A8A5R&amp;esheet=54434562&amp;newsitemid=20260226979590&amp;lan=en-US&amp;anchor=link&amp;index=1&amp;md5=e10f29b58839b552556f14c696deb15d\" rel=\"nofollow noopener\" shape=\"rect\">link</a>. Additional information about Lemonade can be found at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Flemonade.com%2Finvestor&amp;esheet=54434562&amp;newsitemid=20260226979590&amp;lan=en-US&amp;anchor=lemonade.com%2Finvestor&amp;index=2&amp;md5=df87ed32d2e3afe402add8112f58c20a\" rel=\"nofollow noopener\" shape=\"rect\">lemonade.com/investor</a>.</p><p><b>About Lemonade<br/></b>Lemonade delivers AI-powered renters, pet, car, homeowners, and life insurance across the US and EU. We process claims instantly, keep costs low, and donate unused premiums to causes selected by our community, as part of the annual Giveback program.</p><p><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fx.com%2Flemonade_inc&amp;esheet=54434562&amp;newsitemid=20260226979590&amp;lan=en-US&amp;anchor=X&amp;index=3&amp;md5=c711882fb5c220bcbd45a62001368e22\" rel=\"nofollow noopener\" shape=\"rect\">X</a>, <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.instagram.com%2Flemonade_inc%2F&amp;esheet=54434562&amp;newsitemid=20260226979590&amp;lan=en-US&amp;anchor=Instagram&amp;index=4&amp;md5=acaa8aa17b37c253d1b8decd624ed059\" rel=\"nofollow noopener\" shape=\"rect\">Instagram</a>, <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Flemonade-inc-%2F%3FviewAsMember%3Dtrue&amp;esheet=54434562&amp;newsitemid=20260226979590&amp;lan=en-US&amp;anchor=LinkedIn&amp;index=5&amp;md5=a50d31d316e0dff6cc9731a867fcbed7\" rel=\"nofollow noopener\" shape=\"rect\">LinkedIn</a></p><p><img alt=\"\" loading=\"lazy\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226979590r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\"/><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20260226979590/en/\" rel=\"nofollow noopener\">https://www.businesswire.com/news/home/20260226979590/en/</a></span></p><p><b>Press:</b><br/>Paul Staats<br/><a href=\"mailto:Press@lemonade.com\" rel=\"nofollow noopener\" shape=\"rect\">Press@lemonade.com</a></p><p>Source: Lemonade</p></article>",
            "link": "https://www.stocktitan.net/news/LMND/lemonade-to-attend-the-citizens-technology-f6pr13kpxmy3.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 15:44:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wallbridge Mining Invites Shareholders and Investment Community to Booth 2442 at PDAC 2026, March 1-4 | WLBMF Stock News",
            "description": "<article class=\"article\"><p>Toronto, Ontario--(Newsfile Corp. - February 26, 2026) - <b>Wallbridge Mining Company Limited (TSX: WM) (OTCQB: <a class=\"symbol-link\" href=\"/overview/WLBMF/\" title=\"View WLBMF stock overview\">WLBMF</a>)</b> (\"<b>Wallbridge</b>\" or the \"<b>Company</b>\") announces its participation at the Prospectors &amp; Developers Association of Canada's (\"<b>PDAC</b>\") Convention at the Metro Toronto Convention Centre (\"<b>MTCC</b>\") from Sunday, March 1 to Wednesday, March 4, 2026. Representatives from the Company will be at booth #2442 in the Investors Exchange on Level 800 of the MTCC.</p><p><b>About PDAC</b></p><p>The World's Premier Mineral Exploration &amp; Mining Convention is the leading convention for people, governments, companies and organizations connected to mineral exploration. In addition to meeting more than 1,100 exhibitors, 2,500 investors and 26,000 attendees in person in 2024, participants could also attend programming, courses and networking events.</p><p>PDAC is held in Toronto, Canada and has grown in size, stature and influence since it began in 1932.</p><p>For more information and/or to register for the conference please visit: <a href=\"https://api.newsfilecorp.com/redirect/rpXgmswPLn\" rel=\"nofollow noopener\">https://www.pdac.ca/convention</a>.</p><p><b>About Wallbridge Mining</b></p><p>Wallbridge is focused on creating value through the exploration and sustainable development of gold projects in Quebec's Abitibi region while respecting the environment and communities where it operates. The Company holds a contiguous mineral property position totaling 598 square kilometres that extends approximately 82 kilometres along the Detour-Fenelon gold trend. The land position is host to the Company's flagship PEA stage Fenelon Gold Project, and its earlier exploration stage Martiniere Gold Project, as well as numerous greenfield gold projects.</p><p>For further information please visit the Company's website at <a href=\"https://api.newsfilecorp.com/redirect/Vvr40FMENg\" rel=\"nofollow noopener\">https://wallbridgemining.com/</a> or contact:</p><div id=\"contactInfo\"><p><b>Wallbridge Mining Company Limited</b></p><table border=\"0\" cellpadding=\"0\" cellspacing=\"0\" style=\"text-align: start; width: 100%; border-collapse: collapse;\"><tbody><tr><td style=\"width: 1%;\"> </td><td style=\"width: 15%;\">Brian Penny, CPA, CMA<br/>Chief Executive Officer<br/>Email: <a href=\"mailto:bpenny@wallbridgemining.com\" rel=\"nofollow noopener\">bpenny@wallbridgemining.com</a><br/>M: +1 416 716 8346</td><td style=\"width: 13%; vertical-align: top;\">Tania Barreto, CPIR<br/>Director, Investor Relations<br/>Email: <a href=\"mailto:tbarreto@wallbridgemining.com\" rel=\"nofollow noopener\">tbarreto@wallbridgemining.com</a><br/>M: +1 289 819 3012</td></tr></tbody></table></div><p> </p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/zAJn7IjVQY\" rel=\"nofollow noopener\">https://www.newsfilecorp.com/release/285479</a></p><p><img alt=\"\" loading=\"lazy\" src=\"https://api.newsfilecorp.com/newsinfo/285479/375\"/></p></article>",
            "link": "https://www.stocktitan.net/news/WLBMF/wallbridge-mining-invites-shareholders-and-investment-community-to-yewejkp88d4y.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 15:43:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AM Best Affirms Credit Ratings of Primerica, Inc. and Its Subsidiaries | PRI Stock News",
            "description": "<article class=\"article\"><p> <location idsrc=\"xmltag.org\" value=\"LU/us.nj.oldick\">OLDWICK, N.J.</location>--(BUSINESS WIRE)--<b>AM Best </b>has affirmed the Financial Strength Rating of A+ (Superior) and the Long-Term Issuer Credit Ratings (Long-Term ICR) of “aa-” (Superior) of Primerica Life Insurance Company (<location idsrc=\"xmltag.org\" value=\"LU/us.tn.nashvl\">Nashville, TN</location>) and its affiliates, National Benefit Life Insurance Company (<location idsrc=\"xmltag.org\" value=\"LU/us.ny.lonity\">Long Island City, NY</location>) and Primerica Life Insurance Company of <location idsrc=\"xmltag.org\" value=\"LC/ca\">Canada</location> (<location idsrc=\"xmltag.org\" value=\"LU/ca.on.misuga\">Mississauga, Ontario</location>), collectively referred to as Primerica Group. Additionally, AM Best has affirmed the Long-Term ICR of “a-” (Excellent) of Primerica, Inc. (Primerica) (headquartered in <location idsrc=\"xmltag.org\" value=\"LU/us.ga.duluth\">Duluth, GA</location>) [NYSE: PRI], which is the holding company for the group’s insurance and non-insurance operating companies. AM Best also has affirmed the Long-Term Issue Credit Rating of “a-” (Excellent) on <money><money>$600 million</money></money>, <percent>2.8%</percent> senior unsecured notes, due 2031, of Primerica. The outlook of all these Credit Ratings (ratings) is stable.</p><p>The ratings reflect Primerica Group’s balance sheet strength, which AM Best assesses as very strong, as well as its very strong operating performance, favorable business profile and appropriate enterprise risk management.</p><p>Primerica’s credit ratings continue to recognize the group’s strongest level of risk-adjusted capitalization, as measured by Best’s Capital Adequacy Ratio (BCAR). The company’s balance sheet remains a core strength, characterized by strong liquidity and financial flexibility. Primerica has an investment profile that focuses on fixed-income assets, while maintaining only modest exposure to commercial mortgage-backed securities. However, the company’s business model does rely heavily on the use of reinsurance.</p><p>Primerica reinforced its position as an industry leader, consistently reporting high levels of earnings and top-tier return-on-equity measures among its peers. Steady premium growth, fueled by a vast and geographically diversified distribution system spanning the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> and Canadian marketplaces, continues to improve the company's operational strength. Primerica has extensive agent recruitment and a well-established monitoring system to ensure compliance and steady premium growth. Primerica’s use of highly rated reinsurance partners mitigates term life insurance mortality risk, a core component of its strong balance sheet management.</p><p>The group’s business profile is focused on its core term life insurance offering, particularly the investments made in its simplified issue product. Beyond the Primerica Group, Primerica also offers the distribution of primarily third-party investment and savings products and other non-life products.</p><p><b>This press release relates to Credit Ratings that have been published on AM Best’s website. For all rating information relating to the release and pertinent disclosures, including details of the office responsible for issuing each of the individual ratings referenced in this release, please see AM Best’s </b><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fratings.ambest.com%2Fratingeventdisclosures.aspx&amp;esheet=54434424&amp;newsitemid=20260226977831&amp;lan=en-US&amp;anchor=Recent+Rating+Activity&amp;index=1&amp;md5=208243794b6a60fce3c0f807215b7ff2\" rel=\"nofollow noopener\" shape=\"rect\"><b>Recent Rating Activity</b></a><b> web page. For additional information regarding the use and limitations of Credit Rating opinions, please view </b><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww3.ambest.com%2Fambv%2Fratingmethodology%2FOpenPDF.aspx%3Fri%3D1866&amp;esheet=54434424&amp;newsitemid=20260226977831&amp;lan=en-US&amp;anchor=Guide+to+Best%27s+Credit+Ratings&amp;index=2&amp;md5=e478bad9c5957187611bf6d61d2971c4\" rel=\"nofollow noopener\" shape=\"rect\"><b>Guide to Best's Credit Ratings</b></a><b>. For information on the proper use of Best’s Credit Ratings, Best’s Performance Assessments, Best’s Preliminary Credit Assessments and AM Best press releases, please view </b><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.ambest.com%2Fratings%2Fguidetouse.pdf&amp;esheet=54434424&amp;newsitemid=20260226977831&amp;lan=en-US&amp;anchor=Guide+to+Proper+Use+of+Best%26%238217%3Bs+Ratings+%26amp%3B+Assessments&amp;index=3&amp;md5=91951a7c83ab6d815fa5f43458894b6e\" rel=\"nofollow noopener\" shape=\"rect\"><b>Guide to Proper Use of Best’s Ratings &amp; Assessments</b></a><b>.</b></p><p><b>AM Best is a global credit rating agency, news publisher and data analytics provider specializing in the insurance industry. Headquartered in <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location>, the company does business in over 100 countries with regional offices in <location idsrc=\"xmltag.org\" value=\"LU/gb.eng.london\">London</location>, <location idsrc=\"xmltag.org\" value=\"LU/us.ny.amster\">Amsterdam</location>, <location idsrc=\"xmltag.org\" value=\"LU/ae..dubai\">Dubai</location>, <location idsrc=\"xmltag.org\" value=\"LC/hk\">Hong Kong</location>, <location idsrc=\"xmltag.org\" value=\"LC/sg\">Singapore</location> and <location idsrc=\"xmltag.org\" value=\"LU/mx.sm.mexcty\">Mexico City</location>. For more information, visit </b><a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.ambest.com%2F&amp;esheet=54434424&amp;newsitemid=20260226977831&amp;lan=en-US&amp;anchor=www.ambest.com&amp;index=4&amp;md5=5768005e09cab1518c6c9cf3819b0337\" rel=\"nofollow noopener\" shape=\"rect\"><b>www.ambest.com</b></a><b>.</b></p><p class=\"bwalignc\"><b>Copyright © 2026 by A.M. Best Rating Services, Inc. and/or its affiliates. ALL RIGHTS RESERVED.</b></p><p><img alt=\"\" loading=\"lazy\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226977831r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\"/><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20260226977831/en/\" rel=\"nofollow noopener\">https://www.businesswire.com/news/home/20260226977831/en/</a></span></p><p><b>Mitul Patel</b><br/><b>Senior Financial Analyst</b><br/><b>+1 908 882 1983</b><br/><a href=\"mailto:mitul.patel@ambest.com\" rel=\"nofollow noopener\" shape=\"rect\">mitul.patel@ambest.com</a></p><p><b>Louis Silvers</b><br/><b>Senior Financial Analyst</b><br/><b>+1 908 882 2316</b><br/><a href=\"mailto:louis.silvers@ambest.com\" rel=\"nofollow noopener\" shape=\"rect\">louis.silvers@ambest.com</a></p><p><b>Christopher Sharkey</b><br/><b>Associate Director, Public Relations</b><br/><b>+1 908 882 2310</b><br/><a href=\"mailto:christopher.sharkey@ambest.com\" rel=\"nofollow noopener\" shape=\"rect\">christopher.sharkey@ambest.com</a></p><p><b>Al Slavin</b><br/><b>Senior Public Relations Specialist</b><br/><b>+1 908 882 2318</b><br/><a href=\"mailto:al.slavin@ambest.com\" rel=\"nofollow noopener\" shape=\"rect\">al.slavin@ambest.com</a></p><p>Source: AM Best</p></article>",
            "link": "https://www.stocktitan.net/news/PRI/am-best-affirms-credit-ratings-of-primerica-inc-and-its-u0qf3epbfynm.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 14:32:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Carrier Connect Data Solutions Inc. Announces Closing of $10.5 Million Private Placement of Units | CCDSF Stock News",
            "description": "<article class=\"article\"><p>Vancouver, British Columbia--(Newsfile Corp. - February 26, 2026) - Carrier Connect Data Solutions Inc. (TSXV: CCDS) (OTCQB: <a class=\"symbol-link\" href=\"/overview/CCDSF/\" title=\"View CCDSF stock overview\">CCDSF</a>) (WKN: A40XB1) (the \"<b>Company</b>\" or \"<b>Carrier</b>\"), is pleased to announce that it has closed its previously announced brokered private placement of units of the Company (the \"<b>Units</b>\") for gross proceeds of <money>$10,500,000</money> (the \"<b>Offering</b>\"). The Offering was co-led by Canaccord Genuity Corp. and Beacon Securities Limited (the \"<b>Agents</b>\") and consisted of the sale of 6,562,500 Units at a price of <money>$1.60</money> per Unit. </p><p>Each Unit comprised of one common share of the Company (a \"<b>Common Share</b>\") and one-half of one Common Share purchase warrant (each whole warrant, a \"<b>Warrant</b>\"). Each Warrant entitles the holder thereof to acquire one Common Share until February 26, 2028 at an exercise price of <money>$2.10</money>.</p><p>The Units were issued pursuant to Part 5A of National Instrument 45-106 - <i>Prospectus Exemptions</i>, as amended by Coordinated Blanket Order 45-935 - Exemptions from Certain Conditions of the Listed Issuer Financing Exemptions, to purchasers resident in Canada (other than the province of Québec) and in other qualifying jurisdictions outside of Canada on a private placement basis pursuant to relevant prospectus or registration exemptions in accordance with applicable laws, and are not subject to a statutory hold period pursuant to applicable Canadian securities laws. The Offering remains subject to the final approval of the TSX Venture Exchange (\"<b>TSXV</b>\").</p><p>The Company intends to use the net proceeds from the Offering on acquisitions, debt repayment, capital improvement and data center expansions, marketing and staffing, and for general corporate purposes and working capital, all as further described in the amended and restated offering document dated February 18, 2026 related to the Offering that can be accessed under the Company's profile on SEDAR+ at <a href=\"https://api.newsfilecorp.com/redirect/3KkZ4seYo8\" rel=\"nofollow noopener\">www.sedarplus.ca</a> and on the Company's website at <a href=\"https://api.newsfilecorp.com/redirect/N3KLeIPQY7\" rel=\"nofollow noopener\">www.carrierconnect.ca</a>. </p><p>In connection with and in consideration for their services rendered under the Offering, the Company paid the Agents an aggregate cash commission of <money>$625,500</money> and issued an aggregate of 390,937 agents' warrants (the \"<b>Agents' Warrants</b>\"). Each Agents' Warrant entitles the holder thereof to acquire one Common Share at a price of <money>$1.60</money> per Common Share until February 26, 2028. The Agents' Warrants and Common Shares issuable upon exercise thereof are subject to a four month and one day statutory hold period.</p><p>Mark Binns, Chief Executive Officer of Carrier, commented, \"The completion of this financing shows the confidence in our business model, execution to date, and growth plans for Carrier Connect for 2026. We look forward to providing further business updates in the near future.\"</p><p><b>About Carrier Connect Data Solutions Inc.</b></p><p>Carrier Connect Data Solutions' mission is to roll up Tier II/III data centers internationally that specialize in delivering co-location and data center solutions to AI companies, service providers, enterprises and small businesses. Data centers are the physical locations that store computing machines and their related hardware equipment, such as servers, data storage drives, and network equipment. As a carrier-neutral organization, Carrier's systems are fully independent and owned outright within its leased space. The current principal markets for the Company are Vancouver and Ottawa, Canada and Perth, Australia, where it serves clients who use its facilities either as their primary data center or as an ancillary site depending on their needs.</p><p><b>ON BEHALF OF THE BOARD OF DIRECTORS</b></p><p>\"Mark Binns\"</p><p>Mark Binns, CEO</p><div id=\"contactInfo\"><p><b>For further information, please contact:</b></p><p>Attention: Mark Binns, CEO<br/>Email: <a href=\"mailto:mark@carrierconnectds.com\" rel=\"nofollow noopener\">mark@carrierconnectds.com</a><br/>Phone: 778-945-1074</p></div><p><i>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSXV) accepts responsibility for the adequacy or accuracy of this news release.</i></p><p><b>Forward-Looking Information</b></p><p>This press release contains \"forward-looking information\" within the meaning of applicable Canadian securities legislation. \"Forward-looking information\" includes, but is not limited to, statements with respect to the activities, events or developments that the Company expects or anticipates will or may occur in the future, including, without limitation, statements with respect to the proposed use of proceeds from the Offering, growth plans and business related updates of the Company, and the final approval of the Offering from the TSXV. Generally, but not always, forward-looking information and statements can be identified by the use of words such as \"plans\", \"expects\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\", or \"believes\" or the negative connotation thereof or variations of such words and phrases or state that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will be taken\", \"occur\" or \"be achieved\" or the negative connotation thereof.</p><p>Such forward-looking information is based on numerous assumptions, including among others, that general business and economic conditions will not change in a material adverse manner. Although the assumptions made by the Company in providing forward-looking information are considered reasonable by management at the time, there can be no assurance that such assumptions will prove to be accurate.</p><p>Forward-looking information also involves known and unknown risks and uncertainties and other factors, which may cause actual events or results in future periods to differ materially from any projections of future events or results expressed or implied by such forward-looking information or statements, including, among others: negative operating cash flow and dependence on third party financing, uncertainty of additional financing, reliance on key management and other personnel, and the risk factors with respect to the Company set out in the Company's filings with the Canadian securities regulators and available under the Company's profile on SEDAR+ at <a href=\"https://api.newsfilecorp.com/redirect/XEzKDTMOn2\" rel=\"nofollow noopener\">www.sedarplus.ca</a>. </p><p>Although the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in the forward-looking information or implied by forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that forward-looking information and statements will prove to be accurate, as actual results and future events could differ materially from those anticipated, estimated or intended. Accordingly, readers should not place undue reliance on forward-looking statements or information. The Company undertakes no obligation to update or reissue forward-looking information as a result of new information or events except as required by applicable securities laws.</p><p id=\"corporateNewsLogoContainer\"><img alt=\"Corporate Logo\" id=\"corporateNewsLogo\" loading=\"lazy\" src=\"https://images.newsfilecorp.com/files/12061/285469_c629964a54b4d9b8_logo.jpg\"/></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/DOy4YuPZEE\" rel=\"nofollow noopener\">https://www.newsfilecorp.com/release/285469</a></p><p><img alt=\"\" loading=\"lazy\" src=\"https://api.newsfilecorp.com/newsinfo/285469/375\"/></p></article>",
            "link": "https://www.stocktitan.net/news/CCDSF/carrier-connect-data-solutions-inc-announces-closing-of-10-5-million-p269rczj98jv.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 14:36:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "F.N.B. Corporation Named a Leading U.S. Financial Services Company for Both Businesses and Consumers With 14 National Coalition Greenwich 2026 Awards and Exclusive Recognition from TIME | FNB Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p class=\"prntac\"><i>Company Has Earned Approximately 130 Awards From Crisil Coalition Greenwich Since 2011</i></p><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.pa.pittbr\">PITTSBURGH</location></span>, <span class=\"legendSpanClass\">Feb. 26, 2026</span> /PRNewswire/ -- F.N.B. Corporation (NYSE: <a class=\"symbol-link\" href=\"/overview/FNB/\" title=\"View FNB stock overview\">FNB</a>) strengthened its standing as a leading financial institution that excels across both commercial and personal banking sectors, after being named to <i>TIME</i>'s list of America's Best Financial Services 2026 and earning 14 Best Bank Awards from Crisil Coalition Greenwich. These honors reflect the Bank's sustained performance and client‑centered strategies, and <a class=\"symbol-link\" href=\"/overview/FNB/\" title=\"View FNB stock overview\">FNB</a> has now earned a total of approximately 130 awards from Crisil Coalition Greenwich since 2011.</p><p>\"Earning the status of a trusted advisor for individuals and businesses is of utmost importance in banking,\" said Vincent J. Delie, Jr., Chairman, President and Chief Executive Officer of F.N.B. Corporation and First National Bank. \"These national honors from Crisil Coalition Greenwich and <i>TIME</i> confirm our standing as an elite commercial bank and speak to the strength of our business model. <a class=\"symbol-link\" href=\"/overview/FNB/\" title=\"View FNB stock overview\">FNB</a>'s sophisticated solutions, deep advisory capabilities and relationship‑based approach keep our clients' goals at the center of every decision.\"</p><p><b>Coalition <location idsrc=\"xmltag.org\" value=\"LU/us.pa.greich\">Greenwich</location> 2026 Awards<br/></b>FNB's Best Bank Awards — which add to a total of approximately 130 awards from Crisil Coalition Greenwich since 2011 — affirm the Company's success in establishing itself as an elite commercial bank that provides clients with a full-service, relationship-based approach supported by competitive products and services. Leveraging its scale, technological capabilities and talent, FNB competes effectively with institutions of all sizes and delivers a comprehensive financial picture for clients.</p><p>Among this year's recognition are five national awards honoring the Bank for its exceptional performance and high-quality service for <b>small business clients</b> (<money><money>$1</money>-<money>$10 million</money></money> in sales):</p><ul type=\"disc\"><li>Satisfaction with Relationship Manager</li><li>Values Long-Term Relationships</li><li>Advisory Capabilities of Relationship Manager</li><li>Trust</li><li>Product Capabilities in Cash Management</li></ul><p>FNB also earned nine total Best Banks Awards (seven national awards, two of which also were awarded regionally) for its excellence in <b>middle market clients </b>(<money><money>$10</money>-<money>$500 million</money></money> in sales):</p><ul type=\"disc\"><li>Likelihood to Recommend (also recognized in Northeast region)</li><li>Satisfaction with Relationship Manager (also recognized in Northeast region)</li><li>Values Long-Term Relationships</li><li>Advisory Capabilities of Relationship Manager</li><li>Trust</li><li>Customer Service</li><li>Ease of Product Implementation</li></ul><p>Crisil Coalition Greenwich is a leading global provider of data, analytics and insights to the financial services industry. Coalition <location idsrc=\"xmltag.org\" value=\"LU/us.pa.greich\">Greenwich</location> 2026 Award winners were determined based on interviews with businesses throughout <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location>. For more information about the Best Bank Awards and the Crisil Coalition Greenwich selection process, visit <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628207-1&amp;h=3623316144&amp;u=https%3A%2F%2Fwww.greenwich.com%2F&amp;a=www.greenwich.com\" rel=\"nofollow noopener\" target=\"_blank\">www.greenwich.com</a>.</p><p>Source: Coalition Greenwich Voice of Client - 2025 U.S. Commercial Banking Study</p><p><b>Recognition from <i>TIME<br/></i></b>FNB was named to <i>TIME</i>'s list of America's Best Financial Services of 2026, one of only 134 companies to earn a spot in the rankings. FNB appeared in the Banking category and in the top 10 for Checking Accounts, further highlighting the strength of the Company's offerings. <i>TIME</i> surveyed over 20,000 consumers in the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> who were asked to rate their financial services providers based on digital services, customer service, value for money and trust. Read the full list <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628207-1&amp;h=2144002708&amp;u=https%3A%2F%2Ftime.com%2F7368951%2Famericas-best-financial-services-2026%2F&amp;a=here\" rel=\"nofollow noopener\" target=\"_blank\">here</a>.</p><p>To learn more about the various honors the Company has received for its outstanding culture, industry-leading client experience and strong community leadership, visit FNB's <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628207-1&amp;h=3848542858&amp;u=https%3A%2F%2Fwww.fnb-online.com%2Fabout-us%2Fnewsroom%2Fawards-and-recognition&amp;a=Awards+and+Recognition\" rel=\"nofollow noopener\" target=\"_blank\">Awards and Recognition</a> page.</p><p><b>About F.N.B. Corporation<br/></b>F.N.B. Corporation (NYSE: FNB), headquartered in <location idsrc=\"xmltag.org\" value=\"LU/us.pa.pittbr\">Pittsburgh, Pennsylvania</location>, is a diversified financial services company operating in seven states and the <location idsrc=\"xmltag.org\" value=\"LS/us.dc\">District of Columbia</location>. FNB's market coverage spans several major metropolitan areas, including: <location idsrc=\"xmltag.org\" value=\"LU/us.pa.pittbr\">Pittsburgh, Pennsylvania</location>; <location idsrc=\"xmltag.org\" value=\"LU/us.md.bltmre\">Baltimore, Maryland</location>; <location idsrc=\"xmltag.org\" value=\"LU/us.oh.clevld\">Cleveland, Ohio</location>; <location idsrc=\"xmltag.org\" value=\"LU/us.dc.wash\">Washington, D.C.</location>; <location idsrc=\"xmltag.org\" value=\"LU/us.nc.charlt\">Charlotte</location>, <location idsrc=\"xmltag.org\" value=\"LU/us.nc.raleig\">Raleigh</location>, <location idsrc=\"xmltag.org\" value=\"LU/us.nc.durham\">Durham</location> and the Piedmont Triad (<location idsrc=\"xmltag.org\" value=\"LU/us.nc.winlem\">Winston-Salem</location>, <location idsrc=\"xmltag.org\" value=\"LU/us.nc.grnsbo\">Greensboro</location> and <location idsrc=\"xmltag.org\" value=\"LU/us.nc.higint\">High Point</location>) in <location idsrc=\"xmltag.org\" value=\"LS/us.nc\">North Carolina</location>; and <location idsrc=\"xmltag.org\" value=\"LU/us.sc.chlstn\">Charleston, South Carolina</location>. The Company has total assets of more than <money><money>$50 billion</money></money> and approximately 350 banking offices throughout <location idsrc=\"xmltag.org\" value=\"LS/us.pa\">Pennsylvania</location>, <location idsrc=\"xmltag.org\" value=\"LS/us.oh\">Ohio</location>, <location idsrc=\"xmltag.org\" value=\"LS/us.md\">Maryland</location>, <location idsrc=\"xmltag.org\" value=\"LS/us.wv\">West Virginia</location>, <location idsrc=\"xmltag.org\" value=\"LS/us.nc\">North Carolina</location>, <location idsrc=\"xmltag.org\" value=\"LS/us.sc\">South Carolina</location>, <location idsrc=\"xmltag.org\" value=\"LU/us.dc.wash\">Washington, D.C.</location> and <location idsrc=\"xmltag.org\" value=\"LS/us.va\">Virginia</location>.</p><p>FNB provides a full range of commercial banking, consumer banking and wealth management solutions through its subsidiary network, which is led by its largest affiliate, First National Bank of <location idsrc=\"xmltag.org\" value=\"LS/us.pa\">Pennsylvania</location>, founded in 1864. Commercial banking solutions include corporate banking, small business banking, investment real estate financing, government banking, business credit, capital markets and lease financing. The consumer banking segment provides a full line of consumer banking products and services, including deposit products, mortgage lending, consumer lending and a complete suite of mobile and online banking services. FNB's wealth management services include asset management, private banking and insurance.</p><p>The common stock of F.N.B. Corporation trades on the New York Stock Exchange under the symbol \"FNB\" and is included in Standard &amp; Poor's MidCap 400 Index with the Global Industry Classification Standard (GICS) Regional Banks Sub-Industry Index. Customers, shareholders and investors can learn more about this regional financial institution by visiting the F.N.B. Corporation website at <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628207-1&amp;h=254584851&amp;u=https%3A%2F%2Fwww.fnbcorporation.com&amp;a=www.fnbcorporation.com\" rel=\"nofollow noopener\" target=\"_blank\">www.fnbcorporation.com</a>.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder6172\"><p><a href=\"https://mma.prnewswire.com/media/1632396/FNB_Corporation_Logo_v4.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"(PRNewsfoto/F.N.B. Corporation)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/1632396/FNB_Corporation_Logo_v4.jpg\" title=\"(PRNewsfoto/F.N.B. Corporation)\"/></a></p></div><p> </p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder0\"></div><p>SOURCE F.N.B. Corporation</p></div></article>",
            "link": "https://www.stocktitan.net/news/FNB/f-n-b-corporation-named-a-leading-u-s-financial-services-company-for-ldp1hoitgotf.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 14:40:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CANADIAN FIRST NATION SEEKS TO HAVE ITS SAY AS PART OF UPCOMING SALE OF HECLA QUÉBEC AND THE CASA BERARDI MINE TO OREZONE GOLD CORPORATION | HL Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\">PIKOGAN, QC</span>, <span class=\"legendSpanClass\">Feb. 26, 2026</span> /PRNewswire/ - Abitibiwinni First Nation (hereinafter \"Abitibiwinni\") is calling on Hecla Mining Company (NYSE: <a class=\"symbol-link\" href=\"/overview/HL/\" title=\"View HL stock overview\">HL</a>) (\"Hecla\") and Orezone Gold Corporation (TSX: ORE) (ASX: ORE) (OTCQX: ORZCF) (\"Orezone\") to ensure a smooth and fair transition that respects its Aboriginal rights and aligns future operations with current economic and environmental realities as part of the proposed sale of Hecla's subsidiary \"Hecla Quebec\" and its Casa Berardi Mine to Orezone.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\"><p><a href=\"https://mma.prnewswire.com/media/2921356/Abitibiwinni_First_Nation_Council_CANADIAN_FIRST_NATION_SEEKS_TO.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"Abitibiwinni First Nation (CNW Group/Abitibiwinni First Nation Council)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/2921356/Abitibiwinni_First_Nation_Council_CANADIAN_FIRST_NATION_SEEKS_TO.jpg\" title=\"Abitibiwinni First Nation (CNW Group/Abitibiwinni First Nation Council)\"/></a></p></div><p>These concerns were raised by Abitibiwinni in a letter sent to the presidents of both Hecla and Orezone on February 3<sup>rd</sup>, 2026, concerns which were largely dismissed and ignored by Hecla in its response dated February 16, 2026. Orezone, to this day, has not responded to Abitibiwinni's letter.</p><p>\"The sale of Hecla Quebec and Casa Berardi marks an important transition in our continued efforts to reconcile the sustainable development of our lands with our stewardship responsibilities,\" said Chief Chantal Kistabish. \"Abitibiwinni's priority is to ensure that the sale, once finalized, leads us to constructive dialogue aimed at ensuring that fairness is restored in terms of our relationship with the mine and its owner and guaranteeing that further development only proceeds responsibly and with appropriate environmental safeguards.\"</p><p>The Casa Berardi mine is located entirely on Abitibiwinni's traditional lands, lands over which it has existing Aboriginal and Treaty rights. The mine is currently subject to an Impacts and Benefits Agreement (IBA) between Abitibiwinni and Hecla, but because of Hecla's refusal to allow the agreement to factor in the sharp rise in gold prices, the very foundation of the partnership between Hecla and the First Nation has been undermined.</p><p>In its letter, Abitibiwinni also raised concerns about the impact of mining activities in the region on woodland caribou. Given the species' cultural significance and ongoing decline, Abitibiwinni is moving to establish a network of protected areas in the region surrounding the Casa Berardi mine to protect the Detour-Kesagami caribou herd. Abitibiwinni expects both compagnies to support this initiative and insists that no further exploration or the possible expansion of the project can occur without its free and informed consent.</p><p>Abitibiwinni is therefore asking that Hecla and Orezone engage promptly in good-faith discussions to work toward a respectful and constructive path forward.</p><p>SOURCE Abitibiwinni First Nation Council</p></div></article>",
            "link": "https://www.stocktitan.net/news/HL/canadian-first-nation-seeks-to-have-its-say-as-part-of-upcoming-sale-l61rvodzm6bu.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 15:28:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Masivo Silver Corp. Launches Phase I Drill Program at Cerro Colorado Project, Sonora, Mexico | GNYPF Stock News",
            "description": "<article class=\"article\"><p>Vancouver, British Columbia--(Newsfile Corp. - February 26, 2026) - <b>Masivo Silver Corp. (TSXV: MASS) (OTC Pink: <a class=\"symbol-link\" href=\"/overview/GNYPF/\" title=\"View GNYPF stock overview\">GNYPF</a>) (FSE: R74) (</b>\"<b>Masivo\" or the </b>\"<b>Company\")</b> is pleased to announce that the Company's Phase I diamond drill program has begun at its Cerro Colorado Project in Sonora, Mexico.</p><p>The initial phase of the program consists of approximately eight (8) diamond drill holes totaling an estimated 1,500 to 2,000 meters. The program is designed to systematically test high-priority silver-copper targets identified through geological mapping, surface sampling, and historical data compilation.</p><p>David G. Coburn, CEO and Director, commented:</p><p>\"The start of drilling at Cerro Colorado is a pivotal moment for Masivo. We are now systematically testing what we have evidence at surface of being at least 1.2 km structurally controlled, expanding silver-copper system with clear evidence of scale at surface. These first holes are designed to validate our geological model and demonstrate continuity at depth. We believe this program has the potential to materially expand the footprint of mineralization and unlock significant value for shareholders.\" </p><p><b>Hole A</b> targets a depth of 130 meters, with the objective of hitting a zone of polymetallic sulfides that may correspond to an anomaly of high chargeability found in the geophysics program or induced polarization (\"IP\") at a depth of 100 meters below surface. There is strong potential for significantly higher values of silver (Ag), gold (Au), copper (Cu), lead (Pb), and zinc (Zn).</p><p><b>Hole B </b>is planned approximately 500 meters northeast of Hole A, targeting a depth of 150 meters. The objective is to test a high chargeability anomaly and follow up on high-grade values identified in sulfide material from the dumps of historic mine workings, which returned assays of 1,840 g/t silver (Ag), 4.82 g/t gold (Au), <percent>3.06%</percent> copper (Cu), <percent>4.55%</percent> lead (Pb), and <percent>2.92%</percent> zinc (Zn).</p><p><b>Holes C, D &amp; E</b> are planned between Holes A and B, with the objective of testing the high chargeability anomaly within the same mineralized structure. Hole C and E are designed to reach a target depth of 150 meters, while hole D is planned to extend deeper to 200 meters.</p><p><b>Holes F &amp; G</b> are planned to reach depths of 150 to 300 meters northeast of Hole B. Their objective is to test the high chargeability anomaly and assess the continuity of the mineralized structure along a well-defined southwest-to-northeast (SW-NE) trend.</p><p><b>Hole H</b> is oriented in a different direction, targeting a southeast-to-northwest (SE-NW) structural system that is perpendicular to the main southwest-to-northeast (SW-NE) trend.</p><p>This secondary structural system hosts a gold-copper-silver (Au-Cu-Ag) mineralization style, observed in several near-surface historic artisanal workings developed by local \"Gambusinos.\" These small-scale mines have returned high-grade values, including over 20 g/t gold (Au), 95 g/t silver (Ag), and <percent>0.8%</percent> copper (Cu). The planned depth for these holes is 120 meters.</p><p>The Cerro Colorado Project hosts numerous historic workings and surface exposures of silver-copper mineralization. Previous surface sampling has returned encouraging silver and copper values associated with quartz veining, breccia zones, and structurally controlled shear zones. The current drill program represents the first systematic test of several priority targets at depth and is intended to confirm continuity of mineralization below surface exposures.</p><p><b>Historic Drill Results (2015)</b></p><p>Historic drilling completed by Minera Gold Zone in 2015 on the southwestern margin of the Cerro Colorado system returned broad, near-surface, polymetallic silver and base-metal mineralization, including the following intercepts:</p><ul><li><b>ETCC-15-01:</b> 29.65 m @ 50.74 g/t Ag, <percent>0.607%</percent> Zn, <percent>0.131%</percent> Pb, <percent>0.053%</percent> Cu, and 0.062 g/t Au (48.80-78.45 m), including 5.05 m @ 254 g/t Ag and 2.95 m @ 384 g/t Ag.<br/><br/></li><li><b>ETCC-15-04</b>: 35.80 m @ 23.44 g/t Ag and <percent>0.406%</percent> Zn (44.50-80.30 m), including 3.15 m @ 159.06 g/t Ag and 0.60 m @ 577 g/t Ag (with associated base metals and gold).</li></ul><p>These historic intercepts, together with recent mapping and surface sampling, support the current Phase I drill program designed to test the continuity and structural controls of mineralization at depth.</p><p>Please visit the following link for drill program map and information. </p><p><a href=\"https://api.newsfilecorp.com/redirect/DOy4gCPZEa\" rel=\"nofollow noopener\">https://masivosilver.com/cerro-colorado</a></p><p>The Company will provide updates as the program progresses.</p><p>Qualified Person</p><p>Brian Brewer, PGeo, is Masivo Silver's qualified person for the company's projects in Mexico and Nevada and has approved this news release.</p><div id=\"contactInfo\"><p>About Masivo Silver Corp.</p><p>Masivo is a Canadian junior silver and gold mining exploration company based in Vancouver, Canada. Masivo is currently focused on advancing its exploration projects in the State of Nevada, US, and in the State of Sinaloa, Mexico. The Company's mill, located on its El Colomo property, is capable of processing up to 300 tons of ore per day. Additional information on Masivo's current operations is available on the Company's website at <a href=\"https://api.newsfilecorp.com/redirect/rpXwqIwPQm\" rel=\"nofollow noopener\">www.masivosilver.com</a> or email <a href=\"mailto:davidcoburn@masivosilver.com\" rel=\"nofollow noopener\">davidcoburn@masivosilver.com</a>.</p></div><p>ON BEHALF OF THE BOARD OF DIRECTORS</p><p>\"David Coburn\" Chief Executive Officer</p><p>This press release contains \"forward-looking information\" that is based on the Company's current expectations, estimates, forecasts, and projections. This forward-looking information includes, among other things, statements with respect to the Company's exploration plans. The words \"will\", \"anticipated\", \"plans\" or other similar words and phrases are intended to identify forward-looking information. Forward-looking information is subject to known and unknown risks, uncertainties and other factors that may cause the Company's actual results, level of activity, performance, or achievements to be materially different from those expressed or implied by such forward looking information.</p><p>Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/VvrKaSME5D\" rel=\"nofollow noopener\">https://www.newsfilecorp.com/release/285468</a></p><p><img alt=\"\" loading=\"lazy\" src=\"https://api.newsfilecorp.com/newsinfo/285468/375\"/></p></article>",
            "link": "https://www.stocktitan.net/news/GNYPF/masivo-silver-corp-launches-phase-i-drill-program-at-cerro-colorado-q110c415hhr8.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 15:29:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Knightscope Announces Over $2 Million in New and Recurring Contracts | KSCP Stock News",
            "description": "<article class=\"article\"><p> <location idsrc=\"xmltag.org\" value=\"LU/us.ca.sunyvl\">SUNNYVALE, Calif.</location>--(BUSINESS WIRE)--<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fknightscope.com%2F&amp;esheet=54433878&amp;newsitemid=20260226885101&amp;lan=en-US&amp;anchor=Knightscope%2C+Inc.&amp;index=1&amp;md5=7c97cad44de160164d94a3aab14c70ad\" rel=\"nofollow noopener\" shape=\"rect\">Knightscope, Inc.</a> (NASDAQ: <a class=\"symbol-link\" href=\"/overview/KSCP/\" title=\"View KSCP stock overview\">KSCP</a>), a security technology company building the Nation’s First Autonomous Security Force, today announced that it has surpassed another <money><money>$2 million</money></money> milestone in new sales and client renewals. Following similar success in prior months, this continued momentum underscores the growing national demand for Knightscope’s innovative, technology-driven solutions designed to enhance security infrastructure and modernize both public and private environments.</p><p><b>Emergency Communication Device (ECD) Growth Across Key Verticals</b></p><p>Knightscope secured sales of 119 new Emergency Communication Devices (ECD) across multiple sectors, including consumer packaged goods, higher education, hospitality, local governments, and healthcare. These varying areas of new business growth reflect increasing confidence in Knightscope’s potentially life-saving communication technology and its critical role in bolstering emergency communications infrastructure nationwide.</p><p>In addition, maintenance services for hundreds of ECD units were renewed or extended among existing clients in the healthcare, higher education, and state and local government sectors. These ongoing commitments further validate the reliability and long-term value of Knightscope’s emergency communication systems and contribute meaningfully to Knightscope’s recurring revenue.</p><p><b>Autonomous Security Robot (ASR) Momentum and Renewals</b></p><p>Knightscope also reported continued strength in its Autonomous Security Robots (ASRs), with 20 new ASR sales across residential, consumer goods, commercial real estate, and healthcare verticals. Notably, these new deployments include three RTX human-in-the-loop remote monitoring packages, reinforcing the market’s confidence in Knightscope’s intelligent patrol solutions for high-security environments.</p><p>Knightscope additionally completed ASR renewals totaling 21 units, including 13 K1 Hemispheres, 5 K5 ASR, and 2 K1 Towers, with clients spanning megachurches, local governments, hospitals, logistics, auto retail, and commercial real estate deployment environments. These renewals reflect client satisfaction in the solution Knightscope’s Machine-as-a-Service (MaaS) platform provides.</p><p><b>Long-Term Client Partnerships Continue to Strengthen</b></p><p>Among the many renewals, Knightscope has highlighted its 9<sup>th</sup> consecutive year renewal with one of the largest health systems in the US, along with a Fortune 500 entertainment company’s industrial site entering its 8<sup>th</sup> year under contract, as some of the most notable. These enduring relationships demonstrate sustained value Knightscope delivers through its machines proven crime deterrence and prevention.</p><p><b>Building on Recurring Revenue Growth</b></p><p>This performance further solidifies Knightscope’s position as a national leader in autonomous physical security and emergency communications. Through its Machine-as-a-Service (MaaS) model, the Company continues to expand predictable revenue streams while delivering measurable impact through innovation, scalability, and client-valued outcomes.</p><p><b>About Knightscope</b></p><p>Knightscope is a security technology company building the Nation’s First Autonomous Security Force. The Company combines autonomous machines, advanced software, and human expertise to help protect people, property, and critical infrastructure. Knightscope’s long-term mission is to make <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States of America</location> the safest country in the world. Learn more about us at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.knightscope.com%2F&amp;esheet=54433878&amp;newsitemid=20260226885101&amp;lan=en-US&amp;anchor=www.knightscope.com&amp;index=2&amp;md5=64ca37d2fdb820634cbacdc49659dd29\" rel=\"nofollow noopener\" shape=\"rect\">www.knightscope.com</a>.</p><p><b>Forward-Looking Statements</b></p><p>This press release contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such forward-looking statements can be identified by the use of words such as \"should,\" \"may,\" \"intends,\" \"anticipates,\" \"believes,\" \"estimates,\" \"projects,\" \"forecasts,\" \"expects,\" \"plans,\" \"proposes\" and similar expressions. Forward-looking statements contained in this press release and other communications include, but are not limited to, statements about the Company’s goals, profitability, growth, prospects, reduction of expenses, and outlook. Although Knightscope believes that the expectations reflected in these forward-looking statements are based on reasonable assumptions, there are a number of risks, uncertainties and other important factors that could cause actual results to differ materially from such forward-looking statements, including the factors discussed under the heading \"Risk Factors\" in Knightscope’s Annual Report on Form 10-K for the year ended December 31, 2024, as updated by its other filings with the Securities and Exchange Commission. Forward-looking statements speak only as of the date of the document in which they are contained, and Knightscope does not undertake any duty to update any forward-looking statements, except as may be required by law.</p><p><img alt=\"\" loading=\"lazy\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226885101r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\"/><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20260226885101/en/\" rel=\"nofollow noopener\">https://www.businesswire.com/news/home/20260226885101/en/</a></span></p><p><b><i>Public Relations</i></b><br/><i><a href=\"mailto:overwatch@knightscope.com\" rel=\"nofollow noopener\" shape=\"rect\">overwatch@knightscope.com</a></i><br/><i>Knightscope, Inc.</i><br/><b><i>(650) 924-1025 ext. 6</i></b></p><p>Source: Knightscope, Inc.</p></article>",
            "link": "https://www.stocktitan.net/news/KSCP/knightscope-announces-over-2-million-in-new-and-recurring-3eg9x7ln4do7.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 15:32:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FIS Announces Proposed Offerings of Senior Notes | FIS Stock News",
            "description": "<article class=\"article\"><p> <location idsrc=\"xmltag.org\" value=\"LU/us.fl.jckvil\">JACKSONVILLE, Fla.</location>--(BUSINESS WIRE)--FIS<sup>®</sup> (NYSE: <a class=\"symbol-link\" href=\"/overview/FIS/\" title=\"View FIS stock overview\">FIS</a>), a global leader in financial technology, today announced that it intends, subject to market and other considerations, to make offerings of senior notes denominated in Euro and <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> dollars, each in multiple tranches (the “Senior Notes”). <a class=\"symbol-link\" href=\"/overview/FIS/\" title=\"View FIS stock overview\">FIS</a> intends to use the net proceeds from the Senior Notes offerings for the repayment of short-term indebtedness incurred to finance the acquisition of Global Payments’ Issuer Solutions business, with any remaining net proceeds used to repay outstanding borrowings under its existing commercial paper programs.</p><p>Goldman Sachs &amp; Co. LLC, Wells Fargo Securities International Limited, Citigroup Global Markets Limited, J.P. Morgan Securities plc and TD Global Finance unlimited company are joint book-running managers for the offering of Euro-denominated Senior Notes. Goldman Sachs &amp; Co. LLC, Wells Fargo Securities, LLC, Citigroup Global Markets Inc., J.P. Morgan Securities LLC and TD Securities (<location idsrc=\"xmltag.org\" value=\"LC/us\">USA</location>) LLC are joint book-running managers for the offering of <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> dollar-denominated Senior Notes. The offerings of the Senior Notes are being made only by means of the applicable prospectus supplement and accompanying prospectus. You may obtain copies of these documents without charge from the Securities and Exchange Commission (the “SEC”). Alternatively, you may request copies of the prospectus supplement relating to the offering of Euro-denominated Senior Notes and accompanying prospectus by calling Goldman Sachs &amp; Co. LLC toll-free at +1 (866) 471-2526, Wells Fargo Securities International Limited toll-free at +1 (800) 645-3751, Citigroup Global Markets Limited toll-free at +1 (800) 831-9146, J.P. Morgan Securities plc at +44-20 7134-2468 (for non-U.S. investors), J.P. Morgan Securities LLC collect at +1 (212) 834-4533 (for U.S. investors) or TD Global Finance unlimited company toll-free at +1 (855) 495-9846, and copies of the prospectus supplement relating to the offering of <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> dollar-denominated Senior Notes and accompanying prospectus by calling Goldman Sachs &amp; Co. LLC toll-free at +1 (866) 471-2526, Wells Fargo Securities, LLC toll-free at +1 (800) 645-3751, Citigroup Global Markets Inc. toll-free at +1 (800) 831-9146, J.P. Morgan Securities LLC collect at +1 (212) 834-4533 or TD Securities (<location idsrc=\"xmltag.org\" value=\"LC/us\">USA</location>) LLC toll-free at +1 (855) 495-9846.</p><p>This press release does not constitute an offer to sell or the solicitation of an offer to buy any of the Senior Notes, nor will there be any sale of the Senior Notes in any jurisdiction in which such offer, solicitation or sale is not authorized or to any person to whom it is unlawful to make such offer, solicitation or sale. Any offer, solicitation or sale of the Senior Notes will be made only by means of the applicable prospectus supplement and the accompanying prospectus, meeting the requirements of Section 10 of the Securities Act of 1933, as amended.</p><p><b>About FIS</b></p><p><a class=\"symbol-link\" href=\"/overview/FIS/\" title=\"View FIS stock overview\">FIS</a> is a financial technology company providing solutions to financial institutions and businesses. We unlock financial technology to the world across the money lifecycle underpinning the world’s financial system. Our people are dedicated to advancing the way the world pays, banks and invests, by helping our clients to confidently run, grow and protect their businesses. Our expertise comes from decades of experience helping financial institutions and businesses of all sizes adapt to meet the needs of their customers by harnessing where reliability meets innovation in financial technology. Headquartered in <location idsrc=\"xmltag.org\" value=\"LU/us.fl.jckvil\">Jacksonville, Fla.</location>, FIS is a member of the Fortune 500® and the Standard &amp; Poor’s 500® Index.</p><p><b>Forward-looking Statements</b></p><p>This news release contains forward-looking statements that involve a number of risks and uncertainties. Statements that are not historical facts, including statements about our beliefs and expectations, are forward-looking statements. Forward-looking statements are based on management’s beliefs, as well as assumptions made by, and information currently available to, management. Because such statements are based on expectations as to future events and are not statements of fact, actual results may differ materially from those projected. FIS undertakes no obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law. The risks and uncertainties which forward-looking statements are subject to include, but are not limited to, the risk that the offerings described herein are not completed, the risk that the proceeds are not able to be used for the purposes stated as a result of unforeseen circumstances and other risks detailed in the “Statement Regarding Forward-Looking Information,” “Risk Factors” and other sections of FIS’ Form 10-K for the year ended December 31, 2025 and FIS’ other filings with the SEC.</p><p><img alt=\"\" loading=\"lazy\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226436903r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\"/><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20260226436903/en/\" rel=\"nofollow noopener\">https://www.businesswire.com/news/home/20260226436903/en/</a></span></p><p><b>For More Information</b><br/>Kim Snider, 904.438.6278<br/>Senior Vice President<br/>FIS Global Marketing and Communications<br/><a href=\"mailto:kim.snider@fisglobal.com\" rel=\"nofollow noopener\" shape=\"rect\">kim.snider@fisglobal.com</a><br/><br/>George Mihalos, 904.438.6438<br/>Senior Vice President<br/>FIS Investor Relations<br/><a href=\"mailto:georgios.mihalos@fisglobal.com\" rel=\"nofollow noopener\" shape=\"rect\">georgios.mihalos@fisglobal.com</a></p><p>Source: Fidelity National Information Services</p></article>",
            "link": "https://www.stocktitan.net/news/FIS/fis-announces-proposed-offerings-of-senior-c5bmavh8y3ax.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 14:26:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "iMetal Resources Intersects 16.65 Metres at 1.24 g/t Gold Within 62.25 Metres at 0.61 g/t Gold at Gowganda West | IMRFF Stock News",
            "description": "<article class=\"article\"><p>Vancouver, British Columbia--(Newsfile Corp. - February 26, 2026) - <b>iMetal Resources Inc. (TSXV: IMR) (OTCQB: <a class=\"symbol-link\" href=\"/overview/IMRFF/\" title=\"View IMRFF stock overview\">IMRFF</a>) (FSE: A7VA)</b> (\"<b>iMetal</b>\" or the \"<b>Company</b>\") has intersected <b>16.65 metres at 1.25 g/t gold within 62.25 metres at 0.61 g/t gold</b> at its Gowganda West Gold Project, southwest of Timmins, Ontario. Drilling in the West Zone intersected broad levels of gold mineralization in multiple holes, with long intervals of gold mineralization encountered in two of the six holes completed during the program, complementing the spring 2023 discovery hole of 48.5m of 0.85 g/t Au starting at 316.5m (see News Release dated 2023-Jun-06).</p><p><b>Highlights:</b></p><ul style=\"list-style-type: disc;\"><li>IMGW-25-06 returned 0.424 g/t gold over 278.35 metres from 45.1 to 323.45 metres, which included several sub-intervals, including:<ul style=\"list-style-type: circle;\"><li><b>1.019 g/t gold over 7.4 metres</b> from 118.75 to 126.15 metres</li><li><b>0.566 g/t over 80 metres</b> from 154 to 234 metres</li><li><b>0.610 g/t gold over 62.45</b> <b>metres</b> from 261 to 323.45 metres, including<ul style=\"list-style-type: square;\"><li><b>1.239 g/t gold over 16.65 metres</b> from 289.35 to 306 metres</li></ul></li></ul></li><li>IMGW-25-01 returned <b>0.419 g/t gold over 65.75</b> <b>metres </b>from 276.7 to 342.45 metres, including<ul style=\"list-style-type: circle;\"><li><b>0.868 g/t gold over 8 metres</b> from 296.5 to 304 metres</li><li><b>0.786 g/t gold over 5.8 metres</b> from 315.95 to 321.75 metres</li></ul></li><li>IMGW-25-03 returned <b>1.116 g/t gold over 6.2 metres</b> from 342.75 to 348.95 metres</li><li>McFarlane Lake Mining Limited, contiguous to the northwest has identifed a parallel zone to it's Juby Zone within the regional Ridout-Tyrrell Deformation Zone, the 826 Zone, which appears to trend into the West Zone.</li></ul><p>\"These results continue to expand the gold system at Gowganda West and demonstrate both broad mineralization and higher-grade internal intervals,\" stated Saf Dhillon, President &amp; CEO of iMetal. \"The scale of the mineralized envelope, combined with its proximity to the Juby Deposit and the emerging 826 Zone, reinforces the structural significance of this corridor. We look forward to incorporating these results into our ongoing geological model and planning the next phase of drilling!\" commented iMetal President &amp; CEO Saf Dhillon. </p><p>The drilling intersected the targeted host rocks that exhibited alteration patterns and mineralization similar to that which was intersected in the 2023 drill program. The dominant rock type intersected is a matrix supported greenish polymictic conglomerate composed of heterogenous centimetric to pluricentimetric round clasts with different colors. A percentage of the red clasts are magnetic but the matrix is not. Zones of moderate to pervasive hematization /potassic alteration, sericitization and silicification were noted in the drill holes. Mineralization included disseminated and clast-replacement controlled pyrite, while a few holes also intersected local chalcopyrite vein fractures or plurimillimetric clusters. Alteration intensity appears to be a control on elevated gold values. Pyrite content also shows a relationship with elevated gold values and intensity of alteration.</p><p style=\"text-align: center;\"><a href=\"https://images.newsfilecorp.com/files/7946/285465_table1.jpg\" rel=\"nofollow noopener\"><img alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/7946/285465_table1_550.jpg\" loading=\"lazy\" src=\"https://images.newsfilecorp.com/files/7946/285465_table1_550.jpg\" style=\"border-width: 0px;\"/></a></p><p style=\"text-align: center;\"><b>Table 1. 2025 Key Intervals</b></p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br/><a href=\"https://images.newsfilecorp.com/files/7946/285465_table1.jpg\" rel=\"nofollow noopener\">https://images.newsfilecorp.com/files/7946/285465_table1.jpg</a></p><p>Drilling also intersected multiple dykes in all holes. Diabase ranged in width from 1.45 to 45.05 metres in width and did not return any elevated gold values, though elevated gold values were noted at the lower contacts in several holes. Fine-grained intermediate dykes range in width from 1 to 20.8 metres and carry gold values in some instances but not others.</p><p style=\"text-align: center;\"><a href=\"https://images.newsfilecorp.com/files/7946/285465_table2.jpg\" rel=\"nofollow noopener\"><img alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/7946/285465_table2_550.jpg\" loading=\"lazy\" src=\"https://images.newsfilecorp.com/files/7946/285465_table2_550.jpg\" style=\"border-width: 0px;\"/></a><br/><br/><b>Table 2. 2025 Drill Collar Table</b></p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br/><a href=\"https://images.newsfilecorp.com/files/7946/285465_table2.jpg\" rel=\"nofollow noopener\">https://images.newsfilecorp.com/files/7946/285465_table2.jpg</a></p><p>The Gowganda West property hosts a large package of gold prospective Timiskaming metasediments, approximately 7 km in strike and up to 5 km in width, that hosts all the gold mineralization thus far discovered on the property. Successive drill programs advancing to the southwest continued to intersect increasing alteration and gold values in suspected NW trending zones and lead directly to the IMGW23-04 discovery hole. The 48.5m gold interval is characterized by a coarse-grained to boulder-sized conglomerate, with moderate to pervasive silica alteration associated with a large intermediate-mafic dyke. Ther 2022 and 2023 drill programs appear to suggest a strong correlation between the intensity of the silica alteration and increased gold grades.</p><p style=\"text-align: center;\"><a href=\"https://images.newsfilecorp.com/files/7946/285465_6b2a3af7241a6a98_002full.jpg\" rel=\"nofollow noopener\"><img alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/7946/285465_6b2a3af7241a6a98_002.jpg\" loading=\"lazy\" src=\"https://images.newsfilecorp.com/files/7946/285465_6b2a3af7241a6a98_002.jpg\" style=\"border-width: 0px;\"/></a><br/><br/><b>Figure 1. 2026 Drill Hole Locations</b></p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br/><a href=\"https://images.newsfilecorp.com/files/7946/285465_6b2a3af7241a6a98_002full.jpg\" rel=\"nofollow noopener\">https://images.newsfilecorp.com/files/7946/285465_6b2a3af7241a6a98_002full.jpg</a></p><p>Gowganda West is an exploration-stage gold project about 100 km south-southeast of Timmins, Ontario; contiguous to McFarlane Lake Mining's Juby Deposits Project in the Shining Tree Camp of the southern part of the Abitibi Greenstone Gold Belt; and also contiguous to the Knight project that is part of the Strategic Partnership between Orecap Invest Corp. and Agnico Eagle Mines Ltd. iMetal's fall 2022 and spring 2023 drill program were successful in intersecting new gold trends in the SW section of the property. The Property also has multiple-ounce grab samples from trends that have yet to be drill tested.</p><p style=\"text-align: center;\"><a href=\"https://images.newsfilecorp.com/files/7946/285465_table3.jpg\" rel=\"nofollow noopener\"><img alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/7946/285465_table3_550.jpg\" loading=\"lazy\" src=\"https://images.newsfilecorp.com/files/7946/285465_table3_550.jpg\" style=\"border-width: 0px;\"/></a><br/><br/><b>Figure 3. All 2026 Drill Intervals</b></p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br/><a href=\"https://images.newsfilecorp.com/files/7946/285465_table3.jpg\" rel=\"nofollow noopener\">https://images.newsfilecorp.com/files/7946/285465_table3.jpg</a></p><p style=\"text-align: center;\"><a href=\"https://images.newsfilecorp.com/files/7946/285465_image1.jpg\" rel=\"nofollow noopener\"><img alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/7946/285465_image1_550.jpg\" loading=\"lazy\" src=\"https://images.newsfilecorp.com/files/7946/285465_image1_550.jpg\" style=\"border-width: 0px;\"/></a><br/><br/>Image 1</p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br/><a href=\"https://images.newsfilecorp.com/files/7946/285465_image1.jpg\" rel=\"nofollow noopener\">https://images.newsfilecorp.com/files/7946/285465_image1.jpg</a></p><p style=\"text-align: center;\"><a href=\"https://images.newsfilecorp.com/files/7946/285465_image2.jpg\" rel=\"nofollow noopener\"><img alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/7946/285465_image2_550.jpg\" loading=\"lazy\" src=\"https://images.newsfilecorp.com/files/7946/285465_image2_550.jpg\" style=\"border-width: 0px;\"/></a><br/><br/>Image 2</p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br/><a href=\"https://images.newsfilecorp.com/files/7946/285465_image2.jpg\" rel=\"nofollow noopener\">https://images.newsfilecorp.com/files/7946/285465_image2.jpg</a></p><p style=\"text-align: center;\"><a href=\"https://images.newsfilecorp.com/files/7946/285465_image3.jpg\" rel=\"nofollow noopener\"><img alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/7946/285465_image3_550.jpg\" loading=\"lazy\" src=\"https://images.newsfilecorp.com/files/7946/285465_image3_550.jpg\" style=\"border-width: 0px;\"/></a><br/><br/>Image 3</p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br/><a href=\"https://images.newsfilecorp.com/files/7946/285465_image3.jpg\" rel=\"nofollow noopener\">https://images.newsfilecorp.com/files/7946/285465_image3.jpg</a></p><p><b>QA/QC</b></p><p>All samples were dispatched to ALS Minerals prep facilites at either Val D'Or or Lachine (Montreal) where they underwent standard preparation procedures of CRU-21 and PREP-31. All pulps were then dispatched to ALS Minerals North Vancouver to undergo the Au-AA24 procedure, a 50 gram gold fire assay with an AAS finish. Intervals of visible chalcopyrite underwent the ME-ICP41 procedure, again in North Vancouver. All ALS Minerals laboratories and prep labs are Standards Council of Canada (SCC) ISO/IEC 17025 accredited facilities and are independent of iMetal Resources Inc. </p><p>A rigorous QA/QC program is was instituted with a certified standard and a blank inserted at an interval of every thirty samples. Each 30<sup>th</sup> sample is also be duplicated. No anomalies were noted in the QA/QC data.</p><p><b>Qualified Person</b></p><p>The technical content of the New Release has been reviewed and approved by R.Tim Henneberry, P.Geo. (BC), a director of the Company and a Qualified Person under National Instrument 43-101. </p><p><b>About iMetal Resources Inc.</b></p><p>iMetal is a Canadian-based junior exploration company focused on the exploration and development of its portfolio of resource properties in Ontario and Quebec. The flagship property Gowganda West, is an exploration-stage gold project with a recent discovery hole of 48.5m at 0.85 g/t gold that borders the Juby Deposit and is located within the Shining Tree Camp area in the southern part of the Abitibi Greenstone Gold Belt about 100 km south-southeast of the Timmins Gold Camp. The 220-hectare Ghost Mountain property, 42 kilometres NE of Kirkland Lake, lies 5 kilometres W of Agnico Eagle's Holt and Holloway Mine. Carheil is an exploration stage project with multi-metal potential and previous graphite results. The project is about 170 km north of Rouyn-Noranda in the Northern Abitibi Greenstone Belt.</p><div id=\"contactInfo\"><p><b>ON BEHALF OF THE BOARD OF DIRECTORS</b>,</p><p><b>Saf Dhillon</b><br/><i>President &amp; CEO</i></p><p><b>iMetal Resources Inc.</b><br/><a href=\"mailto:saf@imetalresources.ca\" rel=\"nofollow noopener\">saf@imetalresources.ca</a> <br/>Tel. (604-484-3031)<br/>Suite 550, 800 West Pender Street, Vancouver, British Columbia, V6C 2V6. <br/><a href=\"https://api.newsfilecorp.com/redirect/0p3ZOskbKD\" rel=\"nofollow noopener\"><b>https://imetalresources.ca</b></a></p></div><p><i>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. </i></p><p><i>This release may contain forward-looking statements or forward-looking information under applicable Canadian securities legislation that may not be based on historical fact, including, without limitation, statements containing the words \"believe\", \"may\", \"plan\", \"will\", \"estimate\", \"continue\", \"anticipate\", \"intend\", \"expect\", \"potential\", and similar expressions. Forward-looking statements involve known and unknown risks, uncertainties, and other factors which may cause the actual results, performance, or achievements of iMetal to be materially different from any future results, performance, or achievements expressed or implied by the forward-looking statements. Forward-looking statements or information in this release relates to, among other things, the potential to complete a transaction with the Vendor and the outstanding conditions to such a transaction. These forward-looking statements are based on management's current expectations and beliefs and assume, among other things, the ability of the Company to successfully pursue its current development plans, that future sources of funding will be available to the company, that relevant commodity prices will remain at levels that are economically viable for the Company and that the Company will receive relevant permits in a timely manner in order to enable its operations, but given the uncertainties, assumptions and risks, readers are cautioned not to place undue reliance on such forward-looking statements or information. The Company disclaims any obligation to update, or to publicly announce, any such statements, events or developments except as required by law.</i></p><p id=\"corporateNewsLogoContainer\"><img alt=\"Corporate Logo\" id=\"corporateNewsLogo\" loading=\"lazy\" src=\"https://images.newsfilecorp.com/files/7946/285465_6b2a3af7241a6a98_logo.jpg\"/></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/RYpK5uOqyj\" rel=\"nofollow noopener\">https://www.newsfilecorp.com/release/285465</a></p><p><img alt=\"\" loading=\"lazy\" src=\"https://api.newsfilecorp.com/newsinfo/285465/375\"/></p></article>",
            "link": "https://www.stocktitan.net/news/IMRFF/i-metal-resources-intersects-16-65-metres-at-1-24-g-t-gold-within-62-pl73iehw0nwo.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 14:32:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cardinal Infrastructure Group Announces Key Leadership Appointments | CDNL Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\">RALEIGH, N.C.</span>, <span class=\"legendSpanClass\">Feb. 26, 2026</span> /PRNewswire/ -- Cardinal Infrastructure Group (NASDAQ: <a class=\"symbol-link\" href=\"/overview/CDNL/\" title=\"View CDNL stock overview\">CDNL</a>) (\"Cardinal\" or \"the Company\") today announced the appointment of three senior professionals to support the company's continued growth and maturation as a publicly traded company. Jason Banks joined as Director of Information Technology, Emily Lear as Director of Investor Relations and Liz Hester as Director of Marketing and Public Relations. These key hires mark a significant milestone in Cardinal's commitment to expanding its expertise and capabilities across critical business functions.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\"><p><a href=\"https://mma.prnewswire.com/media/2842252/CIG_Logo.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"Cardinal Infrastructure Group Inc. Announces Pricing of Initial Public Offering (PRNewsfoto/Cardinal Infrastructure Group Inc.)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/2842252/CIG_Logo.jpg\" title=\"Cardinal Infrastructure Group Inc. Announces Pricing of Initial Public Offering (PRNewsfoto/Cardinal Infrastructure Group Inc.)\"/></a></p></div><p>\"We are thrilled to welcome Jason, Emily and Liz to our growing team,\" said Jeremy Spivey, President and CEO of Cardinal Infrastructure Group. \"These hires represent an important investment in the future of Cardinal and bring deep expertise in their respective fields. Together, they will help us scale efficiently, communicate more effectively and support the long-term strategic vision of our company.\"</p><p><b>Jason Banks — Director of Information Technology<br/></b>Jason brings more than 20 years of experience in enterprise systems, IT operations and modernization initiatives. In his new role, he will lead efforts to enhance internal technology platforms, strengthen cybersecurity and support seamless operational growth. Jason most recently served as the North America IT Director for Descours &amp; Cabaud and previously held an IT leadership role at Parker Hannifin.</p><p><b>Emily Lear — Director of Investor Relations<br/></b>Emily joins Cardinal with more than a decade of experience building and supporting investor relations programs. She will lead engagement with Cardinal's investor and analyst community and ensure clear, consistent communication of the company's strategy, performance and long-term growth opportunities. Prior to joining Cardinal, Emily held strategic roles at Vontier Corporation and MDU Resources Group, former parent company of Knife River and Everus Construction Group.</p><p><b>Liz Hester — Director of Marketing and Public Relations<br/></b>As Director of Marketing and Public Relations, Liz Hester will lead brand development, marketing strategy and public communications. With deep experience in integrated marketing, digital strategy and brand positioning, she will elevate Cardinal's presence across key markets and audiences. Liz joins from FMI Corp., where she served as the Head of Brand Marketing and previously held roles with JPMorgan Chase and Bloomberg News.</p><p><b>About Cardinal<br/></b>Cardinal Infrastructure Group (NASDAQ: <a class=\"symbol-link\" href=\"/overview/CDNL/\" title=\"View CDNL stock overview\">CDNL</a>) is one of the Southeast's fastest‑growing, full‑service infrastructure service providers. The company delivers integrated civil and site‑development solutions across high‑growth markets through a self‑performing model supported by skilled labor, specialized fleets and market‑leading subsidiaries. This model enables efficient, turnkey, project execution at scale while maintaining focus on building long-term client relationships. Cardinal's strategy is grounded in operational discipline, market expansion and a commitment to Integrity from the Ground Up.</p><p>SOURCE Cardinal Infrastructure Group Inc.</p></div></article>",
            "link": "https://www.stocktitan.net/news/CDNL/cardinal-infrastructure-group-announces-key-leadership-x2pspcgsvycd.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 14:30:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MGM RESORTS & BETMGM COMMIT OVER $1 MILLION TO RESPONSIBLE GAMING INITIATIVES DURING PROBLEM GAMBLING AWARENESS MONTH | MGM Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p class=\"prntac\"><i>Investment includes <money><money>$450,000</money></money> dedicated for groundbreaking responsible gaming research </i></p><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.nv.lasveg\">LAS VEGAS</location></span>, <span class=\"legendSpanClass\">Feb. 26, 2026</span> /PRNewswire/ -- <a class=\"symbol-link\" href=\"/overview/MGM/\" title=\"View MGM stock overview\">MGM</a> Resorts International (NYSE: <a class=\"symbol-link\" href=\"/overview/MGM/\" title=\"View MGM stock overview\">MGM</a>) and BetMGM have announced a <money><money>$1 million</money></money> expanded commitment to responsible gaming research, public awareness, community partnerships, and employee engagement. This news comes as <a class=\"symbol-link\" href=\"/overview/MGM/\" title=\"View MGM stock overview\">MGM</a> Resorts and BetMGM join the National Council on Problem <span>Gambling</span> (NCPG) in recognizing March as Problem <span>Gambling</span> Awareness Month (PGAM).</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\"><p><a href=\"https://mma.prnewswire.com/media/1452194/BetMGM_MGMRI_v3_Logo.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"(PRNewsfoto/MGM Resorts and BetMGM)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/1452194/BetMGM_MGMRI_v3_Logo.jpg\" title=\"(PRNewsfoto/MGM Resorts and BetMGM)\"/></a></p></div><p>Initiatives include the following:</p><p><b>MGM Resorts &amp; BetMGM Support Independent, Evidence-Based Research</b></p><p>MGM Resorts and BetMGM have jointly committed <money><money>$450,000</money></money> to the International Center for Responsible Gaming (ICRG) to fund a new, groundbreaking research initiative examining sports wagering and its impact on player behavior. This contribution will support independent, peer-reviewed research aimed at developing best practices and strengthening long-term industry sustainability.</p><p>\"As sports <span>betting</span> continues to grow so must our understanding of its impact on our guests and customers,\" said Stephen Martino, Senior Vice President and Chief Compliance Officer, MGM Resorts. \"Investing in high quality research allows us to be guided by valuable data and insights, which will ultimately help us support our patrons, communities and industry.\"</p><p>Over three years, this research will examine factors that may influence sports <span>betting</span> behaviors, including decision-making and risk patterns across different populations. The study will also explore trends and prevention efforts designed to strengthen industry-wide responsible gaming strategies.</p><p>Rhea Loney, Chief Compliance Officer, BetMGM, said, \"Problem <span>Gambling</span> Awareness Month is an important reminder of our year-round responsibility to assist and empower our players. We prioritize player protection by investing in education, tools, collaboration, and meaningful support resources. Our commitment remains clear: to help every player make informed decisions and enjoy our products safely.\"</p><p><b>Community &amp; State Support Initiatives</b></p><p>In 2026, MGM Resorts and BetMGM will contribute over <money><money>$850,000</money></money> to state and national organizations focused on problem <span>gambling</span> prevention, treatment, and responsible gaming measures. As a Founding Member, MGM Resorts will continue its sponsorship of the annual Nevada Council on Problem <span>Gambling</span> Conference and will feature the organization's leaders in responsible gaming training sessions for employees.</p><p><b>Expanding GameSense Engagement &amp; Employee Certification</b></p><p>Throughout March and beyond, MGM Resorts and BetMGM will increase responsible gaming messaging across <span>casino</span> floors, sportsbooks, and digital platforms through their shared GameSense program, developed and licensed by the British Columbia Lottery Corporation (BCLC).</p><p>This involves:</p><ul type=\"disc\"><li>Expanded nationwide GameSense Advisor training, now exceeding 2,000 certified team members equipped to engage guests in proactive conversations and support</li><li>Increased responsible gaming visibility across both gaming and non-gaming resort areas, including convention spaces, arenas, theaters, as well as MGM Rewards desks and the BetMGM app, with messages and QR codes reminding players to \"take a time-out\" and \"set a budget\"</li><li>A Problem <span>Gambling</span> Awareness Month email campaign, featuring GameSense, sent to all BetMGM customers</li><li>An MGM Rewards guest survey to measure awareness and perception of responsible gaming initiatives and GameSense</li><li>Participation in the Cambridge Health Alliance's 13th annual <span>Gambling</span> Disorder Screening Day, supported through employee communications and training channels</li></ul><p><b>Launch of New Responsible Gaming Campaign</b></p><p>This spring, MGM Resorts will introduce a new campaign, <i>Earn More. Play Smart.</i> integrating MGM Rewards® with responsible play messaging. The campaign will remind guests that membership comes with responsibility, not just perks. BetMGM's <i>Mullet Over </i>hockey-themed responsible gaming commercial featuring company ambassador Connor McDavid will continue to air during key sports broadcast across <location idsrc=\"xmltag.org\" value=\"LB/nam\">North America</location> and will also be featured prominently across MGM Resorts properties.</p><p><b><u>Additional Commitments</u></b></p><ul type=\"disc\"><li>For the sixth consecutive year, BetMGM is partnering with EPIC Global Solutions to offer all employees the opportunity to attend a lived experience session, providing insight into the human impact of problem <span>gambling</span>.</li><li>MGM Resorts and BetMGM will launch a social media and internal messaging campaign featuring executive thought leadership on responsible gaming</li><li>MGM Resorts and BetMGM will continue to provide all employees with comprehensive and research-based responsible gaming training</li><li>MGM Resorts and BetMGM continue in their partnership with the American Gaming Association's (AGA) <i>Have A Game Plan. ® Bet Responsibly.™</i> public service campaign and <i>Play Smart from the Start</i> initiative.</li></ul><p>For more information, follow <u><a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627987-1&amp;h=572473947&amp;u=https%3A%2F%2Ftwitter.com%2FMGMResortsIntl&amp;a=%40mgmresorts\" rel=\"nofollow noopener\" target=\"_blank\">@mgmresorts</a></u> and <u><a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627987-1&amp;h=2314561879&amp;u=http%3A%2F%2Ftwitter.com%2Fbetmgm%23_blank&amp;a=%40BetMGM\" rel=\"nofollow noopener\" target=\"_blank\">@BetMGM</a></u> on X.</p><p><b><u>About MGM Resorts International<br/></u></b>MGM Resorts International (NYSE: MGM) is an S&amp;P 500® global entertainment company with national and international locations featuring best-in-class hotels and <span>casinos</span>, state-of-the-art meetings and conference spaces, incredible live and theatrical entertainment experiences, and an extensive array of restaurant, nightlife and retail offerings. MGM Resorts creates immersive, iconic experiences through its suite of <location idsrc=\"xmltag.org\" value=\"LU/us.nv.lasveg\">Las Vegas</location>-inspired brands. The MGM Resorts portfolio encompasses 31 unique hotel and gaming destinations globally, including some of the most recognizable resort brands in the industry. The Company's 50/50 venture, BetMGM, LLC, offers <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> sports <span>betting</span> and online gaming through market-leading brands, including BetMGM and partypoker, and the Company's subsidiary LeoVegas AB offers sports <span>betting</span> and online gaming through market-leading brands in several jurisdictions throughout <location idsrc=\"xmltag.org\" value=\"LR/eur\">Europe</location>. The Company is currently pursuing targeted expansion in <location idsrc=\"xmltag.org\" value=\"LR/asp\">Asia</location> through the integrated resort opportunity in <location idsrc=\"xmltag.org\" value=\"LC/jp\">Japan</location>. Through its \"Focused on What Matters: Embracing Humanity and Protecting the Planet\" philosophy, MGM Resorts commits to creating a more sustainable future, while striving to make a bigger difference in the lives of its employees, guests, and in the communities where it operates. The global employees of MGM Resorts are proud of their company for being recognized as one of FORTUNE® Magazine's World's Most Admired Companies®.</p><p><b><u>About BetMGM</u></b><br/>BetMGM is a market-leading sports <span>betting</span> and gaming entertainment company, pioneering the online gaming industry. Born out of a partnership between MGM Resorts International (NYSE: <u><a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627987-1&amp;h=3351566139&amp;u=https%3A%2F%2Fwww.prnewswire.com%2Fnews-releases%2Fbetmgm-partners-with-cheddar-news-to-launch-sports-betting-business-show-301345531.html%23financial-modal&amp;a=MGM\" rel=\"nofollow noopener\" target=\"_blank\">MGM</a></u>) and Entain Plc (LSE: ENT), BetMGM has exclusive access to all of MGM's <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> land-based and online sports <span>betting</span>, major tournament poker, and online gaming businesses. Utilizing Entain's <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location>-licensed, state-of-the-art technology, BetMGM offers sports <span>betting</span> and online gaming via market-leading brands including BetMGM, Borgata <span>Casino</span>, Party <span>Casino</span> and Party Poker. Founded in 2018, BetMGM is headquartered in New Jersey. For more information, visit <u><a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627987-1&amp;h=3363871089&amp;u=https%3A%2F%2Fc212.net%2Fc%2Flink%2F%3Ft%3D0%26l%3Den%26o%3D3245459-1%26h%3D3798646678%26u%3Dhttps%253A%252F%252Fwww.betmgm.com%252F%26a%3Dhttps%253A%252F%252Fwww.betmgm.com%252F&amp;a=https%3A%2F%2Fwww.betmgm.com%2F\" rel=\"nofollow noopener\" target=\"_blank\">https://www.betmgm.com/</a></u>.</p><p><b><u>About ICRG<br/></u></b>The ICRG, founded in 1996, continues to serve as the only funding source for scientific research on <span>gambling</span> disorder and responsible <span>gambling</span> in <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location>. Recently, it has become a global leader in the field. For more information, visit <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627987-1&amp;h=861381896&amp;u=https%3A%2F%2Fwww.icrg.org&amp;a=www.icrg.org\" rel=\"nofollow noopener\" target=\"_blank\">www.icrg.org</a>.</p><p><b><u>About British Columbia Lottery Corporation</u></b><br/>BCLC is a social purpose company based in <location idsrc=\"xmltag.org\" value=\"LS/ca.bc\">British Columbia, Canada</location> that is committed to delivering win-wins for the greater good while providing lottery, <span>casino</span> and sports <span>gambling</span> entertainment in a way that serves the best interests of its players, the province and society. Last year, BCLC generated more than <money><money>$1.3 billion</money></money> in net income to benefit provincial and community programs, including healthcare, education and charities across <location idsrc=\"xmltag.org\" value=\"LS/ca.bc\">British Columbia, Canada</location>.</p><p><b><u>Forward-Looking Statements</u></b><br/>Statements in this release that are not historical facts are forward-looking statements, within the meaning of the Private Securities Litigation Reform Act of 1995, as amended, and involve risks and/or uncertainties, including those described in MGM Resorts' public filings with the Securities and Exchange Commission. Forward-looking statements can be identified by the use of forward-looking terminology such as \"believes,\" \"expects,\" \"could,\" \"may,\" \"will,\" \"should,\" \"seeks,\" \"likely,\" \"intends,\" \"plans,\" \"pro forma,\" \"projects,\" \"estimates\" or \"anticipates\" or the negative of these words and phrases or similar words or phrases that are predictions of or indicate future events or trends and that do not relate solely to historical matters. MGM Resorts and BetMGM have based forward-looking statements on management's current expectations and assumptions and not on historical facts. Examples of these statements include, but are not limited to, MGM Resorts' and BetMGM's expectations regarding responsible gaming initiatives. These forward-looking statements involve a number of risks and uncertainties. Among the important factors that could cause actual results to differ materially from those indicated in such forward-looking statements include risks related to the effects of economic conditions and market conditions in the markets in which MGM Resorts and BetMGM operate and competition with other destination travel locations throughout <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location> and the world, the design, timing and costs of expansion projects, risks relating to international operations, permits, licenses, financings, approvals and other contingencies in connection with growth in new or existing jurisdictions and additional risks and uncertainties described in MGM Resorts' Form 10-K, Form 10-Q and Form 8-K reports (including all amendments to those reports). In providing forward-looking statements, neither MGM Resorts nor BetMGM is undertaking any duty or obligation to update these statements publicly as a result of new information, future events or otherwise, except as required by law. If MGM Resorts or BetMGM update one or more forward-looking statements, no inference should be drawn that it will make additional updates with respect to those other forward-looking statements.</p><p><b><u>Media Contacts<br/></u></b>Marc Jacobson<br/>MGM Resorts<br/><u><a href=\"mailto:media@mgmresorts.com\" rel=\"nofollow noopener\" target=\"_blank\">media@mgmresorts.com</a></u></p><p>Jennifer Arapoff<br/>BetMGM<br/><u><a href=\"mailto:press@betmgm.com\" rel=\"nofollow noopener\" target=\"_blank\">press@betmgm.com</a></u></p><p>SOURCE MGM Resorts International</p></div></article>",
            "link": "https://www.stocktitan.net/news/MGM/mgm-resorts-betmgm-commit-over-1-million-to-responsible-gaming-nx037pupx6sg.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 14:30:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tevogen Signs Letter of Intent to Evaluate Potential Acquisition of Sciometrix and its Digital Care Management Platform Clinicus | TVGN Stock News",
            "description": "<article class=\"article\"><p>WARREN, N.J. and ROYAL OAK, Mich., Feb.  26, 2026  (GLOBE NEWSWIRE) --  <a href=\"https://www.globenewswire.com/Tracker?data=hd2T6-IximH26_UboHphOKEDbLIis7bl8RaxN6dowv3DcKOIUhLDtNY2w1ugCe1zAmZfIdGt0kHIx1gBl14iqg==\" rel=\"nofollow noopener\" target=\"_blank\">Tevogen</a> (“Tevogen Bio Holdings Inc.”) (Nasdaq: <a href=\"https://www.globenewswire.com/Tracker?data=6DkyrbjiEM9i_-aUDYDY5TPzIdiE3XC92hpsbSB0ztW4VNVu_tYugcRLCNzrhlonFg8kyLMGDeH-iyAauoQTTPllK0cOdFv52xnUa9la6HGF4nKr969z59oDs-7Jpsa6\" rel=\"nofollow noopener\" target=\"_blank\">TVGN</a>) today announced that it has entered into a signed, non-exclusive, non-binding Letter of Intent (“LoI”) to evaluate a potential transaction with <a href=\"https://www.globenewswire.com/Tracker?data=dDVEqD4un-P3jrt4Fn_9_cifRbKU2YeQPjYARi-0nRGtkcg8mHGs5DSjG4JGG0op1EOg81zNJYfZd3Dbwe13bt9IJnw0mQ6Ym8LNPABWL-Q=\" rel=\"nofollow noopener\" target=\"_blank\">Sciometrix Inc.</a> (“Sciometrix”), a privately held healthcare technology and value-based care solutions provider headquartered in Michigan and developer of the Clinicus digital care management platform, that would, if consummated, result in Tevogen holding a majority voting interest in Sciometrix.</p> <p>The potential transaction is being explored to augment Tevogen’s existing capabilities and would result in Tevogen becoming a revenue-generating healthcare enterprise. Tevogen is evaluating the integration of Sciometrix’s digital care management capabilities, including its Clinicus platform, and remote patient monitoring technologies, with the Tevogen.AI initiative.</p> <p>Tevogen believes the acquisition may:</p> <ul type=\"disc\"><li style=\"margin-bottom:8pt;\"><strong>Accelerate Tevogen’s commercialization readiness</strong> by integrating clinical development with real-world patient engagement and outcomes tracking.</li><li style=\"margin-bottom:8pt;\"><strong>Enhance Tevogen.AI and Tevogen’s data capabilities</strong> through Clinicus’ predictive analytics and care optimization platform.</li><li style=\"margin-bottom:8pt;\"><strong>Support value-based models</strong> for advanced immunotherapies by aligning treatment delivery with longitudinal patient monitoring and payer reporting requirements.</li><li style=\"margin-bottom:8pt;\"><strong>Create a differentiated biotech-plus-services model</strong> designed to reduce friction between innovation, reimbursement, and patient access.</li><li style=\"margin-bottom:8pt;\"><strong>Optimize clinical trials</strong> and related operational efficiency.<br/><br/></li></ul> <p>Abhishek Sharma, Founder and Chief Executive Officer of Sciometrix, stated, “Today marks a major milestone for Sciometrix and Clinicus and the many patients who rely on our high-quality, cost-effective digital healthcare platform to deliver healthcare in their own environment. Our comprehensive care management service has achieved major milestones in the past year, resulting in Sciometrix becoming a top 25 digital healthcare companies in the USA. With the addition of Tevogen.AI’s capabilities, we aim to jump into the top 10 next year.”</p> <p>Dr. Ryan Saadi, Founder and Chief Executive Officer of Tevogen, stated, “Our objective is to build a fully integrated healthcare ecosystem designed to support patients across all socioeconomic backgrounds. This proposed transaction, if completed, could further advance that vision.”</p> <p>The proposed transaction remains subject to, among other things, completion of due diligence, negotiation and execution of definitive documentation, required approvals, and satisfaction with customary closing conditions.</p> <p>Tevogen is also actively considering other transactions, with a focus on life sciences-related businesses, but there can be no assurance any such transaction will be consummated.</p> <p><strong>About Tevogen</strong></p> <p>Tevogen is a socially integrated healthcare enterprise built on the principles of affordability, efficiency, and scientific rigor. The company leverages artificial intelligence and precision T cell therapy platforms, a patient-first and cost-disciplined operating model, and engagements with global technology leaders to support the development of advanced, life-saving therapies across multiple therapeutic areas and scalable solutions for the broader healthcare system.</p> <p>Tevogen Bio, the company’s lead initiative, has completed a proof-of-concept clinical trial demonstrating the potential of its single-HLA-restricted, genetically unmodified allogeneic T cells. Tevogen Bio’s pipeline spans virology, oncology, and neurology, with programs built on the company’s proprietary ExacTcell™ platform.</p> <p>Tevogen.AI is designed to transform drug development by accelerating target detection, helping reduce failure rates, and supporting optimized clinical trial design through proprietary predictive technologies. The platform utilizes cloud and data services from leading technology providers, including Microsoft and Databricks, to advance its long-term ambition to predict the proteome for any given protein–HLA combination, enabling rapid and cost-efficient therapeutic discovery.</p> <p>Tevogen is exploring future strategic initiatives that may include domestic generics, biosimilars, medical devices, and innovative insurance solutions for healthcare providers. Together, these programs reflect Tevogen’s mission to advance sustainable innovation and broaden patient access through a faster, more efficient, and more equitable healthcare model.</p> <p><strong>About Sciometrix Inc.</strong></p> <p>Sciometrix Inc. is a healthcare technology company providing enterprise care management, digital patient engagement, predictive analytics, and value-based care solutions to healthcare organizations nationwide.</p> <p><strong>Forward Looking Statements</strong></p> <p>This press release contains certain forward-looking statements, including without limitation statements relating to: the potential transaction with Sciometrix and the potential benefits of the transaction; Tevogen’s plans for its research and manufacturing capabilities; expectations regarding future growth; expectations regarding the healthcare and biopharmaceutical industries; and Tevogen’s development of, the potential benefits of, and patient access to its product candidates for the treatment of infectious diseases and cancer. Forward-looking statements can sometimes be identified by words such as “may,” “could,” “would,” “expect,” “anticipate,” “possible,” “potential,” “goal,” “opportunity,” “project,” “believe,” “future,” and similar words and expressions or their opposites. These statements are based on management’s expectations, assumptions, estimates, projections and beliefs as of the date of this press release and are subject to a number of factors that involve known and unknown risks, delays, uncertainties and other factors not under the company’s control that may cause actual results, performance or achievements of the company to be materially different from the results, performance or other expectations expressed or implied by these forward-looking statements.</p> <p>Factors that could cause actual results, performance, or achievements to differ from those expressed or implied by forward-looking statements include, but are not limited to: risks inherent in diligence and negotiation of the proposed transaction with Sciometrix; the risk that the transaction with Sciometrix may not be consummated on favorable terms or at all; the risk that the expected benefits of the transaction with Sciometrix may not be realized on a timely basis or at all; changes in the markets in which Tevogen competes, including with respect to its competitive landscape, technology evolution, or regulatory changes; changes in domestic and global general economic conditions; the risk that Tevogen may not be able to execute its growth strategies or may experience difficulties in managing its growth and expanding operations; the risk that Tevogen may not be able to develop and maintain effective internal controls; the failure to achieve Tevogen’s commercialization and development plans and identify and realize additional opportunities, which may be affected by, among other things, competition, the ability of Tevogen to grow and manage growth economically and hire and retain key employees; the risk that Tevogen may fail to keep pace with rapid technological developments to provide new and innovative products and services or make substantial investments in unsuccessful new products and services; that Tevogen will need to raise additional capital to fully realize its business plans; risks related to the ability to develop, license or acquire new therapeutics; the risk of regulatory lawsuits or proceedings relating to Tevogen’s business; uncertainties inherent in the execution, cost, and completion of preclinical studies and clinical trials; risks related to regulatory review, approval and commercial development; risks associated with intellectual property protection; Tevogen’s limited operating history; and those factors discussed or incorporated by reference in Tevogen’s most recent Annual Report on Form 10-K and subsequent filings with the SEC.</p> <p>You should not place undue reliance on forward-looking statements, which speak only as of the date they are made. Tevogen undertakes no obligation to update any forward-looking statements, except as required by applicable law.</p> <p><strong>Contacts</strong></p> <p>Tevogen Bio Communications<br/>T: 1 877 TEVOGEN, Ext 701 <br/><a href=\"https://www.globenewswire.com/Tracker?data=O9gmdxIzENjO6vUWWLPaFSSplzgolM_mc4vF-PsJwOFvJqgJQKMBD3NsUwDkRE0OaplQqrQffpwPT_-KBJRhhmYF4qLHcAEvTsv8Ut9_hPog4hty98ypA8v2jfB4Aejd\" rel=\"nofollow noopener\" target=\"_blank\">Communications@Tevogen.com</a></p> <p>A photo accompanying this announcement is available at <a href=\"https://www.globenewswire.com/Tracker?data=Cg6jXcDtnaCbb2AckUQzeTcE54bIffVXYSbBmZcsupdiFI8qbJCdrKJeqFg8999cwqB3bTYKUDJlax4VTFbgmj1lpV7-g97TVGO5hPi9PNeeJySaY4AoACRkiD_owI8c3pPYW--C30i60WxnGONGx9lNnOJZYY_Qo7XKqJ92DixzAPJ2wEYJLJu4eVAVMTSq5Go3Rg4FrAPKZNcyAqJ_qhEfQPyxK798HYWfs1yeAzpDqt5kD-MSbbtN1YPSgvfmSzB8jEnEZfF1Y7e_GNvTWg==\" rel=\"nofollow noopener\" target=\"_blank\">https://www.globenewswire.com/NewsRoom/AttachmentNg/a3aa282a-602f-458e-adf0-51fe77c799a7</a></p> <p> </p> <img alt=\"\" class=\"__GNW8366DE3E__IMG\" loading=\"lazy\" src=\"https://www.globenewswire.com/newsroom/ti?nf=OTY2MjA5NiM3NDU3MTY3IzIyODk5MTc=\"/> <br/><img alt=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\" src=\"https://ml.globenewswire.com/media/NjdjN2FhZGMtZDdjZi00NWU5LTg0ZWMtZDMwY2FkZmU1OGI5LTEzMDE0NjctMjAyNi0wMi0yNi1lbg==/tiny/Tevogen-Bio-Inc.png\"/></article>",
            "link": "https://www.stocktitan.net/news/TVGN/tevogen-signs-letter-of-intent-to-evaluate-potential-acquisition-of-af1y67b4vfcs.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 14:20:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Exxe Group Reports December 31, 2025 Results; Highlights Balance Sheet Improvements and Strategic Platform Expansion | AXXA Stock News",
            "description": "<article class=\"article\"><ul><li><p><i><strong>Revenue for the Quarter grew <percent>26.5%</percent> to <money>$18.96 million</money></strong></i></p></li><li><p><i><strong>Revenue for first Three Quarters grew <percent>11.9%</percent> to <money>$52.88 million</money></strong></i></p></li><li><p><i><strong>Minority interest decreased by <money>$15.81 million</money> affecting platform-based economic participation</strong></i></p></li><li><p><i><strong>Total debt decreased from approx. <money>$25.0 million</money> to <money>$20.8 million</money>, a reduction of roughly <percent>17%</percent>.</strong></i></p></li></ul><p><strong id=\"dateline\">SHERIDAN, WY / <a href=\"https://www.accessnewswire.com/\" rel=\"nofollow noopener\">ACCESS Newswire</a> / February 26, 2026 / </strong>Exxe Group, Inc. (OTC PINK:AXXA), (\"Exxe\" or the \"Company\"), a next-generation business accelerator and digital transformation platform, reports financial results for the Quarter and nine-month period ended December 31, 2025.</p><p><strong>Financial Performance</strong></p><p>Exxe delivered continued top-line growth and strong gross profitability. For the Quarter revenue was <money>$18.96 million</money> vs. <money>$14.99 million</money>, an increase of <percent>26.5%</percent> year-on-year. Gross profit was <money>$15.41 million</money> vs. <money>$7.58 million</money>, an increase of +<percent>103%</percent> year-on-year.</p><p>For the first three Quarters revenues were <money>$52.88 million</money> vs. <money>$47.28 million</money>, an increase of +<percent>11.9%</percent> from the same reporting period. Gross profit was <money>$30.85 million</money> vs. <money>$23.34 million</money>, an increase of +<percent>32%</percent>.</p><p><strong>Balance Sheet Improvements</strong></p><p>During the Quarter, Exxe continued executing a multi-quarter balance sheet cleanup initiative focused on simplifying legacy structures and aligning financial reporting with its platform-based operating model.</p><p><i>Minority Interest Reduction</i></p><p>The Company reduced non-controlling interests associated with certain legacy consolidated structures, reflecting the transition from subsidiary ownership to platform-based economic participation.</p><p>Minority interest decreased by <money>$15.81 million</money> from <money>$37.21 million</money> as at March 31, 2025 to <money>$21.39 million</money> as at December 31, 2025.</p><p><i>Goodwill and Legacy Intangible Optimization</i></p><p>Exxe continued reducing and reclassifying legacy acquisition-related balances through amortization and restructuring actions, simplifying historical deal accounting and aligning reported assets with the Company's service-driven operating model.</p><p>This cleanup reduces balance sheet distortion and improves comparability for future reporting periods.</p><p><strong>Debt Stabilization &amp; Reduction</strong></p><p>The Company also advanced capital structure optimization initiatives during the reporting period. Through renegotiations, settlements, and conversions of certain obligations into longer-term instruments, Exxe improved debt maturity profiles and reduced near-term pressure.</p><p>Short-term debt decreased from approximately <money>$6.5 million</money> to <money>$4.5 million</money>, representing a reduction of roughly <percent>31%</percent>, while long-term debt declined from approximately <money>$18.5 million</money> to <money>$16.3 million</money>, a reduction of about <percent>12%</percent>. In aggregate, total debt decreased from approximately <money>$25.0 million</money> to <money>$20.8 million</money>, reflecting an overall reduction of roughly <percent>17%</percent>.</p><p>Management believes these actions demonstrate continued deleveraging efforts and support improved financial flexibility as refinancing initiatives progress.</p><p><strong>Audit Readiness and Financial Reporting</strong></p><p>Exxe focused efforts on ongoing balance sheet simplification, restructuring of legacy positions, and implementation of the platform accounting framework intended to support audit preparedness and improve financial transparency.</p><p><strong>Infrastructure &amp; Private Network Platform Expansion</strong></p><p>As part of its broader platform evolution, Exxe continued developing capabilities in private digital infrastructure and network-based solutions designed to support partner ecosystems. Building on previously announced initiatives, the Company is advancing the deployment of private connectivity and infrastructure nodes that integrate telecom, data, and AI-enabled operational tools across selected real estate and enterprise environments.</p><p>Management believes these capabilities may contribute to recurring service revenues, enhance asset-level efficiency, and create additional monetization opportunities aligned with the Company's technology-enabled platform strategy.</p><p><strong>Real Estate Refinancing Outlook</strong></p><p>Exxe remains focused on executing refinancing initiatives across its core real estate pipeline, with initial transactions expected to progress during the Spring 2026 period. These refinancing events are anticipated to unlock liquidity at the asset level, strengthen partner balance sheets, and generate incremental economic participation for the Company through its platform agreements.</p><p>Management views these refinancing milestones as an important catalyst supporting both growth and continued balance sheet transformation.</p><p><strong>Management Commentary</strong></p><p>Dr. Eduard Nazmiev, Exxe Group CEO, stated:</p><p>\"The December period reflects continued progress in strengthening our operating performance while simplifying our financial structure. We remain focused on executing our platform strategy, advancing refinancing initiatives, expanding infrastructure capabilities, and preparing the Company for future reporting milestones.\"</p><p><strong>About Exxe Group:</strong></p><p>Exxe Group Inc. (\"Exxe\" or the \"Company\") is a Wyoming corporation. The Company operates as a technology-enabled management and consulting platform that provides business restructuring, operational scaling, and liquidity-unlocking services to partner companies. Core competencies and capabilities include fintech-based financial management, marketing through media and design, management consulting, strategic advisory, and AI-based systems. Exxe operates in a broad scope of segments. These include fintech, real estate, agritech, software, AI, medical products, media and design, automotive products, and automotive repair. Revenue and profit are generated via license, software, and service contracts related to its platform and core competencies.</p><p>For additional information please visit the Company's:</p><p>Website: <a href=\"https://pr.report/j3ck\" rel=\"nofollow noopener\">http://www.exxegroup.com/</a></p><p>X.com: <a href=\"https://pr.report/j3cl\" rel=\"nofollow noopener\">https://x.com/exxegroup</a></p><p><i>Forward-Looking Statements:</i></p><p>This press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. In some cases, you can identify forward-looking statements by the following words: \"anticipate,\" \"believe,\" \"continue,\" \"could,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\" \"ongoing,\" \"plan,\" \"potential,\" \"predict,\" \"project,\" \"should,\" \"will,\" \"would,\" or the negative of these terms or other comparable terminology, although not all forward-looking statements contain these words. Forward-looking statements are not a guarantee of future performance or results and will not necessarily be accurate indications of the times at, or by, which such performance or results will be achieved. Forward-looking statements are based on information available at the time the statements are made and involve known and unknown risks, uncertainties and other factors that may cause our results, levels of activity, performance or achievements to be materially different from the information expressed or implied by the forward-looking statements in this press release.</p><p>Exxe Group IR: <a href=\"mailto:info@exxegroup.com\" rel=\"nofollow noopener\">info@exxegroup.com</a></p><p><a href=\"https://app.accessnewswire.com/imagelibrary/bcc96836-18e9-46b4-88ca-cca674d0ab97/image.jpeg\" rel=\"nofollow noopener\"><img loading=\"lazy\" src=\"https://app.accessnewswire.com/imagelibrary/bcc96836-18e9-46b4-88ca-cca674d0ab97/1141883/image.jpeg\"/></a></p><p><strong>SOURCE: </strong>Exxe Group, Inc.</p><br/><br/>View the original <a href=\"https://www.accessnewswire.com/newsroom/en/computers-technology-and-internet/exxe-group-reports-december-31-2025-results-highlights-balance-sh-1141883\" rel=\"nofollow noopener\">press release</a> on ACCESS Newswire<br/><br/><img height=\"0\" loading=\"lazy\" src=\"https://app.accessnewswire.com/img.ashx?id=1141883\" width=\"0\"/></article>",
            "link": "https://www.stocktitan.net/news/AXXA/exxe-group-reports-december-31-2025-results-highlights-balance-sheet-4r5mpj4mkac7.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 14:20:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Edwards Lifesciences Advances Structural Heart Care Through Innovation and Purpose | EW Stock News",
            "description": "<article class=\"article\"><p> <location idsrc=\"xmltag.org\" value=\"LU/us.ca.irvine\">IRVINE, Calif.</location>--(BUSINESS WIRE)--At the close of Heart Month, Edwards Lifesciences (NYSE: <a class=\"symbol-link\" href=\"/overview/EW/\" title=\"View EW stock overview\">EW</a>) underscored its leadership in structural heart innovation, advancing care through deep expertise and strong partnerships so people with structural heart disease can live longer, healthier lives. As part of this commitment, Edwards announced the impact and renewed vision for Every Heartbeat Matters, its signature global health initiative, to help 2 million more patients facing barriers worldwide access lifesaving structural heart treatment by the end of 2030.</p><p>“For nearly 70 years, Edwards has led with a strong focus on improving the lives of patients with structural heart disease,” said Bernard Zovighian, Edwards’ CEO. “It starts with breakthrough innovation, layered with world class clinical expertise, sustained commitment and strong partnerships across the global healthcare ecosystem. Every advancement we make impacts a patient, a family and a community. Our purpose is to advance science and expand access so more people can benefit.”</p><p>This commitment extends through the Edwards Lifesciences Foundation and Every Heartbeat Matters, which increases access to diagnosis and treatment for underserved structural heart patients, particularly those in low- and middle-income countries and regions where care is limited and barriers may be substantial. Since 2014, Every Heartbeat Matters and its charitable partners have impacted more than 4 million underserved structural heart patients globally.</p><p>“Improving the lives of patients with structural heart disease is core to who we are,” Zovighian said. “Through Every Heartbeat Matters and our global partners, we are breaking down financial, systemic and geographic barriers so that underserved patients can get access to care that can change the trajectory of their lives. We innovate with purpose, we are powered by science and we remain centered on patients.”</p><p>More information on the Edwards Lifesciences Foundation and Every Heartbeat Matters is available at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.edwards.com%2Fcorporategiving&amp;esheet=54433881&amp;newsitemid=20260226865431&amp;lan=en-US&amp;anchor=www.edwards.com%2Fcorporategiving&amp;index=1&amp;md5=0a612a0612658af10cf65bd181d2048e\" rel=\"nofollow noopener\" shape=\"rect\">www.edwards.com/corporategiving</a> or <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.everyheartbeatmatters.org&amp;esheet=54433881&amp;newsitemid=20260226865431&amp;lan=en-US&amp;anchor=www.everyheartbeatmatters.org&amp;index=2&amp;md5=07c2626f17a957e6a6a6e04c5549136f\" rel=\"nofollow noopener\" shape=\"rect\">www.everyheartbeatmatters.org</a>.</p><p><b>About Edwards Lifesciences<br/></b>Edwards Lifesciences is the leading global structural heart innovation company, driven by a passion to improve patient lives. Through breakthrough technologies, world-class evidence and partnerships with clinicians and healthcare stakeholders, our employees are inspired by our patient-focused culture to deliver life-changing innovations to those who need them most. Discover more at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.edwards.com&amp;esheet=54433881&amp;newsitemid=20260226865431&amp;lan=en-US&amp;anchor=www.edwards.com&amp;index=3&amp;md5=e9c1e965899fc5c392a2b70861a3453f\" rel=\"nofollow noopener\" shape=\"rect\">www.edwards.com</a> and follow us on LinkedIn, Facebook, Instagram and YouTube.</p><p>This news release includes forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, and Section 21E of the Securities Exchange Act of 1934. These forward-looking statements can sometimes be identified by the use of words such as “may,” “will,” “should,” “anticipate,” “believe,” “plan,” “project,” “estimate,” “forecast,” “potential,” “predict,” \"early clinician feedback,\" “expect,” “intend,” “guidance,” “outlook,” “optimistic,” “aspire,” “confident” or other forms of these words or similar expressions and include, but are not limited to, statements made by Mr. Zovighian, impact of Edwards’ therapies and innovation, including improving lives; access to care for underserved patients, changing the trajectory of their lives; and breaking down of barriers. No inferences or assumptions should be made from statements of past performance, efforts, or results which may not be indicative of future performance or results. Forward-looking statements are based on estimates and assumptions made by management of the company and are believed to be reasonable, though they are inherently uncertain, difficult to predict, and may be outside of the company’s control. The company's forward-looking statements speak only as of the date on which they are made and the company does not undertake any obligation to update any forward-looking statement to reflect events or circumstances after the date of the statement. If the company does update or correct one or more of these statements, investors and others should not conclude that the company will make additional updates or corrections.</p><p>Forward-looking statements involve risks and uncertainties that could cause actual results or experience to differ materially from that expressed or implied by the forward-looking statements. Factors that could cause actual results or experience to differ materially from that expressed or implied by the forward-looking statements include risk and uncertainties associated with the risks detailed in the company's filings with the Securities and Exchange Commission (SEC), including its Annual Report on Form 10-K for the year ended December 31, 2025 and its other filings with the SEC. These filings, along with important safety information about our products, may be found at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fedwards.com&amp;esheet=54433881&amp;newsitemid=20260226865431&amp;lan=en-US&amp;anchor=edwards.com&amp;index=4&amp;md5=4b8e9acafcb6e1893fc632d58c684e2b\" rel=\"nofollow noopener\" shape=\"rect\">edwards.com</a>.</p><p><img alt=\"\" loading=\"lazy\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226865431r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\"/><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20260226865431/en/\" rel=\"nofollow noopener\">https://www.businesswire.com/news/home/20260226865431/en/</a></span></p><p><b>Media Contact:</b> Amy Meshulam<b>,</b> <a href=\"mailto:media@edwards.com\" rel=\"nofollow noopener\" shape=\"rect\">media@edwards.com</a><br/><b>Investor Contact:</b> <a href=\"mailto:Investor_Relations@edwards.com\" rel=\"nofollow noopener\" shape=\"rect\">Investor_Relations@edwards.com</a></p><p>Source: Edwards Lifesciences Corporation</p></article>",
            "link": "https://www.stocktitan.net/news/EW/edwards-lifesciences-advances-structural-heart-care-through-a045h4g73si0.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 14:15:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BeautyHealth to Report Fourth Quarter and Full Year 2025 Financial Results on March 12, 2026 | SKIN Stock News",
            "description": "<article class=\"article\"><p align=\"justify\">LONG BEACH, Calif., Feb.  26, 2026  (GLOBE NEWSWIRE) -- The Beauty Health Company (NASDAQ:<a class=\"symbol-link\" href=\"/overview/SKIN/\" title=\"View SKIN stock overview\">SKIN</a>), home to flagship brand Hydrafacial™, today announced it will report fourth quarter and full year 2025 financial results after market close on Thursday, March 12, 2026. The Company will host an investor conference call at 4:30 p.m. Eastern Time, following a press release detailing the results.</p> <p align=\"justify\">A live webcast of the call can be accessed on the Company’s investor relations website at <a href=\"https://www.globenewswire.com/Tracker?data=7Ilbkv6ixqKR6bhE60BWJsh7rVf7kYmuOtJwoNzWfEL25ybsuHaxNbagT1xqjIEvZjwmylHKV5nvYr__H8sIG-wGsq9b1_Ptcq0Xm9XJ1ItLECbAWDPtkL8dQ4WbNJQ8\" rel=\"nofollow noopener\" target=\"_blank\">https://investors.beautyhealth.com</a>, along with supporting materials. A recording of the call will become available on the site approximately three hours after its conclusion.</p> <p align=\"justify\"><strong>Disclosure Information</strong><br/>The Beauty Health Company announces material information to the public through a variety of means, including filings with the Securities and Exchange Commission, press releases, public conference calls and on its investor relations website (<a href=\"https://www.globenewswire.com/Tracker?data=7Ilbkv6ixqKR6bhE60BWJsh7rVf7kYmuOtJwoNzWfEI7jr_kfG0PW7Icy19WNWKh6oLzZvgkRE24oiaA3sgxHr1GybbLnkKircivBttOhGiogg7cOyC1L5ybLbJkkyQd\" rel=\"nofollow noopener\" target=\"_blank\">https://investors.beautyhealth.com</a>) as means of disclosing material non-public information and for complying with its disclosure obligations under Regulation FD.</p> <p align=\"justify\"><strong>About Us<br/></strong>The Beauty Health Company (NASDAQ: <a class=\"symbol-link\" href=\"/overview/SKIN/\" title=\"View SKIN stock overview\">SKIN</a>) is a global medical aesthetics company delivering an integrated ecosystem of clinically proven solutions designed to help consumers achieve superior skin health and support the success of providers. Anchored by Hydrafacial™, a leading and widely requested professional skincare treatment, and supported by complementary offerings including SkinStylus™ microneedling and HydraScalp powered by Keravive™, BeautyHealth combines advanced device technology, proprietary consumables, and clinical validation to deliver trusted treatment experiences through an omnichannel network of providers worldwide. Learn more at beautyhealth.com or follow us on LinkedIn. Local providers can be found at <a href=\"https://www.globenewswire.com/Tracker?data=nzGpohFVZtKaptw9dtI1l8ixgEW7JiOwPXf9owXn87GXD4VPGAc-ASJzmJnexGytBTCUQxSuE7C_6arOtk6DPC3aGECZHevirLwgs64Pk4A6BmSKzBRcfaxyDUiMpsNi-rYHYOFrimr-3yMc-WYr00iSjxsQz7ME54mc8Ax3fhg=\" rel=\"nofollow noopener\" target=\"_blank\">hydrafacial.com/find-a-hydrafacialist</a>.</p> <p><strong>Investors: </strong><a href=\"https://www.globenewswire.com/Tracker?data=DxJnXPcz9M9NUQSubf6yOSTTtwF527zcYSTJ12oLcp4h9yTnUfMtgNTj-lZO5QTnWgqFiogaLWVE_bCOWtRoAg5tMbu0qLfekezOLpKjN2c=\" rel=\"nofollow noopener\" target=\"_blank\">IR@beautyhealth.com</a><br/><strong>Press: </strong><a href=\"https://www.globenewswire.com/Tracker?data=-lFnV9ajV4-lu3zUqNWzhFY2NPYa0QVlI7lZRO2k_aEbrpKxOkNe_5eWnlrZcPRRNKn8qOKorkKbISeOUpuzWR3UMsS-c93IawlXy4EQa8g=\" rel=\"nofollow noopener\" target=\"_blank\">press@beautyhealth.com</a></p> <img alt=\"\" class=\"__GNW8366DE3E__IMG\" loading=\"lazy\" src=\"https://www.globenewswire.com/newsroom/ti?nf=OTY2MTE2MiM3NDU0NTMyIzIyMDc1NzY=\"/> <br/><img alt=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\" src=\"https://ml.globenewswire.com/media/NmIzN2MzZmItMDU5Zi00YzkxLWIxY2UtZjg4ZjhjNDNkZWY0LTEyMTkxMjktMjAyNi0wMi0yNi1lbg==/tiny/Hydrafacial-LLC.png\"/></article>",
            "link": "https://www.stocktitan.net/news/SKIN/beauty-health-to-report-fourth-quarter-and-full-year-2025-financial-bxpwx1a09ugo.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 15:00:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        }
    ]
}