{
    "data": [
        {
            "title": "IMPACT Silver Corp: Invitation to PDAC 2026 Booth 2505 | ISVLF Stock News",
            "description": "<article class=\"article\"><p>Vancouver, British Columbia--(Newsfile Corp. - February 27, 2026) - Visit <b>IMPACT Silver Corp</b> (TSXV: IPT) (OTCQB: <a class=\"symbol-link\" href=\"/overview/ISVLF/\" title=\"View ISVLF stock overview\">ISVLF</a>) at Booth #2505 at the Prospectors &amp; Developers Association of Canada’s (PDAC) Convention at the Metro Toronto Convention Centre (MTCC) from Sunday, March 1 to Wednesday, March 4, 2026.</p> <p><b>About IMPACT Silver Corp</b></p><p>ABOUT IMPACT SILVER IMPACT Silver Corp. (TSXV: IPT) is a successful producer-explorer with two mining projects in Mexico. 1/ Royal Mines of Zacualpan Silver-Gold District: IMPACT owns <percent>100%</percent> of the 211 km2 Zacualpan project in central Mexico where four producing underground silver mines and one open pit mine feed the central 500 tpd Guadalupe processing plant. 2/ To the south, the Capire Project includes a 200 tpd processing pilot plant adjacent to an open pit silver mine with an NI 43-101 inferred mineral resource of over 4.5 million ounces silver, 48 million lbs zinc and 21 million lbs lead in 1,786,000 tonnes grading 79g/t Ag, <percent>1.22%</percent> Zn and <percent>0.54%</percent> Pb (see IMPACT news release dated January 18, 2016, for details and QP statement). Company engineers are reviewing Capire for a potential restart of operations to leverage improving commodity prices. Over the past 19 years, IMPACT has developed multiple exploration zones into commercial production and has produced over 13.7 million ounces of silver, generating revenue of more than <money>$307 million</money>, with no long-term debt. 3/ Plomosas Zinc-Lead-Silver District: Plomosas is a high-grade zinc producer in northern Mexico with exploration upside potential. The Company recently restarted mining operations and is ramping up production. Exploration potential at Plomosas is along the 6 km long structure. This is in addition to other exploration targets on the 3,019-hectare property including untested copper-gold targets with indications of high-grade material at surface. Regionally, Plomosas lies in the same mineral belt as some of the largest carbonate replacement deposits in the world. George Gorzynski, PEng, a director of the Company, is a Qualified Person within the meaning of NI 43-101 and has approved the technical information contained in this news release.</p> <p><b>About PDAC</b></p> <p>The World’s Premier Mineral Exploration &amp; Mining Convention is the leading convention for people, governments, companies and organizations connected to mineral exploration. In addition to meeting more than 1,100 exhibitors, 2,500 investors and 26,000 attendees in person in 2024, participants could also attend programming, courses and networking events.</p> <p>The annual convention is held in Toronto, Canada. It has grown in size, stature and influence since it began in 1932 and today is the event of choice for the world’s mineral industry.</p> <p>For more information and/or to register for the conference please visit: <a href=\"https://api.newsfilecorp.com/redirect/0p3ADHkPLK\" rel=\"nofollow noopener\">https://www.pdac.ca/convention</a>.</p> <p>We look forward to seeing you there.</p> <p>For further information:</p> <div id=\"contactInfo\"><p><i>IMPACT Silver Corp</i><br/><i>Jerry Huang</i><br/><i>7788677909</i><br/><i><a href=\"mailto:jerry@impactsilver.com\" rel=\"nofollow noopener\">jerry@impactsilver.com</a></i><br/><i><a href=\"https://api.newsfilecorp.com/redirect/RYpNZiO1N5\" rel=\"nofollow noopener\">www.impactsilver.com</a></i></p></div><p><img alt=\"\" loading=\"lazy\" src=\"https://api.newsfilecorp.com/newsinfo/285771/375\"/></p></article>",
            "link": "https://www.stocktitan.net/news/ISVLF/impact-silver-corp-invitation-to-pdac-2026-booth-salr23jvnbs2.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 23:30:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Algo Grande Copper Closes Oversubscribed $6.52 Million Financing and Strengthens Board at AGM | KNDYF Stock News",
            "description": "<article class=\"article\"><p><i><strong>THIS NEWS RELEASE IS NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES FOR DISSEMINATION IN THE UNITED STATES</strong></i></p><p><strong id=\"dateline\">VANCOUVER, BC / <a href=\"https://www.accessnewswire.com/\" rel=\"nofollow noopener\">ACCESS Newswire</a> / February 27, 2026 / </strong>Algo Grande Copper Corp. (\"Algo Grande\") (TSXV:ALGR)(OTC:<a class=\"symbol-link\" href=\"/overview/KNDYF/\" title=\"View KNDYF stock overview\">KNDYF</a>)(FRA:KM00) announces the closing of its previously announced non-brokered private placement and the election of three new directors at its Annual General Meeting held on February 25, 2026.</p><p>Pursuant to its news releases dated February 11, 2026 and February 19, 2026, the Company has closed its previously announced non-brokered private placement (the \"Offering\") of common shares in the capital of the Company (the \"Shares\"), at a deemed price of <money>$0.65</money> per Share. The Offering consisted of 10,037,020 Shares for aggregate gross proceeds of <money>$6,524,063.</money></p><p>The Offering will fund the next phase of exploration at the Company's <percent>100%</percent>-owned Adelita Project in Sonora, Mexico, focused on a Phase II drill program. Phase I drilling at the Cerro Grande skarn intersected multiple stacked Cu-Au-Ag skarn horizons at depth, including skarn zones that had not been identified by historic drilling. The upcoming program will target expansion drilling at Cerro Grande and first-pass drilling along an approximately 6-kilometre prospective limestone corridor hosting multiple, undrilled, outcropping skarn targets. Proceeds from the Offering will also be used for additional operating costs and general working capital requirements.</p><p>Commenting on the opportunity at Adelita, newly elected Director Raymond Jannas stated: \"The Adelita Project exhibits many of the characteristics we look for in emerging district-scale systems, high-grade skarn mineralization with clear geological vectors toward a deeper potential porphyry source. What excites me most is the combination of compelling geology and a focused, determined team that is executing with discipline. With capital in place and a clear exploration roadmap, Algo Grande is well positioned to unlock the broader potential of this system.\"</p><p>In connection with the closing of the Offering, the Company paid certain eligible finders (each, a \"Finder\") aggregate cash commissions of <money>$169,605.44</money>, being equal to <percent>7%</percent> of the aggregate gross proceeds raised from those purchasers introduced by such Finder, and issued 355,863 common share purchase warrants (each, a \"Finder Warrant\") being equal to <percent>7%</percent> of the number of Shares purchased by those purchasers introduced by such Finder. Each Finder Warrant entitles the holder thereof to acquire a Share (each, a \"Finder's Warrant Share\") at an exercise price of <money>$0.65</money> per Finder's Warrant Share until the date that is three years after issuance.</p><p>Additionally, Canaccord Genuity Corp. (\"Canaccord\") acted as financial advisor to the Company in connection with the Offering. The Company paid Canaccord a corporate finance fee of <money>$50,000</money> (the \"Corporate Finance Fee\"). The Corporate Finance Fee was settled through the issuance of 76,923 Shares at a deemed price of <money>$0.65</money> per Share.</p><p>Securities issued in the Offering are subject to a four-month hold period in accordance with applicable securities laws, which will expire four months and one day from the date of closing of the Offering. The Offering is subject to certain conditions including, but not limited to, receipt of all necessary approvals, including approval of the TSX Venture Exchange.</p><p>The Company also announces that at its Annual General Meeting held on February 25, 2026, shareholders approved all matters brought before the meeting, including the election of three new directors:</p><ul style=\"list-style-type:disc;\"><li><p>Raymond Jannas</p></li><li><p>Hunter Scharfe</p></li><li><p>Enrico Gay</p></li></ul><p>The appointments follow the Company's previously announced board strengthening initiatives (see news release dated February 11, 2026).</p><p>Certain directors of the Company (the \"Insiders\") subscribed for an aggregate of 77,155 Shares for aggregate gross proceeds of <money>$50,150.75</money> in the Offering. The Insiders' participation constitutes a \"related party transaction\" within the meaning of Multilateral Instrument 61-101 - <i>Protection of Minority Security Holders in Special Transactions</i> (\"MI 61-101\"). The Company is relying on the exemption from the valuation requirements and minority shareholder approvals in MI 61-101 pursuant to subsections 5.5(a) and 5.7(1)(a) of MI 61-101, respectively, as the value of the Insiders' participation in the Offering does not represent more than <percent>25%</percent> of the Company's market capitalization, as determined in accordance with MI 61-101.</p><p>This news release does not constitute an offer to sell or a solicitation of an offer to buy any of the securities in the United States. The securities have not been and will not be registered under the United States Securities Act of 1933, as amended (the \"U.S. Securities Act\"), or any state securities laws, and may not be offered or sold within the United States or to U.S. persons unless registered under the U.S. Securities Act and applicable state securities laws or an exemption from such registration is available.</p><p><strong>About Algo Grande Copper Corp.</strong><br/>Algo Grande Copper Corp. is a growth-focused mineral exploration company advancing the Adelita Project, a district-scale, multi-system copper-gold-silver opportunity positioned in the prolific Arizona-Sonora copper belt.</p><p>The company is dedicated to unlocking the full potential of this under-explored corridor through disciplined data-driven exploration, technical excellence, and a firm commitment to value creation for shareholders. The 5,895-hectare Adelita Project is anchored by the high-grade Cerro Grande Cu-Au-Ag skarn discovery, which exhibits strong continuity along a defined corridor extending over 6 kilometers. Reprocessing of legacy geophysical data and field mapping indicate the presence of a potential porphyry system at depth, suggesting a classic skarn-porphyry mineralization model similar to major deposits found throughout northwestern Mexico.</p><p>ON BEHALF OF ALGO GRANDE COPPER CORP.</p><p>Enrico Gay<br/>Chief Executive Officer</p><p>For more information, please contact:</p><p>E-mail: <a href=\"mailto:info@algo-grande.com\" rel=\"nofollow noopener\">info@algo-grande.com</a></p><p>Website: <a href=\"https://pr.report/j58y\" rel=\"nofollow noopener\">www.algo-grande.com</a></p><p><strong>Cautionary Statement on Forward-Looking Information</strong></p><p><i>NEITHER THE TSX VENTURE EXCHANGE NOR ITS REGULATION SERVICES PROVIDER (AS THAT TERM IS DEFINED IN THE POLICIES OF THE TSX VENTURE EXCHANGE) ACCEPTS RESPONSIBILITY FOR THE ADEQUACY OR ACCURACY OF THIS RELEASE.</i></p><p><i>This news release contains statements and information that, to the extent that they are not historical fact, constitute \"forward-looking information\" within the meaning of applicable securities legislation. Forward-looking information is based on the reasonable assumptions, estimates, analysis and opinions of management made in light of its experience and its perception of trends, current conditions and expected developments, as well as other factors that management believes to be relevant and reasonable in the circumstances at the date that such statements are made, but which may prove to be incorrect. Forward-looking information involves known and unknown risks, uncertainties and other factors that may cause the actual results, performance or achievements of the Algo Grande to differ materially from any future results, performance or achievements expressed or implied by the forward-looking information, including, but not limited to, regulatory approvals for the Offering and the anticipated use of proceeds therefrom, and those listed in filings made by Algo Grande with the Canadian securities regulatory authorities (which may be viewed at </i><a href=\"https://pr.report/j58z\" rel=\"nofollow noopener\"><i>www.sedarplus.ca</i></a><i>). Accordingly, readers should not place undue reliance on any such forward-looking information. Further, any forward-looking statement speaks only as of the date on which such statement is made. New factors emerge from time to time, and it is not possible for Algo Grande's management to predict all of such factors and to assess in advance the impact of each such factor on Algo Grande's business or the extent to which any factor, or combination of factors, may cause actual results to differ materially from those contained in any forward- looking statements. Algo Grande does not undertake any obligation to update any forward-looking information to reflect information, events, results, circumstances or otherwise after the date hereof or to reflect the occurrence of unanticipated events, except as required by law including securities laws.</i></p><p><strong>SOURCE: </strong>Algo Grande Copper Corp.</p><br/><br/>View the original <a href=\"https://www.accessnewswire.com/newsroom/en/business-and-professional-services/algo-grande-copper-closes-oversubscribed-6.52-million-financing-1142397\" rel=\"nofollow noopener\">press release</a> on ACCESS Newswire<br/><br/><img height=\"0\" loading=\"lazy\" src=\"https://app.accessnewswire.com/img.ashx?id=1142397\" width=\"0\"/></article>",
            "link": "https://www.stocktitan.net/news/KNDYF/algo-grande-copper-closes-oversubscribed-6-52-million-financing-and-rlle2a8b9fsk.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 23:10:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Globant Files Annual Report for 2025 | GLOB Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LC/lu\">LUXEMBOURG</location></span>, <span class=\"legendSpanClass\">Feb. 27, 2026</span> /PRNewswire/ -- Globant S.A. (NYSE: <a class=\"symbol-link\" href=\"/overview/GLOB/\" title=\"View GLOB stock overview\">GLOB</a>), a digitally native technology services company (the \"Company\"), announced today that it filed its annual report on Form 20-F for the year ended December 31, 2025 (the \"2025 Annual Report\") with the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> Securities and Exchange Commission (\"SEC\"). The 2025 Annual Report can be accessed by visiting either the SEC's website at <a href=\"http://www.sec.gov/\" rel=\"nofollow noopener\" target=\"_blank\">www.sec.gov</a> or the Company's website at <a href=\"http://investors.globant.com/\" rel=\"nofollow noopener\" target=\"_blank\">http://investors.globant.com</a>. In addition, shareholders may receive a hard copy of the Company's complete audited financial statements free of charge, by requesting a copy from: Globant S.A., 37A Avenue J.F. Kennedy, L-1855, <location idsrc=\"xmltag.org\" value=\"LC/lu\">Luxembourg</location>.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\"><p><a href=\"https://mma.prnewswire.com/media/959011/Globant_logo_actualizado.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"Globant new logo (PRNewsfoto/Globant)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/959011/Globant_logo_actualizado.jpg\" title=\"Globant new logo (PRNewsfoto/Globant)\"/></a></p></div><p><b>About Globant </b></p><p>At Globant, we help organizations thrive in a digital and AI-powered future. Our industry-focused solutions combine technology and creativity to accelerate enterprise transformation and design experiences customers demand. Through digital reinvention, our subscription-based AI Pods, and Globant Enterprise AI platform, we turn challenges into measurable business results and promised savings into real impact.</p><p>We have more than 28,700 employees and we are present in more than 30 countries across 5 continents working for companies like Google, Electronic Arts and Santander, among others.</p><p>We were named a Worldwide Leader in CX Improvement by IDC MarketScape report. We were also featured as a business case study at Harvard, MIT and Stanford. We are a member of the Cybersecurity Tech Accord.</p><p>For more information, visit <u><a href=\"http://www.globant.com/\" rel=\"nofollow noopener\" target=\"_blank\">www.globant.com</a></u>.</p><p><b>Contact<br/></b><a href=\"mailto:pr@globant.com\" rel=\"nofollow noopener\" target=\"_blank\">pr@globant.com</a> </p><p>SOURCE Globant</p></div></article>",
            "link": "https://www.stocktitan.net/news/GLOB/globant-files-annual-report-for-mjikypd9kc3b.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 23:24:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "YY Group Announces US$20 Million At-The-Market Offering Facility | YYGH Stock News",
            "description": "<article class=\"article\"><p align=\"justify\">SINGAPORE, Feb.  27, 2026  (GLOBE NEWSWIRE) -- YY Group Holding Limited (NASDAQ: <a class=\"symbol-link\" href=\"/overview/YYGH/\" title=\"View YYGH stock overview\">YYGH</a>) (“YY Group” or the “Company”), a global leader in on-demand workforce solutions and integrated facilities management (IFM), today announced that it has entered into an At The Market Sales Agreement (the \"ATM Agreement\") with Spartan Capital Securities, LLC (\"Spartan\") and Wilson-Davis &amp; Co., Inc. (“WDCO,” and together with Spartan, the “Sales Agents”), pursuant to which the Company may offer and sell, from time to time, up to US<money>$20,000,000</money> of its Class A Ordinary Shares through the Sales Agents, acting as sales agents.</p> <p align=\"justify\">Sales of the shares, if any, will be made at market prices by methods deemed to be an “at the market offering” as defined in Rule 415 under the Securities Act, including without limitation sales made directly on The Nasdaq Capital Market, on any other existing trading market for the Class A Ordinary Shares or to or through a market maker. The Sales Agents may also sell the Class A Ordinary Shares (i) in privately negotiated transactions with the consent of the Company or (ii) in block transactions. The Company is under no obligation to sell any shares under the ATM Agreement and may suspend or terminate the offering at any time. The Company expects to use (i) up to approximately <money>$0.4 million</money> of the net proceeds from this offering to satisfy certain outstanding debt obligations and (ii) any additional net proceeds from this offering for general corporate purposes, which may include business diversification and development initiatives and capital expenditures.</p> <p align=\"justify\">The offering is being made pursuant to the Company's shelf registration statement on Form F-3 (File No. 333-286705), which was filed with the U.S. Securities and Exchange Commission (the \"SEC\") on April 23, 2025, and declared effective on April 30, 2025. A prospectus supplement describing the terms of the offering will be filed with the SEC and will be available on the SEC's website at <a href=\"https://www.globenewswire.com/Tracker?data=MxBzEu79gy5KCko5klSmp3pm6sCpb6w14G9pICTNbBO_BO_Nw1SJ19ReNf7k5JWap77vBRbESMdZB7iSXf-RjA==\" rel=\"nofollow noopener\" target=\"_blank\">www.sec.gov</a>.</p> <p align=\"justify\">Spartan Capital Securities, LLC is serving as the lead sales agent for the offering and Wilson-Davis &amp; Co., Inc. is serving as an additional sales agent for the offering.</p> <p align=\"justify\">This press release shall not constitute an offer to sell or the solicitation of an offer to buy any securities, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation, or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.</p> <p align=\"justify\"><strong>About YY Group Holding Limited</strong><br/>YY Group Holding Limited (Nasdaq: <a class=\"symbol-link\" href=\"/overview/YYGH/\" title=\"View YYGH stock overview\">YYGH</a>) is a Singapore-headquartered, technology-enabled platform providing flexible, scalable workforce solutions and integrated facility management (IFM) services across Asia and beyond. The Group operates through two core verticals: on-demand staffing and IFM, delivering agile, reliable support to industries such as hospitality, logistics, retail, and healthcare.</p> <p align=\"justify\">Leveraging proprietary digital platforms and IoT-driven systems, YY Group enables clients to meet fluctuating labor demands and maintain high-performance environments. In addition to its core operations in Singapore and Malaysia, the Group maintains a growing presence in Asia, Europe, Africa, Oceania and the Middle East.</p> <p align=\"justify\">Listed on the Nasdaq Capital Market, YY Group is committed to service excellence, operational innovation, and long-term value creation for clients and shareholders.</p> <p align=\"justify\">For more information on the Company, please visit <a href=\"https://www.globenewswire.com/Tracker?data=wkEczIjsQNdEYI-jV_BVIeXp-SKbnm6bhUfCgXqEd607Niv--nIwvoAXYIjv02t4ZsPBadR906fS3SbfCRu9MXi55mndZnx-qdjObJmV3naUMMOpbZQ_Xlh831Dwccde\" rel=\"nofollow noopener\" target=\"_blank\"><u>https://yygroupholding.com/</u></a>.</p> <p align=\"justify\"><strong>Safe Harbor Statement</strong><br/>This press release contains forward-looking statements. These statements are made under the “safe harbor” provisions of the U.S. Private Securities Litigation Reform Act of 1995. Statements that are not historical facts, including statements about the YY Group Holding Limited’s beliefs and expectations, are forward-looking statements. Forward-looking statements involve inherent risks and uncertainties, and a number of factors could cause actual results to differ materially from those contained in any forward-looking statement. These factors include, but are not limited to, (i) growth of the hospitality market in Hong Kong, (ii) capital and credit market volatility, (iii) local and global economic conditions, (iv) our anticipated growth strategies, (v) governmental approvals and regulations, and (vi) our future business development, results of operations and financial condition. In some cases, forward-looking statements can be identified by words or phrases such as “may,” “will,” “expect,” “anticipate,” “target,” “aim,” “estimate,” “intend,” “plan,” “believe,” “potential,” “continue,” “is/are likely to” or other similar expressions. All information provided in this press release is as of the date of this press release, and YY Group Holding Limited undertakes no duty to update such information, except as required under applicable law.</p> <p><strong>Investor Contact</strong><br/>Jason Phua Zhi Yong, Chief Financial Officer<br/>YY Group<br/><a href=\"https://www.globenewswire.com/Tracker?data=2UflvfBY3qmMcaZeawXalaJe4-xN2yzbkUTFOHY5nK-hJ86vnfmJhFrpOfjosGKhPcIVUL0W88Fq7zqChKo0vtYijYPomKWouZlTabJOY-8MVPY92v_j0-eUzXJUlWvD\" rel=\"nofollow noopener\" target=\"_blank\">enquiries@yygroupholding.com</a> </p> <img alt=\"\" class=\"__GNW8366DE3E__IMG\" loading=\"lazy\" src=\"https://www.globenewswire.com/newsroom/ti?nf=OTY2MzI0NCM3NDYwMzI2IzIyNjQ5Njc=\"/> <br/><img alt=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\" src=\"https://ml.globenewswire.com/media/NWI3MWU1ZDItZDY2OS00MjU3LWExM2QtZjIzZjdlOThhODdkLTEyNzY1MTctMjAyNi0wMi0yOC1lbg==/tiny/YY-Group-Holding-Limited.png\"/></article>",
            "link": "https://www.stocktitan.net/news/YYGH/yy-group-announces-us-20-million-at-the-market-offering-kuizygdhqn9y.html",
            "author": "stocktitan",
            "pub_date": "Sat, 28 Feb 2026 00:00:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Delivra Health and Its Brands LivRelief (TM) and Dream Water (TM) Report Results for Second Quarter of Fiscal 2026 | DHBUF Stock News",
            "description": "<article class=\"article\"><p style=\"text-align: center;\"><i>Year to date sales growth of Dream Water® E-commerce of <percent>26%</percent> offset by a decline of Dream Water® Retail of <percent>4%</percent> compared to same period last year</i></p><p style=\"text-align: center;\"><i>Year to date sales growth of LivRelief™ E-commerce of 28 % offset by a decline in LivRelief™ Retail of <percent>29%</percent> compared to same period last year</i></p><p>Vancouver, British Columbia--(Newsfile Corp. - February 27, 2026) - Delivra Health Brands Inc. (TSXV: DHB) (OTCQB: <a class=\"symbol-link\" href=\"/overview/DHBUF/\" title=\"View DHBUF stock overview\">DHBUF</a>) (\"<b>Delivra Health</b>\" or the \"<b>Company</b>\"), a consumer packaged goods company uniquely positioned in the health and wellness sector, is pleased to announce its financial and operating results for the three and six months ended December 31, 2025 (\"<b>Q2 2026</b>\"). The Delivra Health portfolio features innovative brands Dream Water® and LivRelief™, which deliver relief from common health issues such as sleeplessness, chronic pain and anxiety.</p><p>During the first half of fiscal 2026, the Company has seen encouraging momentum in its targeted e-commerce strategy and continued growth within the Dream Water® brand. Year-to-date e-commerce sales increased <percent>26%</percent> for Dream Water® and <percent>28%</percent> for LivRelief™, reflecting strong consumer engagement and repeat purchasing behavior. At the same time, overall revenue has been impacted by temporary shifts in customer ordering patterns across certain retail markets, along with the transition of our licensed LivRelief™ Infused distribution channel. While these factors have created near-term variability in reported results, underlying consumer demand for the Company's core brands remains solid, and management is actively addressing fluctuations in distribution timing and engaging in channel optimization to stabilize and accelerate growth in the second half of fiscal 2026.</p><p><b>Management Commentary</b></p><p>\"While our results this quarter reflect temporary timing variability in certain retail markets, we are encouraged by the strength of our core business fundamentals. Our targeted e-commerce strategy continues to deliver measurable growth, our U.S. expansion remains a key driver, and consumer demand for both Dream Water® and LivRelief™ continues to develop,\" said Gord Davey, President and Chief Executive Officer of Delivra Health Brands Inc. \"We are focused on disciplined execution — strengthening distribution, optimizing customer mix, advancing innovation, and investing in scalable revenue channels. As we move through the second half of fiscal 2026, our priority remains clear: stabilize retail ordering patterns, reignite growth in licensed markets, and continue expanding high-margin direct-to-consumer and U.S. retail opportunities. We believe these initiatives position us well to return to consistent revenue growth while maintaining financial responsibility.\"</p><p><b>Financial Highlights for the Three Months Ended December 31, 2025</b><br/><i>(<b>Expressed in thousands of Canadian dollars, except share and per share amounts)</b></i></p><p style=\"margin-left: 20px;\"><b>Net revenue:</b> In the three months ended December 31, 2025, the Company reported total net revenue of <money>$2,433</money> as compared to <money>$2,754</money> in same period last year, representing approximately a <money>$321</money> or <percent>12%</percent> decrease. This net decrease was primarily due to lower sales of Dream Water® in the U.S. and Canada by <money>$183</money>, lower sales of LivRelief™ OTC by <money>$93</money> impacted by the timing of customer ordering patterns and partially, offset by growing ecommerce LivRelief™ OTC sales, and finally lower sales of LivRelief™ Infused topical creams by <money>$45</money> due to the transition to a new licensed distribution partner. </p><p style=\"margin-left: 20px;\"><b>Gross profit and gross profit margin:</b> In the three months ended December 31, 2025, the Company reported gross profit of <money>$972</money> and a gross profit margin of <percent>40%</percent> as compared to <money>$1,294</money> and <percent>47%</percent> in the same period last year. The decrease in gross profit is driven by lower revenue and higher product cost due to price increases by certain vendors and the reduction in gross profit margin was the result of a different product and customer mix in this quarter compared to same quarter last year.</p><p style=\"margin-left: 20px;\"><b>Expenses including selling, general and administrative (\"SG&amp;A\") expenses and excluding non-cash items</b>: In the three months ended December 31, 2025, the Company reported expenses of <money>$1,391</money> as compared to <money>$1,544</money> in the same period last year, representing a <money>$153</money> or <percent>10%</percent> decrease. The decrease was mainly driven by lower investments in marketing campaigns and digital marketing programs of <money>$182</money> or <percent>32%</percent>, offset by a slight increase in general and administrative costs of <money>$29</money> or <percent>3%</percent> mainly driven by increased investments in investor relation programs. </p><p style=\"margin-left: 20px;\"><b>Adjusted EBITDA</b><sup><b>(1)</b></sup><b>:</b> In the three months ended December 31, 2025, the Company reported Adjusted EBITDA of <money>$(369)</money> as compared to <money>$(194)</money> in the same period last year. This reduction in Adjusted EBITDA is the result of lower sales volume and gross profit as explained above. </p><p><b>Financial Highlights for the Six Months Ended December 31, 2025</b><br/><i>(<b>Expressed in thousands of Canadian dollars, except share and per share amounts)</b></i></p><p style=\"margin-left: 20px;\"><b>Net revenue:</b> In the six months ended December 31, 2025, the Company reported total net revenue of <money>$5,640</money> compared to <money>$5,917</money> in same period last year, representing a <money>$277</money> or <percent>5%</percent> decrease. This decrease was due to higher sales of Dream Water® in the U.S and Canada by <money>$29</money> offset by lower sales of LivRelief™ OTC of <money>$61</money> impacted by the timing of customer ordering patterns and finally lower sales of <money>$245</money> of LivRelief™ Infused topical creams due to the transition to a new distribution channel in Canada. These declines were partially offset by increased e-commerce sales of LivRelief™ OTC by <percent>28%</percent> and Dream Water® products in Canada and USA by <percent>26%</percent> driven by strong consumer demand and online marketing. The Company is currently reviewing its market distribution strategy for licensed LivRelief™ Infused products and intends to resume its growth strategy in the second half of fiscal 2026 and fiscal 2027.</p><p style=\"margin-left: 20px;\"><b>Gross profit and gross profit margin:</b> In the six months ended December 31, 2025, the Company reported year-to-date gross profit of <money>$2,473</money> and a gross profit margin of <percent>44%</percent> as compared to <money>$2,891</money> and <percent>49%</percent> in same period last year. The reduction in gross profit and gross profit margin was the result of a change in customer mix and product cost and mix.  </p><p style=\"margin-left: 20px;\"><b>Expenses including selling, general and administrative (\"SG&amp;A\") expenses and excluding non-cash items</b>: In the six months ended December 31, 2025, the Company reported expenses of <money>$2,838</money> compared to <money>$3,149</money> in the same period last year, representing a <percent>10%</percent> decrease. Prior year fiscal 2025 first half sales and marketing expenses were higher than the first half of fiscal 2026 sales and marketing expenses by <money>$426</money> or <percent>34%</percent> given that the Company released in November 2024 two major marketing campaigns, 'Shush Your Mind' for Dream Water® and 'Quiets Chronic Pain' for LivRelief™. General and administrative costs were higher in the first half of fiscal 2026 compared with same period last year by <money>$115</money> or <percent>6%</percent> mainly as a result of higher investor relation programs and higher professional and consulting services offset by lower salaries costs. </p><p style=\"margin-left: 20px;\"><b>Adjusted EBITDA</b><sup><b>(1)</b></sup><b>:</b> In the six months ended December 31, 2025, the Company reported Adjusted EBITDA of <money>$(313)</money> compared to <money>$(176)</money> in the same period last year, representing a <money>$(137)</money> year-over-year reduction. This reduction in Adjusted EBITDA was mainly driven by lower sales volume and lower gross profit as discussed above. </p><p><b>Summary of Key Financial Results </b></p><table border=\"0\" cellpadding=\"0\" cellspacing=\"0\" style=\"text-align: start; width: 100%; border-collapse: collapse;\"><tbody><tr><td style=\"border-width: 1px; border-style: solid; border- font-size: 10px;\"><br/></td><td colspan=\"2\" style=\"text-align: center; width: 15%; vertical-align: top; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>For the three months ended<br/>December 31</b></td><td colspan=\"2\" style=\"text-align: center; width: 15%; vertical-align: top; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>For the six months ended<br/>December 31</b></td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- font-size: 10px;\">(<money>$000</money>'s, except share and per share amounts)</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>2025</b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">2024</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>2025</b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">2024</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- font-size: 10px;\">Continued operations:</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>$</b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">$</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>$</b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">$</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- font-size: 10px;\">Net revenue</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>                      2,433 </b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">                      2,754 </td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>                     5,640 </b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">                     5,917 </td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- font-size: 10px;\">Cost of sales</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>                         1,411 </b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">                         1,404 </td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>                         3,115 </b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">                         2,944 </td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- font-size: 10px;\">Inventory write-down</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>                         50 </b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">                         56 </td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>                        52 </b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">                        82 </td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- font-size: 10px;\">Gross profit</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>                     972 </b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">                     1,294 </td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>                     2,473 </b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">                     2,891 </td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- font-size: 10px;\">Expenses excluding non-cash expenses</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>1,391</b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">1,544</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>2,838</b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">3,149</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- font-size: 10px;\">Depreciation and amortization and share based compensation</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>31</b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">397</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>107</b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">794</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- font-size: 10px;\">Total expenses</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>1,422 </b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">1,941 </td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>2,945</b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">3,943 </td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- font-size: 10px;\">Loss from operations</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>                    (450)</b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">                    (647)</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>                    (472)</b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">                    (1,052)</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- font-size: 10px;\">Other (expense) income</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>                           39</b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">                           (165)</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>                        (30) </b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">                        (236) </td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- font-size: 10px;\">Net gain (loss) from continued operations</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>                    (411)</b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">                    (812)</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>                    (502)</b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">                    (1,288)</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- font-size: 10px;\">Net gain (loss) per share - basic </td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>(0.01)</b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">(0.03)</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>(0.02)</b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">(0.04)</td></tr></tbody></table><p> </p><p><b>Adjusted EBITDA</b><sup><b>(1)</b></sup><b> (non-IFRS measure) </b></p><table border=\"0\" cellpadding=\"0\" cellspacing=\"0\" style=\"text-align: start; width: 100%; border-collapse: collapse;\"><tbody><tr><td style=\"border-width: 1px; border-style: solid; border- font-size: 10px;\"><br/></td><td colspan=\"2\" style=\"text-align: center; width: 15%; vertical-align: top; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>For the three months ended<br/>December 31</b></td><td colspan=\"2\" style=\"text-align: center; width: 15%; vertical-align: top; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>For the six months ended<br/>December 31</b></td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- font-size: 10px;\">(<money>$000</money>'s, except share and per share amounts)</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>2025</b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">2024</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>2025</b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">2024</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- font-size: 10px;\">Loss from operations</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>                   (450)</b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">                   (647)</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>              (472)</b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">              (1,052)</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- font-size: 10px;\">Inventory write-down</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>                       50 </b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">                       56 </td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>                       52 </b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">                       82 </td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- font-size: 10px;\">Depreciation and amortization</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">                -                       </td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">                326                       </td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>                27 </b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">                652 </td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- font-size: 10px;\">Share-based compensation</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>                         31 </b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">                         71 </td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>                  80 </b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">                  142 </td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- font-size: 10px;\">Adjusted EBITDA(1)</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>                      (369)</b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">                      (194)</td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\"><b>              (313)</b></td><td style=\"width: 15%; vertical-align: top; text-align: right; border-width: 1px; border-style: solid; border- font-size: 10px;\">              (176)</td></tr></tbody></table><p> </p><p><b>Expenses excluding non-cash items</b></p><table border=\"0\" cellpadding=\"3\" cellspacing=\"0\" style=\"width: 100%; border-collapse: collapse; border-width: 1px; border-style: solid; border-\"><tbody><tr><td style=\"border-width: 1px; border-style: solid; border- font-size: 10px;\"><br/></td><td colspan=\"2\" style=\"border-width: 1px; border-style: solid; border- width: 15%; text-align: center; vertical-align: top; font-size: 10px;\"><b>For the three months ended<br/>December 31</b></td><td colspan=\"2\" style=\"border-width: 1px; border-style: solid; border- width: 15%; text-align: center; vertical-align: top; font-size: 10px;\"><b>For the six months ended<br/>December 31</b></td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- font-size: 10px;\">(<money>$000</money>'s, except share and per share amounts)</td><td style=\"border-width: 1px; border-style: solid; border- width: 15%; text-align: right; vertical-align: top; font-size: 10px;\"><b>2025</b></td><td style=\"border-width: 1px; border-style: solid; border- width: 15%; text-align: right; vertical-align: top; font-size: 10px;\">2024</td><td style=\"border-width: 1px; border-style: solid; border- width: 15%; text-align: right; vertical-align: top; font-size: 10px;\"><b>2025</b></td><td style=\"border-width: 1px; border-style: solid; border- width: 15%; text-align: right; vertical-align: top; font-size: 10px;\">2024</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- font-size: 10px;\">General and administration</td><td style=\"border-width: 1px; border-style: solid; border- width: 15%; text-align: right; vertical-align: top; font-size: 10px;\"><b>                  998 </b></td><td style=\"border-width: 1px; border-style: solid; border- width: 15%; text-align: right; vertical-align: top; font-size: 10px;\">                  969 </td><td style=\"border-width: 1px; border-style: solid; border- width: 15%; text-align: right; vertical-align: top; font-size: 10px;\"><b>                  2,026 </b></td><td style=\"border-width: 1px; border-style: solid; border- width: 15%; text-align: right; vertical-align: top; font-size: 10px;\">                  1,911 </td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- font-size: 10px;\">Sales and marketing</td><td style=\"border-width: 1px; border-style: solid; border- width: 15%; text-align: right; vertical-align: top; font-size: 10px;\"><b>                     393 </b></td><td style=\"border-width: 1px; border-style: solid; border- width: 15%; text-align: right; vertical-align: top; font-size: 10px;\">                     575 </td><td style=\"border-width: 1px; border-style: solid; border- width: 15%; text-align: right; vertical-align: top; font-size: 10px;\"><b>                     812                   </b></td><td style=\"border-width: 1px; border-style: solid; border- width: 15%; text-align: right; vertical-align: top; font-size: 10px;\">                     1,238                   </td></tr><tr><td style=\"border-width: 1px; border-style: solid; border- font-size: 10px;\">Total </td><td style=\"border-width: 1px; border-style: solid; border- width: 15%; text-align: right; vertical-align: top; font-size: 10px;\"><b>1,391</b></td><td style=\"border-width: 1px; border-style: solid; border- width: 15%; text-align: right; vertical-align: top; font-size: 10px;\">1,544</td><td style=\"border-width: 1px; border-style: solid; border- width: 15%; text-align: right; vertical-align: top; font-size: 10px;\"><b>2,838</b></td><td style=\"border-width: 1px; border-style: solid; border- width: 15%; text-align: right; vertical-align: top; font-size: 10px;\">3,149</td></tr></tbody></table><p> </p><p><b>About Delivra Health Brands Inc.</b></p><p>Helping people take control of their health with alternative wellness solutions is what energizes the Delivra Health team! The Delivra Health portfolio features innovative brands like Dream Water® and LivRelief™, which deliver relief from common everyday issues like chronic pain, anxiety, and sleeplessness. Delivra Health products have allowed millions of customers to reclaim their mobility, energy, and in turn, quality of life.  The websites of the Company's two subsidiaries are  <a href=\"https://api.newsfilecorp.com/redirect/MqygRTqvYB\" rel=\"nofollow noopener\">Dream Water®</a> and  <a href=\"https://api.newsfilecorp.com/redirect/bg1L0c1gwy\" rel=\"nofollow noopener\" target=\"_blank\">LivRelief</a><sup>TM</sup>. For more information, please visit  <a href=\"https://api.newsfilecorp.com/redirect/3KkALce4M0\" rel=\"nofollow noopener\">www.delivrahealthbrands.com</a>. </p><p><b>Non-IFRS Measures, Reconciliation and Discussion</b></p><p>This press release contains references to \"Adjusted EBITDA\" which is a non-International Financial Reporting Standards (\"<b>IFRS</b>\") financial measure. Adjusted EBITDA is a measure of the Company's loss from operations before interest, taxes, depreciation, and amortization and adjusted for share-based compensation, common shares issued for services, fair value effects of accounting for biological assets and inventories, asset impairment and write-downs, and other non-cash items, and is a non-IFRS measure.</p><p>This measure can be used to analyze and compare profitability among companies and industries, as it eliminates the effects of financing and capital expenditures. It is often used in valuation ratios and can be compared to enterprise value and revenue. This measure does not have any standardized meaning according to IFRS and, therefore, may not be comparable to similar measures presented by other companies.</p><p>There are no comparable IFRS financial measures presented in Delivra Health's financial statements. Reconciliations of the supplemental non-IFRS measure are presented in the Company's management discussion and analysis for the three and six months ended December 31, 2025 (the \"<b>Q2 2026 MD&amp;A</b>\"). This non-IFRS financial measure is presented because management has evaluated the financial results both including and excluding the adjusted items and believes that the non-IFRS financial measure presented provides additional perspective and insights when analyzing the core operating performance of the business. The Company believes that the supplemental measure provides information which is useful to shareholders and investors in understanding the Company's performance and may assist in the evaluation of the Company's business relative to that of its peers.</p><p>The non-IFRS financial measure should not be considered superior to, as a substitute for, or as an alternative to, and should be considered in conjunction with the IFRS financial measures presented in the Company's financial statements. For more information, please see \"Adjusted EBITDA (non-IFRS measure)\"  and \"Non-IFRS Measures\" in the Q2 2026 MD&amp;A, which is available under the Company's SEDAR+ profile on <a href=\"https://api.newsfilecorp.com/redirect/N3KpqSPxRw\" rel=\"nofollow noopener\">www.sedarplus.ca</a>.</p><p><b><font style=\"font-size: 11px;\">Notes:</font></b></p><ol style=\"list-style-type: decimal; font-size: 11px;\"><li>This is a non-IFRS reporting measure. For a reconciliation of this measure to the nearest IFRS measure, see \"Adjusted EBITDA (non-IFRS measure)\"  and \"Non-IFRS Measures\" in the Q2 2026 MD&amp;A.</li></ol><p><b>Cautionary Note Regarding Forward-Looking Statements</b></p><p>This news release contains \"forward-looking information\" and \"forward-looking statements\" (collectively, \"forward-looking statements\") within the meaning of the applicable Canadian securities legislation. All statements, other than statements of historical fact, are forward-looking statements and are based on expectations, estimates, and projections as at the date of this news release. Any statement that involves discussions with respect to predictions, expectations, beliefs, plans, projections, objectives, assumptions, future events or performance (often but not always using phrases such as \"expects\", or \"does not expect\", \"is expected\", \"anticipates\" or \"does not anticipate\", \"plans\", \"budget\", \"scheduled\", \"forecasts\", \"estimates\", \"believes\" or \"intends\" or variations of such words and phrases or stating that certain actions, events or results \"may\" or \"could\", \"would\", \"might\" or \"will\" be taken to occur or be achieved) are not statements of historical fact and may be forward-looking statements. In this news release, forward-looking statements include, among other things, statements with respect to the Company's products offering relief from chronic pain, anxiety, and sleeplessness, impacts of the Company's latest marketing campaigns, expectations regarding expansion opportunities including the Company's U.S. expansion, ongoing consumer demand for the Company's products, stabilization of retail ordering patterns, expectations regarding increases in the Company's revenues and profitability,  increases in consumer demand, the Company's ability to expand high-margin direct-to-consumer and U.S. retail opportunities, and the Company's growth objectives and strategy, growth in new markets, and new distribution channels.</p><p>These forward-looking statements are based on reasonable assumptions and estimates of management of the Company at the time such statements were made. Actual future results may differ materially as forward-looking statements involve known and unknown risks, uncertainties, and other factors which may cause the actual results, performance, or achievements of the Company to materially differ from any future results, performance, or achievements expressed or implied by such forward-looking statements. Such factors, among other things, include: fluctuations in general macroeconomic conditions; fluctuations in securities markets; expectations regarding the size of the cannabis markets where the Company operates; changing consumer habits; the ability of the Company to successfully achieve its business objectives; plans for expansion; political and social uncertainties; inability to obtain adequate insurance to cover risks and hazards; employee relations and the presence of laws and regulations that may impose restrictions on cultivation, production, distribution, and sale of cannabis and cannabis-related products in the markets where the Company operates. Although the forward-looking statements contained in this news release are based upon what management of the Company believes, or believed at the time, to be reasonable assumptions, the Company cannot assure shareholders that actual results will be consistent with such forward-looking statements, as there may be other factors that cause results not to be as anticipated, estimated or intended. Readers should not place undue reliance on the forward-looking statements and information contained in this news release. The Company assumes no obligation to update the forward-looking statements of beliefs, opinions, projections, or other factors, should they change, except as required by law.</p><p>Additional information regarding this and other risks and uncertainties relating to the Company's business are contained under the heading \"Risk Factors\" in the Company's annual information form dated March 2, 2021, and under the heading \"Risks and Uncertainties\" in the Q2 2026 MD&amp;A filed under the Company's profile on SEDAR+ at <a href=\"https://api.newsfilecorp.com/redirect/XEz4VIMa5w\" rel=\"nofollow noopener\">www.sedarplus.ca</a>.</p><p><i>Neither TSX-V nor its Regulation Services Provider (as that term is defined in the policies of the TSX-V) accept responsibility for the adequacy or accuracy of this release.</i></p><div id=\"contactInfo\"><p><b>Investor Relations:</b><br/>Jack Tasse<br/>Chief Financial Officer<br/><a href=\"mailto:IR@delivrahealth.com\" rel=\"nofollow noopener\">IR@delivrahealth.com</a><br/>1-877-915-7934</p></div><p id=\"corporateNewsLogoContainer\"><img alt=\"Corporate Logo\" id=\"corporateNewsLogo\" loading=\"lazy\" src=\"https://images.newsfilecorp.com/files/2413/285779_a04ad75be4edda48_logo.jpg\"/></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/DOymjIPXm1\" rel=\"nofollow noopener\">https://www.newsfilecorp.com/release/285779</a></p><p><img alt=\"\" loading=\"lazy\" src=\"https://api.newsfilecorp.com/newsinfo/285779/375\"/></p></article>",
            "link": "https://www.stocktitan.net/news/DHBUF/delivra-health-and-its-brands-liv-relief-tm-and-dream-water-tm-sq3h4mvatdg2.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 23:45:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Biocytogen Announces Clinical Milestone with First Patient Dosed in Phase 1 Trial of IDEAYA’s First-in-Class B7H3/PTK7 Bispecific TOP1 ADC IDE034 | IDYA Stock News",
            "description": "<article class=\"article\"><ul class=\"bwlistdisc\"><li>IDE034 is a B7H3/PTK7 bispecific TOP1 ADC designed to target tumor cells expressing both B7H3 and PTK7 preferentially, and is being evaluated as monotherapy and in combination with IDEAYA’s PARG inhibitor IDE161.</li><li>IDEAYA has dosed the first patient in its Phase 1 trial of IDE034, initially evaluating safety, tolerability, and PK.</li><li>First dosing triggers a <money><money>$5 million</money></money> milestone payment to Biocytogen under the companies’ option and license agreement.</li></ul><p> <location idsrc=\"xmltag.org\" value=\"LU/cn..beijng\">BEIJING</location>--(BUSINESS WIRE)--Biocytogen Pharmaceuticals (Beijing) Co., Ltd. (Biocytogen, SSE: 688796; HKEX: 02315), a global biotechnology company that drives the research and development of novel antibody-based drugs with innovative technologies, today announced that its partner IDEAYA Biosciences, Inc. (“IDEAYA”; Nasdaq: <a class=\"symbol-link\" href=\"/overview/IDYA/\" title=\"View IDYA stock overview\">IDYA</a>) has dosed the first patient in IDEAYA’s Phase 1 dose-escalation/expansion clinical trial of IDE034, an investigational B7H3/PTK7 bispecific TOP1 ADC. Pursuant to the companies’ option and license agreement, first patient dosing triggers a <money><money>$5 million</money></money> milestone payment to Biocytogen.</p><p>According to IDEAYA, the Phase 1 study is designed to characterize IDE034’s safety profile, tolerability, and PK as a monotherapy, and IDEAYA also intends to evaluate combination regimens with DNA damage response (DDR) -targeting agents such as its oral PARG inhibitor IDE161 as the program advances.</p><p>IDE034 is a potential first-in-class bispecific B7H3/PTK7 TOP1 ADC, independently developed by Biocytogen and licensed to IDEAYA in July 2024. IDEAYA has stated that IDE034 is designed to preferentially internalize in tumor cells co-expressing B7H3 and PTK7, supporting selectivity and tolerability, and estimates 30–<percent>40%</percent> co-expression across several major solid tumors with limited dual expression in normal tissues.</p><p>“Reaching first dosing in the IDE034 Phase 1 trial marks an important step in translating this bispecific TOP1 ADC concept into clinical evaluation,” said Dr. Yuelei Shen, President and CEO of Biocytogen. “We appreciate IDEAYA’s strong execution in advancing IDE034 into the clinic and look forward to the readout of initial safety and PK data from the ongoing Phase 1 study.”</p><p><b>About Biocytogen</b></p><p>Biocytogen (SSE: 688796; HKEX: 02315) is a global biotechnology company that drives the research and development of novel antibody-based drugs with innovative technologies. Founded on gene editing technology, Biocytogen has established a dual-engine platform combining a fully human antibody library with an extensive target-humanized mouse model portfolio, enabling a systematic approach to accelerating global drug discovery and development.</p><p>Biocytogen has independently developed its proprietary RenMice<sup>® </sup>(RenMab<sup>®</sup>/ RenLite<sup>®</sup>/ RenNano<sup>®</sup>/RenTCR™/ RenTCR mimic™) platforms for fully human monoclonal/bispecific/multispecific antibody discovery, bispecific antibody-drug conjugate discovery, hu-VHH discovery, and TCR mimic antibody discovery, and has established a sub-brand, RenSuper™ Biologics, to explore global partnerships for an off-the-shelf library of &gt;1,000,000 fully human antibody sequences against over 1000 targets for worldwide collaboration. As of June 30, 2025, approximately 280 therapeutic antibody and multiple clinical asset co-development/out-licensing/transfer agreements and over 50 target-nominated RenMice<sup>®</sup> licensing projects have been established around the globe, including several partnerships with multinational pharmaceutical companies (MNCs). Biocytogen pioneered the generation of drug target knock-in humanized models for preclinical research, and currently provides a few thousand off-the-shelf animal and cell models under the company's sub-brand, BioMice™, along with preclinical pharmacology and gene-editing services for clients worldwide. Headquartered in <location idsrc=\"xmltag.org\" value=\"LU/cn..beijng\">Beijing</location>, Biocytogen has branches in <location idsrc=\"xmltag.org\" value=\"LC/cn\">China</location> (Haimen, <location idsrc=\"xmltag.org\" value=\"LU/cn..jangsu\">Jiangsu</location>, <location idsrc=\"xmltag.org\" value=\"LU/cn..shangh\">Shanghai</location>), the <location idsrc=\"xmltag.org\" value=\"LC/us\">USA</location> (<location idsrc=\"xmltag.org\" value=\"LU/us.ma.boston\">Boston</location>, <location idsrc=\"xmltag.org\" value=\"LU/us.ca.sanfrn\">San Francisco</location>, <location idsrc=\"xmltag.org\" value=\"LU/us.ca.sandgo\">San Diego</location>), and <location idsrc=\"xmltag.org\" value=\"LC/de\">Germany</location> (Heidelberg). For more information, please visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fbiocytogen.com&amp;esheet=54435096&amp;newsitemid=20260227206909&amp;lan=en-US&amp;anchor=https%3A%2F%2Fbiocytogen.com&amp;index=1&amp;md5=0d27ed18dc81efd4ff87a7531b305cfd\" rel=\"nofollow noopener\" shape=\"rect\">https://biocytogen.com</a>.</p><p><img alt=\"\" loading=\"lazy\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260227206909r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\"/><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20260227206909/en/\" rel=\"nofollow noopener\">https://www.businesswire.com/news/home/20260227206909/en/</a></span></p><p><b>Biocytogen Contacts</b><br/>Antibody assets and platforms: <a href=\"mailto:BD-Licensing@biocytogen.com\" rel=\"nofollow noopener\" shape=\"rect\">BD-Licensing@biocytogen.com</a><br/>Media: <a href=\"mailto:pr@biocytogen.com.cn\" rel=\"nofollow noopener\" shape=\"rect\">pr@biocytogen.com.cn</a></p><p>Source: Biocytogen Pharmaceuticals (Beijing) Co., Ltd.</p></article>",
            "link": "https://www.stocktitan.net/news/IDYA/biocytogen-announces-clinical-milestone-with-first-patient-dosed-in-ye38khp593bs.html",
            "author": "stocktitan",
            "pub_date": "Sat, 28 Feb 2026 00:00:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dynamite Blockchain Announces Change in Auditor | CRYBF Stock News",
            "description": "<article class=\"article\"><p><strong id=\"dateline\">VANCOUVER, BC / <a href=\"https://www.accessnewswire.com/\" rel=\"nofollow noopener\">ACCESS Newswire</a> / February 27, 2026 / </strong>Dynamite Blockchain Corp. (the \"<strong>Company</strong>\" or \"<strong>Dynamite</strong>\") (CSE:<strong>KAS</strong>)(OTC:<strong>CRYBF</strong>) announces that it has changed its auditor from SRCO Professional Corporation (the <strong>\"former auditor\"</strong>) to Davidson and Company LLP. (the <strong>\"successor auditor\"</strong>) effective February 19, 2026.</p><p>The change of auditor was approved by the Company's board of directors and audit committee. There were no reservations or modified opinions in the Former Auditor's audit reports for any financial period during which the Former Auditor was engaged, and there are no \"reportable events\" (as that term is defined in National Instrument 51-102 - <i>Continuous Disclosure Obligations</i>) in connection with the change of auditor.</p><p>The Company has filed a Notice of Change of Auditor in accordance with NI 51-102on SEDAR+ at <a href=\"https://pr.report/j52k\" rel=\"nofollow noopener\">www.sedarplus.ca</a>.</p><p>The Company wishes to thank SRCO Professional Corporation for their services and support during their tenure.</p><p>On behalf of the Company,</p><p>Akshay Sood<br/>Chief Executive Officer<br/>Telephone: 236-259-0279</p><p>About Dynamite Blockchain Corp.</p><p>Dynamite Blockchain Corp. is a blockchain technology and infrastructure company focused on building shareholder value through its Blockchain Ecosystem Strategy, which is comprised of 3 primary divisions: Holdings, Products and Services. The Holdings Division is the foundation, which focuses on acquiring utility-driven tokens that combine scarcity with real-world adoption and monetization. The Products and Services Divisions are intended to drive utility into the digital assets in the Holdings Division by the development and acquisition of products and services that will be compatible with the digital assets in the Company's Holdings Division. Working in strategic harmony, the vertically integrated Blockchain Ecosystem not only offers shareholders ownership in rare and unique digital assets but also provides them with a unique investment vehicle that has utility generation built into its business model.</p><p><i>The CSE (operatedby CNSX Markets Inc.) has neither approved nor disapproved of the contents of this press release.</i></p><p><strong>SOURCE: </strong>Dynamite Blockchain Corp</p><br/><br/>View the original <a href=\"https://www.accessnewswire.com/newsroom/en/computers-technology-and-internet/dynamite-blockchain-announces-change-in-auditor-1142354\" rel=\"nofollow noopener\">press release</a> on ACCESS Newswire<br/><br/><img height=\"0\" loading=\"lazy\" src=\"https://app.accessnewswire.com/img.ashx?id=1142354\" width=\"0\"/></article>",
            "link": "https://www.stocktitan.net/news/CRYBF/dynamite-blockchain-announces-change-in-kuoijszejjbr.html",
            "author": "stocktitan",
            "pub_date": "Sat, 28 Feb 2026 02:00:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ION Announces Proposed Continuation to British Columbia | IONGF Stock News",
            "description": "<article class=\"article\"><p>Vancouver, British Columbia--(Newsfile Corp. - February 27, 2026) - Lithium ION Energy Limited (TSXV: ION) (FSE: ZA4) (\"<b>ION</b>\" or the \"<b>Company</b>\") is pleased to announce that ION has called a special shareholders' meeting for March 31, 2026. </p><p>At this meeting, the Company will put forth a resolution to continue the Company's corporate jurisdiction from the Province of Alberta to the Province of British Columbia (the \"<b>Continuation</b>\"). Subject to obtaining shareholder approval of the Continuation, the Company will be subject to the corporate jurisdiction of the Province of British Columbia. </p><div id=\"contactInfo\"><p><b>On behalf of the Board</b><br/>Sreenath Didugu<br/>CEO<br/><a href=\"mailto:sdidugu@qcap.com.au\" rel=\"nofollow noopener\">sdidugu@qcap.com.au</a></p></div><p><i>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this news release.</i></p><p><i><b>Forward-looking Statements </b></i></p><p><i>Certain information contained herein constitutes \"forward-looking information\" under Canadian securities legislation. Forward-looking information includes, but is not limited to, the Continuation and the completion of the proposed actions on the timing described herein and receipt of TSXV approval for the proposed actions. Generally, forward-looking information can be identified by the use of forward-looking terminology such as \"will\", \"intends\", \"intention\", \"anticipates\" or variations of such words and phrases or statements that certain actions, events or results \"will\" occur. Forward-looking statements are based on the opinions and estimates of management as of the date such statements are made and they are from those expressed or implied by such forward-looking statements or forward-looking information subject to known and unknown risks, uncertainties and other factors that may cause the actual results to be materially different, including receipt of all necessary regulatory approvals. Although management of the Company have attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements or forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements and forward-looking information. The Company will not update any forward-looking statements or forward-looking information that are incorporated by reference herein, except as required by applicable securities laws.</i></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/oPyvzUBDXw\" rel=\"nofollow noopener\">https://www.newsfilecorp.com/release/285780</a></p><p><img alt=\"\" loading=\"lazy\" src=\"https://api.newsfilecorp.com/newsinfo/285780/375\"/></p></article>",
            "link": "https://www.stocktitan.net/news/IONGF/ion-announces-proposed-continuation-to-british-8na8lgl4fwoi.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 23:49:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wilton Resources Inc. Announces Grant of Stock Options | WLTNF Stock News",
            "description": "<article class=\"article\"><p>Calgary, Alberta--(Newsfile Corp. - February 27, 2026) - <b>Wilton Resources Inc. (TSXV: WIL) (the \"Corporation\") </b>announces that on February 27, 2026, the board of directors of the Corporation granted 1,223,805 stock options (the \"<b>Options</b>\") to purchase common shares in the capital of the Corporation (\"<b>Shares</b>\") to certain directors, officers and consultants of the Corporation. The Options vest on the date of issuance and are exercisable for a period of five years from the date of grant at an exercise price of <money>$0.30</money> per Share. Each grant of Options is subject to the approval of the TSX Venture Exchange. </p><div id=\"contactInfo\"><p><u><b>For further information, please contact:</b></u></p><p><b>Wilton Resources Inc.</b></p><p>Richard Anderson<br/>Chief Executive Officer<br/>(403) 619 6609</p></div><p><i>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</i></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/qpNG3CKRr0\" rel=\"nofollow noopener\">https://www.newsfilecorp.com/release/285781</a></p><p><img alt=\"\" loading=\"lazy\" src=\"https://api.newsfilecorp.com/newsinfo/285781/375\"/></p></article>",
            "link": "https://www.stocktitan.net/news/WLTNF/wilton-resources-inc-announces-grant-of-stock-9qbzi8nxuipp.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 23:54:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "First Commerce Bancorp, Inc. Announces Conclusion of Tender Offer for its Common Stock | CMRB Stock News",
            "description": "<article class=\"article\"><p><strong id=\"dateline\">LAKEWOOD, NJ / <a href=\"https://www.accessnewswire.com/\" rel=\"nofollow noopener\">ACCESS Newswire</a> / February 27, 2026 / </strong>First Commerce Bancorp, Inc., (OTCID:CMRB) (the \"Company\") today announced the conclusion of its previously initiated tender offer to repurchase up to 3,000,000 shares of the Company's common stock (\"Shares\") at a purchase price of <money>$7.00</money> per Share (the \"Tender Offer\"). The conclusion of the Tender Offer has occurred with the close of business today, Friday, February 27, 2026, at 5:00 P.M. EST.</p><p>Performance Trust Capital Partners, LLC, served as Deal Manager for the Tender Offer. Computershare, Inc. served as the Depositary for the Tender Offer while Georgeson, LLC acted as the Company's Information Agent for the Tender Offer.</p><p>Based on a preliminary count by the Depository and Deal Manager for the Tender Offer, a total of 2,974,738 shares have been validly tendered and not properly withdrawn pursuant to the tender offer, representing approximately <percent>14.9%</percent> of the outstanding Shares. All Shares validly tendered cannot be withdrawn and no additional tenders will be accepted.</p><p>This press release is for informational purposes only and is neither an offer to purchase nor a solicitation of an acceptance of securities. No offer, solicitation, purchase, or sale will be made in any jurisdiction in which such offer, solicitation, or sale would be unlawful. The Tender Offer is being made solely pursuant to the terms and conditions set forth in the Offer to Purchase dated January 28, 2026 (the \"Offer to Purchase\"), and accompanying materials. Shareholders should read such Offer to Purchase and related materials carefully and in their entirety because they contain important information, including the various terms and conditions of the tender offer.</p><p>This press release contains \"forward-looking statements\". Forward-looking statements contain words such as \"anticipate,\" \"believe,\" \"can,\" \"would,\" \"should,\" \"could,\" \"may,\" \"predict,\" \"seek,\" \"potential,\" \"will,\" \"estimate,\" \"target,\" \"plan,\" \"project,\" \"continuing,\" \"ongoing,\" \"expect,\" \"intend\" or similar expressions that relate to the Company's strategy, plans or intentions. Forward-looking statements involve certain important risks, uncertainties and other factors, any of which could cause actual results to differ materially from those in such statements. Such factors include, without limitation, the \"Risk Factors\" referenced in the Offer to Purchase and the following additional factors: ability to execute our business strategy; business and economic conditions; economic, market, operational, liquidity, credit and interest rate risks associated with the Company's business; effects of any changes in trade, monetary and fiscal policies and laws; effects of inflation as well as interest rate, securities market and monetary supply fluctuations; changes in consumer spending, borrowings and savings habits; the Company's ability to achieve organic loan and deposit growth and the composition of such growth; changes in sources and uses of funds; increased competition in the financial services industry; the effect of changes in accounting policies and practices; the share price of the Company's stock; ability to maintain or increase market share and control expenses; costs and effects of changes in laws and regulations and of other legal and regulatory developments; technological changes; the timely development and acceptance of new products and services; ability to implement or improve operational management and other internal risk controls and processes and reporting system and procedures; changes in estimates of future loan reserve requirements based upon the periodic review thereof under relevant regulatory and accounting requirements; widespread natural and other disasters, dislocations, political instability, acts of war or terrorist activities, cyberattacks or international hostilities; impact of reputational risk; and success at managing the risks involved in the foregoing items. The Company can give no assurance that any goal or plan or expectation set forth in forward-looking statements can be achieved and readers are cautioned not to place undue reliance on such statements. The forward-looking statements are made as of the date of this press release, and the Company does not intend, and assumes no obligation, to update any forward-looking statement to reflect events or circumstances after the date on which the statement is made or to reflect the occurrence of unanticipated events or circumstances, except as required by applicable law.</p><p>Press Contact:</p><p>Donald Mindiak<br/>First Commerce Bancorp, Inc.<br/>Lakewood, NJ 08701<br/>(732) 364-0032<br/><a href=\"mailto:dmindiak@firstcommercebk.com\" rel=\"nofollow noopener\">dmindiak@firstcommercebk.com</a><br/><a href=\"https://pr.report/j5h1\" rel=\"nofollow noopener\">http://firstcommercebk.com</a></p><p><strong>SOURCE:</strong> First Commerce Bancorp, Inc.</p><br/><br/>View the original <a href=\"https://www.accessnewswire.com/newsroom/en/banking-and-financial-services/first-commerce-bancorp-inc.-announces-conclusion-of-tender-offer-for-1142390\" rel=\"nofollow noopener\">press release</a> on ACCESS Newswire<br/><br/><img height=\"0\" loading=\"lazy\" src=\"https://app.accessnewswire.com/img.ashx?id=1142390\" width=\"0\"/></article>",
            "link": "https://www.stocktitan.net/news/CMRB/first-commerce-bancorp-inc-announces-conclusion-of-tender-offer-for-qi5dhaawr84b.html",
            "author": "stocktitan",
            "pub_date": "Sat, 28 Feb 2026 00:00:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EQV Ventures Acquisition Corp. Shareholders Approve Business Combination with Presidio | EQV Stock News",
            "description": "<article class=\"article\"><p align=\"center\"><i>Transaction expected to close on or about March 4, 2026</i></p> <p>Fort Worth, TX, Feb.  27, 2026  (GLOBE NEWSWIRE) -- <a class=\"symbol-link\" href=\"/overview/EQV/\" title=\"View EQV stock overview\">EQV</a> Ventures Acquisition Corp. (NYSE: FTW) (“EQV”), a special purpose acquisition company sponsored by <a class=\"symbol-link\" href=\"/overview/EQV/\" title=\"View EQV stock overview\">EQV</a> Group, is pleased to announce that in an extraordinary general meeting held today, <a class=\"symbol-link\" href=\"/overview/EQV/\" title=\"View EQV stock overview\">EQV</a> shareholders voted to approve the previously announced business combination with Presidio Investment Holdings LLC (“Presidio” or the “Company”), a differentiated oil and gas operator focused on the acquisition and optimization of mature, producing oil and natural gas assets in the United States. A Form 8-K disclosing the full voting results will be filed with the Securities and Exchange Commission.</p> <p align=\"justify\">The closing of the business combination is expected to occur on or about March 4, 2026, subject to the satisfaction or waiver of all closing conditions, with shares of the combined entity expected to trade on NYSE under the symbol “FTW” on March 5, 2026.</p> <p align=\"justify\">Shortly following the closing of the Transaction and upon approval of the combined company Board of Directors, Presidio expects to provide formal dividend timing details aligned with its previously announced dividend framework and broader shareholder return strategy, which highlights Presidio’s differentiation as an E&amp;P company with a capital-light platform with minimal reinvestment requirements, enabling a greater portion of cash flow to be returned directly to shareholders. The strategy is underpinned by accretive acquisitions, supported by a favorable M&amp;A environment for purchasing non-core assets at attractive returns.</p> <p><b>About Presidio</b></p> <p align=\"justify\">Headquartered in Fort Worth, TX, Presidio is a leading operator of mature oil and gas wells across the Mid-Continent. The Company is focused exclusively on optimizing existing production and generating sustainable cash flow from low-decline, producing assets.</p> <p align=\"justify\">Dividends are not guaranteed and may be adjusted, suspended, or discontinued at the discretion of the Board of Directors based on liquidity, legal surplus, business conditions, commodity price volatility, market conditions and other factors.</p> <p><b>About EQV Ventures Acquisition Corp.</b></p> <p align=\"justify\">EQV is a blank check company incorporated as a Cayman Islands exempted company for the purpose of effecting a merger, amalgamation, share exchange, asset acquisition, share purchase, reorganization or similar business combination with one or more businesses or entities. EQV’s sponsor is an affiliate of EQV Group, which was formed in 2022 and is an active acquirer and operator of proved developed producing oil and gas properties, and currently owns and operates more than 3,500 wells across 10 states.</p> <p><b>Forward-Looking Statements</b></p> <p align=\"justify\">This press release includes “forward-looking statements.” These include EQV’s, Presidio Pubco Inc’s (“Pubco”), EQV Resources LLC’s (“EQVR”) or Presidio’s or their management teams’ expectations, hopes, beliefs, intentions or strategies regarding the future. Forward-looking statements may be identified by the use of words such as “estimate,” “plan,” “project,” “forecast,” “intend,” “expect,” “anticipate,” “believe,” “seek,” “potential,” “budget,” “may,” “will,” “could,” “should,” “continue” or other similar expressions that predict or indicate future events or trends or that are not statements of historical matters. These forward-looking statements include, but are not limited to, statements regarding Pubco’s, Presidio’s, EQVR’s and EQV’s expectations with respect to future performance, the timing and amount of any dividend payments; the ability to successfully complete acquisitions on attractive terms, or at all, the capitalization of EQV or Pubco after giving effect to the proposed Business Combination and expectations with respect to the future performance and the success of Pubco following the consummation of the proposed Business Combination. These statements are based on various assumptions, whether or not identified in this press release, and on the current expectations of Pubco’s, Presidio’s, EQVR’s and EQV’s management and are not predictions of actual performance. These forward-looking statements are provided for illustrative purposes only and are not intended to serve as, and must not be relied upon by any investors as, a guarantee, an assurance, a prediction or a definitive statement of fact or probability. Actual events and circumstances are difficult or impossible to predict and will differ from assumptions. Many actual events and circumstances are beyond the control of Pubco, Presidio, EQVR and EQV. These forward-looking statements are subject to a number of risks and uncertainties, including changes in business, market, financial, political and legal conditions; benefits from hedges and expected production; the inability of the parties to successfully or timely consummate the proposed Business Combination, including the risk that any regulatory approvals are not obtained, are delayed or are subject to unanticipated conditions that could adversely affect Pubco or the expected benefits of the proposed Business Combination; failure to realize the anticipated benefits of the proposed Business Combination, which may be affected by, among other things, competition, the ability of Pubco to grow and manage growth profitably, maintain key relationships and retain its management and key employees; risks related to the uncertainty of the projected financial information with respect to Presidio or Pubco; risks related to Presidio’s current growth strategy; the occurrence of any event, change or other circumstances that could give rise to the termination of any definitive agreements with respect to the proposed Business Combination; the outcome of any legal proceedings that may be instituted against any of the parties to the potential Business Combination following its announcement and any definitive agreements with respect thereto; changes to the proposed structure of the proposed Business Combination that may be required or appropriate as a result of applicable laws or regulations or as a condition to obtaining regulatory approval of the proposed Business Combination; risks that Presidio or Pubco may not achieve their expectations; the ability to meet stock exchange listing standards following the proposed Business Combination; the risk that the proposed Business Combination disrupts the current plans and operations of Presidio; costs related to the potential Business Combination; changes in laws and regulations; risks related to the domestication of EQV as a Delaware corporation; risks related to Pubco’s ability to pay expected dividends; the extent of participation in rollover agreements; the amount of redemption requests made by EQV’s public equity holders; and the ability of EQV or Pubco to issue equity or equity-linked securities or issue debt securities or enter into debt financing arrangements in connection with the proposed Business Combination or in the future. Additional information concerning these and other factors that may impact such forward-looking statements can be found in filings and potential filings by Presidio, EQV, EQVR or Pubco resulting from the proposed Business Combination with the SEC, including under the heading “Risk Factors” in the Registration Statement on Form S-4 filed by Presidio, EQVR and Presidio. If any of these risks materialize or any assumptions prove incorrect, actual results could differ materially from the results implied by these forward-looking statements. There may be additional risks that none of Pubco, Presidio, EQVR nor EQV presently know or that Pubco, Presidio, EQVR or EQV currently believe are immaterial that could also cause actual results to differ from those contained in the forward-looking statements. These forward-looking statements are provided for illustrative purposes only and are not intended to serve as and must not be relied on by investors as a guarantee, an assurance, a prediction or a definitive statement of fact or probability.</p> <p align=\"justify\">In addition, forward-looking statements reﬂect Pubco’s, Presidio’s, EQVR’s and EQV’s expectations, plans or forecasts of future events and views as of the date they are made. Pubco, Presidio, EQVR and EQV anticipate that subsequent events and developments will cause Pubco’s, Presidio’s, EQVR’s and EQV’s assessments to change. However, while Pubco, Presidio, EQVR and EQV may elect to update these forward-looking statements at some point in the future, Pubco, Presidio, EQVR and EQV specifically disclaim any obligation to do so, except as required by law. These forward-looking statements should not be relied upon as representing Pubco’s, Presidio’s, EQVR’s or EQV’s assessments as of any date subsequent to the date they are made. Accordingly, undue reliance should not be placed upon the forward-looking statements. None of Pubco, Presidio, EQVR or EQV, or any of their respective affiliates have any obligation to update these forward-looking statements other than as required by law.</p> <p><b>No Offer or Solicitation</b></p> <p align=\"justify\">This press release shall not constitute a solicitation of any proxy, vote, consent or approval in any jurisdiction in connection with the proposed Business Combination and shall not constitute an offer to sell or a solicitation of an offer to buy the securities of EQV, PIH, EQVR or Pubco, nor shall there be any sale of any such securities in any state or jurisdiction in which such offer, solicitation, or sale would be unlawful prior to registration or qualification under the securities laws of such state or jurisdiction. No offer of securities shall be made except by means of a prospectus meeting the requirements of the Securities Act of 1933, as amended. This press release is restricted by law; it is not intended for distribution to, or use by any person in, any jurisdiction in where such distribution or use would be contrary to local law or regulation.</p> <p><b>Presidio Media and Investor Contact</b>:</p> <p><a href=\"https://www.globenewswire.com/Tracker?data=_s6R5sLbRhBEeA5U1YX1sGex4e9P9tKRuqED31rFUj-RVQcKVgq6UTWJ_qJbVoe81h9bvrlhjkKPt-iZ_lLzPfrq9mjqbxvETqHU7ZnJzPQ=\" rel=\"nofollow noopener\" target=\"_blank\">Presidio@icrinc.com</a></p> <p><b>For EQV:</b></p> <p><a href=\"https://www.globenewswire.com/Tracker?data=1rLNCs4Ui4AgeGVRH9f5INV2vlumhGY3xFkton8LaFWhTvgz27eWmGIzmmxp9AqH2WAs2Y6DcNINiq0mWyS9Wcymg8HlSkcRxgJrRS06i2k=\" rel=\"nofollow noopener\" target=\"_blank\">IR@eqvventures.com</a> </p> <p>Source: EQV Ventures Acquisition Corp.</p> <img alt=\"\" class=\"__GNW8366DE3E__IMG\" loading=\"lazy\" src=\"https://www.globenewswire.com/newsroom/ti?nf=OTY2MzMwMiM3NDYwNDk3IzUwMDEyNjg5Mw==\"/> <br/><img alt=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\" src=\"https://ml.globenewswire.com/media/OWIyNWY5ZDctZmUwMi00ZmVkLTk1YmMtODM4M2UwZTViN2MyLTUwMDEyNjg5My0yMDI2LTAyLTI4LWVu/tiny/EQV-Ventures-Acquisition-Corp-.png\"/></article>",
            "link": "https://www.stocktitan.net/news/EQV/eqv-ventures-acquisition-corp-shareholders-approve-business-73q92zhv5nmz.html",
            "author": "stocktitan",
            "pub_date": "Sat, 28 Feb 2026 01:00:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S. Food and Drug Administration Approves BioMarin's PALYNZIQ® (pegvaliase-pqpz) for Adolescents 12 Years of Age and Older with Phenylketonuria (PKU) | BMRN Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p class=\"prntac\"><i>Treatment with PALYNZIQ led to statistically significant blood phenylalanine (Phe) lowering compared to diet alone in pivotal Phase 3 PEGASUS study</i></p><p class=\"prntac\"><i>PALYNZIQ is the only enzyme substitution therapy approved for the treatment of people with PKU</i></p><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.ca.sanael\">SAN RAFAEL, Calif.</location></span>, <span class=\"legendSpanClass\">Feb. 27, 2026</span> /PRNewswire/ -- BioMarin Pharmaceutical Inc. (Nasdaq: <a class=\"symbol-link\" href=\"/overview/BMRN/\" title=\"View BMRN stock overview\">BMRN</a>) today announced that the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> Food and Drug Administration (FDA) has approved the company's supplemental Biologics License Application (sBLA) for PALYNZIQ<i><sup>®</sup></i> (pegvaliase-pqpz) to include pediatric patients 12 years of age and older with phenylketonuria (PKU). PALYNZIQ is the only enzyme substitution therapy approved to reduce blood phenylalanine (Phe) concentrations in people with PKU.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\"><p><a href=\"https://mma.prnewswire.com/media/534018/BioMarin_Pharmaceutical_Inc_Logo.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"BioMarin Pharmaceutical logo (PRNewsfoto/BioMarin Pharmaceutical Inc.)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/534018/BioMarin_Pharmaceutical_Inc_Logo.jpg\" title=\"BioMarin Pharmaceutical logo (PRNewsfoto/BioMarin Pharmaceutical Inc.)\"/></a></p></div><p>\"Adolescence is a period of increasing independence and academic demands, and represents a particularly challenging time for individuals with PKU. The ultra-restrictive diet required for PKU management may become unsustainable, and poor blood Phe control leads to adverse neurocognitive outcomes. PALYNZIQ is the only genotype-independent medication which may bring Phe into the normal range while allowing an unrestricted diet,\" said Stephanie Sacharow, M.D., Director, Dr. Harvey Levy Program for PKU and Related Conditions, Boston Children's Hospital. \"In my clinic we have found that PALYNZIQ treatment adherence is even more successful in teens under age 18, while they are living at home with family support, and this approval allows us to extend this therapeutic option to adolescents who may benefit most.\" </p><p>The FDA approval is based on data from PEGASUS, a Phase 3 multi-center open-label randomized controlled study evaluating the safety and efficacy of PALYNZIQ compared to diet alone in adolescents aged 12 to &lt;18 with PKU who had uncontrolled blood Phe concentrations greater than 600 µmol/L on existing management. Individuals in the PALYNZIQ arm showed a significant mean reduction from baseline in blood Phe levels at Week 72 compared to those in the diet only arm (Table 1).</p><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen2\" colspan=\"3\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Table 1: Change from Baseline in Blood Phe Level (by μmol/L) Among Randomized <br/>Participants in PEGASUS</b></span></p></td></tr><tr><td class=\"prnpr2 prnpl2 prnvab prncbts prnbrbrs prnbbbs prnbsbls\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Study Visit</b></span></p></td><td class=\"prnpr2 prnpl2 prnvab prntac prncbts prnrbrb1 prnbbbs prnsblb1\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>PALYNZIQ</b></span></p></td><td class=\"prnpr2 prnpl2 prnvab prntac prncbts prnbrbrs prnbbbs prnsblb1\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Diet Only</b></span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Baseline</b></span></p></td><td class=\"prngen7\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">N = 36</span></p></td><td class=\"prngen8\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">N = 19</span></p></td></tr><tr><td class=\"prngen9\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">  Mean (standard deviation [SD])</span></p></td><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1025 (254)</span></p></td><td class=\"prngen10\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1029 (199)</span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Week 72</b></span></p></td><td class=\"prngen7\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">N = 32</span></p></td><td class=\"prngen8\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">N = 17</span></p></td></tr><tr><td class=\"prngen9\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">     Mean (SD)</span></p></td><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">567 (396)</span></p></td><td class=\"prngen10\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">973 (234)</span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Mean (SD; min, max) Change at Week 72 </b></span></p></td><td class=\"prngen7\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml8\"><span class=\"prnews_span\">-473 (285; -22, -1133)</span></p></td><td class=\"prngen8\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml8\"><span class=\"prnews_span\">-19 (249; 355, -634) </span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">  Treatment Difference (<percent>95%</percent> CI)</span></p></td><td class=\"prngen8\" colspan=\"2\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">-409 (-579, -240)</span></p></td></tr><tr><td class=\"prnpr2 prnpl2 prnvab prntar prnsbtb1 prnbrbrs prnbbbs prnbsbls\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen10\" colspan=\"2\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td></tr></table></div><p>\"Today's FDA approval for PALYNZIQ is an important step forward for the PKU community, providing a new option for adolescents ages 12 and older that has the potential to improve daily PKU management,\" said Catherine Warren, Executive Director of the National PKU Alliance. \"Adolescence is a time of major change for people living with PKU, and having PALYNZIQ available better sets teenagers up for success with managing their blood phenylalanine levels as they navigate the transition into adulthood.\"</p><p>As was recently presented at the 15th International Congress of Inborn Errors of Metabolism, by the end of Part 1 almost half of participants (<percent>44.4%</percent>) reached levels below guideline recommendations. Of those individuals, <percent>75%</percent> were below 120 µmol/L and their average Phe reduction was 828 µmol/L (<percent>94%</percent> reduction in blood Phe from baseline). Nine participants whose blood Phe levels were below 30 µmol/L (hypophenylalaninemia) were able to increase their intact protein intake by <percent>318.1%</percent> from baseline (SD=195.4; min=1.42, max=542.5) and decrease their intake of medical food protein by <percent>55.16%</percent> (SD=56.4; min=-100, max=60.3); six individuals discontinued medical food completely.</p><p>The most common adverse reactions (≥<percent>20%</percent>) with PALYNZIQ in adolescents were injection site reactions, arthralgia, headache, pyrexia, hypersensitivity reactions, dizziness, nausea, vomiting, fatigue and pain in extremity. As in previous clinical studies, the overall safety profile of PALYNZIQ observed in adolescents showed most reactions occurring in the induction/titration phase and decreasing in frequency during the maintenance phase.</p><p>\"Over the past two decades, BioMarin has been working hand-in-hand with the medical and advocacy communities to improve the lives of people living with PKU, including introduction of the first two treatment options for this inherited metabolic condition that otherwise requires lifelong adherence to a rigid medical diet,\" said Greg Friberg, M.D., Executive Vice President and Chief Research &amp; Development Officer at BioMarin. \"We are proud to build on this legacy by expanding PALYNZIQ's approval to adolescents as young as age 12, which will allow even more people with PKU the prospect of achieving substantially lower Phe levels.\"</p><p>The company is also seeking approval from the European Medicines Agency with the goal of expanding treatment with PALYNZIQ to include adolescents as young as age 12 in the European Union.</p><p>Dr. Stephanie Sacharow has participated in speaking engagements and served on advisory boards for BioMarin.</p><p><b>About PALYNZIQ</b></p><p>PALYNZIQ substitutes the deficient phenylalanine hydroxylase (PAH) enzyme in PKU with a PEGylated version of the enzyme phenylalanine ammonia lyase to break down Phe. PALYNZIQ is administered using a dosing regimen designed to facilitate tolerability; PALYNZIQ's safety profile consists primarily of immune-mediated responses, which can include anaphylaxis, for which robust risk management measures effective in clinical trials are in place.</p><p>See the full Prescribing Information, which includes a Boxed Warning. PALYNZIQ is available only through a restricted program under a Risk Evaluation and Mitigation Strategy (REMS) called the PALYNZIQ REMS, because of the risk of anaphylaxis. Further information, including a list of qualified pharmacies, is available at <u><a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627317-1&amp;h=2353549735&amp;u=http%3A%2F%2Fwww.palynziqrems.com%2F&amp;a=www.PALYNZIQREMS.com\" rel=\"nofollow noopener\" target=\"_blank\">www.PALYNZIQREMS.com</a></u> or by telephone 1-855-758-REMS (1-855-758-7367).</p><p>PALYNZIQ is approved for the treatment of PKU in more than 35 countries worldwide.</p><p><b>Patient Support Accessing PALYNZIQ</b></p><p>To reach a BioMarin RareConnections<sup>®</sup> Case Manager, please call, toll-free, 1-866-906-6100 or e-mail <u><a href=\"mailto:support@biomarin-rareconnections.com\" rel=\"nofollow noopener\" target=\"_blank\">support@biomarin-rareconnections.com</a></u>. For more information about PALYNZIQ, please visit <u><a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627317-1&amp;h=230086488&amp;u=https%3A%2F%2Fc212.net%2Fc%2Flink%2F%3Ft%3D0%26l%3Den%26o%3D2942468-1%26h%3D827540919%26u%3Dhttp%253A%252F%252Fwww.palynziq.com%252F%26a%3Dwww.palynziq.com&amp;a=www.palynziq.com\" rel=\"nofollow noopener\" target=\"_blank\">www.palynziq.com</a></u>. For additional information regarding this product, please contact BioMarin Medical Information at <u><a href=\"mailto:medinfo@bmrn.com\" rel=\"nofollow noopener\" target=\"_blank\">medinfo@bmrn.com</a></u>.</p><p><b>About Phenylketonuria</b></p><p>PKU, or phenylalanine hydroxylase (PAH) deficiency, is a genetic condition affecting approximately 70,000 people in the regions of the world where BioMarin operates. The PAH enzyme is required for the metabolism of Phe, an essential amino acid found in most protein-containing foods. If functional enzyme is not present in sufficient quantities, Phe accumulates to abnormally high levels in the blood and becomes toxic to the brain, resulting in a variety of complications including severe intellectual disability, seizures, tremors, behavioral problems and psychiatric symptoms.</p><p>As a result of newborn screening efforts implemented in the 1960s and early 1970s, virtually all individuals with PKU born after this period in countries with newborn screening programs are diagnosed at birth and treatment is implemented soon after.</p><p>PKU can be managed with a severe Phe-restricted diet, supplemented by low-protein modified foods and Phe-free medical foods; however, it is difficult for most individuals to adhere to this strict diet to the extent needed to achieve adequate control of blood Phe levels. Dietary control of Phe in childhood can prevent major developmental issues and neurological consequences, but poor Phe control in adolescence and adulthood is associated with a range of neuropsychological deficits and functional impairment.</p><p><b>PALYNZIQ <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> Indication and Important Safety Information</b></p><p>PALYNZIQ<sup>®</sup> (pegvaliase-pqpz) is a phenylalanine (Phe)-metabolizing enzyme indicated to reduce blood Phe concentrations in adult and pediatric patients 12 years of age and older with phenylketonuria (PKU) who have uncontrolled blood Phe concentrations greater than 600 micromol/L (10 mg/dL) on existing management.</p><p><b>BOXED WARNING: ANAPHYLAXIS</b></p><ul type=\"disc\"><li>Anaphylaxis has been reported after administration of PALYNZIQ and may occur at any time during treatment.</li><li>Administer the initial dose of PALYNZIQ under the supervision of a healthcare provider equipped to manage anaphylaxis, and closely observe patients for at least 60 minutes following injection. Prior to self-injection, confirm patient's and observer's (if applicable) ability to recognize signs and symptoms of anaphylaxis and to administer epinephrine, if needed.</li><li>Consider having an adult observer for patients who may need assistance in recognizing and managing anaphylaxis during PALYNZIQ treatment. If an adult observer is needed, the observer should be present during and for at least 60 minutes after PALYNZIQ administration, should be able to administer epinephrine, and call for emergency medical support upon its use.</li><li>Prescribe epinephrine for all patients treated with PALYNZIQ. Prior to the first dose, instruct the patient and observer (if applicable) on its appropriate use. Instruct the patient to seek immediate medical care upon its use. Instruct patients to carry epinephrine with them at all times during PALYNZIQ treatment.</li><li>PALYNZIQ is available only through a restricted program called PALYNZIQ REMS (Risk Evaluation and Mitigation Strategy). Further information, including a list of qualified pharmacies, is available at <u><a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627317-1&amp;h=2013208726&amp;u=https%3A%2F%2Fc212.net%2Fc%2Flink%2F%3Ft%3D0%26l%3Den%26o%3D2942468-1%26h%3D2581340187%26u%3Dhttp%253A%252F%252Fwww.palynziqrems.com%252F%26a%3Dwww.PALYNZIQREMS.com&amp;a=PALYNZIQREMS.com\" rel=\"nofollow noopener\" target=\"_blank\">PALYNZIQREMS.com</a></u> or by telephone at 1-855-758-REMS (1-855-758-7367).</li></ul><p><b>WARNINGS AND PRECAUTIONS</b></p><p><b>Anaphylaxis</b></p><ul type=\"disc\"><li>Signs and symptoms of anaphylaxis reported include syncope, hypotension, hypoxia, dyspnea, wheezing, chest discomfort/chest tightness, tachycardia, angioedema (swelling of face, lips, eyes, tongue), throat swelling or tightness, flushed or red skin, rash, urticaria, pruritus, and gastrointestinal symptoms (vomiting, nausea, diarrhea).</li><li>Anaphylaxis generally occurred within 1 hour after injection; however, delayed episodes occurred up to 48 hours after PALYNZIQ administration.</li><li>Consider the risks and benefits of readministering PALYNZIQ following an episode of anaphylaxis. If the decision is made to readminister PALYNZIQ, administer the first dose under the supervision of a healthcare provider equipped to manage anaphylaxis and closely observe the patient for at least 60 minutes following the dose.</li><li>In clinical trials of primarily adult patients with an induction/titration/maintenance dosage regimen, 29/285 (<percent>10%</percent>) experienced a total of 42 anaphylaxis episodes.</li><li>In a clinical trial of patients 12 to less than 18 years of age, 4/36 (<percent>11%</percent>) of PALYNZIQ-treated patients experienced 1 episode of anaphylaxis.</li></ul><p><b>Other Hypersensitivity Reactions</b></p><ul type=\"disc\"><li>Management of hypersensitivity reactions should be based on the severity of the reaction, recurrence of the reaction, and the clinical judgment of the healthcare provider.</li><li>In clinical trials of primarily adult patients taking PALYNZIQ, hypersensitivity reactions, other than anaphylaxis, were reported in 204/285 (<percent>72%</percent>) of patients. In a clinical trial of patients 12 to less than 18 years old taking PALYNZIQ, these reactions were reported in 12 out of 36 (<percent>33%</percent>) of patients.</li></ul><p><b>Injection Site Infections</b></p><ul type=\"disc\"><li>Serious injection site infections including abscess, cellulitis, necrosis, and ulcer have been reported. Some cases required hospitalization, surgical debridement, intravenous antibiotics, and discontinuation of PALYNZIQ.</li><li>Provide proper training to patients and/or caregivers on the use of aseptic injection technique, injection site rotation and to check the site for redness, swelling, or tenderness. Instruct patients to contact their healthcare provider if signs or symptoms of an infection develop, persist, or worsen.</li></ul><p><b>Hypophenylalaninemia (HypoPhe)<br/></b>Some patients have experienced HypoPhe; monitor blood Phe levels periodically during treatment. Frequent blood Phe monitoring is recommended in the pediatric population. For blood Phe concentrations below 30 micromol/L, the dosage of PALYNZIQ may be reduced and/or dietary protein and Phe intake may be modified to maintain blood Phe concentrations within a clinically acceptable range and above 30 micromol/L.</p><p><b>ADVERSE REACTIONS<br/></b>The most common adverse reactions in clinical trials of primarily adult patients (at least <percent>20%</percent> in either treatment phase) were injection site reactions, arthralgia, hypersensitivity reactions, headache, generalized skin reactions lasting at least 14 days, nausea, abdominal pain, vomiting, cough, oropharyngeal pain, pruritus, diarrhea, nasal congestion, fatigue, dizziness, and anxiety.</p><ul type=\"disc\"><li><b>Arthralgia</b>: In clinical trials, 245 out of 285 (<percent>86%</percent>) primarily adult patients experienced episodes consistent with arthralgia (includes back pain, musculoskeletal pain, pain in extremity, and neck pain).</li><li><b>Injection site</b> <b>reactions</b> were reported as early as after the first dose of PALYNZIQ and occurred at any time during treatment.</li><li><b>Generalized Skin Reactions</b>: In clinical trials, 134 out of 285 (<percent>47%</percent>) primarily adult patients treated with PALYNZIQ experienced generalized skin reactions (not limited to the injection site) lasting at least 14 days.</li><li><b>Angioedema and serum sickness</b>: In clinical trials, 22 out of 285 (<percent>8%</percent>) primarily adult patients experienced 45 episodes of angioedema (symptoms included: pharyngeal edema, swollen tongue, lip swelling, mouth swelling, eyelid edema, and face edema) occurring independent of anaphylaxis. In clinical trials, serum sickness was reported in 7 out of 285 (<percent>2%</percent>) primarily adult patients.</li></ul><p>In the clinical trials, adverse reactions were associated with treatment discontinuation, dosage reduction and temporary drug interruption. In the 285 primarily adult patients exposed to PALYNZIQ in an induction/titration/maintenance regimen in clinical trials, 44 (<percent>15%</percent>) patients discontinued treatment due to adverse reactions.</p><p>Pediatric Patients: In a clinical study of 55 patients aged 12 to less than 18 years of age, the most common adverse reactions (at least <percent>20%</percent> and greater than in control) were injection site reactions, arthralgia, headache, pyrexia, hypersensitivity reactions, dizziness, nausea, vomiting, fatigue, and pain in extremity. Two patients (<percent>5.6%</percent>) discontinued treatment due to adverse reactions.</p><p><b>Blood Phenylalanine Monitoring and Diet</b></p><ul type=\"disc\"><li>Obtain blood Phe concentrations every 4 weeks until a maintenance dosage is established. Periodically monitor blood Phe concentrations during maintenance therapy.</li><li>Counsel patients to monitor dietary protein and Phe intake, and adjust as directed by their healthcare provider.</li></ul><p><b>DRUG INTERACTIONS</b></p><p><b>Effect of PALYNZIQ on Other PEGylated Products</b></p><ul type=\"disc\"><li>In a single-dose study of PALYNZIQ in adult patients with PKU, two patients receiving concomitant injections of medroxyprogesterone acetate suspension (a formulation containing PEG 3350) experienced a hypersensitivity reaction. One of the two patients experienced anaphylaxis</li><li>The clinical effects of concomitant treatment with different PEGylated products are unknown. Monitor patients treated with PALYNZIQ and concomitantly with other PEGylated products for hypersensitivity reactions including anaphylaxis</li></ul><p><b>USE IN SPECIFIC POPULATIONS</b></p><p><b>Pregnancy and Lactation<br/></b>Available data do not establish an increased risk of adverse developmental outcomes to the fetus exposed to PALYNZIQ.</p><ul type=\"disc\"><li>Advise women who are exposed to PALYNZIQ during pregnancy or who become pregnant within one month following the last dose of PALYNZIQ that there is a pregnancy surveillance program that monitors pregnancy outcomes. Healthcare providers should report PALYNZIQ exposure and encourage these patients to report their pregnancy to BioMarin (1-866-906-6100).</li><li>Monitor blood Phe levels in breastfeeding women treated with PALYNZIQ to ensure maintenance of blood Phe &lt;360 micromol/L. Adjust dosage and/or dietary protein and Phe intake as needed to avoid concentrations below 30 micromol/L.</li></ul><p><b>Pediatric &amp; Geriatric Use: </b>The safety and effectiveness of PALYNZIQ in pediatric patients from birth to less than 12 years have not been established. Clinical studies of PALYNZIQ did not include patients aged 65 years and older.</p><p><b>You are encouraged to report suspected adverse reactions to BioMarin at 1-866-906-6100, or to the FDA at 1-800-FDA-1088 or <u><a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627317-1&amp;h=2923164849&amp;u=https%3A%2F%2Fc212.net%2Fc%2Flink%2F%3Ft%3D0%26l%3Den%26o%3D2942468-1%26h%3D1583590525%26u%3Dhttps%253A%252F%252Fwww.fda.gov%252Fmedwatch%26a%3Dwww.fda.gov%252Fmedwatch&amp;a=www.fda.gov%2Fmedwatch\" rel=\"nofollow noopener\" target=\"_blank\">www.fda.gov/medwatch</a></u>.</b></p><p><b>Please see accompanying full <u><a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627317-1&amp;h=961560467&amp;u=https%3A%2F%2Fwww.biomarin.com%2Fwp-content%2Fuploads%2F2026%2F02%2FPalynziq-prescribing-Information_Feb-2026.pdf&amp;a=Prescribing+Information\" rel=\"nofollow noopener\" target=\"_blank\">Prescribing Information</a></u>, including Boxed Warning.</b></p><p><b>About BioMarin</b></p><p>BioMarin is a leading, global rare disease biotechnology company focused on delivering medicines for people living with genetically defined conditions. Founded in 1997, the San Rafael, <location idsrc=\"xmltag.org\" value=\"LS/us.ca\">California</location>-based company has a proven track record of innovation, with eight commercial therapies and a strong clinical and preclinical pipeline. Using a distinctive approach to drug discovery and development, BioMarin seeks to unleash the full potential of genetic science by pursuing category-defining medicines that have a profound impact on patients. To learn more, please visit <u><a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627317-1&amp;h=632710631&amp;u=http%3A%2F%2Fwww.biomarin.com%2F&amp;a=www.biomarin.com\" rel=\"nofollow noopener\" target=\"_blank\">www.biomarin.com</a></u>.</p><p><b>Forward-Looking Statements</b></p><p>This press release contains forward-looking statements about the business prospects of BioMarin Pharmaceutical Inc. (BioMarin), including without limitation, statements about: the approval of BioMarin's supplemental Biologics License Application (sBLA) for PALYNZIQ for adolescents 12 years of age and older with phenylketonuria (PKU) by the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> Food and Drug Administration (FDA), including the safety profile and potential benefits of PALYNZIQ for adolescents and the potential to fundamentally change the way adolescents manage PKU in their daily lives; BioMarin's work with the European Medicines Agency (EMA) with the goal of expanding treatment with PALYNZIQ to include adolescents as young as age 12 in the European Union; and the continued clinical development of PALYNZIQ. These forward-looking statements are predictions and involve risks and uncertainties such that actual results may differ materially from these statements. These risks and uncertainties include, among others, results and timing of current and planned preclinical studies and clinical trials of PALYNZIQ; any potential adverse events observed in the continuing monitoring of the patients in the clinical trials; the content and timing of decisions by the FDA, the EMA, the European Commission and other regulatory authorities, and those factors detailed in BioMarin's filings with the Securities and Exchange Commission (SEC), including, without limitation, the factors contained under the caption \"Risk Factors\" in BioMarin's Annual Report on Form 10-K for the year ended December 31, 2025, as such factors may be updated by any subsequent filings with the SEC. Investors are urged not to place undue reliance on forward-looking statements, which speak only as of the date hereof. BioMarin is under no obligation, and expressly disclaims any obligation to update or alter any forward-looking statement, whether as a result of new information, future events or otherwise.</p><p>BioMarin<sup>®</sup>, BioMarin RareConnections<sup>®</sup> and PALYNZIQ<sup>®</sup> are registered trademarks of BioMarin Pharmaceutical Inc.</p><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Contacts:</b></span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Investors                                                                                             </span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Media</span></p></td></tr><tr><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><i>Traci McCarty</i></span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><i>Katherine Powell</i></span></p></td></tr><tr><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><i>BioMarin Pharmaceutical Inc.</i>                                                            </span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><i>BioMarin Pharmaceutical Inc.</i></span></p></td></tr><tr><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><i>(415) 455-7558</i>                                                                                    </span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><i>(415) 827-2968</i></span></p></td></tr></table></div><p>SOURCE BioMarin Pharmaceutical Inc.</p></div></article>",
            "link": "https://www.stocktitan.net/news/BMRN/u-s-food-and-drug-administration-approves-bio-marin-s-palynziq-5n54a1o6i7mm.html",
            "author": "stocktitan",
            "pub_date": "Sat, 28 Feb 2026 01:00:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "The Cannabist Company Further Extends Forbearance Agreement With Senior Noteholders | CBSTF Stock News",
            "description": "<article class=\"article\"><p> <location idsrc=\"xmltag.org\" value=\"LU/us.ma.chelms\">CHELMSFORD, Mass.</location>--(BUSINESS WIRE)--The Cannabist Company Holdings Inc. (Cboe CA: CBST) (OTCQB: <a class=\"symbol-link\" href=\"/overview/CBSTF/\" title=\"View CBSTF stock overview\">CBSTF</a>) (“The Cannabist Company” or the “Company”), one of the most experienced cultivators, manufacturers, and retailers of cannabis products in <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location>, today announced that the ad hoc group of noteholders of the Company’s <percent>9.25%</percent> Senior Secured Notes due December 31, 2028 and the <percent>9.00%</percent> Senior Secured Convertible Notes due December 31, 2028 (collectively, the “Notes”), which are parties to the previously announced forbearance agreement with the Company, have agreed to a further extension and to forbear from exercising any of their rights and remedies under the amended and restated indenture, as supplemented, governing the Notes and applicable law, until March 6, 2026.</p><p><b>About The Cannabist Company (f/k/a Columbia Care)</b></p><p>The Cannabist Company, formerly known as Columbia Care, is one of the most experienced cultivators, manufacturers and providers of cannabis products and related services, with licenses in 11 U.S. jurisdictions. The Company operates 69 facilities including 54 dispensaries and 15 cultivation and manufacturing facilities, including those under development. Columbia Care, now The Cannabist Company, is one of the original multi-state providers of cannabis in the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> and now delivers industry-leading products and services to both the medical and adult-use markets. In 2021, the Company launched Cannabist, its retail brand, creating a national dispensary network that leverages proprietary technology platforms. The Company offers products spanning flower, edibles, oils and tablets, and manufactures popular brands including dreamt, Seed &amp; Strain, Triple Seven, Hedy, gLeaf, Classix, Press, and Amber. For more information, please visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.cannabistcompany.com&amp;esheet=54435750&amp;newsitemid=20260227334210&amp;lan=en-US&amp;anchor=www.cannabistcompany.com&amp;index=1&amp;md5=1383c55af2835bf4f7bd82dffe40ce47\" rel=\"nofollow noopener\" shape=\"rect\">www.cannabistcompany.com</a>.</p><p><b>Forward Looking Statements</b></p><p>This press release contains “forward-looking statements” within the meaning of the safe harbor provisions of the United States Private Securities Litigation Reform Act of 1995 and corresponding Canadian securities laws. Such forward-looking statements are not representative of historical facts or information or current condition, but instead represent only the Company’s beliefs regarding use of proceeds, future events, plans, strategies, or objectives, many of which, by their nature, are inherently uncertain and outside of the Company’s control. Generally, such forward-looking statements can be identified by the use of forward-looking terminology such as “plans”, “expects” or “does not expect”, “is expected”, “future”, “scheduled”, “estimates”, “forecasts”, “projects,” “intends”, “anticipates” or “does not anticipate”, or “believes”, or variations of such words and phrases, or may contain statements that certain actions, events or results “may”, “could”, “would”, “might” or “will be taken”, “will continue”, “will occur” or “will be achieved”. Forward-looking statements involve and are subject to assumptions and known and unknown risks, uncertainties, and other factors which may cause actual events, results, performance, or achievements of the Company to be materially different from future events, results, performance, and achievements expressed or implied by forward-looking statements herein, as well as the risk factors described in the Company’s annual report on Form 10-K for the year ended December 31, 2024, its quarterly report on Form 10-Q for the quarter ended September 30, 2025, and any subsequent quarterly reports on Form 10-Q, in each case, filed with the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> Securities and Exchange Commission at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.sec.gov&amp;esheet=54435750&amp;newsitemid=20260227334210&amp;lan=en-US&amp;anchor=www.sec.gov&amp;index=2&amp;md5=d0ea759206d3b61e7b60e81fdfc20895\" rel=\"nofollow noopener\" shape=\"rect\">www.sec.gov</a> and in <location idsrc=\"xmltag.org\" value=\"LC/ca\">Canada</location> on SEDAR+, available at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.sedarplus.ca&amp;esheet=54435750&amp;newsitemid=20260227334210&amp;lan=en-US&amp;anchor=www.sedarplus.ca&amp;index=3&amp;md5=5f03256e717277b5342497d9e9995b3e\" rel=\"nofollow noopener\" shape=\"rect\">www.sedarplus.ca</a>. The forward-looking statements contained in this press release are made as of the date of this press release, and the Company does not undertake to update any forward-looking information or forward-looking statements that are contained or referenced herein, except as may be required in accordance with applicable securities laws. All subsequent written and oral forward-looking information and statements attributable to the Company or persons acting on its behalf is expressly qualified in its entirety by this notice regarding forward-looking information and statements.</p><p><img alt=\"\" loading=\"lazy\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260227334210r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\"/><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20260227334210/en/\" rel=\"nofollow noopener\">https://www.businesswire.com/news/home/20260227334210/en/</a></span></p><p><b>Investor &amp; Media Contact</b><br/>Lee Ann Evans<br/>SVP, Capital Markets &amp; Communications<br/><a href=\"mailto:investor@cannabistcompany.com\" rel=\"nofollow noopener\" shape=\"rect\">investor@cannabistcompany.com</a></p><p>Source: The Cannabist Company Holdings Inc.</p></article>",
            "link": "https://www.stocktitan.net/news/CBSTF/the-cannabist-company-further-extends-forbearance-agreement-with-1yaq03g6a5qh.html",
            "author": "stocktitan",
            "pub_date": "Sat, 28 Feb 2026 01:51:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Secretary of War Pete Hegseth Visits L3Harris Solid Rocket Motor Site | LHX Stock News",
            "description": "<article class=\"article\"><p> <location idsrc=\"xmltag.org\" value=\"LU/us.ar.camden\">CAMDEN, Ark.</location>--(BUSINESS WIRE)--Secretary of War Pete Hegseth visited the L3Harris Technologies (NYSE: <a class=\"symbol-link\" href=\"/overview/LHX/\" title=\"View LHX stock overview\">LHX</a>) <location idsrc=\"xmltag.org\" value=\"LU/us.ar.camden\">Camden</location> site today as part of his nationwide “Arsenal of Freedom” tour, highlighting the importance of American manufacturing capacity in strengthening the defense industrial base and supporting <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> and allied warfighters.</p><div id=\"bwbodyimg\" style=\"width: 480px; float:left; padding-left:0px; padding-right:20px; padding-top:0px; padding-bottom:0px;\"><img alt=\"Secretary of War Pete Hegseth addresses a crowd of approximately 1,500 L3Harris employees in Camden, Arkansas, as part of his “Arsenal of Freedom” tour.\" loading=\"lazy\" src=\"https://mms.businesswire.com/media/20260227797011/en/2733957/4/SecWar_Camden_Visit_for_Business_Wire.jpg\"/><p style=\"font-size:85%;\">Secretary of War Pete Hegseth addresses a crowd of approximately 1,500 L3Harris employees in <location idsrc=\"xmltag.org\" value=\"LU/us.ar.camden\">Camden, Arkansas</location>, as part of his “Arsenal of Freedom” tour.</p></div><p>Secretary Hegseth toured several of the site’s solid rocket motor production facilities and spoke with the 1,500 employees who design, build and deliver propulsion systems for critical missile programs. L3Harris is investing billions of dollars into modernizing and expanding its sites across the nation to significantly increase solid rocket motor production, including for Munitions Acceleration Council programs.</p><p>“Thank you for being the backbone of our department and our great nation, for having the backs of our warfighters because what you build right here in <location idsrc=\"xmltag.org\" value=\"LU/us.ar.camden\">Camden</location> is absolutely central to the 21st Century Arsenal of Freedom,” Secretary Hegseth said. “You are the patriots ensuring that our warriors are never, ever in a fair fight. The more than 115,000 solid rocket motors that you’re building every single year can’t be matched.”</p><p>“Industrial capacity has become a strategic element of deterrence; the ability to deliver at scale, with speed and reliability, directly impacts how effectively <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location> can deter threats and project peace through strength,” said Christopher Kubasik, Chairman and CEO, L3Harris. “Thank you, Secretary Hegseth, for reinforcing to our <location idsrc=\"xmltag.org\" value=\"LU/us.ar.camden\">Camden</location> team that what L3Harris builds here directly contributes to the safety of our warfighters and our homeland.”</p><p>During the visit, Secretary Hegseth engaged employees who produce the propulsion systems that power the PAC-3 air and missile defense system and met with the teams who manufacture the large solid rocket motors for strategic deterrence, interceptors, hypersonic systems and target missiles. He also reviewed construction progress on the company’s new Arkansas Advanced Propulsion Facilities (AAPF).</p><p>The AAPF facilities are an expansive new campus that will support medium and large solid rocket motor production. The 110-acre campus will include more than 20 new buildings and increase large solid rocket motor manufacturing capacity sixfold. The expansion incorporates advanced manufacturing technologies, automation and digital process controls L3Harris designed to improve safety, efficiency and throughput while providing long-term, domestic surge capacity.</p><p>The <location idsrc=\"xmltag.org\" value=\"LU/us.ar.camden\">Camden</location> site produces thousands of solid rocket motors a year that support a wide range of Department of War programs. L3Harris is investing billions in this competitive market to deliver at the scale and speed the Department of War demands. The company’s 2,000-acre <location idsrc=\"xmltag.org\" value=\"LU/us.ar.camden\">Camden</location> site is one of the nation’s largest solid rocket motor manufacturing centers and has supported national and allied defense missions for more than four decades.</p><p>L3Harris acquired the solid rocket motor business in 2023 and has transformed and grown its production operations to align with the Department of War’s increasing demand for missile programs. L3Harris intends to pursue an initial public offering of the solid rocket motor business in the second half of the year.</p><p><b>About L3Harris Technologies</b></p><p>L3Harris is the Trusted Disruptor in defense tech. With customers’ mission-critical needs always in mind, our employees deliver end-to-end technology solutions connecting the space, air, land, sea and cyber domains in the interest of national security. Visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.l3harris.com%2F&amp;esheet=54435301&amp;newsitemid=20260227797011&amp;lan=en-US&amp;anchor=L3Harris.com&amp;index=1&amp;md5=7865616000cb981852c830a95f457183\" rel=\"nofollow noopener\" shape=\"rect\">L3Harris.com</a> for more information.</p><p><b>Forward-Looking Statements</b></p><p>This press release contains forward-looking statements that reflect management's current expectations, assumptions and estimates of future performance and economic conditions. Such statements are made in reliance upon the safe harbor provisions of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. The company cautions investors that any forward-looking statements are subject to risks and uncertainties that may cause actual results and future trends to differ materially from those matters expressed in or implied by such forward-looking statements. Statements about future investments and expansions are forward-looking and involve risks and uncertainties. L3Harris disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events, or otherwise.</p><p><img alt=\"\" loading=\"lazy\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260227797011r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\"/><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20260227797011/en/\" rel=\"nofollow noopener\">https://www.businesswire.com/news/home/20260227797011/en/</a></span></p><p><i>Media Contacts:</i></p><p><b>Eileen Lainez</b><br/>Missile Solutions<br/><a href=\"mailto:Eileen.Lainez@L3Harris.com\" rel=\"nofollow noopener\" shape=\"rect\">Eileen.Lainez@L3Harris.com</a><br/>571-239-7839</p><p><b>Sara Banda</b><br/>Corporate<br/><a href=\"mailto:Media@L3Harris.com\" rel=\"nofollow noopener\" shape=\"rect\">Media@L3Harris.com</a><br/>321-306-8927</p><p>Source: L3Harris Technologies</p></article>",
            "link": "https://www.stocktitan.net/news/LHX/secretary-of-war-pete-hegseth-visits-l3harris-solid-rocket-motor-i4dquwl5qdcw.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 23:45:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Mission Success: Rocket Lab Launches 2nd Hypersonic Test Mission in Three Months for Defense Innovation Unit | RKLB Stock News",
            "description": "<article class=\"article\"><p align=\"justify\">LONG BEACH, Calif., Feb.  27, 2026  (GLOBE NEWSWIRE) -- Rocket Lab Corporation (Nasdaq: <a class=\"symbol-link\" href=\"/overview/RKLB/\" title=\"View RKLB stock overview\">RKLB</a>) (“Rocket Lab” or “the Company”), a global leader in launch services and space systems, today successfully launched its latest hypersonic test mission on its HASTE rocket for the Department of War’s Defense Innovation Unit (DIU) – supporting a critical national priority to advance hypersonic technology for the United States and its allies.</p> <p align=\"justify\">“That’s Not A Knife” lifted off on February 27 at 7:00 p.m. Eastern (February 28, 00:00 UTC) from Rocket Lab Launch Complex 2 within the Virginia Spaceport Authority’s Mid-Atlantic Regional Spaceport on Wallops Island, Virginia – the second successful launch of a hypersonic test mission for the DIU in three months and 7th HASTE launch overall. The mission deployed DART AE, a scramjet-powered aircraft developed by Australian aerospace engineering firm Hypersonix, into a suborbital hypersonic flight environment at several times the speed of sound. </p> <p align=\"justify\">With <percent>100%</percent> mission success across all HASTE launches, Rocket Lab is helping to shape a new era of hypersonic systems testing with speed and precision, lower costs, and a modern test platform that serves the Department of War’s critical technology priorities. In under two years since its inaugural launch, HASTE has rapidly established itself as a premier commercial test platform for hypersonic systems. By combining Rocket Lab’s unmatched operational speed and cadence with the versatility to support diverse mission profiles within a single test platform, HASTE is driving significant advancements in hypersonic innovation and technology readiness for the nation.</p> <p align=\"justify\">Rocket Lab’s Vice President Global Launch Services, Brian Rogers, says: “This launch is another proud moment for the HASTE team and a great showcase of the important commercial platform it has become for the Department of War. Regular and reliable HASTE launches are helping to accelerate hypersonic readiness for the nation, and we take pride in providing the foundation to a new era of testing of this critical technology to protect the United States space security.”</p> <p align=\"justify\">Hypersonix CEO, Matt Hill, says: “This mission is a major milestone for Hypersonix and our flight test program. Successfully flying DART AE in a real hypersonic environment validates years of disciplined engineering and preparation by our team. Launching aboard Rocket Lab’s HASTE vehicle enabled us to execute the mission with speed and precision. This flight moves us from ground-based validation into true hypersonic operations and brings us closer to delivering reusable hypersonic capability that is operationally relevant for our partners and allies.”</p> <p align=\"justify\">“That’s Not A Knife” is Rocket Lab’s third launch of the year with <percent>100%</percent> mission success and 82nd launch overall, maintaining the global superiority of Rocket Lab’s small-lift launch capabilities across government and commercial missions.</p> <p align=\"justify\"><strong>Rocket Lab Media Contact</strong><br/>Murielle Baker<br/><a href=\"https://www.globenewswire.com/Tracker?data=IRrLrLMJ6f3TjuyIWi_jUkDGA_5j78hoGWW54oe87-2eSUdf7SnUdQQjt0jpI-7VmMuopxMEokAyX7DTLYxHg1SXRUpiblPNmqg8AXfL_V4=\" rel=\"nofollow noopener\" target=\"_blank\">media@rocketlabusa.com</a></p> <p align=\"justify\"><strong>About Rocket Lab</strong><br/>About Rocket Lab Rocket Lab is a leading space company that provides launch services, spacecraft, payloads and satellite components serving commercial, government, and national security markets. Rocket Lab’s Electron rocket is the world’s most frequently launched orbital small rocket; its HASTE rocket provides hypersonic test launch capability for the U.S. government and allied nations; and its Neutron launch vehicle in development will unlock medium launch for constellation deployment, national security and exploration missions. Rocket Lab’s spacecraft and satellite components have enabled more than 1,700 missions spanning commercial, defense and national security missions including GPS, constellations, and exploration missions to the Moon, Mars, and Venus. Rocket Lab is a publicly listed company on the Nasdaq stock exchange (<a class=\"symbol-link\" href=\"/overview/RKLB/\" title=\"View RKLB stock overview\">RKLB</a>). Learn more at <a href=\"https://www.globenewswire.com/Tracker?data=fwJwnvirvQ9OgpVOwA7nFNli7S2EynpCIduQzGoLlbQ1MVQvyEdDiQGyjWkxXL6sulyTreti6EWxPlDwwodMyjCpgfA11nBjOTKlzMXPLoI=\" rel=\"nofollow noopener\" target=\"_blank\">www.rocketlabcorp.com</a>.</p> <p align=\"justify\"><strong>Forward Looking Statements </strong><br/>This press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. We intend such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in Section 27A of the Securities Act of 1933, as amended (the “Securities Act”) and Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). All statements contained in this press release other than statements of historical fact, including, without limitation, statements regarding our launch and space systems operations, launch schedule and window, safe and repeatable access to space, Neutron development, operational expansion and business strategy, are forward-looking statements. The words “believe,” “may,” “will,” “estimate,” “potential,” “continue,” “anticipate,” “intend,” “expect,” “strategy,” “future,” “could,” “would,” “project,” “plan,” “target,” and similar expressions are intended to identify forward-looking statements, though not all forward-looking statements use these words or expressions. These statements are neither promises nor guarantees, but involve known and unknown risks, uncertainties and other important factors that may cause our actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements, including but not limited to the factors, risks and uncertainties included in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024, as such factors may be updated from time to time in our other filings with the Securities and Exchange Commission (the “SEC”), accessible on the SEC’s website at <a href=\"https://www.globenewswire.com/Tracker?data=BguNFiE8MHWipaYnAPRsBmZwNIoV9bCrHl-D4tIl7qGSXNfgoJJ0HM1BntHW0nrOBXzVREmFTvBlDJa-3nL5ATX7Zv0G453C3X74wPYbRWf-Os3kWqms2NhqcsGsOy4GzQKnbePwj0F7QNZpO-x21wuczOp5xqNEIXrVrh91w_bTXldNybtxj3FKsvScwAp7pneGxHEQ59LorxBGwOT-8HOzuXIMJw9eW4v7N_V2-JADuq-OrNR9YjtbDBLj3OdYkY_mhhwKwjxMir_37M7DnA==\" rel=\"nofollow noopener\" target=\"_blank\">www.sec.gov</a> and the Investor Relations section of our website at <a href=\"https://www.globenewswire.com/Tracker?data=j4YcphCRwQZbaXknX2IuBbSHFGQ7Go9xletXzJEjDUZ8TAj0WmAtCLJX7fqxYDCUTVIA40_yvkOFZj_lmuQidv0FZMPyp0__oD8hbedZVPs1Neu-IIhi_MXApzjTczqVjNx4zd2DLkJoXXN-ANlvnw==\" rel=\"nofollow noopener\" target=\"_blank\">https://investors.rocketlabcorp.com</a> which could cause our actual results to differ materially from those indicated by the forward-looking statements made in this press release. Any such forward-looking statements represent management’s estimates as of the date of this press release. While we may elect to update such forward-looking statements at some point in the future, we disclaim any obligation to do so, even if subsequent events cause our views to change.</p> <img alt=\"\" class=\"__GNW8366DE3E__IMG\" loading=\"lazy\" src=\"https://www.globenewswire.com/newsroom/ti?nf=OTY2MzI5OCM3NDYwMDc5IzIyNTc0NDU=\"/> <br/><img alt=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\" src=\"https://ml.globenewswire.com/media/NzBhZjg3NjgtNWJiMC00YWNmLTk3MTctNjRkOWY2NTRmOWVjLTEyNjg5OTQtMjAyNi0wMi0yOC1lbg==/tiny/Rocket-Lab-Corporation.png\"/></article>",
            "link": "https://www.stocktitan.net/news/RKLB/mission-success-rocket-lab-launches-2nd-hypersonic-test-mission-in-uaufsf6l0sxy.html",
            "author": "stocktitan",
            "pub_date": "Sat, 28 Feb 2026 00:40:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Empress Reports 2025 Year End Financial Results | EMPYF Stock News",
            "description": "<article class=\"article\"><p><strong id=\"dateline\">VANCOUVER, BC / <a href=\"https://www.accessnewswire.com/\" rel=\"nofollow noopener\">ACCESS Newswire</a> / February 27, 2026 / </strong>Empress Royalty Corp. (TSXV:EMPR)(OTCQX:EMPYF) (\"<strong>Empress</strong>\" or the \"<strong>Company</strong>\") is pleased to announce its audited financial and operating results for the fiscal year ended December 31, 2025. The Company concluded the year with record-breaking revenue.</p><p><i>\"2025 was a transformational year for Empress, we doubled revenue, generated strong cash flow, and strengthened our balance sheet,\" </i>stated Alexandra Woodyer Sherron<i>, </i>CEO and President of Empress Royalty<i>. \"We executed our strategy with discipline and focus, and our model delivered. With rising production and strong gold and silver prices, we enter 2026 from a position of strength - ready to redeploy capital with precision and continue building durable, value-accretive growth for our shareholders.\"</i></p><p><strong>Key Financial and Operating Highlights for the year ended December 31, 2025</strong></p><ul><li><p>Record Revenue: Empress generated royalty and streaming revenue of US<money>$17.2M</money>, resulting in a gross profit of US<money>$12.1M</money>.</p></li><li><p>Strong Cash Generation: The Company maintained its focus on liquidity, achieving positive operating cash flow of US<money>$3.7M</money>.</p></li><li><p>Substantial Earnings Growth: Empress reported a net income of US<money>$7.4M</money> for the year, representing a significant increase over the US<money>$1.0M</money> reported in fiscal year 2024.</p></li><li><p>Operational Efficiency: Adjusted EBITDA for the full year stood at US<money>$13.9M</money>, reflecting the high-margin nature of the Company's streaming and royalty interests.</p></li></ul><p>These annual results highlight the strength of the Company's portfolio and its commitment to building long-term, sustainable value through selective, high-quality investments.</p><p>The financial statements and accompanying management's discussion and analysis have been filed on <strong>Sedar+ </strong>(<a href=\"https://pr.report/j5hq\" rel=\"nofollow noopener\">www.sedarplus.ca</a>) and are also available on the Company's website at <a href=\"https://pr.report/j5hr\" rel=\"nofollow noopener\">www.empressroyalty.com</a>.</p><p>Empress provides the following guidance as part of its annual financial statement filing, reflecting management's current expectations for fiscal 2026 based on the performance of its existing royalty and streaming portfolio, information provided from operators, and prevailing market conditions.</p><p><strong>Key Guidance Metrics for Fiscal 2026</strong></p><p>Empress anticipates meaningful growth in its attributable production in 2026, supported by continued contributions from key assets with potential optimization initiatives and steady performance with its portfolio holdings. Guidance incorporates assumptions of stable or improving operator performance and no major disruptions, consistent with disclosure standards under NI 51-102 and, where applicable, National Instrument 43-101 - Standards of Disclosure for Mineral Projects (\"NI 43-101\") for technical information.</p><p><strong>Attributable Gold Equivalent Ounces (GEOs)</strong></p><p>As a royalty and streaming company focused on precious metals, the Company's performance is inherently tied to production volumes and metal prices, which are volatile; accordingly, emphasis is placed on attributable gold equivalent ounces (\"GEOs\") sales as a primary metric to reflect production exposure. For streams, guidance reflects GEOs that have been delivered from the operators of our assets. Our GEO deliveries may differ from operators' production based on timing of deliveries and due to recovery and payability factors. GEO sales may differ from GEO deliveries based on the timing of the sales. For royalties, GEO guidance reflects the timing of royalty payments or accruals.</p><p>Empress expects attributable GEOs of 7,045 to 7,430 for fiscal 2026. This range represents the Company's diversified exposure across gold and silver calculated using conservative conversion ratios based on assumed commodity prices of <money>$4,000</money>/oz gold and <money>$70</money>/oz silver. GEOs are emphasized as the core metric, as they directly reflect the underlying production from operators and reduce dependency on volatile spot prices for performance evaluation.</p><p><strong>Assumptions and Basis for Guidance</strong></p><p>The 2026 Guidance is based on public and non-public forecasts, other disclosure by the owners and operators of our assets, internal analysis of historical performance, and management's understanding of the underlying producing assets. Additionally, the Company may receive information from the owners and operators of the properties, which the Company is not permitted to disclose to the public pursuant to the underlying agreement.</p><p>Key assumptions include:</p><ul><li><p>Annual increases in revenue if metals prices continue to be in the range of <money>$4,000</money>oz gold and <money>$70</money>/oz silver, and/or operating improvements are made at the underlying assets, and/or additional assets are added to the stream and royalty portfolio;</p></li><li><p>Production estimates reliant on operator guidance under NI 43-101-compliant reports and other non-public technical information and no material production interruptions;</p></li><li><p>No major new acquisitions or divestitures beyond those already announced, though the Company continues to actively evaluate opportunities; and</p></li><li><p>Currency exchange rates and tax considerations consistent with current levels.</p></li></ul><p><strong>Sensitivity</strong></p><p>The success of the Company in 2025 was based on a small number of investments and a significant increasing trend in gold and silver prices. There is no guarantee that this trend will continue in 2026. Given the volatile nature of gold and silver markets, an increase or decrease in gold or silver prices could impact attributable GEO values and related revenue considerably.</p><p><strong>Risks and Uncertainties</strong></p><p>Achievement of this guidance is subject to various risks, including but not limited to commodity price volatility (a primary concern given the small number of investments), operator-specific challenges (e.g., production delays), geopolitical factors, and environmental considerations. These could result in actual GEOs and revenues varying from the provided guidance, potentially materially. Investors should refer to the cautionary statements contained at the end of this news release, and the full discussion of risks in the Company's 2025 Annual Information Form filed on <a href=\"https://pr.report/j5hs\" rel=\"nofollow noopener\">www.sedarplus.ca</a>.</p><p><strong>Conclusion and Updates</strong></p><p>Empress continues to implement its stated strategy of building a diversified, cash-flowing portfolio to deliver sustainable value to shareholders. The Company will review and update this outlook quarterly or as material events occur, such as new acquisitions, significant operator announcements, or commodity price shifts. Management remains focused on disciplined growth and capital allocation in the streaming and royalty sector.</p><p><strong>ABOUT EMPRESS ROYALTY CORP.</strong></p><p>Empress is a global royalty and streaming creation company providing investors with a diversified portfolio of gold and silver investments. Empress has built a portfolio of precious metal investments and is actively investing in mining companies with development and production stage projects who require additional non-dilutive capital. The Company has a strategic partnership with Endeavour Financial which allows Empress to not only access global investment opportunities but also bring unique mining finance expertise and deal structuring. Empress is looking forward to continuously creating value for its shareholders through the proven royalty and streaming models.</p><p><strong>ON BEHALF OF EMPRESS ROYALTY CORP.</strong></p><p>Per: Alexandra Woodyer Sherron, CEO and President</p><p>For further information, please visit our website at <a href=\"https://pr.report/j5hu\" rel=\"nofollow noopener\"><u>www.empressroyalty.com</u></a>, or contact us by email at <a href=\"mailto:info@empressroyalty.com\" rel=\"nofollow noopener\"><u>info@empressroyalty.com</u></a> or by phone at +1.604.331.2080.</p><p><i><strong>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this press release.</strong></i></p><p><i>The information contained herein includes \"forward-looking statements\" and \"forward looking information\" as defined under applicable Canadian securities laws (\"forward-looking statements\"). Forward-looking statements and information can generally be identified by the use of terms such as \"may\", \"will\", \"should\", \"expect\", \"intend\", \"estimate\", continue\", \"believe\", \"plans\", \"anticipate\" or similar terms.</i></p><p><i>Forward-looking information and statements include, but are not limited to, statements with respect to the activities, events or developments that Empress Royalty Corp. (\"Empress\" or the \"Company\") expects or anticipates will or may occur in the future, including those regarding future growth and ability to create new streams or royalties, the development and focus of the Company , its acquisition strategy, the plans and expectations of the operators of the projects underlying its interests, including the proposed advancement and expansion of such projects; the results of exploration, development and production activities of the operators of such projects; and the Company's expectations regarding future revenues.</i></p><p><i>Forward-looking information and statements are based on the then current expectations, beliefs, assumptions, estimates and forecasts about Empress's business and the industry and markets in which it operates. Forward-looking information and statements are made based upon numerous assumptions and although the assumptions made by the Company in providing forward-looking information and statements are considered reasonable by management at the time, there can be no assurance that such assumptions will prove to be accurate. Forward-looking information and statements also involve known and unknown risks and uncertainties and other factors, which may cause actual results, performances and achievements of Empress to differ materially from any projections of results, performances and achievements of Empress including, without limitation, any inability of the operators of the properties underlying the Company's royalty and stream interests to execute proposed plans for such properties or to achieve planned development and production estimates and goals, risks related to the operators of the projects in which the Company holds interests, including the successful continuation of operations at such projects by those operators, risks related to exploration, development, permitting, infrastructure, operating or technical difficulties on any such projects, risks related to international operations, government relations and environmental regulation, uncertainty relating to the availability and costs of financing needed in the future and the Company's ability to carry out its growth plans as well as the impact of the COVID-19 pandemic and other related risks and uncertainties. For a discussion of important factors which could cause actual results to differ from forward-looking statements, refer to the annual information form of Empress for the year ended December 31, 2024 and its other publicly filed documents under it profile a </i><a href=\"https://pr.report/j5ht\" rel=\"nofollow noopener\"><i>www.sedarplus.ca</i></a><i>. Although the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in the forward-looking information and statements, there may be other factors that cause results not to be as anticipated, estimated, or intended. There can be no assurance that forward-looking information and statements will prove to be accurate, as actual results and future events could differ materially from those anticipated, estimated or intended. Accordingly, readers should not place undue reliance on forward-looking information and statements. The Company undertakes no obligation to update or reissue forward-looking information as a result of new information or events except as required by applicable securities laws. Disclosure relating to properties in which Empress holds royalty or stream interests is based on information publicly disclosed by the owners or operators of such properties. The Company generally has limited or no access to the properties underlying its interests and is largely dependent on the disclosure of the operators of its interests and other publicly available information. The Company generally has limited or no ability to verify such information. Although the Company does not have any knowledge that such information may not be accurate, there can be no assurance that such third-party information is complete or accurate. In addition, certain information publicly reported by operators may relate to a larger property than the area covered by the Company's interest, which often may only apply to a portion of the overall project area or applicable mineral resources or reserves.</i></p><p><strong>SOURCE:</strong> Empress Royalty Corp.</p><br/><br/>View the original <a href=\"https://www.accessnewswire.com/newsroom/en/metals-and-mining/empress-reports-2025-year-end-financial-results-1142500\" rel=\"nofollow noopener\">press release</a> on ACCESS Newswire<br/><br/><img height=\"0\" loading=\"lazy\" src=\"https://app.accessnewswire.com/img.ashx?id=1142500\" width=\"0\"/></article>",
            "link": "https://www.stocktitan.net/news/EMPYF/empress-reports-2025-year-end-financial-3uveo03ph9fo.html",
            "author": "stocktitan",
            "pub_date": "Sat, 28 Feb 2026 01:00:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Damon Announces Board Update | DMNIF Stock News",
            "description": "<article class=\"article\"><p>Vancouver, British Columbia--(Newsfile Corp. - February 27, 2026) - Damon Inc. (OTC Pink: <a class=\"symbol-link\" href=\"/overview/DMNIF/\" title=\"View DMNIF stock overview\">DMNIF</a>) (\"Damon\" or the \"Company\"), a designer and developer of electric motorcycles and other personal mobility products that seek to empower the personal mobility sector through innovation, today that the Board of Directors including the Chief Executive Officer and Chief Financial Officer has resigned. </p><p><i>For more information about Damon's vision for a connected mobility future and to learn about the investment opportunity, please visit </i><a href=\"https://api.newsfilecorp.com/redirect/5WeVMiWeX4\" rel=\"nofollow noopener\"><i>https://invest.damon.com/</i></a><i>.</i></p><p><b>About Damon</b></p><p>Damon Inc. is a designer and developer of personal mobility products and technology solutions that integrate AI-enabled safety systems, smart electrification, and user-driven design to revolutionize sustainable transportation. Operating across four potential revenue verticals - Data Intelligence &amp; Services, Engineering Services, Personal Mobility Products, and Special Projects - Damon believes it is positioned to capture a significant share of the <money>$200B</money> global two-wheeler market by 2032<sup>1</sup>. The company distinguishes itself through its integrated ecosystem approach, combining advanced data analytics and engineering expertise, while seeking to enter into strategic partnerships with OEMs and Tier 1 suppliers. Damon emphasizes accessible mobility solutions while leveraging its proprietary AI-enabled safety systems and intelligent energy management technology to deliver superior performance and operational efficiency in the urban and business mobility space. For more information, please visit <b><a href=\"https://api.newsfilecorp.com/redirect/OARrxh2DjP\" rel=\"nofollow noopener\">damon.com</a></b>.</p><p style=\"text-indent: 5%;\"><font style=\"font-size: 11px;\">1 Source Fortune Business Insights (2025)</font></p><div id=\"contactInfo\"><p>Contact: <br/>236-326-3619<br/><a href=\"mailto:Info@damon.com\" rel=\"nofollow noopener\">Info@damon.com</a></p></div><p>FORWARD-LOOKING STATEMENTS</p><p>This press release, including any materials referenced herein, contains forward-looking information or forward-looking statements under applicable Canadian and U.S. securities laws (collectively, \"forward-looking statements\") that reflect current expectations and projections of Damon Inc. (\"Damon\") about its future development. When used in this press release, forward-looking statements can be identified by the use of words such as \"may,\" or by such words as \"will,\" \"intend,\" \"believe,\" \"estimate,\" \"consider,\" \"expect,\" \"anticipate,\" and \"objective\" and similar expressions or variations of such words. Forward-looking statements in this press release include, but are not limited to, statements relating to the Company's strategic plans and expected benefits of the divestiture of Grafiti Limited. Forward-looking statements are, by their nature, not guarantees of Damon's future operational or financial performance and are subject to risks and uncertainties and other factors that could cause Damon's actual results, performance, prospects, or opportunities to differ materially from those expressed in, or implied by, these forward-looking statements. No representation or warranty is intended with respect to anticipated future results, or that estimates, or projections will be sustained.</p><p>In developing the forward-looking statements in this press release, we have applied several material assumptions, including the general business and economic conditions of the industries and countries in which Damon operates, and general market conditions. Many risks, uncertainties, and other factors could cause the actual results of Damon to differ materially from the results, performance, achievements, or developments expressed or implied by such forward-looking statements. Factors that could cause actual results to differ from those discussed in the forward-looking statements include, but are not limited to, our history of losses, our ability to implement our growth strategy, generate revenue and achieve profitability, our ability to obtain adequate financing as needed, our ability to continue as a going concern, our status as a foreign private issuer, impact of our prior delisting from Nasdaq, our ability to establish and sustain an active trading market on an over-the-counter market maintained by OTC Markets Group Inc., customer demand for or acceptance of our products and services, our ability to enter into strategic partnerships with OEMs and Tier 1 suppliers, the impact of competitive or alternative products, technologies, and pricing, emerging competition and rapidly advancing technology that may outpace our own, our ability to develop, manufacture or distribute products and services and secure strategic supply, manufacturing, licensing and distribution arrangements, our ability to protect our intellectual property, our ability to protect user data and user information, impact of any changes in existing or future regulatory and tax regimes applying to our business, our ability to successfully consummate strategic transactions and integrate companies or technologies we acquire, our ability to attract and retain management and employees with specialized knowledge and technical skills, our ability to develop and maintain effective internal controls, general economic conditions and events and the impact they may have on us and our customers, including but not limited to escalating tariff and non-tariff trade measures imposed by the United States and other countries, increases in inflation rates and rates of interest, supply chain challenges, increased costs for materials and labor, cybersecurity threats, and conflicts such as those in Russia/Ukraine, Israel/Hamas and Iran, our success at managing the risks involved in the foregoing items, and other risk factors discussed in our periodic and current reports and registration statements filed with the U.S. Securities and Exchange Commission and the British Columbia Securities Commission.</p><p>Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of the press release or as of the date otherwise specifically indicated herein. Due to risks and uncertainties, events may differ materially from current expectations. Damon disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events, or otherwise, except as required pursuant to applicable securities law. All forward-looking statements contained in the press release are expressly qualified in their entirety by this cautionary statement.</p><p id=\"corporateNewsLogoContainer\"><img alt=\"Corporate Logo\" id=\"corporateNewsLogo\" loading=\"lazy\" src=\"https://images.newsfilecorp.com/files/11994/285789_5e29780994732956_logo.jpg\"/></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/oPyvWcBDRD\" rel=\"nofollow noopener\">https://www.newsfilecorp.com/release/285789</a></p><p><img alt=\"\" loading=\"lazy\" src=\"https://api.newsfilecorp.com/newsinfo/285789/375\"/></p></article>",
            "link": "https://www.stocktitan.net/news/DMNIF/damon-announces-board-4l48soqy45ee.html",
            "author": "stocktitan",
            "pub_date": "Sat, 28 Feb 2026 01:30:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AgriBank Reports Fourth Quarter 2025 and Year-End Financial Results | AGRIP Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><i>Continued strong financial performance reflects AgriBank business model, Association success</i></p><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.mn.stpaul\">ST. PAUL, Minn.</location></span>, <span class=\"legendSpanClass\">Feb. 27, 2026</span> /PRNewswire/ -- Today, <location idsrc=\"xmltag.org\" value=\"LU/us.mn.stpaul\">St. Paul</location>-based AgriBank announced financial results for the fourth quarter and full year of 2025, with strong profitability, credit quality, and liquidity and capital.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\"><p><a href=\"https://mma.prnewswire.com/media/396773/AgriBank_Logo.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"AgriBank (PRNewsfoto/AgriBank)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/396773/AgriBank_Logo.jpg\" title=\"AgriBank (PRNewsfoto/AgriBank)\"/></a></p></div><p><b>Highlights:</b></p><ul type=\"disc\"><li><b>Profitability: </b>Net income remained strong at <money><money>$1</money></money>.0 billion for the year ended December 31, 2025. AgriBank's year-to-date return on assets (ROA) ratio of 52 basis points was slightly above the target of 50 basis points.</li><li><b>Credit quality: </b>Total loan portfolio credit quality remained strong, with 99.2 percent of loans classified as acceptable at December 31, 2025.</li><li><b>Liquidity and capital: </b>End-of-the-quarter liquidity was 147 days, well above the regulatory requirement. Capital also remained well above the regulatory minimums and company targets.</li></ul><p>\"AgriBank delivered another year of strong financial results in 2025, reflecting disciplined growth, prudent balance‑sheet management, and the underlying strength of our District,\" said AgriBank CEO Jeffrey Swanhorst. \"Higher net interest income was driven by favorable retail loan spreads and increased wholesale loan volume, while credit quality, capital, and liquidity remained strong. Together, these factors position AgriBank to continue providing reliable funding and financial solutions to our Farm Credit Association‑owners as they support farmers, ranchers, and rural communities through challenging economic and market conditions.\"</p><p><b>2025</b><b> Results of Operations</b></p><p>Net interest income was <money><money>$1.2 billion</money></money> for the year ended December 31, 2025, an increase of <money><money>$143.8 million</money></money>, or 13.5 percent, compared to the same period of the prior year. The increase was primarily due to higher spread income on retail loans in AgriBank's asset pool portfolio and on AgriBank's wholesale loan portfolio due to an increase in volume. These factors were somewhat offset by decreased spread income on investment securities due to the mix of investment securities. The benefit of equity financing in net interest income increased compared to the prior year, due to higher levels of equity partially offset by a decline in interest rates. Equity financing represents the benefit of non-interest bearing funding. With interest rates moving lower during the second half of 2025, opportunities were taken to call and refinance debt at lower levels. While some loans have followed this pattern, the repricing or conversion of loans has been slower, resulting in wider retail interest rate spreads.</p><p>Non-interest income was <money><money>$113.9 million</money></money> for the year ended December 31, 2025, an increase of <money><money>$5.0 million</money></money>, or 4.6 percent, compared to the same period of the prior year, primarily related to an increase in loan fees due to marginally higher conversion and commitment fees generating additional income during the year. The increase in non-interest income was partially offset by the reduction in mineral income related to lower oil prices.</p><p>Non-interest expense was <money><money>$235.9 million</money></money> for the year ended December 31, 2025, an increase of <money><money>$19</money></money>.1 million, or 8.8 percent, compared to the same period of the prior year. The increase was mainly due to dealer incentive expenses related to AgriBank's crop input financing portfolio. Loan servicing expense increased due to asset pool activity during 2025 and the second half of 2024. Additionally, contractor fees added to increased purchased services expense related to additional resources for technology projects during the year.</p><p><b>Loan Portfolio</b> </p><p>Total loans were <money><money>$177</money></money>.9 billion at December 31, 2025, an increase of <money><money>$13</money></money>.2 billion, or 8.0 percent, compared to December 31, 2024. This increase was primarily attributable to wholesale loan growth and increases in retail loans from expanded participation in asset pool programs.</p><p>AgriBank's credit quality reflects the overall financial strength of District Associations and their underlying portfolios of retail loans. AgriBank's portfolio was composed of 99.2 percent acceptable loans at December 31, 2025, compared to 99.4 percent at December 31, 2024. Loans classified as acceptable represent the highest-quality assets. The credit quality of AgriBank's retail loan portfolio decreased slightly to 94.9 percent classified as acceptable at December 31, 2025, compared to 95.7 percent acceptable at December 31, 2024.</p><p><b>Agricultural Conditions</b></p><p>On February 5, 2026, the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> Department of Agriculture's Economic Research Service (USDA-ERS) released its initial forecast of the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> aggregate farm income and financial conditions for 2026 and updated its 2025 forecast. The revised 2025 net farm income forecast of <money><money>$154.5 billion</money></money> represents a <money><money>$27.0 billion</money></money> increase from the 2024 level, up 21.2 percent, driven by increasing direct government payments and animal and animal product cash receipts, which more than offset rising expenses. When adjusting for inflation, the 2025 net farm income forecast is <money><money>$28.4 billion</money></money>, or 22.0 percent, above the 10-year average (2015-2024) net farm income in 2026 dollars. The initial 2026 net farm income projection of <money><money>$153.4 billion</money></money> represents a decrease of <money><money>$1.2 billion</money></money>, or 0.7 percent, from the revised 2025 net farm income forecast, and if realized, would be <money><money>$24.3 billion</money></money>, or 18.8 percent, above the 10-year average net farm income in 2026 dollars.</p><p>Many factors, including weather, trade, government and monetary policy, global agricultural production levels, and pathogenic outbreaks in livestock and poultry, may keep agriculture market volatility elevated. Implementation of cost-saving technologies, marketing methods, and risk management strategies will continue to cause a wide range of results among the respective agricultural producers.</p><p><b>Capital Resources</b> <b>and Liquidity</b></p><p>Total capital remained strong at <money><money>$10</money></money>.5 billion as of December 31, 2025, an increase of <money><money>$1</money></money>.0 billion compared to December 31, 2024. The increase was driven by AgriBank's strong net income and the issuance of capital stock, which were partially offset by cash patronage declared, consistent with AgriBank's capital plan. AgriBank exceeded all regulatory capital minimum requirements, including additional regulatory buffers.</p><p>Cash, cash equivalents, and investments totaled <money><money>$25</money></money>.4 billion and <money><money>$25</money></money>.1 billion at December 31, 2025, and December 31, 2024, respectively. AgriBank's end-of-the-period liquidity position represented 147 days coverage of maturing debt obligations, which supports operational demands, and was well above the 90-day minimum established by AgriBank's regulator.</p><p><b>About AgriBank </b></p><p>AgriBank is part of the customer-owned, nationwide Farm Credit System. Under Farm Credit's cooperative structure, AgriBank is primarily owned by local Farm Credit Associations, which provide financial products and services to rural communities and agriculture. AgriBank obtains funds and provides funding and financial solutions to those Associations. AgriBank and those Associations compose the AgriBank District. The District covers a 15-state area stretching from <location idsrc=\"xmltag.org\" value=\"LS/us.wy\">Wyoming</location> to <location idsrc=\"xmltag.org\" value=\"LS/us.oh\">Ohio</location> and <location idsrc=\"xmltag.org\" value=\"LS/us.mn\">Minnesota</location> to <location idsrc=\"xmltag.org\" value=\"LS/us.ar\">Arkansas</location>. For more information, visit <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629813-1&amp;h=2691081622&amp;u=http%3A%2F%2Fwww.agribank.com%2F&amp;a=www.AgriBank.com\" rel=\"nofollow noopener\" target=\"_blank\">www.AgriBank.com</a>.</p><p><b>Forward-Looking Statements </b></p><p>Any forward-looking statements in this press release are based on current expectations and are subject to uncertainty and changes in circumstances. Actual results may differ materially from expectations due to a number of risks and uncertainties. More information about these risks and uncertainties is contained in AgriBank's annual report, which is available approximately 75 days following the end of the year. AgriBank undertakes no duty to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.</p><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen2\" colspan=\"3\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>AGRIBANK, FCB</b></span></p></td></tr><tr><td class=\"prngen2\" colspan=\"3\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>STATEMENTS OF CONDITION INFORMATION</b></span></p></td></tr><tr><td class=\"prngen2\" colspan=\"3\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>(in thousands)</b></span></p></td></tr><tr><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>December 31,</b></span></p></td><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">December 31,</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen4\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>2025</b></span></p></td><td class=\"prngen4\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">2024</span></p></td></tr><tr><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Loans</span></p></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b><money><money>$177,887,238</money></money></b></span></p></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$164,659,006</money></money></span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Allowance for credit losses on loans</span></p></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>73,456</b></span></p></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">39,641</span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml8\"><span class=\"prnews_span\">Net loans</span></p></td><td class=\"prngen7\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>177,813,782</b></span></p></td><td class=\"prngen7\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">164,619,365</span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Investment securities and other earning assets     </span></p></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>25,406,324</b></span></p></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">25,071,437</span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Accrued interest receivable</span></p></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>1,945,092</b></span></p></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1,815,644</span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Other assets</span></p></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>543,129</b></span></p></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">424,514</span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml8\"><span class=\"prnews_span\">Total assets</span></p></td><td class=\"prngen8\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b><money><money>$205,708,327</money></money></b></span></p></td><td class=\"prngen8\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$191,930,960</money></money></span></p></td></tr><tr><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Bonds and notes</span></p></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b><money><money>$193,426,229</money></money></b></span></p></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$180,795,727</money></money></span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Accrued interest payable</span></p></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>1,189,507</b></span></p></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1,201,851</span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Other liabilities</span></p></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>606,868</b></span></p></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">470,261</span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml8\"><span class=\"prnews_span\">Total liabilities</span></p></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b><money><money>$195,222,604</money></money></b></span></p></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$182,467,839</money></money></span></p></td></tr><tr><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Shareholders' equity</span></p></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b><money><money>$10,485,723</money></money></b></span></p></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$9,463,121</money></money></span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml8\"><span class=\"prnews_span\">Total liabilities and shareholders' equity</span></p></td><td class=\"prngen8\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b><money><money>$205,708,327</money></money></b></span></p></td><td class=\"prngen8\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$191,930,960</money></money></span></p></td></tr><tr><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td></tr></table></div><p> </p><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen2\" colspan=\"5\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>AGRIBANK, FCB</b></span></p></td></tr><tr><td class=\"prngen2\" colspan=\"5\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>STATEMENTS OF INCOME INFORMATION</b></span></p></td></tr><tr><td class=\"prngen2\" colspan=\"5\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>(in thousands)</b></span></p></td></tr><tr><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"2\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>For the</b></span></p></td><td class=\"prngen2\" colspan=\"2\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>For the</b></span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"2\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>three months ended</b></span></p></td><td class=\"prngen2\" colspan=\"2\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>twelve months ended</b></span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"2\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>December 31,</b></span></p></td><td class=\"prngen2\" colspan=\"2\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>December 31,</b></span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen4\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>2025</b></span></p></td><td class=\"prngen4\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">2024</span></p></td><td class=\"prngen4\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>2025</b></span></p></td><td class=\"prngen4\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">2024</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>(unaudited)</b></span></p></td><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">(unaudited)</span></p></td><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Interest income</span></p></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b><money><money>$2,062,553</money></money></b></span></p></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$1,977,492</money></money></span></p></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b><money><money>$8,048,140</money></money></b></span></p></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$7,681,922</money></money></span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Interest expense</span></p></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>1,726,940</b></span></p></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1,683,510</span></p></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>6,841,901</b></span></p></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">6,619,466</span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml8\"><span class=\"prnews_span\">Net interest income</span></p></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>335,613</b></span></p></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">293,982</span></p></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>1,206,239</b></span></p></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1,062,456</span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Provision for credit losses</span></p></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>27,000</b></span></p></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">16,000</span></p></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>59,000</b></span></p></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">27,000</span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml8\"><span class=\"prnews_span\">Net interest income after provision for credit losses     </span></p></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>308,613</b></span></p></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">277,982</span></p></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>1,147,239</b></span></p></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1,035,456</span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Non-interest income</span></p></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>30,466</b></span></p></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">22,978</span></p></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>113,882</b></span></p></td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">108,866</span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Non-interest expense</span></p></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>63,451</b></span></p></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">58,500</span></p></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>235,921</b></span></p></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">216,864</span></p></td></tr><tr><td class=\"prngen6\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml8\"><span class=\"prnews_span\">Net income</span></p></td><td class=\"prngen8\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b><money><money>$275,628</money></money></b></span></p></td><td class=\"prngen8\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$242,460</money></money></span></p></td><td class=\"prngen8\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b><money><money>$1,025,200</money></money></b></span></p></td><td class=\"prngen8\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$927,458</money></money></span></p></td></tr><tr><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><br/></td></tr></table></div><p> </p><p> </p><p>SOURCE AgriBank</p></div></article>",
            "link": "https://www.stocktitan.net/news/AGRIP/agri-bank-reports-fourth-quarter-2025-and-year-end-financial-ycgs526mtv68.html",
            "author": "stocktitan",
            "pub_date": "Sat, 28 Feb 2026 01:32:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "GoldMining Announces Filing of Financial Statements, MD&A, Annual Information Form and Annual Report on Form 40-F | GLDG Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/ca.bc.vancvr\">VANCOUVER, BC</location></span>, <span class=\"legendSpanClass\">Feb. 27, 2026</span> /PRNewswire/ -<b> GoldMining Inc.</b> (TSX: GOLD) (NYSE American: <a class=\"symbol-link\" href=\"/overview/GLDG/\" title=\"View GLDG stock overview\">GLDG</a>) (\"GoldMining\" or the \"Company\") announces the filing of its annual financial statements, management's discussion and analysis (\"MD&amp;A\"), annual information form (together, the \"Annual Filings\") and its annual report on Form 40-F (the \"Form 40-F\") for the year ended November 30, 2025.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\"><p><a href=\"https://mma.prnewswire.com/media/2922673/GoldMining_Inc__GoldMining_Announces_Filing_of_Financial_Stateme.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"GoldMining Inc. Logo (CNW Group/GoldMining Inc.)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/2922673/GoldMining_Inc__GoldMining_Announces_Filing_of_Financial_Stateme.jpg\" title=\"GoldMining Inc. Logo (CNW Group/GoldMining Inc.)\"/></a></p></div><p>The Annual Filings, which include information regarding the Company's financial position, operations and projects for the fiscal year, are available under the Company's profile at <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629848-1&amp;h=972216706&amp;u=http%3A%2F%2Fwww.sedarplus.ca%2F&amp;a=www.sedarplus.ca\" rel=\"nofollow noopener\" target=\"_blank\">www.sedarplus.ca</a>, on EDGAR at <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629848-1&amp;h=3212424137&amp;u=http%3A%2F%2Fwww.sec.gov%2FEDGAR&amp;a=www.sec.gov%2FEDGAR\" rel=\"nofollow noopener\" target=\"_blank\">www.sec.gov/EDGAR</a> and on the Company's website at <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629848-1&amp;h=274967724&amp;u=http%3A%2F%2Fwww.goldmining.com%2F&amp;a=www.goldmining.com\" rel=\"nofollow noopener\" target=\"_blank\">www.goldmining.com</a>. The Form 40-F is available under the Company's profile on EDGAR.</p><p><b>About GoldMining Inc.</b></p><p>GoldMining Inc. is a public mineral exploration company focused on acquiring and developing gold assets in the <location idsrc=\"xmltag.org\" value=\"LR/am\">Americas</location>. Through its disciplined acquisition strategy, GoldMining now controls a diversified portfolio of resource-stage gold and gold-copper projects in <location idsrc=\"xmltag.org\" value=\"LC/ca\">Canada</location>, the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.A.</location>, <location idsrc=\"xmltag.org\" value=\"LC/br\">Brazil</location>, <location idsrc=\"xmltag.org\" value=\"LC/co\">Colombia</location>, and <location idsrc=\"xmltag.org\" value=\"LC/pe\">Peru</location>.</p><p>SOURCE GoldMining Inc.</p></div></article>",
            "link": "https://www.stocktitan.net/news/GLDG/gold-mining-announces-filing-of-financial-statements-md-a-annual-ukj1x53g2t8d.html",
            "author": "stocktitan",
            "pub_date": "Sat, 28 Feb 2026 01:39:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Equity Residential to Participate in Citi 2026 Global Property CEO Conference | EQR Stock News",
            "description": "<article class=\"article\"><p> <location idsrc=\"xmltag.org\" value=\"LU/us.il.chicgo\">CHICAGO</location>--(BUSINESS WIRE)--Equity Residential (NYSE: <a class=\"symbol-link\" href=\"/overview/EQR/\" title=\"View EQR stock overview\">EQR</a>) today announced that members of the Company’s senior management team, including the Company’s President and CEO, Mark J. Parrell, will participate in a roundtable presentation at the Citi 2026 Global Property CEO Conference on Tuesday, March 3, 2026 at 11:00 a.m. ET. The event will be web cast live. A link to the web cast will be available in the Presentations section of the Investor section of the Company’s website at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.equityapartments.com&amp;esheet=54435718&amp;newsitemid=20260227280930&amp;lan=en-US&amp;anchor=www.equityapartments.com&amp;index=1&amp;md5=4ce8c8a262c5e7b837c8d6402e2ace29\" rel=\"nofollow noopener\" shape=\"rect\">www.equityapartments.com</a>.</p><p>The Company has posted an updated Investor Presentation in connection with these meetings, which includes an operating update. The presentation is available in the Investor section of the Company’s website.</p><p><b>About Equity Residential</b></p><p>Equity Residential is committed to creating communities where people thrive. The Company, a member of the S&amp;P 500, owns and manages 312 properties consisting of 85,190 apartment units in dynamic metro areas across the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> with a primary concentration in major coastal markets, diversified by a targeted presence in the high-growth metro areas of <location idsrc=\"xmltag.org\" value=\"LU/us.ga.atlnta\">Atlanta</location>, <location idsrc=\"xmltag.org\" value=\"LU/us.tx.austin\">Austin</location>, <location idsrc=\"xmltag.org\" value=\"LU/us.tx.ftwort\">Dallas/Ft. Worth</location> and <location idsrc=\"xmltag.org\" value=\"LU/us.co.denver\">Denver</location>. For more information on Equity Residential, please visit our website at<a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.equityapartments.com%2F&amp;esheet=54435718&amp;newsitemid=20260227280930&amp;lan=en-US&amp;anchor=www.equityapartments.com&amp;index=2&amp;md5=d4ac8cfaf231eb60d4d0d5862a41778a\" rel=\"nofollow noopener\" shape=\"rect\"> www.equityapartments.com</a>.</p><p><img alt=\"\" loading=\"lazy\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260227280930r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\"/><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20260227280930/en/\" rel=\"nofollow noopener\">https://www.businesswire.com/news/home/20260227280930/en/</a></span></p><p>Marty McKenna<br/>(312) 928-1901, <a href=\"mailto:mmckenna@eqr.com\" rel=\"nofollow noopener\" shape=\"rect\">mmckenna@eqr.com</a></p><p>Source: Equity Residential</p></article>",
            "link": "https://www.stocktitan.net/news/EQR/equity-residential-to-participate-in-citi-2026-global-property-ceo-8ilewpbj1zz2.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 22:53:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        }
    ]
}