{
    "data": [
        {
            "title": "Cohen & Steers Infrastructure Fund, Inc. (UTF) Notification of Sources of Distribution Under Section 19(a) | CNS Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.ny.nyc\">NEW YORK</location></span>, <span class=\"legendSpanClass\">Feb. 26, 2026</span> /PRNewswire/ -- This press release provides shareholders of Cohen &amp; Steers Infrastructure Fund, Inc. (NYSE: <a class=\"symbol-link\" href=\"/overview/UTF/\" title=\"View UTF stock overview\">UTF</a>) (the \"Fund\") with information regarding the sources of the distribution to be paid on February 27, 2026 and cumulative distributions paid fiscal year-to-date.</p><p>In March 2015, the Fund implemented a managed distribution policy in accordance with exemptive relief issued by the Securities and Exchange Commission. The managed distribution policy seeks to deliver the Fund's long-term total return potential through regular monthly distributions declared at a fixed rate per common share. This policy gives the Fund greater flexibility to realize long-term capital gains throughout the year and to distribute those gains on a regular monthly basis to shareholders. The Board of Directors of the Fund may amend, terminate or suspend the managed distribution policy at any time, which could have an adverse effect on the market price of the Fund's shares.</p><p>The Fund's monthly distributions may include long-term capital gains, short-term capital gains, net investment income and/or return of capital for federal income tax purposes. Return of capital includes distributions paid by the Fund in excess of its net investment income and net realized capital gains and such excess is distributed from the Fund's assets. A return of capital is not taxable; rather, it reduces a shareholder's tax basis in his or her shares of the Fund. In addition, distributions from the Fund's investments in MLPs are attributed to various sources, including net investment income and return of capital. The amount of monthly distributions may vary depending on a number of factors, including changes in portfolio and market conditions.</p><p>At the time of each monthly distribution, information will be posted to cohenandsteers.com and mailed to shareholders in a concurrent notice. However, this information may change at the end of the year because the final tax characteristics of the Fund's distributions cannot be determined with certainty until after the end of the calendar year. Final tax characteristics of all of the Fund's distributions will be provided on Form 1099-DIV, which is mailed after the close of the calendar year.</p><p>The following table sets forth the estimated amounts of the current distribution and the cumulative distributions paid this fiscal year-to-date from the sources indicated. All amounts are expressed per common share.</p><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prnpr2 prnpl2 prnvab prncbts prnrbrb1 prnbbbs prnbsbls\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>DISTRIBUTION ESTIMATES</b></span></p></td><td class=\"prnpr2 prnpl2 prnvab prntac prncbts prnrbrb1 prnbbbs prnsblb1\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>February 2026</b></span></p></td><td class=\"prnpr2 prnpl2 prnvab prntac prncbts prnbrbrs prnbbbs prnsblb1\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>YEAR-TO-DATE (YTD) </b></span></p><p class=\"prnml4\"><span class=\"prnews_span\"><b>February 28, 2026*</b></span></p></td></tr><tr><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Source</b></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Per Share Amount</b></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>% of Current Distribution</b></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Per Share Amount</b></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>% of 2026 Distributions</b></span></p></td></tr><tr><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Net Investment Income</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.08</money>96</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">57.80 %</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.15</money>65</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">50.48 %</span></p></td></tr><tr><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Net Realized Short-Term Capital Gains</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.03</money>78</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">24.39 %</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.03</money>78</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">12.19 %</span></p></td></tr><tr><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Net Realized Long-Term Capital Gains</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.02</money>76</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">17.81 %</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.02</money>76</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">8.90 %</span></p></td></tr><tr><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Return of Capital (or other Capital Source)</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.00</money>00</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.00 %</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.08</money>81</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">28.43 %</span></p></td></tr><tr><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Total Current Distribution</b></span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b><money><money>$0.15</money>50</money></b></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>100.00 %</b></span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b><money><money>$0.31</money>00</money></b></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>100.00 %</b></span></p></td></tr></table></div><p><b>You should not draw any conclusions about the Fund's investment performance from the amount of this distribution or from the terms of the Fund's managed distribution policy. The Fund estimates that it has distributed more than its income and capital gains; therefore, a portion of your distribution may be a return of capital. A return of capital may occur, for example, when some or all of the money that you invested in the Fund is paid back to you. A return of capital distribution does not necessarily reflect the Fund's investment performance and should not be confused with 'yield' or 'income'. The amounts and sources of distributions reported in this Notice are only estimates, are likely to change over time, and are not being provided for tax reporting purposes. The actual amounts and sources of the amounts for accounting and tax reporting purposes will depend upon the Fund's investment experience during the remainder of its fiscal year and may be subject to changes based on tax regulations. The amounts and sources of distributions year-to-date may be subject to additional adjustments.</b></p><p><b>*THE FUND WILL SEND YOU A FORM 1099-DIV FOR THE CALENDAR YEAR THAT WILL TELL YOU HOW TO REPORT THESE DISTRIBUTIONS FOR FEDERAL INCOME TAX PURPOSES.</b></p><p>The Fund's Year-to-date Cumulative Total Return for fiscal year 2026 (January 1, 2026 through January 31, 2026) is set forth below. Shareholders should take note of the relationship between the Year-to-date Cumulative Total Return with the Fund's Cumulative Distribution Rate for 2026. In addition, the Fund's Average Annual Total Return for the five-year period ending January 31, 2026 is set forth below. Shareholders should note the relationship between the Average Annual Total Return with the Fund's Current Annualized Distribution Rate for 2026. The performance and distribution rate information disclosed in the table is based on the Fund's net asset value per share (NAV). The Fund's NAV is calculated as the total market value of all the securities and other assets held by the Fund minus the total liabilities, divided by the total number of shares outstanding. While NAV performance may be indicative of the Fund's investment performance, it does not measure the value of a shareholder's individual investment in the Fund. The value of a shareholder's investment in the Fund is determined by the Fund's market price, which is based on the supply and demand for the Fund's shares in the open market.</p><p><b><i>Fund Performance and Distribution Rate Information: </i></b></p><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prnpr2 prnpl2 prnvab prncbts prnbrbrs prnbbbs prnbsbls\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Year-to-date January 1, 2026 to January 31, 2026</b></span></p></td></tr><tr><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Year-to-date Cumulative Total Return<sup>1      </sup></span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">6.14 %</span></p></td></tr><tr><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Cumulative Distribution Rate<sup>2     </sup></span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1.15 %</span></p></td></tr><tr><td class=\"prnpr10 prnpl2 prnvab prnsbtb1 prnbrbrs prnbbbs prnbsbls\" colspan=\"2\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen5\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Five-year period ending January 31, 2026            </b></span></p></td></tr><tr><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Average Annual Total Return<sup>3</sup></span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">10.26 %</span></p></td></tr><tr><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Current Annualized Distribution Rate<sup>4     </sup>                              </span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">6.89 %</span></p></td></tr></table></div><ol type=\"1\"><li>Year-to-date Cumulative Total Return is the percentage change in the Fund's NAV over the year-to-date time period including distributions paid and assuming reinvestment of those distributions.</li><li>Cumulative Distribution Rate for the Fund's current fiscal period (January 1, 2026 through February 28, 2026) measured on the dollar value of distributions in the year-to-date period as a percentage of the Fund's NAV as of January 31, 2026.</li><li>Average Annual Total Return represents the compound average of the Annual NAV Total Returns of the Fund for the five-year period ending January 31, 2026. Annual NAV Total Return is the percentage change in the Fund's NAV over a year including distributions paid and assuming reinvestment of those distributions.</li><li>The Current Annualized Distribution Rate is the current fiscal period's distribution rate annualized as a percentage of the Fund's NAV as of January 31, 2026.</li></ol><p>Investors should consider the investment objectives, risks, charges and expense of the Fund carefully before investing. You can obtain the Fund's most recent periodic reports, when available, and other regulatory filings by contacting your financial advisor or visiting cohenandsteers.com. These reports and other filings can be found on the Securities and Exchange Commission's EDGAR Database. You should read these reports and other filings carefully before investing.</p><p><i>Shareholders should not use the information provided here in preparing their tax returns. Shareholders will receive a Form 1099-DIV for the calendar year indicating how to report Fund distributions for federal income tax purposes.</i></p><p><b>About Cohen &amp; Steers. </b>Cohen &amp; Steers is a leading global investment manager specializing in real assets and alternative income, including listed and private real estate, preferred securities, infrastructure, resource equities, commodities, as well as multi-strategy solutions. Founded in 1986, the firm is headquartered in <location idsrc=\"xmltag.org\" value=\"LU/us.ny.nyc\">New York City</location>, with offices in <location idsrc=\"xmltag.org\" value=\"LU/gb.eng.london\">London</location>, <location idsrc=\"xmltag.org\" value=\"LU/ie..dublin\">Dublin</location>, <location idsrc=\"xmltag.org\" value=\"LC/hk\">Hong Kong</location>, <location idsrc=\"xmltag.org\" value=\"LU/jp..tokyo\">Tokyo</location> and <location idsrc=\"xmltag.org\" value=\"LC/sg\">Singapore</location>.</p><p><b><i>Forward-Looking Statements<br/></i></b><i>This press release and other statements that Cohen &amp; Steers may make may contain forward looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934, which reflect the company's current views with respect to, among other things, its operations and financial performance. You can identify these forward-looking statements by the use of words such as \"outlook,\" \"believes,\" \"expects,\" \"potential,\" \"continues,\" \"may,\" \"will,\" \"should,\" \"seeks,\" \"approximately,\" \"predicts,\" \"intends,\" \"plans,\" \"estimates,\" \"anticipates,\" or the negative versions of these words or other comparable words. Such forward-looking statements are subject to various risks and uncertainties.</i></p><p><i>Accordingly, there are or will be important factors that could cause actual outcomes or results to differ materially from those indicated in these statements. The company undertakes no obligation to publicly update or review any forward-looking statement, whether as a result of new information, future developments or otherwise. </i></p><p>Website: <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628864-5&amp;h=1028473427&amp;u=https%3A%2F%2Fwww.cohenandsteers.com%2F&amp;a=https%3A%2F%2Fwww.cohenandsteers.com\" rel=\"nofollow noopener\" target=\"_blank\">https://www.cohenandsteers.com</a><br/>Symbol: (NYSE: CNS)</p><p>SOURCE Cohen &amp; Steers</p></div></article>",
            "link": "https://www.stocktitan.net/news/CNS/cohen-steers-infrastructure-fund-inc-utf-notification-of-sources-of-mzjsxbgf10v0.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 23:57:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Global REMAX R4 Conference Introduces Bold Ideas, New Products to Advance World's Most Productive Real Estate Network | RMAX Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p class=\"prntac\"><i>Attendees from over 55 countries came together to learn, network, discover new services, prepare for the future, and celebrate their place in a global brand positioned to help them win more listings, save more time, and seize more income-lifting opportunities.</i></p><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.co.denver\">DENVER</location></span>, <span class=\"legendSpanClass\">Feb. 26, 2026</span> /PRNewswire/ -- REMAX<sup>®</sup>, the No. 1 name in real estate<sup>1</sup>, hosted its annual REMAX R4<sup>®</sup> global convention February 22–25 at the MGM Hotel in <location idsrc=\"xmltag.org\" value=\"LU/us.nv.lasveg\">Las Vegas</location>. With more than 4,200 attendees from over 55 countries, the event was an emphatic celebration of the network's high standards, winning culture, and global membership of trusted, productive professionals.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\"><p><a href=\"https://mma.prnewswire.com/media/432004/RE_MAX_LLC_2025_Logo_v2.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"www.remax.com (PRNewsfoto/RE/MAX, LLC)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/432004/RE_MAX_LLC_2025_Logo_v2.jpg\" title=\"www.remax.com (PRNewsfoto/RE/MAX, LLC)\"/></a></p></div><p>Through people, process and technology, REMAX has elevated its value proposition during a transformative past year – positioning the brand and its record-high 148,000 agents to greet the future with the right tools, services and mindset.</p><p>\"There's a faster pace of play at Headquarters. We're moving quickly – and with purpose – to strengthen the advantages of being with REMAX. And we're doubling down on the winning culture that defines this brand,\" CEO Erik Carlson told affiliates at the opening general session. \"Based on what we see and hear from you, you're leaning into this fresh new direction. Because you see the value in staying ahead of competitors.\"</p><p>Part of that quicker new direction – shaped by Carlson and his team of senior leaders, many of whom the Company welcomed since the beginning of last year – is an across-the-board modernization of the 53-year-old brand.</p><p>From refreshed branding to AI-powered services to data-driven, storytelling upgrades of the flagship remax.com and remax.ca websites, REMAX is providing its agents with programs and resources to compete – and win – in the ever-fierce battle for listings and clients.</p><p>New programs and services include:</p><ul type=\"disc\"><li><b>SkyView – </b>a purpose-built REMAX AI assistant that leverages brand data to help agents operate, market, and grow their business more efficiently.</li><li><b>BOSSCAT –</b> an innovative new offering designed to streamline the home inspection process with fast, accurate repair estimates, creating added value for both agents and clients.</li><li><b>REMAX Golf Lifestyles</b> – a new initiative that will connect REMAX agents with buyers and sellers in golf communities – tapping into one of the world's most engaged and loyal niche markets.</li><li>A new <b>partnership with INDYCAR team Meyer Shank Racing</b> – amplifying the visibility of REMAX within one of the world's fastest sports in <location idsrc=\"xmltag.org\" value=\"LB/nam\">North America</location>.</li><li><b>Marketing Studio</b> advancements, featuring expanded integrations with Canva, realtor.com and Zillow. The expansion also includes client testimonials and local market reports.</li><li><b>MasterPitch</b>, a comprehensive new offering designed to help agents win more listings. It includes strategic presentation tools to provide a full-spectrum listing system from prework to follow-up.</li><li><span>The <b>enhanced remax.com and remax.ca ecosystem</b>, bringing modern, mobile-first home search, richer storytelling, and smarter pathways from consumer interest to agent connection, while unifying global, luxury, and commercial listings under one experience to power the most visited No. 1 real estate franchisor website<sup>2</sup> and its more than 138 million annual visitors<sup>3</sup>.  </span></li></ul><p>The brand is doing all of this from a position of strength. During his opening address, Carlson revealed that REMAX agents around the world have closed more than 10 million transaction sides since January 1, 2020. And no competing brand comes close to that mark.</p><p><span>\"REMAX is winning the race,\" Carlson said. \"Behind each of those 10 million (transaction sides) is a family, a life moment, a dream realized – and a REMAX professional who made it come true. We're focused on delivering the absolute best for buyers and sellers. REMAX is winning the decade, and nobody in the world sells more real estate than REMAX<sup>4</sup>.\"</span><span> </span></p><p><b>Celebrating Excellence Across the Global Network </b></p><p>During the event's opening general session, REMAX also honored top-performing agents, teams, and Broker/Owners within residential, luxury and commercial.  </p><p>REMAX also presented the prestigious Distinguished Service Award to REMAX Co-Founder and Chairman of the Board Dave Liniger for his enduring leadership and impact on the industry. </p><p>The brand further spotlighted its decades-long commitment to Children's Miracle Network, recognizing the top 2025 Miracle Makers for their extraordinary generosity. REMAX agents have donated more than <money><money>$226 million</money></money> to CMN since the partnership began in 1992.</p><p><b>MarketPlace Moments</b></p><p>In many ways, the entire R4 experience was elevated, modernized and more global this year. This was especially evident in the MarketPlace, where attendees learned about new products and services available from REMAX and a host of high-quality vendors and partners.</p><p>They could test-drive the many new REMAX innovations, find professional services, explore technology solutions, consider insurance options, sign up for classes, purchase marketing materials, lean into The REMAX Collection<sup>®</sup> and REMAX Commercial<sup>®</sup> brands, and discover other resources to help build their businesses.</p><p>Raising money for Children's Miracle Network, they could enter the REMAX Lifestyles golf simulator and swing against REMAX agent Brandon Holtz of <location idsrc=\"xmltag.org\" value=\"LS/us.il\">Illinois</location>, who will play – sponsored by REMAX – in The Masters next month in <location idsrc=\"xmltag.org\" value=\"LU/us.ga.agusta\">Augusta, Georgia</location>. And they could take selfies with the No. 66 Meyer Shank Racing Honda driven by Marcus Armstrong, newly wrapped in its REMAX livery for the INDYCAR season.</p><p>The dynamic Global Referral Exchange provided especially memorable Marketplace moments. Attendees filled the hall to meet REMAX peers from dozens of countries around the world. Global affiliates hosted colorful booths, with many of them treating visitors to samples of their local fare. Amid smiles and handshakes, connections were made – with limitless potential for referrals in the future.</p><p><span>1 Source: MMR Strategy Group study of unaided awareness. <br/></span><span>2 Source: Based on ComScore report of 2024 data for <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> real estate franchisor among website visits in the \"Business and Consumer Services/Real Estate\" category.<br/></span><span>3 </span><span>Source: RE/MAX first-party data for full-year 2023<br/></span><span>4 As measured by residential transaction sides. </span></p><p><b>About the REMAX Network</b></p><p>As one of the leading global real estate franchisors, RE/MAX, LLC is a subsidiary of RE/MAX Holdings (NYSE: <a class=\"symbol-link\" href=\"/overview/RMAX/\" title=\"View RMAX stock overview\">RMAX</a>) with more than 145,000 agents in over 8,500 offices and a presence in more than 120 countries and territories. Nobody in the world sells more real estate than REMAX, as measured by residential transaction sides. REMAX was founded in 1973 by Dave and Gail Liniger, with an innovative, entrepreneurial culture affording its agents and franchisees the flexibility to operate their businesses with great independence. REMAX agents have lived, worked and served in their local communities for decades, raising millions of dollars every year for Children's Miracle Network Hospitals<sup>®</sup> and other charities. To learn more about REMAX, to search home listings or find an agent in your community, please visit <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628866-1&amp;h=1185662210&amp;u=https%3A%2F%2Fwww.remax.com%2F&amp;a=www.remax.com\" rel=\"nofollow noopener\" target=\"_blank\">www.remax.com</a>. For the latest news about REMAX, please visit <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628866-1&amp;h=3001437908&amp;u=https%3A%2F%2Fnews.remax.com%2F&amp;a=news.remax.com\" rel=\"nofollow noopener\" target=\"_blank\">news.remax.com</a>.</p><p><b>Forward-Looking Statements </b></p><p>This press release includes \"forward-looking statements\" within the meaning of the \"safe harbor\" provisions of the United States Private Securities Litigation Reform Act of 1995. Forward-looking statements are often identified by the use of words such as \"believe,\" \"intend,\" \"expect,\" \"estimate,\" \"plan,\" \"outlook,\" \"project,\" \"anticipate,\" \"may,\" \"will,\" \"would\" and other similar words and expressions that predict or indicate future events or trends that are not statements of historical matters. Forward-looking statements include statements related to new ideas and products; advancing the REMAX network; strengthening the advantages of being with REMAX; modernization of the REMAX brand; and providing REMAX agents with programs, resources and services to compete for and win listings and clients. Forward-looking statements should not be read as a guarantee of future performance or results and will not necessarily accurately indicate the times at which such performance or results may be achieved. Forward-looking statements are based on information available at the time those statements are made and/or management's good faith belief as of that time with respect to future events and are subject to risks and uncertainties that could cause actual performance or results to differ materially from those expressed in or suggested by the forward-looking statements. These risks and uncertainties include, without limitation, (1) changes in the real estate market or interest rates and availability of financing, (2) changes in business and economic activity in general, including enacted and proposed tariffs and other trade policies which could impact the global economy, (3) the company's ability to attract and retain quality franchisees, (4) the company's franchisees' ability to recruit and retain real estate agents and mortgage loan originators, (5) changes in laws and regulations, (6) the company's ability to enhance, market, and protect its brands, (7) the company's ability to implement its technology initiatives, (8) risks related to recent changes in the company's leadership team, (9) fluctuations in foreign currency exchange rates, (10) the nature and amount of the exclusion of charges in future periods when determining Adjusted EBITDA is subject to uncertainty and may not be similar to such charges in prior periods, and (11) those risks and uncertainties described in the sections entitled \"Risk Factors\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in the most recent Annual Report on Form 10-K and Quarterly Reports on Form 10-Q filed with the Securities and Exchange Commission (\"SEC\") and similar disclosures in subsequent periodic and current reports filed with the SEC, which are available on the investor relations page of the company's website at <a href=\"http://www.remaxholdings.com\" rel=\"nofollow noopener\">www.remaxholdings.com</a> and on the SEC website at <a href=\"http://www.sec.gov\" rel=\"nofollow noopener\">www.sec.gov</a>. Readers are cautioned not to place undue reliance on forward-looking statements, which speak only as of the date on which they are made. Except as required by law, the company does not intend, and undertakes no obligation, to update this information to reflect future events or circumstances.</p><p>SOURCE RE/MAX, LLC</p></div></article>",
            "link": "https://www.stocktitan.net/news/RMAX/global-remax-r4-conference-introduces-bold-ideas-new-products-to-yurbfbo8fu5c.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 23:58:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NewMarket Corporation Announces Quarterly Dividend | NEU Stock News",
            "description": "<article class=\"article\"><p> <location idsrc=\"xmltag.org\" value=\"LU/us.va.ricity\">RICHMOND, Va.</location>--(BUSINESS WIRE)--The Board of Directors of NewMarket Corporation (NYSE: <a class=\"symbol-link\" href=\"/overview/NEU/\" title=\"View NEU stock overview\">NEU</a>) declared a quarterly dividend in the amount of <money><money>$3.00</money></money> per share on the common stock of the Corporation. The dividend is payable April 1, 2026, to NewMarket shareholders of record at the close of business on March 16, 2026.</p><p>NewMarket Corporation is a holding company operating through its subsidiaries, Afton Chemical Corporation (Afton), Ethyl Corporation (Ethyl), American Pacific Corporation (AMPAC) and Calca Solutions, LLC (Calca). The Afton and Ethyl companies develop, manufacture, blend, and deliver chemical additives that enhance the performance of petroleum products. AMPAC is a manufacturer of specialty materials primarily used in solid rocket motors for the aerospace and defense industries. Calca is the nation’s leading producer of UltraPure and high-purity hydrazine – essential, mission-critical propellants that enable advanced aerospace and defense applications.<b> </b>The NewMarket family of companies has a long-term commitment to its people, to safety, to providing innovative solutions for its customers, and to making the world a better place.</p><p>Some of the information contained in this press release constitutes forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Although NewMarket’s management believes its expectations are based on reasonable assumptions within the bounds of its knowledge of its business and operations, there can be no assurance that actual results will not differ materially from expectations.</p><p>Factors that could cause actual results to differ materially from expectations include, but are not limited to, the availability of raw materials and distribution systems; disruptions at production facilities, including single-sourced facilities; hazards common to chemical businesses; the ability to respond effectively to technological changes in our industries; failure to protect our intellectual property rights; sudden, sharp, or prolonged raw material price increases; competition from other manufacturers; current and future governmental regulations; the loss of significant customers; termination or changes to contracts with contractors and subcontractors of the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> government or directly with the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> government; failure to attract and retain a highly-qualified workforce; an information technology system failure or security breach; the occurrence or threat of extraordinary events, including natural disasters, terrorist attacks, wars and health-related epidemics; risks related to operating outside of <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location>, including tariffs and trade policy; political, economic, and regulatory factors concerning our products; the impact of substantial indebtedness on our operational and financial flexibility; the impact of fluctuations in foreign exchange rates; resolution of environmental liabilities or legal proceedings; limitation of our insurance coverage; our inability to realize expected benefits from investment in our infrastructure or from acquisitions, or our inability to successfully integrate acquisitions into our business; the underperformance of our pension assets resulting in additional cash contributions to our pension plans; and other factors detailed from time to time in the reports that NewMarket files with the Securities and Exchange Commission, including the risk factors in Part I, Item 1A. “Risk Factors” of our Annual Report on Form 10-K for the year ended December 31, 2025, which is available to shareholders upon request.</p><p>You should keep in mind that any forward-looking statement made by NewMarket in the foregoing discussion speaks only as of the date on which such forward-looking statement is made. New risks and uncertainties arise from time to time, and it is impossible for us to predict these events or how they may affect us. We have no duty to, and do not intend to, update or revise the forward-looking statements in this discussion after the date hereof, except as may be required by law. In light of these risks and uncertainties, you should keep in mind that the events described in any forward-looking statement made in this discussion, or elsewhere, might not occur.</p><p><img alt=\"\" loading=\"lazy\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226197341r2&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\"/><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20260226197341/en/\" rel=\"nofollow noopener\">https://www.businesswire.com/news/home/20260226197341/en/</a></span></p><p><b>Timothy K. Fitzgerald</b><br/><b>Investor Relations</b><br/><b>Phone: 804.788.5555</b><br/><b>Email: <a href=\"mailto:investorrelations@newmarket.com\" rel=\"nofollow noopener\" shape=\"rect\">investorrelations@newmarket.com</a></b></p><p>Source: NewMarket Corporation</p></article>",
            "link": "https://www.stocktitan.net/news/NEU/new-market-corporation-announces-quarterly-q1j8lh3ezn45.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 22:01:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Energy Fuels Announces 2025 Results and 2026 Guidance | UUUU Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><b><i>Increased uranium sales, over one million pounds of low-cost <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> uranium production, successful ongoing heavy rare earth pilot production, and completion of upsized <money><money>$700 million</money></money> <percent>0.75%</percent> convertible senior notes boosts working capital to near <money><money>$1 billion</money></money>.</i></b></p><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.co.denver\">DENVER</location></span>, <span class=\"legendSpanClass\">Feb. 26, 2026</span> /PRNewswire/ - <b>Energy Fuels Inc. </b>(NYSE American: <a class=\"symbol-link\" href=\"/overview/UUUU/\" title=\"View UUUU stock overview\">UUUU</a>) (TSX: EFR)<b> (\"Energy Fuels\" or the \"Company\"),</b> a leading <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> producer of uranium, rare earth elements (\"<b>REEs</b>\"), and other critical minerals, today reported its financial and operational results for the year ended December 31, 2025. The Company previously announced details for its upcoming February 27, 2026, earnings call.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\"><p><a href=\"https://mma.prnewswire.com/media/2921774/Energy_Fuels_Inc__Energy_Fuels_Announces_2025_Results_and_2026_G.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"Energy Fuels Inc., a US-based uranium and rare earth elements producer. (CNW Group/Energy Fuels Inc.)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/2921774/Energy_Fuels_Inc__Energy_Fuels_Announces_2025_Results_and_2026_G.jpg\" title=\"Energy Fuels Inc., a US-based uranium and rare earth elements producer. (CNW Group/Energy Fuels Inc.)\"/></a></p></div><p>\"2025 was a breakout year for Energy Fuels, as we achieved numerous operational, ramp-up, and growth milestones that we believe set the stage for significant future cashflow generation, market differentiation, and competitive advantages in the critical material space in the next few years,\" said Mark Chalmers, Energy Fuels' Chief Executive Officer. \"As a result, we have raised our profile among investors, customers, and governments to be recognized as, not only the largest and lowest cost <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> uranium producer, but also as an emerging global critical materials leader.</p><p>\"In our uranium segment, we ended the year exceeding 2025 guidance on all metrics, including mining, production, and sales, while lowering our unit costs. Our uranium revenue is ramping up, and we signed two new long-term contracts with major utilities that are expected to increase our portfolio pricing in the coming years. In addition, we are investing significantly in our industry-leading <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> assets, as we expect to remain the country's uranium leader for many years to come.</p><p>\"Equally impressive has been our progress in rare earth processing and production. Energy Fuels' rare earth products have been confirmed, qualified, and used by manufacturers for EVs and hybrid EVs. In 2025, we made considerable investments in our rare earth segment. We strongly believe now is the time to capture opportunities, as vertical integration and access to low-cost 'molecules' are the key to higher margins, increased market share, and overall competitiveness in the space. In years past, we invested 'upstream' by securing low-cost rare earth feedstock at our Donald joint venture in <location idsrc=\"xmltag.org\" value=\"LC/au\">Australia</location>, Vara Mada project in <location idsrc=\"xmltag.org\" value=\"LC/mg\">Madagascar</location>, and <location idsrc=\"xmltag.org\" value=\"LS/br.ba\">Bahia</location> project in <location idsrc=\"xmltag.org\" value=\"LC/br\">Brazil</location>. Now, we are investing 'downstream', including our recently announced proposed acquisition of Australian Strategic Materials (\"<b>ASM</b>\"), which upon completion, will expand our reach into highly coveted rare earth metals and alloys. The proposed acquisition of ASM will also bring another potential material source of feedstock from the Dubbo project located in NSW, <location idsrc=\"xmltag.org\" value=\"LC/au\">Australia</location>.</p><p>Ross Bhappu, President of Energy Fuels, added \"We recently released feasibility studies for several of our development projects, including the proposed Phase 2 Circuit expansion of our rare earth processing at the White Mesa Mill in <location idsrc=\"xmltag.org\" value=\"LS/us.ut\">Utah</location> and our Vara Mada project in <location idsrc=\"xmltag.org\" value=\"LC/mg\">Madagascar</location>, demonstrating impressive net present values and future cashflows. The combined NPV of the Phase 2 Circuit and the Vara Mada project is <money><money>$3.7 billion</money></money>, or <money><money>$15.26</money></money> per share (based on current shares outstanding), with expected EBITDA of <money><money>$765 million</money></money> for the first 15 years when the Phase 2 Circuit is combined with the expected EBITDA from the Vara Mada project over those years. </p><p>\"With an estimated capital cost of <money>$410 million</money> for the Phase 2 Circuit and an estimated all-in production cost of <money>$29.39</money>/kg NdPr equivalent produced from our Vara Mada project, <i>we believe our REE oxide production ranks among the lowest capital and operating costs globally.</i></p><p>Mr. Bhappu continued, \"We believe interest in Energy Fuels is accelerating as customers, governments, and investors favor companies like us that deliver on promises. We think we are turning a corner, as past investments could generate substantial cashflows and profits across several segments by decade's end.\"</p><p><b>Succession Planning Update:</b></p><p>The Company's succession plans are proceeding as expected and, in accordance with existing employment agreements, it is anticipated that Mr. Ross Bhappu, the President of the Company, will be appointed to the role of President and Chief Executive Officer of the Company on April 15, 2026, and Mr. Mark Chalmers,  the current CEO, will be retiring at the same time which is his planned retirement date. Upon his retirement, Mr. Chalmers will continue as a consultant to the Company exclusively for two years to support, as required, Mr. Bhappu and others in the Company with current and future growth initiatives.</p><p><b><u>2025 Highlights</u></b></p><p>Unless noted otherwise, all dollar amounts are in <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> dollars.</p><p><b>Financial Highlights:</b></p><ul type=\"disc\"><li><b>Robust Balance Sheet with Over <money><money>$900 million</money></money> of Liquidity:</b> As of December 31, 2025, the Company had <money><money>$927.4 million</money></money> of working capital, including <money><money>$64.7 million</money></money> of cash and cash equivalents, <money><money>$797.1 million</money></money> of marketable securities (short-term, interest-bearing securities and uranium equities), <money><money>$18.0 million</money></money> of trade and other receivables, and <money><money>$73.5 million</money></money> of inventory, which puts the Company in a strong position to continue to advance its projects.</li><li><b>Completed Upsized <money><money>$700 Million</money></money> Convertible Senior Notes Offering:</b> On October 3, 2025, the Company closed its upsized offering of <percent>0.75%</percent> Convertible Senior Notes due in 2031 for an aggregate principal amount of <money><money>$700.0 million</money></money>, including the exercise in full by the initial purchasers of their option to purchase an additional <money><money>$100.0 million</money></money> of notes, on a deal led by Goldman Sachs &amp; Co. LLC. The notes have a conversion price of <money><money>$20.34</money></money> per common share of Energy Fuels (\"<b>Common Share</b>\"), which represented a premium of approximately <percent>32.5%</percent> to the last reported sale price of the Common Shares on the NYSE American on September 30, 2025, subject to customary anti-dilution adjustments. The effective conversion price of the notes was increased to <money><money>$30.70</money></money> (representing a premium of <percent>100%</percent> over the last reported sale price of the Common Shares on the NYSE American on September 30, 2025) through the purchase of capped call transactions.</li><li><b>Net Loss of <money><money>$86 Million</money></money></b><b>:</b> The Company incurred a net loss of <money><money>$86.1 million</money></money> or <money><money>$0.38</money></money> per share, which is an increase from a net loss of <money><money>$47.8 million</money></money> or <money><money>$0.28</money></money> per share for 2024. The increase was primarily due to higher ongoing costs as expected following the acquisition of Base Resources Limited in Q4 2024, including approximately <money><money>$15.0 million</money></money> increased ongoing selling, general and administrative costs associated with an expanded workforce to effectively progress the Company's global operations. Exploration and development costs were approximately <money><money>$9.0 million</money></money> higher to progress our projects, including: further exploration and development activities relating to the Juniper Zone at the Pinyon Plain Project, development at the La Sal Project, exploration at the Bahia Project and delineation drilling at Nichols Ranch. The Company also incurred approximately <money><money>$6.9 million</money></money> in charges for changes in <location idsrc=\"xmltag.org\" value=\"LC/mg\">Madagascar</location> tax law and exploration projects the Company is no longer pursuing as it focuses on its core projects. Additionally, the average month end spot prices for uranium were approximately <percent>13.8%</percent> lower in 2025 verses 2024 thereby reducing our revenues per pound.</li></ul><p><b>Uranium Milestones:</b></p><ul type=\"disc\"><li><b><money><money>$48 Million</money></money> in Revenue: </b>The Company sold 650,000 pounds of U<sub>3</sub>O<sub>8</sub> at a weighted average realized price of <money><money>$74.21</money></money> per pound for total uranium revenues of <money><money>$48.2 million</money></money>. Spot market sales totaled 350,000 pounds for revenue of <money><money>$26.9 million</money></money> at a weighted average realized price of <money><money>$76.90</money></money> per pound, while long-term contract sales totaled 300,000 pounds for revenue of <money><money>$21.3 million</money></money> at a weighted average realized price of <money><money>$71.06</money></money> per pound.</li><li><b>Mined Over 1.7 Million Pounds of Contained U<sub>3</sub>O<sub>8</sub>: </b>The Company continued mining at its Pinyon Plain, <location idsrc=\"xmltag.org\" value=\"LU/us.ut.lasal\">La Sal</location>, and Pandora mines with combined mined ore and mineralized material containing approximately 1,720,000 pounds of U<sub>3</sub>O<sub>8</sub>. At its Pinyon Plain mine, the Company mined ore containing approximately 1,530,000 pounds of U<sub>3</sub>O<sub>8</sub> with an average grade of approximately <percent>1.62%</percent> eU<sub>3</sub>O<sub>8</sub>, which the Company believes makes Pinyon Plain one of the highest-grade uranium mines in <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> history.</li><li><b>Processed and Produced Over 1.0 Million Pounds of Finished U<sub>3</sub>O<sub>8</sub>:</b> The Company processed and produced 1,015,000 pounds of finished U<sub>3</sub>O<sub>8 </sub>in 2025. The Company commenced its conventional ore processing campaign at the White Mesa Mill in <location idsrc=\"xmltag.org\" value=\"LS/us.ut\">Utah</location> (the \"<b>Mill</b>\") in Q4 2025 as planned, which is expected to continue through Q2 2026 and is expected to support contracted U<sub>3</sub>O<sub>8</sub> deliveries and potential spot sales in 2026. See below for further details.</li><li><b>Two New Long-Term Utility Contracts: </b>The Company entered into two new long-term uranium contracts in Q4 2025 with <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> nuclear power generating companies, expanding its portfolio to six long-term uranium contracts with deliveries extended out to 2032. Both contracts retain exposure to uranium market upside by utilizing hybrid pricing, whereby a portion of the final sales price is calculated on a base escalated price with the other portion based on the spot price at the time of delivery, subject to floors and ceilings.</li><li><b>Well-Stocked to Meet Long-term Contract Obligations and Capture Market Opportunities:</b> Due to mined ore production at the Pinyon Plain, <location idsrc=\"xmltag.org\" value=\"LU/us.ut.lasal\">La Sal</location> and Pandora mines, as well as processing and production at the Mill, the Company is well-stocked to meet its upcoming long-term uranium contract sales and potential spot sales as market conditions warrant. The Company's inventory balances at the end of 2025 were as follows:</li></ul><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml40\"><span class=\"prnews_span\">Ore, mineralized material and raw materials (contained pounds of U<sub>3</sub>O<sub>8</sub>)</span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1,240,000</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml40\"><span class=\"prnews_span\">Work-in-process (contained pounds of U<sub>3</sub>O<sub>8</sub>)</span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">130,000</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml40\"><span class=\"prnews_span\">Finished pounds of U<sub>3</sub>O<sub>8</sub></span></p></td><td class=\"prnpr2 prnpl2 prnvab prntar prnsbtb1 prnrbrb1 prnbbbs prnsblb1\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">810,000</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml40\"><span class=\"prnews_span\">Total pounds of finished and contained U<sub>3</sub>O<sub>8</sub></span></p></td><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">2,180,000</span></p></td></tr></table></div><ul type=\"disc\"><li><b>Exceeded 2025 Guidance: </b>The Company exceeded its production and sales guidance for 2025, which is summarized as follows:</li></ul><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen6\" colspan=\"3\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>2025 Guidance, as revised Q2 2025</b></span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Low</b></span></p></td><td class=\"prnpr2 prnpl2 prnvab prntar prncbts prnrbrb1 prnsbbb1 prnsblb1\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>High</b></span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>2025 Actuals</b></span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml40\"><span class=\"prnews_span\">Mined (contained pounds of U<sub>3</sub>O<sub>8</sub>)</span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">875,000</span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1,435,000</span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1,720,000</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml40\"><span class=\"prnews_span\">Processed (finished pounds of U<sub>3</sub>O<sub>8</sub>)</span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">700,000</span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1,000,000</span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1,015,000</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml40\"><span class=\"prnews_span\">Sales (pounds of U<sub>3</sub>O<sub>8</sub>)</span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">350,000</span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">350,000</span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">650,000</span></p></td></tr></table></div><ul type=\"disc\"><li><b>2026</b> <b>Guidance: </b>The Company expects to continue mining its Pinyon Plain, <location idsrc=\"xmltag.org\" value=\"LU/us.ut.lasal\">La Sal</location> and Pandora mines to process and/or stockpile ore and mineralized material at the Mill to meet its contract deliveries and complete potential spot sales, subject to market conditions. The Company's production and sales guidance for 2026 is as follows:</li></ul><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Low</b></span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>High</b></span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml40\"><span class=\"prnews_span\">Mined (contained pounds of U<sub>3</sub>O<sub>8</sub>)</span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">2,000,000</span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">2,500,000</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml40\"><span class=\"prnews_span\">Processed (finished pounds of U<sub>3</sub>O<sub>8</sub>)<sup>(1)</sup></span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1,500,000</span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">2,500,000</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml40\"><span class=\"prnews_span\">Sales (pounds of U<sub>3</sub>O<sub>8</sub>)<sup>(2)</sup></span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1,500,000</span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">2,000,000</span></p></td></tr></table></div><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen10\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">(1) Assumes the current conventional uranium Mill run continues through Q2 2026, but could be longer depending on availability of stockpiled ore and mineralized materials available for processing. The Company is also looking at various additional REE processing capabilities at the Mill later in 2026. The Mill is expected to restart uranium processing in Q1 2027, but this could be sooner or later, depending on circumstances.</span></p></td></tr><tr><td class=\"prngen10\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">(2) Subject to sales of inventory into the spot market depending on market conditions.</span></p></td></tr></table></div><ul type=\"disc\"><li><b>Uranium Costs Reduced in Q4-2025 with Further Declines Expected in 2026: </b>The Company commenced processing low-cost Pinyon Plain mine ores in Q4 2025, which is expected to continue through Q2 2026, during which we expect to process 1.5 to 2.5 million pounds of finished U<sub>3</sub>O<sub>8</sub> in 2026. During that Mill run, the average mining and transportation costs to the Mill for Pinyon Plain ore are expected to continue to be approximately <money><money>$10</money></money> to <money><money>$14</money></money> per pound of recovered U<sub>3</sub>O<sub>8</sub>, which together with expected milling costs to continue to be approximately <money><money>$13</money></money> to <money><money>$16</money></money> per pound of recovered U<sub>3</sub>O<sub>8</sub>, are expected to continue to result in a total weighted average cost of approximately <money><money>$23</money></money> to <money><money>$30</money></money> per pound of recovered uranium, ranking among the lowest costs for mined uranium production in the world. These high-grade Pinyon Plain ores are expected to be blended and processed with a relatively small quantity of lower grade, higher cost, <location idsrc=\"xmltag.org\" value=\"LU/us.ut.lasal\">La Sal</location>/Pandora mineralized material at the Company's discretion. The Company's finished inventories of U<sub>3</sub>O<sub>8</sub> had a weighted average cost of approximately <money><money>$43</money></money> per pound as of December 31, 2025, reflecting the weighted average cost of production and purchase of finished inventories from various sources over the years, as the Company continued to ramp up production and maximize economies of scale, including from Alternate Feed Materials, the <location idsrc=\"xmltag.org\" value=\"LU/us.ut.lasal\">La Sal</location>/Pandora mines, low-grade mine clean-up materials, and purchases of uranium on the spot market. These costs do not fully reflect the expected lower costs of recently mined ores from the Pinyon Plain mine, which had only been processed and added to finished inventories commencing in early October (a conventional ore processing run, including Pinyon Plain and <location idsrc=\"xmltag.org\" value=\"LU/us.ut.lasal\">La Sal</location>/Pandora ores, commenced at the Mill in early October 2025).</li><li><b>Pinyon Plain Update:</b> The Company updated its existing S-K 1300 and NI 43-101 compliant pre-feasibility study, which was furnished through a Form 8-K filing on February 26, 2026. Due to the high grades encountered during mining in the Main Zone that were not included in the original pre-feasibility the Mineral Resource model was re-estimated. Additionally, new drilling completed by Company in the Juniper Zone allowed those Mineral Resources to be converted from inferred to indicated Mineral Resources and then converted to probable Mineral Reserves. As of December 31, 2025, the remaining Mineral Reserves in the Main Zone totaled 2.1 million pounds U<sub>3</sub>O<sub>8</sub> and the Mineral Reserves for the Juniper Zone totaled 0.5 million pounds U<sub>3</sub>O<sub>8</sub>, acknowledging that further exploration potential exists in the Juniper Zone. The Company intends to continue exploration in the Juniper Zone during 2026.</li><li><b>Nichols Ranch and Whirlwind Update: </b>The Company continues to advance rehabilitation, development and readiness activities at its Whirlwind mine in <location idsrc=\"xmltag.org\" value=\"LS/us.co\">Colorado</location> and Nichols Ranch ISR project in <location idsrc=\"xmltag.org\" value=\"LS/us.wy\">Wyoming</location>. With strong market conditions and sufficient contracting activity, the Company believes these projects could support an increase in uranium production by up to approximately 600,000 pounds of U<sub>3</sub>O<sub>8</sub> per year as early as 2027, subject to market conditions.</li><li><b>Pipeline of Permitted and Advanced Uranium Projects to Support Long-Term Growth: </b>The Company continued advancing permitting and development work on its large-scale uranium projects including Roca Honda (<location idsrc=\"xmltag.org\" value=\"LS/us.nm\">New Mexico</location>) and Bullfrog (<location idsrc=\"xmltag.org\" value=\"LS/us.ut\">Utah</location>), which together with Sheep Mountain (<location idsrc=\"xmltag.org\" value=\"LS/us.wy\">Wyoming</location>) have the potential to expand the Company's uranium production by over 5.0 million pounds of U<sub>3</sub>O<sub>8</sub> per year in the coming years, subject to market conditions and contracting.</li><li><b>Uranium Price Update: </b>The spot price of U<sub>3</sub>O<sub>8</sub> is <money><money>$89.50</money></money> per pound and the long-term price of U<sub>3</sub>O<sub>8</sub> is <money><money>$90.00</money></money> per pound, according to price data from TradeTech as of February 20, 2026.</li></ul><p><b>Rare Earth Element Milestones:</b></p><ul type=\"disc\"><li><b>Planned Expansion of Phase 1 Circuit:</b> The Company is planning enhancements to expand its heavy REE production at its existing Phase 1 Circuit at the Mill, for the planned commercial-level recovery of dysprosium (\"<b>Dy</b>\"), terbium (\"<b>Tb</b>\"), samarium (\"<b>Sm</b>\"), europium (\"<b>Eu</b>\") and gadolinium (\"<b>Gd</b>\"), with the ability to separate other heavy REEs such as Yttrium and Lutetium if market conditions warrant. Subject to receipt of all required regulatory approvals, financing, the successful development of these enhancements and the receipt of sufficient quantities of monazite sand feedstock, the expanded Phase 1 Circuit is expected to be operational in 2027 for the production of up to 35 tonnes of Dy, 12 tonnes of Tb per year and potentially other heavy REEs, in addition to the 850 – 1,000 tonnes of neodymium-praseodymium (\"<b>NdPr</b>\"), from processing up to approximately 10,000 tonnes of monazite per year. The Company had previously announced its intention to start commercial production of Dy and Tb by the end of 2026, but has changed those plans in order to expand the enhancements to the Mill's Phase 1 Circuit to allow for the additional production of Sm, Eu and Gd and to provide the ability to separate other heavy REEs in the 2027 time frame.<br/><br/>At the same time these enhancements are being made to the Phase 1 Circuit, the Company plans to make further enhancements to the Phase 1 Circuit to allow for the processing of uranium- and REE-bearing mixed rare earth carbonate (\"<b>MREC</b>\") or similar intermediary REE products from third-party sources in the Phase 1 Circuit, subject to receipt of all regulatory approvals, financing and the successful development of these further enhancements. As MREC or similar intermediate REE products would not need to utilize the Phase 1 Circuit's crack and leach circuits, it is expected that such products could be separated into NdPr and heavy REEs separately from uranium production, thereby allowing such feedstocks to be separated into REE oxides through the Phase 1 Circuit's SX circuits without interfering with normal Mill conventional uranium ore processing. These enhancements are expected to be made, and the Phase 1 Circuit operational to accept MREC and similar intermediary REE products in 2027. Multiple magnet manufacturers and OEMs have expressed strong interest in obtaining Dy, Tb and Sm samples, further validating the Company's strategy to establish a fully non-Chinese rare earth supply chain for commercial and defense applications.</li></ul><ul type=\"disc\"><li><b>Phase 2 Expansion Planned to Enable Large-Scale Production of Light and Heavy REEs: </b>In January 2026, the Company announced results of an AACE International (AACE) Class 3 Bankable Feasibility Study (\"<b>BFS</b>\") supporting the planned Phase 2 expansion. Highlights of the planned Phase 2 expansion include:<ul type=\"disc\"><li>Upon commissioning, Energy Fuels' Phase 2 Circuit is expected to become one of the world's largest and lowest cost producers of 'light' and 'heavy' rare earth oxides. The Mill has the current installed recovery in its existing Phase 1 Circuit to produce roughly 1,000 tonnes per annum (\"<b>tpa</b>\") NdPr. The Phase 2 Circuit will increase total expected production recovery (from the Phase 1 Circuit and Phase 2 Circuit) to over 6,000 tpa of NdPr (along with approximately 60 tpa of Tb and 200 tpa of Dy).</li><li>A <money><money>$1.9 billion</money></money> NPV<sub><percent>8%</percent></sub>, or <money><money>$7.96</money></money> per share (based on current outstanding shares), and IRR of <percent>33%</percent> (after-tax) for the Phase 2 Circuit, which does not include the Company's recently announced Vara Mada Project or any of the Company's other heavy mineral sands (\"<b>HMS</b>\")/monazite projects, all of which are expected to supply REE ore to the Mill for processing into REE oxides.<ul type=\"disc\"><li>The NPV increases to <money><money>$3.7 billion</money></money>, or <money><money>$15.26</money></money> per share (based on current shares outstanding), when the Phase 2 Circuit is combined with the recently announced <money><money>$1.8 billion</money></money> NPV from the Company's Vara Mada Project.</li></ul></li><li><money><money>$311 million</money></money> of average annual EBITDA for the first 15 years from the Phase 2 Circuit, not including expected EBITDA from the Company's existing Phase 1 Circuit, recently announced expected project-level EBITDA from the Company's Vara Mada project, project-level EBITDA from any of the Company's other HMS/monazite projects, or the Company's <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> industry leading uranium production.<ul type=\"disc\"><li>Expected average annual EBITDA increases to <money><money>$765 million</money></money> for the first 15 years when the Phase 2 Circuit is combined with the recently announced expected EBITDA from the Company's Vara Mada project over those years.</li></ul></li><li>Annual expected REE oxide production (recovered) over the 40-year modeled life of the project from the Phase 2 Circuit alone:<ul type=\"disc\"><li>5,513 tpa NdPr</li><li>48 tpa Tb</li><li>165 tpa Dy</li><li>1,080 tpa SEG concentrate (samarium, europium and gadolinium)</li><li>748 tpa Ho+ concentrate (Ho, Er, Tm, Yb, Lu and Y)</li><li>198,000 pounds per year uranium (U<sub>3</sub>O<sub>8</sub>), which is in addition to the Company's <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location>-leading uranium production from its Pinyon Plain, <location idsrc=\"xmltag.org\" value=\"LU/us.ut.lasal\">La Sal</location> and other conventional uranium mines.</li></ul></li><li>With an estimated capital cost of <money><money>$410 million</money></money> for the Phase 2 Circuit and an estimated all-in production cost of <money><money>$29.39</money></money>/kg NdPr equivalent produced from our Vara Mada project, <i>we believe our REE oxide production ranks among the lowest capital and operating costs globally.</i></li><li>The Company has not yet made a final investment decision (\"<b>FID</b>\") with respect to the Phase 2 Circuit.</li></ul></li><li><b>Planned Phase 1 and Phase 2 Expansion Recoveries:</b></li></ul><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Phase</b></span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>NdPr (tpa)</b></span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Tb (tpa)</b></span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Dy (tpa)</b></span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Phase 1: NdPr (Existing)</span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1,049</span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">—</span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">—</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Phase 1: Heavies (Planned)</span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">—</span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">12</span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">35</span></p></td></tr><tr><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Phase 2: (Planned)</span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">5,513</span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">48</span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">165</span></p></td></tr><tr><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Total (Phase 1 + Phase 2)<sup>(1)</sup></span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">6,562</span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">60</span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">200</span></p></td></tr></table></div><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><sup>(1) </sup></span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Actual recoveries may differ.</span></p></td></tr></table></div><ul type=\"disc\"><li><b>First <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> Producer to Publicly Report Commercial-Spec Dysprosium Production: </b>The Company successfully produced separated Dy oxide at <percent>99.9%</percent> purity, exceeding typical commercial specifications.</li><li><b><location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> Mined and Processed Rare Earths Successfully Manufactured into Permanent Magnets for Use in EVs and Hybrids:</b> In September 2025, the Company announced that high-purity NdPr oxide produced from <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location>-sourced monazite concentrates was successfully manufactured into commercial-scale rare earth permanent magnets (\"<b>REPMs</b>\") by <location idsrc=\"xmltag.org\" value=\"LC/kr\">South Korea's</location> largest manufacturer of EV drive unit motor cores. Approximately 1.2 metric tonnes of NdPr oxide were processed into approximately 3.0 metric tonnes of REPMs, enough to power approximately 1,500 new vehicles, and the magnets passed all quality assurance and quality control benchmarks for use in EV and hybrid applications.</li><li><b>Strategic Collaboration with Vulcan Elements to Strengthen <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> Magnet Supply Chains: </b>In August 2025, the Company signed a Memorandum of Understanding with Vulcan Elements to advance a secure, ex-<location idsrc=\"xmltag.org\" value=\"LC/cn\">China</location> supply chain for rare earth permanent magnets. Under the collaboration, the Company will supply high-purity NdPr and Dy oxides for validation in Vulcan's magnet manufacturing processes, with the intent to consider negotiating longer-term supply arrangements following validation.</li><li><b>Technology Applicable to a Wide Range of Feedstocks: </b>Unlike other companies who are experimenting with \"heavy\" REE production via recycling, we believe Energy Fuels is the only <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> company producing separated \"heavy\" REE oxides from commercial REE ores. The REE separation techniques being utilized by Energy Fuels can also be applied to a wide range of feedstocks, including MREC and recycled materials.</li><li><b>REE Price Update</b><b>: </b>European NdPr, Dy and Tb prices were <money><money>$130</money></money>/kg, <money><money>$1,125</money></money>/kg and <money><money>$4,500</money></money>/kg, respectively, as of February 19, 2026, according to price data from Benchmark Mineral Intelligence.</li></ul><p><b>Heavy Mineral Sands:</b></p><ul type=\"disc\"><li><b>Vara Mada Project (formerly known as the \"Toliara Project\"): </b>On January 8, 2026, the Company announced results of an updated Feasibility Study (\"<b>FS</b>\"), prepared in accordance with <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> Regulation S-K 1300 and Canadian NI 43-101, confirming the project's world-class scale, long mine life and robust economics. Based on the FS, the project is expected to have a modeled mine life of approximately 38 years and is projected to generate a post-tax, pre-debt net present value (<percent>10%</percent> discount rate) of approximately <money><money>$1.8 billion</money></money> and a post-tax internal rate of return of approximately <percent>25%</percent>, with the potential to ramp up to over <money><money>$500 million</money></money> of annual EBITDA and generate average annual free cash flow of approximately <money><money>$264 million</money></money> over the modeled mine life. Advancement of the Vara Mada Project remains subject to a positive FID, regulatory approvals and the resolution of outstanding fiscal and permitting matters with the Government of <location idsrc=\"xmltag.org\" value=\"LC/mg\">Madagascar</location>.<br/><br/>Since acquiring the Project, the Company has been in discussions with the Government of <location idsrc=\"xmltag.org\" value=\"LC/mg\">Madagascar</location> to establish the necessary legal regime to support development of the Project, which will be required before a positive FID can be made. These discussions have been focused on, among other things, mechanisms for achieving legal and fiscal stability, select tax and custom benefits, necessary adjustments to foreign exchange rules, protections from expropriation and access to international arbitration for dispute resolution. The Company has also been seeking clarification of existing procedures for adding monazite to the Project's mining permit, which currently allows for the production of ilmenite, rutile, and zircon. Recent discussions with the Government have focused on addressing these issues through an investment agreement to be approved by Parliament or through revisions to existing Malagasy law applicable to large-scale mining investments.<br/><br/>On October 17, 2025, a new President of <location idsrc=\"xmltag.org\" value=\"LC/mg\">Madagascar</location> was sworn in by the Country's High Constitutional Court following a period of social unrest and political instability that resulted in the removal of the Country's prior President. On October 20, 2025, a new Prime Minister was appointed, and on October 28, 2025, a new cabinet was announced. At this time, it is too early to determine whether and to what extent recent social and political developments in <location idsrc=\"xmltag.org\" value=\"LC/mg\">Madagascar</location> may impact the Vara Mada Project, whether positively or negatively, including with respect to the Project's development prospects or timelines, the ability to achieve suitable fiscal or other terms applicable to the Project or the ability to achieve a positive FID. These developments have not had an impact on the financial results of the Company at this time. The Company will continue to monitor events as they unfold.<br/><br/>There can be no assurance of achieving sufficient legal and fiscal stability or the timing thereof, or obtaining approval of the addition of monazite to the mining permit or the timing thereof. If such approvals are not obtained, or obtained on terms less favorable than expected, this could delay any FID in relation to the Vara Mada Project or prevent or otherwise have a significant effect on the development of the Vara Mada Project or ability to recover monazite from the Vara Mada Project.</li></ul><ul type=\"disc\"><li><b>Donald Project: </b>The Company continued to advance the Donald Project, a large monazite-rich HMS project in <location idsrc=\"xmltag.org\" value=\"LC/au\">Australia</location>, pursuant to its joint venture with Astron Corporation Limited. Having received the final major regulatory approval required to construct and operate the Donald Project, along with advancing commercial and financing avenues, the Company expects that an FID could be made on the Donald Project as early as Q1 2026. The Donald Project is of particular interest as the monazite concentrate has exceptional concentrations of the \"heavy\" rare earth elements, including Dy, Tb, and Sm.</li><li><b>Bahia Project:</b> The Company resumed drilling at the Bahia Project in Q4 2025 after securing its exploration permit, aiming to complete S-K 1300 and NI 43-101 reports by late 2026.</li></ul><p><b>Medical Isotope Highlights:</b></p><ul type=\"disc\"><li>The Company continues to advance its medical isotope initiatives to separate critical radioisotopes to support plans for the development and production of medical isotopes used in cancer treatments.</li><li>The Company is currently completing test work and engineering on its research and development (\"<b>R&amp;D</b>\") pilot facility for radium-226 (\"<b>Ra-226</b>\") production. In parallel, the Company continued efforts related to obtaining the required licensing and advancing engineering work for the potential concentration of R&amp;D quantities of radium-228 (\"<b>Ra-228</b>\") at the Mill.</li><li>During 2026, Energy Fuels plans to continue test work and design and to commission and begin operating a pilot facility to produce R&amp;D quantities of Ra-226 for testing by end-users of the product. Upon successful production of R&amp;D quantities of Ra-226, Energy Fuels plans to develop capabilities at the Mill for the commercial-scale production of Ra-226 and potentially Ra-228 by as early as 2028, conditional on completion of engineering design, securing sufficient offtake agreements for final radium production and receipt of all required regulatory approvals.</li></ul><p><b>Mr. Chalmers continued:</b></p><p>\"We invite all stakeholders to join us in our upcoming February 27, 2026, earnings call, details of which are below, to learn more about our exciting achievements.\"</p><p><b>Conference Call and Webcast at 9:00 AM MT (11:00 AM ET) on Friday, February 27, 2026:</b></p><p><b>Conference call access with the ability to ask questions:</b></p><p>To instantly join the conference call by phone, please use the following link to easily register your name and phone number. After registering, you will receive a call immediately and be placed into the conference call.</p><ul type=\"disc\"><li>Rapid Connect URL:  <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628870-1&amp;h=1351257107&amp;u=https%3A%2F%2Fedge.prnewswire.com%2Fc%2Flink%2F%3Ft%3D0%26l%3Den%26o%3D4618505-1%26h%3D3693718769%26u%3Dhttps%253A%252F%252Furl.us.m.mimecastprotect.com%252Fs%252FRrwuCQW8qoCkWkRxtxfLIGpJFA%253Fdomain%253Dregistrations.events%26a%3Dhttps%253A%252F%252Fregistrations.events%252Feasyconnect%252F7303950%252Frec487vdZtbJNlQLJ%252F&amp;a=https%3A%2F%2Fregistrations.events%2Feasyconnect%2F7303950%2Frec487vdZtbJNlQLJ%2F\" rel=\"nofollow noopener\" target=\"_blank\">https://registrations.events/easyconnect/7303950/rec487vdZtbJNlQLJ/</a></li></ul><p>Alternatively, you may dial in to the conference call where you will be connected to the call by an Operator.</p><ul type=\"disc\"><li>North American Toll Free: 1-800-715-9871</li></ul><p><b>To view the webcast online:</b></p><p>Audience URL:  <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628870-1&amp;h=2612183190&amp;u=https%3A%2F%2Fedge.prnewswire.com%2Fc%2Flink%2F%3Ft%3D0%26l%3Den%26o%3D4618505-1%26h%3D4099956691%26u%3Dhttps%253A%252F%252Furl.us.m.mimecastprotect.com%252Fs%252F5BA2CR6VrpuvLvOVtNhvI1sl0P%253Fdomain%253Dapp.webinar.net%26a%3Dhttps%253A%252F%252Fapp.webinar.net%252FmqLMz6vzOEY&amp;a=https%3A%2F%2Fapp.webinar.net%2FmqLMz6vzOEY\" rel=\"nofollow noopener\" target=\"_blank\">https://app.webinar.net/mqLMz6vzOEY</a></p><p><b>Conference Replay</b></p><ul type=\"disc\"><li>Conference Replay Toronto: 1-647-362-9199</li><li>Conference Replay North American Toll Free: 1-800-770-2030</li><li>Conference Replay Entry Code: 7303950#</li><li>Conference Replay Expiration Date: 06/06/2026</li></ul><p>The Company's Annual Report on Form 10-K has been filed with the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> Securities and Exchange Commission (\"<b>SEC</b>\") and may be viewed on the Electronic Document Gathering and Retrieval System (\"<b>EDGAR</b>\") at <u><a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628870-1&amp;h=2217431087&amp;u=https%3A%2F%2Fwww.sec.gov%2Fedgar&amp;a=www.sec.gov%2Fedgar.html\" rel=\"nofollow noopener\" target=\"_blank\">www.sec.gov/edgar.html</a></u>, on the System for Electronic Data Analysis and Retrieval + (\"<b>SEDAR+</b>\") at <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628870-1&amp;h=519296871&amp;u=https%3A%2F%2Fwww.sedarplus.ca%2Fhome%2F&amp;a=www.sedarplus.ca\" rel=\"nofollow noopener\" target=\"_blank\"><u>www.sedarplus.ca</u></a>, and on the Company's website at <u><a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628870-1&amp;h=1822451528&amp;u=https%3A%2F%2Fwww.energyfuels.com%2F&amp;a=www.energyfuels.com\" rel=\"nofollow noopener\" target=\"_blank\">www.energyfuels.com</a></u>. Unless noted otherwise, all dollar amounts are in <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> dollars.</p><p><b>Selected Summary Financial Information:</b></p><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen12\" colspan=\"3\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen6\" colspan=\"5\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Years Ending December 31,</b></span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen11\" colspan=\"3\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><i>(In thousands, except per share data)</i></span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen13\" colspan=\"3\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>2025</b></span></p></td><td class=\"prngen14\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>2024</b></span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen2\" colspan=\"3\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Results of Operations:</b></span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"3\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen2\" colspan=\"3\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Uranium concentrates revenues</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"3\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">$                     48,234</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">$                     37,904</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen2\" colspan=\"3\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Heavy mineral sands revenues</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"3\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">15,821</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">39,874</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen2\" colspan=\"3\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Total revenues</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"3\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">65,922</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">78,114</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen2\" colspan=\"3\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Operating loss</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"3\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">(101,155)</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">(47,515)</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen2\" colspan=\"3\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Net loss attributable to Energy Fuels Inc.</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"3\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">(85,634)</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">(47,765)</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen2\" colspan=\"3\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Basic net loss per common share</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"3\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">$                        (0.38)</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">$                        (0.28)</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen2\" colspan=\"3\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Diluted net loss per common share</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"3\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">$                        (0.38)</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">$                        (0.28)</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen12\" colspan=\"3\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"3\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen9\" colspan=\"8\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>December 31,</b></span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><i>(In thousands)</i></span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prnpr4 prnpl2 prnvab prntac prnsbtb1 prnrbrb1 prnsbbb1 prnsblb1\" colspan=\"3\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>2025</b></span></p></td><td class=\"prngen14\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prnpr4 prnpl2 prnvab prntac prncbts prnrbrb1 prnsbbb1 prnsblb1\" colspan=\"4\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>2024</b></span></p></td></tr><tr><td class=\"prnpr2 prnpl2 prnvab prncbts prnrbrb1 prnsbbb1 prnsblb1\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Financial Position:</b></span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen14\" colspan=\"3\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen14\" colspan=\"4\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Working capital</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"3\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">$                         927,438</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"4\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">$                         170,898</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Property, plant and equipment, net</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"3\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">69,795</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"4\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">55,187</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Mineral properties, net</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"3\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">312,266</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"4\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">278,330</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Current assets</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"3\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">958,671</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"4\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">230,187</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Total assets</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"3\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1,411,852</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"4\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">611,969</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Current liabilities</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"3\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">31,233</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"4\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">59,289</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Total liabilities</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"3\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">729,282</span></p></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"4\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">80,292</span></p></td></tr><tr><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><br/></td></tr></table></div><p><b>Qualified Person Statement</b></p><p>The scientific and technical information disclosed in this news release was reviewed and approved by Daniel D. Kapostasy, PG, Registered Member SME and Vice President, Technical Services for the Company, who is a \"Qualified Person\" as defined in S-K 1300 and National Instrument 43-101.</p><p><b>ABOUT ENERGY FUELS</b></p><p><i>Energy Fuels is a leading US-based critical materials company, focused on uranium, REEs, HMS, vanadium and medical isotopes. The Company has been the leading <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> producer of natural uranium concentrate for the past several years, which is sold to nuclear utilities that process it further for the production of carbon-free nuclear energy and owns and operates several conventional and in-situ recovery uranium projects in the western <location idsrc=\"xmltag.org\" value=\"LC/us\">United States</location>. The Company also owns the White Mesa Mill in <location idsrc=\"xmltag.org\" value=\"LS/us.ut\">Utah</location>, which is the only fully licensed and operating conventional uranium processing facility in <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location>. At the Mill, the Company also produces advanced REE products, vanadium oxide (when market conditions warrant), and is evaluating the recovery of certain medical isotopes from existing uranium process streams needed for emerging cancer treatments. The Company also owns the operating Kwale HMS project in <location idsrc=\"xmltag.org\" value=\"LC/ke\">Kenya</location> which ceased mining and commenced final reclamation activities at the end of 2024, and is developing three (3) additional HMS projects: the Toliara Project in <location idsrc=\"xmltag.org\" value=\"LC/mg\">Madagascar</location>; the Bahia Project in <location idsrc=\"xmltag.org\" value=\"LC/br\">Brazil</location>; and the Donald Project in <location idsrc=\"xmltag.org\" value=\"LC/au\">Australia</location> in which the Company has the right to earn up to a <percent>49%</percent> interest in a joint venture with Astron Corporation Limited. The Company is based in <location idsrc=\"xmltag.org\" value=\"LU/us.co.lakood\">Lakewood, Colorado</location>, near <location idsrc=\"xmltag.org\" value=\"LU/us.co.denver\">Denver</location>. The primary trading market for Energy Fuels' common shares is the NYSE American under the trading symbol \"<a class=\"symbol-link\" href=\"/overview/UUUU/\" title=\"View UUUU stock overview\">UUUU</a>,\" and the Company's common shares are also listed on the Toronto Stock Exchange under the trading symbol \"EFR.\" For more information on all we do, please visit <u><a href=\"http://www.energyfuels.com\" rel=\"nofollow noopener\">www.energyfuels.com</a></u>.</i></p><p><b><i>Cautionary Note Regarding Forward-Looking Statements:</i></b> <i>This news release contains certain \"Forward Looking Information\" and \"Forward Looking Statements\" within the meaning of applicable <location idsrc=\"xmltag.org\" value=\"LC/us\">United States</location> and Canadian securities legislation, which may include, but are not limited to, statements with respect to: any expectation that the Company will maintain its position as a leading <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location>-based critical minerals company or as the leading producer of uranium in the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location>; any expectation with respect to timelines to production; any expectation as to rate, quantities or duration of production; any expectations as to uranium or other mineral grades and whether such grades will continue or change over time; any expectation as to costs of goods sold, costs of production or gross profits, gross margins or other margins; any expectation as to future sales or sales prices; any expectations as to future inventory levels or changes to inventory levels; any expectation that the Company will be profitable; any expectation that the REE separation techniques being utilized by Energy Fuels can also be applied to a wide range of feedstocks, including rare earth concentrates, and recycle materials; any expectation that the Company will develop its planned expansion of REE separation capacity at the Mill; any expectation that the Company's permitting efforts will be successful and as to any potential future production from any properties that are in the permitting or development stage; any expectation with respect to the Company's planned exploration programs; any expectation that any of the critical minerals the Company produces will have a valuable upside; any expectation that the proposed ASM acquisition will close; any expectation that the Company's Vara Mada Project or Donald Project will advance to an FID within the expected timeframes or at all;  any expectation that Energy Fuels will be successful in agreeing on fiscal terms with the Government of <location idsrc=\"xmltag.org\" value=\"LC/mg\">Madagascar</location> or in achieving sufficient fiscal and legal stability for the Vara Mada Project; any expectation that the Company will be successful in its engineering and test work for the production of Ra-226 at the Mill; any expectation that the Company's evaluation of radioisotope recovery at the Mill will be successful; any expectation that any radioisotopes that can be recovered at the Mill will be sold on a commercial basis; any expectation as to the quantities to be delivered under existing uranium sales contracts; and any expectation as to future uranium, vanadium, REE or HMS prices or market conditions. Generally, these forward-looking statements can be identified by the use of forward-looking terminology such as \"plans,\" \"expects,\" \"does not expect,\" \"is expected,\" \"is likely,\" \"budgets,\" \"scheduled,\" \"estimates,\" \"forecasts,\" \"intends,\" \"anticipates,\" \"does not anticipate,\" or \"believes,\" or variations of such words and phrases, or state that certain actions, events or results \"may,\" \"could,\" \"would,\" \"might\" or \"will be taken,\" \"occur,\" \"be achieved\" or \"have the potential to.\" All statements, other than statements of historical fact, herein are considered to be forward-looking statements. Forward-looking statements involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the Company to be materially different from any future results, performance or achievements express or implied by the forward-looking statements. Factors that could cause actual results to differ materially from those anticipated in these forward-looking statements include risks associated with: commodity prices and price fluctuations; engineering, construction, processing and mining difficulties, upsets and delays; permitting and licensing requirements and delays; the inclusion or exclusion, or change in listing status, of one or more Company projects on the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> Federal Infrastructure Project's Permitting Dashboard, list of FAST-41 Transparency Projects; changes to regulatory requirements; the imposition of tariffs and other restrictions on trade; legal challenges; the availability of feed sources for the Mill; competition from other producers; public opinion; government and political actions or inactions; the failure of the Government of <location idsrc=\"xmltag.org\" value=\"LC/mg\">Madagascar</location> to agree on fiscal terms for the Vara Mada Project or provide the approvals necessary to achieve sufficient fiscal and legal stability on acceptable terms and conditions or at all; the failure of the Company to obtain the required permits for the recovery of Monazite from the Vara Mada Project; the failure of the Company to provide or obtain the necessary financing required to develop the Vara Mada Project, the Donald Project, the Bahia Project and/or its expanded REE separations capacity; available supplies of monazite; the ability of the Mill to produce RE Carbonate, REE oxides or other REE products to meet commercial specifications on a commercial scale at acceptable costs or at all; market factors, including future demand for REEs; actual results differing from estimates and projections; the ability of the Mill to recover radium or other radioisotopes at reasonable costs or at all; market prices and demand for medical isotopes; and the other factors described under the caption \"Risk Factors\" in the Company's most recently filed Annual Report on Form 10-K, which is available for review on EDGAR at <u><a href=\"http://www.sec.gov/edgar\" rel=\"nofollow noopener\">www.sec.gov/edgar</a></u>, on SEDAR+ at <u><a href=\"http://www.sedarplus.ca\" rel=\"nofollow noopener\">www.sedarplus.ca</a></u>, and on the Company's website at <u><a href=\"http://www.energyfuels.com\" rel=\"nofollow noopener\">www.energyfuels.com</a></u>. Forward-looking statements contained herein are made as of the date of this news release, and the Company disclaims, other than as required by law, any obligation to update any forward-looking statements whether as a result of new information, results, future events, circumstances, or if management's estimates or opinions should change, or otherwise. There can be no assurance that forward-looking statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, the reader is cautioned not to place undue reliance on forward-looking statements. The Company assumes no obligation to update the information in this communication, except as otherwise required by law.</i></p><p><u><a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628870-1&amp;h=1822451528&amp;u=https%3A%2F%2Fwww.energyfuels.com%2F&amp;a=www.energyfuels.com\" rel=\"nofollow noopener\" target=\"_blank\">www.energyfuels.com</a></u></p><p>SOURCE Energy Fuels Inc.</p></div></article>",
            "link": "https://www.stocktitan.net/news/UUUU/energy-fuels-announces-2025-results-and-2026-b5h8r2y9570e.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 00:01:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Copa Holdings Files Annual Report Form 20-F | CPA Stock News",
            "description": "<article class=\"article\"><p align=\"justify\">PANAMA CITY, Feb.  26, 2026  (GLOBE NEWSWIRE) -- Copa Holdings, S.A. (NYSE: <a class=\"symbol-link\" href=\"/overview/CPA/\" title=\"View CPA stock overview\">CPA</a>), has filed its annual report Form 20-F for the fiscal year ended December 31, 2025, with the U.S. Securities and Exchange Commission.</p> <p align=\"justify\">The report is available in the investor relations section of Copa's website at <a href=\"https://www.globenewswire.com/Tracker?data=pUUfyCPtvgkr3Q30gBIpk8HWqmQAEc6a2QmB3xfL7Lc8wAjPridNNekm1wJRuzRv9qBxpDLmBZutmqTmHl3xwbWZU-YlBMRy_c2smmNC3pg=\" rel=\"nofollow noopener\" target=\"_blank\">www.copaair.com</a>.</p> <p align=\"justify\">Shareholders may receive a hard copy of the report, which includes Copa's audited financial statements, free of charge through the contact below.</p> <table style=\"border-collapse: collapse; width:100%; border-collapse:collapse ;\"><tr><td style=\"vertical-align: top ; \"><strong>Electronic Link:</strong></td><td style=\"vertical-align: top ; \"><a href=\"https://ir.copaair.com/financial-information/sec-filings\" rel=\"nofollow noopener\" target=\"_blank\">https://ir.copaair.com/financial-information/sec-filings</a></td><td style=\"vertical-align: bottom ; \"> </td></tr><tr><td style=\"vertical-align: top ; \"><strong>Hard Copy Request Link:</strong></td><td style=\"vertical-align: top ; \"><a href=\"https://ir.copaair.com/printed-materials\" rel=\"nofollow noopener\" target=\"_blank\">https://ir.copaair.com/printed-materials</a></td><td style=\"vertical-align: bottom ; \"> </td></tr><tr><td> </td><td> </td><td> </td></tr></table> <p align=\"justify\">For more information, please contact Copa Holdings' Investor Relations in the “Contact Us” section of the company’s investor relations website: ir.copaair.com.</p> <p align=\"justify\"><em>Copa Holdings is a leading Latin American provider of passenger and cargo services. The Company, through its operating subsidiaries, provides service to countries in North, Central and South America and the Caribbean. For more information visit <a href=\"https://www.globenewswire.com/Tracker?data=pUUfyCPtvgkr3Q30gBIpk_mxfsofPziRnXglhW6SaP1Anws9OhJp7NB2FsTA9aUZYC_gowWc2ykq_kU6sV7TWA0ggafqbeDdL2tbETmhMt8=\" rel=\"nofollow noopener\" target=\"_blank\">www.copaair.com</a>.</em></p> <p align=\"justify\"><em>CPA-G</em></p> <p align=\"justify\"><strong>Investor Relations </strong><br/><a href=\"https://www.globenewswire.com/Tracker?data=8P4Yktk3mEuw4g8mtwiAZfuG6iT_OePsnd8YTeW94cyXOpqT9Z_VSZci8gaayiqal-nFZ9mP-CBP0OYP8wbZKSp6Svvk1L36gfJe-6hR3c8TlhZqduum28ftLi3zio64\" rel=\"nofollow noopener\" target=\"_blank\">investor.relations@copaair.com</a></p> <img alt=\"\" class=\"__GNW8366DE3E__IMG\" loading=\"lazy\" src=\"https://www.globenewswire.com/newsroom/ti?nf=OTY2MjYyOCM3NDU4Mzg3IzIxMjI3Njg=\"/> <br/><img alt=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\" src=\"https://ml.globenewswire.com/media/ZTJiYzRlYWMtMjI4Ny00MzRlLTllMWMtNThjNTdhNWNmM2UxLTExMzQzMzktMjAyNi0wMi0yNy1lbg==/tiny/Copa-Holdings-S-A-.png\"/></article>",
            "link": "https://www.stocktitan.net/news/CPA/copa-holdings-files-annual-report-form-20-r7a87synldta.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 00:03:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Stellus Capital Investment Corporation Schedules 2025 Fourth Quarter and Annual Financial Results Conference Call | SCM Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.tx.houstn\">HOUSTON</location></span>, <span class=\"legendSpanClass\">Feb. 26, 2026</span> /PRNewswire/ -- Stellus Capital Investment Corporation (NYSE: <a class=\"symbol-link\" href=\"/overview/SCM/\" title=\"View SCM stock overview\">SCM</a>) will release its financial results for the fourth quarter and year ended December 31, 2025 on Wednesday, March 11, 2026 after the close of the stock market.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\"><p><a href=\"https://mma.prnewswire.com/media/416430/Stellus_Capital_Investment_Corporation_Logo.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/416430/Stellus_Capital_Investment_Corporation_Logo.jpg\" title=\"\"/></a></p></div><p>Stellus Capital Investment Corporation will host a conference call to discuss these results on Thursday, March 12, 2026 at 10:00 AM, Central Time. The conference call will be led by Robert T. Ladd, Chief Executive Officer, and W. Todd Huskinson, Chief Financial Officer, Chief Compliance Officer, Treasurer, and Secretary.</p><p><b>Conference Call Details</b></p><p><b>Via Phone: </b>Dial 888-506-0062 (domestic). Use passcode 401700. Starting approximately two hours after the conclusion of the call, a replay will be available through Friday, March 20, 2026 by dialing 877-481-4010 and entering passcode 53704.</p><p><b>Via Live Webcast:</b> Connect via the Public Company (SCIC) section of our website at <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628658-1&amp;h=1891744529&amp;u=http%3A%2F%2Fwww.stelluscapital.com%2F&amp;a=www.stelluscapital.com\" rel=\"nofollow noopener\" target=\"_blank\">www.stelluscapital.com</a>, under the Events tab. A replay of the conference will be available on our website for approximately 90 days.</p><p><b>About Stellus Capital Investment Corporation</b></p><p>The Company is an externally-managed, closed-end, non-diversified investment management company that has elected to be regulated as a business development company under the Investment Company Act of 1940. The Company's investment objective is to maximize the total return to its stockholders in the form of current income and capital appreciation by investing primarily in private middle-market companies (typically those with <money><money>$5.0 million</money></money> to <money><money>$50.0 million</money></money> of EBITDA (earnings before interest, taxes, depreciation and amortization)) with a focus on investing through first lien (including unitranche) loans, often with a corresponding equity investment. The Company's investment activities are managed by its investment adviser, Stellus Capital Management, LLC. To learn more about Stellus Capital Investment Corporation, visit <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628658-1&amp;h=1891744529&amp;u=http%3A%2F%2Fwww.stelluscapital.com%2F&amp;a=www.stelluscapital.com\" rel=\"nofollow noopener\" target=\"_blank\">www.stelluscapital.com</a> under the Stellus Capital Investment Corporation link.</p><p><b>FORWARD-LOOKING STATEMENTS</b></p><p>Statements included herein may contain \"forward-looking statements\" which relate to future performance or financial condition. Statements other than statements of historical facts included in this press release may constitute forward-looking statements and are not guarantees of future performance or results and involve a number of assumptions, risks and uncertainties, which change over time. Actual results may differ materially from those anticipated in any forward-looking statements as a result of a number of factors, including those described from time to time in filings by the Company with the Securities and Exchange Commission. The Company undertakes no duty to update any forward-looking statement made herein. All forward-looking statements speak only as of the date of this press release.</p><p><b>Contacts<br/></b>Stellus Capital Investment Corporation<br/>W. Todd Huskinson, (713) 292-5414<br/>Chief Financial Officer<br/><a href=\"mailto:thuskinson@stelluscapital.com\" rel=\"nofollow noopener\">thuskinson@stelluscapital.com</a></p><p>SOURCE Stellus Capital Investment Corporation</p></div></article>",
            "link": "https://www.stocktitan.net/news/SCM/stellus-capital-investment-corporation-schedules-2025-fourth-quarter-e65lqvsypul4.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 00:05:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "/C O R R E C T I O N -- Caris Life Sciences/ | CAI Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p>In the news release, Caris Life Sciences Completes Interim Readout of Achieve 1 Study, issued 26-Feb-2026 by Caris Life Sciences over PR Newswire, we are advised by the company that PR Newswire incorrectly placed the second line of the headline as a sub-headline. The complete, corrected release follows, with additional details at the end: </p><h3>Caris Life Sciences Completes Interim Readout of Achieve 1 Study Demonstrates Superior Sensitivity and Specificity of Caris Detect</h3><p class=\"prntac\"><i>Results demonstrate the superiority of Whole Genome Sequencing compared <br/>to methylation-based approaches<br/></i></p><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.tx.irving\">IRVING, Texas</location></span>, <span class=\"legendSpanClass\">Feb. 26, 2026</span> /PRNewswire/ -- <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628833-1&amp;h=4089365284&amp;u=https%3A%2F%2Fwww.carislifesciences.com%2F&amp;a=Caris+Life+Sciences\" rel=\"nofollow noopener\" target=\"_blank\">Caris Life Sciences</a>® (NASDAQ: <a class=\"symbol-link\" href=\"/overview/CAI/\" title=\"View CAI stock overview\">CAI</a>), a leading, patient-centric, next-generation AI TechBio company and precision medicine pioneer, today announced an interim readout of Achieve 1, the Company's study supporting the upcoming launch of Caris Detect™, its multi-cancer early detection (MCED) test. This interim readout of Achieve 1 represents a major milestone in Caris' goal to detect cancer earlier, when it is most treatable, through Whole Genome Sequencing, advanced AI and molecular insights.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\"><p><a href=\"https://mma.prnewswire.com/media/830740/Caris_Life_Sciences_Logo.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"Caris Life Sciences Logo (PRNewsfoto/Caris Life Sciences)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/830740/Caris_Life_Sciences_Logo.jpg\" title=\"Caris Life Sciences Logo (PRNewsfoto/Caris Life Sciences)\"/></a></p></div><p>Caris Detect leverages Caris' industry-leading molecular profiling data, which has surpassed one million cases processed and produced more than 50 billion molecular markers. This deep molecular foundation enables Caris' AI models to identify subtle biological signals associated with early-stage cancers with unprecedented resolution. </p><p>Achieve 1 is evaluating Caris Detect across a broad population of patients, assessing its ability to detect multiple cancer types at early stages using a blood draw. For the undiagnosed cohort, which consisted of 1,505 samples, we utilized blood draws from subjects who had screening or symptomatic screening, a population reflecting a higher likelihood of cancer than the general population. We followed <percent>22.5%</percent> of the subjects for approximately one year following their blood draw. Of these, 121 subjects had no symptoms of cancer, no significant risk factors of cancer and were not subsequently diagnosed with cancer, representing a healthy population.</p><p>The first phase of Achieve 1 utilized a cross-validation approach, with approximately 865 samples held out for a blinded validation that is in process. Caris expects to report those results later in the first quarter of 2026.</p><p>Study highlights and key performance data from the interim readout include:</p><ul type=\"disc\"><li>Sensitivity:</li><ul type=\"circle\"><li><percent>56.8%</percent> for Stage I (n=266)</li><li><percent>70.1%</percent> for Stage II (n=137)</li><li><percent>77.1%</percent> for Stage III (n=105)</li><li><percent>99.1%</percent> for Stage IV (n=109)</li></ul></ul><ul type=\"disc\"><li>Sensitivity in Stage I and II Cancers (<percent>61.3%</percent> sensitivity)</li></ul><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Cancer</b></span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Stage I-II</b></span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Breast</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><percent>53.0%</percent> (n=253)</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Bowel</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><percent>62.2%</percent> (n=45)</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Prostate</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><percent>78.9%</percent> (n=38)</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Uterus</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><percent>73.7%</percent> (n=19)</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Lung</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><percent>86.7%</percent> (n=15)</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Pancreas</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><percent>71.4%</percent> (n=7)</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Head and Neck</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><percent>100.0%</percent> (n=7)</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Esophagus/Stomach</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><percent>80.0%</percent> (n=5)</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Cervix</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><percent>80.0%</percent> (n=5)</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Biliary Tract</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><percent>100%</percent> (n=3)</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Skin</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><percent>50.0%</percent> (n=2)</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Liver</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><percent>100%</percent> (n=2)</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Peritoneum</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><percent>100%</percent> (n=1)</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br/></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Bone</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><percent>100%</percent> (n=1)</span></p></td></tr></table></div><ul type=\"disc\"><ul type=\"circle\"><li>Specificity: <percent>99.1%</percent> in the Asymptomatic Screening Population (n=121) and <percent>95.3%</percent> in the Undiagnosed Population (n=1,505).</li></ul><li>Sample Size: 2,122, across 1,505 undiagnosed and 617 cancers from stages I through IV.</li><li>1,505 undiagnosed subjects from a screening and symptomatic screening population (the \"Undiagnosed Population\").</li><ul type=\"circle\"><li>121 of these subjects with follow-up data had no symptoms of cancer, no significant risk factors of cancer and were not subsequently diagnosed with cancer within one year following blood draw (the \"Asymptomatic Screening Population\").</li><li>In the ~600 undiagnosed subjects with one year of follow-up, roughly <percent>7%</percent> of patients were subsequently diagnosed with cancer, indicating our enrollment criteria enriched for high-risk subjects.</li></ul></ul><p>\"Our hypothesis has been that cancer is a disease driven by molecular aberrations that can manifest itself in many different forms. For example, driver mutations, changes in epigenomics, changes in transcriptomics and changes in aneuploidy,\" said <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628833-1&amp;h=3944640942&amp;u=https%3A%2F%2Fwww.carislifesciences.com%2Fbio%2Fdavid-spetzler-ms-phd-mba%2F&amp;a=David+Spetzler%2C+MS%2C+PhD%2C+MBA\" rel=\"nofollow noopener\" target=\"_blank\">David Spetzler, MS, PhD, MBA</a>, President of Caris Life Sciences. \"Most other attempts to derive insights into blood-based early detection modalities have relied upon epigenomics. Caris approached this from a broader biological perspective to encompass as many genomic alterations as can be attained from extreme ultra-deep Whole Genome Sequencing. This additional data has allowed us to achieve greater performance metrics than others and shows that methodologies focused on limited biological information are not sufficient to encompass the diversity of molecular aberrations driving cancer, especially in early-stage disease. Development of the next version of Caris Detect is currently underway with the aim of improving the already best-in-class performance with the incorporation of Whole Transcriptome Sequencing.\"</p><p><b><u>About Caris Life Sciences<br/></u></b>Caris Life Sciences® (Caris) is a leading, patient-centric, next-generation AI TechBio company and precision medicine pioneer actively developing and commercializing innovative solutions to transform healthcare. Through comprehensive molecular profiling (Whole Genome, Whole Exome and Whole Transcriptome Sequencing), advanced AI and machine learning, Caris has created the large-scale, multimodal clinico-genomic database and computing capability needed to analyze and further unravel the molecular complexity of disease. This convergence of next-generation sequencing, AI and machine learning technologies and high-performance computing provides a differentiated platform for developing the latest generation of advanced precision medicine diagnostic solutions for early detection, diagnosis, monitoring, therapy selection and drug development.</p><p>Caris was founded with a vision to realize the potential of precision medicine to improve the human condition. Headquartered in <location idsrc=\"xmltag.org\" value=\"LU/us.tx.irving\">Irving, Texas</location>, Caris has offices in <location idsrc=\"xmltag.org\" value=\"LU/us.ny.phonix\">Phoenix, New York</location>, <location idsrc=\"xmltag.org\" value=\"LU/us.ny.cambri\">Cambridge</location> (MA), <location idsrc=\"xmltag.org\" value=\"LU/jp..tokyo\">Tokyo, Japan</location> and <location idsrc=\"xmltag.org\" value=\"LU/ch..basel\">Basel, Switzerland</location>. Caris or its distributor partners provide services in the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> and other international markets.</p><p><b><u>Forward Looking Statements<br/></u></b>This press release contains forward-looking statements within the meaning of the federal securities laws. All statements other than statements of historical facts contained in this press release are forward-looking statements, including statements regarding our business, solutions, plans, objectives, goals, industry trends, financial outlook and guidance. In some cases forward-looking statements can be identified by words such as \"may,\" \"will,\" \"should,\" \"would,\" \"expect,\" \"plan,\" \"anticipate,\" \"could,\" \"intend,\" \"target,\" \"project,\" \"potential,\" \"contemplate,\" \"believe,\" \"estimate,\" \"predict,\" \"potential\" or \"continue\" or similar expressions.</p><p>You should not rely upon forward-looking statements as predictions of future events. Although we believe that the expectations reflected in these forward-looking statements are reasonable based on information currently available to us, we cannot guarantee that the future results, discoveries, levels of activity, performance or events and circumstances reflected in forward-looking statements will be achieved or occur. Forward-looking statements involve known and unknown risks and uncertainties, some of which are beyond our control. Risks and uncertainties that could cause our actual results to differ materially from those indicated or implied by the forward-looking statements in this press release include, among other things: technical, operational and implementation requirements the failure of which affect the timing of or prevent commercialization of Caris Detect; future results regarding the blinded hold-out portion of the Achieve 1 samples as well as samples from Achieve 2; future performance and clinical utility of Caris Detect, including its AI models, when applied across larger real-world screening populations; developments in the precision medicine industry; our future financial performance, results of operations or other operational results or metrics; development, analytical and clinical validation, timing and performance of future solutions by us and our competitors; commercial market acceptance for our solutions, including acceptance of preventive as well as diagnostic testing paradigms, and our ability to meet resulting demand; the rapidly evolving competitive environment in which we operate; third-party payer reimbursement and coverage decisions related to our solutions; risks related to data management, storage, and processing capabilities and our ability to integrate and deploy artificial intelligence and advanced data analytics technologies; our ability to protect and enhance our intellectual property; regulatory requirements, decisions or approvals (including the timing and conditions thereof) related to our solutions; reliance on third-party suppliers; risks related to data security, patient privacy, and compliance with healthcare data protection regulations as well as potential cybersecurity threats to our data platforms; our compliance with laws and regulations; the outcome of government investigations and litigation; risks related to our indebtedness; and our ability to hire and retain key personnel as well as risks, uncertainties, and other factors described in the section titled \"Risk Factors\" and elsewhere in our Annual Report on Form 10-K filed on or about March 3, 2026, and in our other filings we make with the SEC from time to time. We undertake no obligation to update any forward-looking statements to reflect changes in events, circumstances or our beliefs after the date of this press release, except as required by law. </p><p><b>Caris Life Sciences Media: <br/></b>Corporate Communications<br/><a href=\"mailto:CorpComm@CarisLS.com\" rel=\"nofollow noopener\" target=\"_blank\">CorpComm@CarisLS.com</a><br/>214.294.5606</p><p><i>Correction: An earlier version of this release incorrectly placed the second half of the headline as a sub-headline.  </i></p><p>SOURCE Caris Life Sciences</p></div></article>",
            "link": "https://www.stocktitan.net/news/CAI/c-o-r-r-e-c-t-i-o-n-caris-life-9uk82bmrkha0.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 23:00:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Venture Global Announces New Long-Term LNG Partnership with Hanwha of Korea | VG Stock News",
            "description": "<article class=\"article\"><p class=\"bwalignc\"><i>20-year sales and purchase agreement marks Venture Global’s first SPA with a Korean entity</i></p><p> <location idsrc=\"xmltag.org\" value=\"LU/us.va.arlton\">ARLINGTON, Va.</location>--(BUSINESS WIRE)--Today, Venture Global, Inc. (NYSE: <a class=\"symbol-link\" href=\"/overview/VG/\" title=\"View VG stock overview\">VG</a>) and Hanwha Aerospace Co., Ltd. announced the execution of a new Sales and Purchase Agreement (SPA) for the purchase of 1.5 million tonnes per annum (MTPA) of <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> liquefied natural gas (LNG) from Venture Global for twenty years starting in 2030. This agreement brings Venture Global’s long-term contracted portfolio to over 46 MTPA.</p><p>“Venture Global is thrilled to announce our first long-term supply deal in <location idsrc=\"xmltag.org\" value=\"LC/kr\">Korea</location> through a new partnership with Hanwha Aerospace which marks another important step in expanding reliable, long-term LNG supply to our partners in Asia,” said Mike Sabel, CEO of Venture Global. “We are proud to support growing global energy needs with low-cost, secure American LNG while strengthening the strategic energy partnership between <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location> and <location idsrc=\"xmltag.org\" value=\"LC/kr\">South Korea</location> to support long-term industrial and economic growth.”</p><p><b>About Venture Global</b></p><p>Venture Global is an American producer and exporter of low-cost <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> liquefied natural gas (LNG) with over 100 MTPA of capacity in production, construction, or development. Venture Global began producing LNG from its first facility in 2022 and is now one of the largest LNG exporters in <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location>. The company’s vertically integrated business includes assets across the LNG supply chain including LNG production, natural gas transport, shipping and regasification. The company’s first three projects, Calcasieu Pass, Plaquemines LNG, and CP2 LNG, are located in <location idsrc=\"xmltag.org\" value=\"LS/us.la\">Louisiana</location> along the Gulf of America. Venture Global is developing Carbon Capture and Sequestration projects at each of its LNG facilities.</p><p><b>About Hanwha Aerospace</b></p><p>Hanwha Aerospace is a core affiliate of the Hanwha Group, operating as a global company primarily focused on aerospace and defense, with expanding operations into energy and industrial infrastructure. Hanwha Aerospace is building an LNG value chain in collaboration with other Hanwha Group affiliates to enhance energy security and advance the effectiveness of clean energy solutions globally.</p><p><b>Forward-looking Statements</b></p><p>This press release contains forward-looking statements. We intend such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in Section 27A of the Securities Act of 1933, as amended (the “Securities Act”), and Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). All statements, other than statements of historical facts, included herein are “forward-looking statements.” In some cases, forward-looking statements can be identified by terminology such as “may,” “might,” “will,” “could,” “should,” “expect,” “plan,” “project,” “intend,” “anticipate,” “believe,” “estimate,” “predict,” “potential,” “pursue,” “target,” “continue,” the negative of such terms or other comparable terminology.</p><p>These forward-looking statements, which are subject to risks, uncertainties and assumptions about us, may include statements about our future performance, our contracts, our anticipated growth strategies and anticipated trends impacting our business. These statements are only predictions based on our current expectations and projections about future events. There are important factors that could cause our actual results, level of activity, performance or achievements to differ materially from the results, level of activity, performance or achievements expressed or implied by the forward-looking statements. Those factors include our need for significant additional capital to construct and complete future projects and related assets, and our potential inability to secure such financing on acceptable terms, or at all; our potential inability to accurately estimate costs for our projects, and the risk that the construction and operations of natural gas pipelines and pipeline connections for our projects suffer cost overruns and delays related to obtaining regulatory approvals, development risks, labor costs, unavailability of skilled workers, operational hazards and other risks; the uncertainty regarding the future of global trade dynamics, international trade agreements and the United States’ position on international trade, including the effects of tariffs; our dependence on our EPC and other contractors for the successful completion of our projects, including the potential inability of our contractors to perform their obligations under their contracts; various economic and political factors, including opposition by environmental or other public interest groups, or the lack of local government and community support required for our projects, which could negatively affect the permitting status, timing or overall development, construction and operation of our projects; and risks related to other factors discussed under “Item 1A.—Risk Factors” of our annual report on Form 10-K for the year ended December 31, 2024 as filed with the Securities and Exchange Commission (“SEC”) and any subsequent reports filed with the SEC. Any forward-looking statements contained herein speak only as of the date of this press release and are based on assumptions that we believe to be reasonable as of this date. We undertake no obligation to update these statements to reflect subsequent events or circumstances, except as may be required by law.</p><p><img alt=\"\" loading=\"lazy\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226064547r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\"/><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20260226064547/en/\" rel=\"nofollow noopener\">https://www.businesswire.com/news/home/20260226064547/en/</a></span></p><p><b>Investor contact:</b><br/>Ben Nolan<br/><a href=\"mailto:IR@ventureglobalLNG.com\" rel=\"nofollow noopener\" shape=\"rect\">IR@ventureglobalLNG.com</a></p><p><b>Media contact:</b><br/>Shaylyn Hynes<br/><a href=\"mailto:press@ventureglobalLNG.com\" rel=\"nofollow noopener\" shape=\"rect\">press@ventureglobalLNG.com</a></p><p>Source: Venture Global, Inc.</p></article>",
            "link": "https://www.stocktitan.net/news/VG/venture-global-announces-new-long-term-lng-partnership-with-hanwha-5243z3kxc1hc.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 00:00:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BioNxt Announces Closing of Shares for Debt Settlement | BNXTF Stock News",
            "description": "<article class=\"article\"><p><strong id=\"dateline\">VANCOUVER, BC / <a href=\"https://www.accessnewswire.com/\" rel=\"nofollow noopener\">ACCESS Newswire</a> / February 26, 2026 / </strong>BioNxt Solutions Inc. (\"<strong>BioNxt</strong>\" or the \"<strong>Company</strong>\") <strong>(CSE:BNXT)(OTCQB:BNXTF)(FSE:BXT)</strong> is pleased to announce that, further to its news release dated January 23, 2026, the Company has issued an aggregate of 6,008,883 common shares in the capital of the Company (the \"<strong>Debt Shares</strong>\") at a deemed price of <money>$0.45</money> per Debt Share to settle <money>$2,704,000</money> in debt (the \"<strong>Debt</strong>\") owed to certain arm's length creditors (the \"<strong>Debt Settlement</strong>\"). The Debt was comprised of a principal amount of <money>$2,600,000</money> and accrued interest of <money>$104,000</money> pursuant to <percent>8%</percent> convertible debentures issued by the Company on December 7, 2022.</p><p>In connection with the Debt Settlement, the Company issued 300,444 common shares in the capital of the Company (the \"<strong>Compensation Shares</strong>\") to Canaccord Genuity Corp. at a deemed price of <money>$0.63</money> per Compensation Share as compensation for facilitating the Debt Settlement.</p><p>Each of the Debt Shares and the Compensation Shares are subject to a statutory four month and one day hold period in accordance with applicable Canadian securities laws.</p><p><strong>About BioNxt Solutions Inc.</strong></p><p>BioNxt Solutions Inc. is a bioscience innovator focused on next‐generation drug delivery technologies, diagnostic screening systems, and active pharmaceutical ingredient development. The Company's proprietary platforms-Sublingual (Thin‐Film), Transdermal (Skin Patch), and Oral (Enteric‐Coated Tablets)-target key therapeutic areas, including autoimmune diseases, neurological disorders, and longevity. With research and development operations in North America and Europe, BioNxt is advancing regulatory approvals and commercialization efforts, primarily focused on European markets. BioNxt is committed to improving healthcare by delivering precise, patient‐centric solutions that enhance treatment outcomes worldwide.</p><p>BioNxt is listed on the Canadian Securities Exchange: BNXT, OTCQB Markets: <a class=\"symbol-link\" href=\"/overview/BNXTF/\" title=\"View BNXTF stock overview\">BNXTF</a> and trades in Germany under WKN: A3D1K3. To learn more about BioNxt, please visit <a href=\"https://pr.report/j3uz\" rel=\"nofollow noopener\">www.bionxt.com</a>.</p><p><u>Investor Relations &amp; Media Contact</u></p><p>Hugh Rogers, Co‐Founder, CEO and Director<br/>Email: <a href=\"mailto:investor.relations@bionxt.com\" rel=\"nofollow noopener\">investor.relations@bionxt.com</a><br/>Phone: +1 778.598.2698</p><p>Web: <a href=\"https://pr.report/j3v0\" rel=\"nofollow noopener\">www.bionxt.com</a><br/>LinkedIn: <a href=\"https://pr.report/j3v3\" rel=\"nofollow noopener\">https://www.linkedin.com/company/bionxt‐solutions</a><br/>Instagram: <a href=\"https://pr.report/j3v2\" rel=\"nofollow noopener\">https://www.instagram.com/bionxt</a></p><p><i>THIS NEWS RELEASE DOES NOT CONSTITUTE AN OFFER TO SELL OR THE SOLICITATION OF ANY OFFER TO BUY, NOR SHALL THERE BE ANY SALE OF THESE SECURITIES IN ANY JURISDICTION IN WHICH SUCH OFFER, SOLICITATION OR SALE WOULD BE UNLAWFUL. THE SHARES ISSUED HAVE NOT BEEN AND WILL NOT BE REGISTERED UNDER THE UNITED STATES SECURITIES ACT OF 1933, AS AMENDED (THE \"<strong>U.S. SECURITIES ACT</strong>\") AND MAY NOT BE OFFERED OR SOLD IN THE UNITED STATES ABSENT REGISTRATION OR AN APPLICABLE EXEMPTION FROM THE REGISTRATION REQUIREMENTS OF THE U.S. SECURITIES ACT AND APPLICABLE STATE SECURITIES LAWS.</i></p><p><strong>Neither the CSE nor its Regulation Services Provider accepts responsibility for the adequacy or accuracy of this release.</strong></p><p><strong>SOURCE:</strong> BioNxt Solutions Inc.</p><br/><br/>View the original <a href=\"https://www.accessnewswire.com/newsroom/en/healthcare-and-pharmaceutical/bionxt-announces-closing-of-shares-for-debt-settlement-1142042\" rel=\"nofollow noopener\">press release</a> on ACCESS Newswire<br/><br/><img height=\"0\" loading=\"lazy\" src=\"https://app.accessnewswire.com/img.ashx?id=1142042\" width=\"0\"/></article>",
            "link": "https://www.stocktitan.net/news/BNXTF/bio-nxt-announces-closing-of-shares-for-debt-svs2h6ezptqv.html",
            "author": "stocktitan",
            "pub_date": "Fri, 27 Feb 2026 00:00:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nektar to Announce Financial Results for the Fourth Quarter and Year-Ended 2025 on Thursday, March 12, 2026, After Close of U.S.-Based Financial Markets | NKTR Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.ca.sanfrn\">SAN FRANCISCO</location></span>, <span class=\"legendSpanClass\">Feb. 26, 2026</span> /PRNewswire/ -- Nektar Therapeutics (Nasdaq: <a class=\"symbol-link\" href=\"/overview/NKTR/\" title=\"View NKTR stock overview\">NKTR</a>) will announce its financial results for the fourth quarter and year-ended December 31, 2025 on Thursday, March 12, 2026, after the close of U.S.-based financial markets. Howard Robin, President and Chief Executive Officer, will host a conference call to review the results beginning at 5:00 p.m. Eastern Time/2:00 p.m. Pacific Time.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\"><p><a href=\"https://mma.prnewswire.com/media/2920430/Nektar_v1_Logo.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"Nektar Logo (PRNewsfoto/Nektar Therapeutics)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/2920430/Nektar_v1_Logo.jpg\" title=\"Nektar Logo (PRNewsfoto/Nektar Therapeutics)\"/></a></p></div><p>This press release and live audio-only webcast of the conference call can be accessed through a link that is posted on the Home Page and Investors section of the Nektar website: <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627385-1&amp;h=3417193063&amp;u=https%3A%2F%2Fc212.net%2Fc%2Flink%2F%3Ft%3D0%26l%3Den%26o%3D4417738-1%26h%3D3396481576%26u%3Dhttps%253A%252F%252Fir.nektar.com%252F%26a%3Dhttps%253A%252F%252Fir.nektar.com%252F&amp;a=https%3A%2F%2Fir.nektar.com%2F\" rel=\"nofollow noopener\" target=\"_blank\">https://ir.nektar.com/</a>. The web broadcast of the conference call will be available for replay through April 12, 2026.</p><p>To access the conference call, please pre-register at <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627385-1&amp;h=4268557713&amp;u=https%3A%2F%2Fregister-conf.media-server.com%2Fregister%2FBI0b215807c0e74ce08bef23d9d35009f5&amp;a=Nektar+Earnings+Call+Registration\" rel=\"nofollow noopener\" target=\"_blank\">Nektar Earnings Call Registration</a>. All registrants will receive dial-in information and a PIN allowing them to access the live call. </p><p><b>About Nektar Therapeutics</b></p><p>Nektar Therapeutics is a clinical-stage biotechnology company focused on developing treatments that address the underlying immunological dysfunction in autoimmune and chronic inflammatory diseases. Nektar's lead product candidate, rezpegaldesleukin (REZPEG, or NKTR-358), is a novel, first-in-class regulatory T cell stimulator being evaluated in one Phase 2b clinical trial in atopic dermatitis, one Phase 2b clinical trial in alopecia areata, and one Phase 2 clinical trial in Type 1 diabetes mellitus. Nektar's pipeline also includes a preclinical bivalent tumor necrosis factor receptor type II (TNFR2) antibody and bispecific programs, NKTR-0165 and NKTR-0166, and a modified hematopoietic colony stimulating factor (CSF) protein, NKTR-422. Nektar, together with various partners, is also evaluating NKTR-255, an investigational IL-15 receptor agonist designed to boost the immune system's natural ability to fight cancer, in several ongoing clinical trials.</p><p>Nektar is headquartered in San Francisco, <location idsrc=\"xmltag.org\" value=\"LS/us.ca\">California</location>. For further information, visit <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627385-1&amp;h=3988882362&amp;u=https%3A%2F%2Fedge.prnewswire.com%2Fc%2Flink%2F%3Ft%3D0%26l%3Den%26o%3D4607104-1%26h%3D627217813%26u%3Dhttps%253A%252F%252Fedge.prnewswire.com%252Fc%252Flink%252F%253Ft%253D0%2526l%253Den%2526o%253D4553519-1%2526h%253D1172832202%2526u%253Dhttp%25253A%25252F%25252Fwww.nektar.com%25252F%2526a%253Dwww.nektar.com%26a%3Dwww.nektar.com&amp;a=www.nektar.com\" rel=\"nofollow noopener\" target=\"_blank\">www.nektar.com</a> and follow us on <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627385-1&amp;h=3268910457&amp;u=https%3A%2F%2Fedge.prnewswire.com%2Fc%2Flink%2F%3Ft%3D0%26l%3Den%26o%3D4607104-1%26h%3D1432903278%26u%3Dhttps%253A%252F%252Fedge.prnewswire.com%252Fc%252Flink%252F%253Ft%253D0%2526l%253Den%2526o%253D4553519-1%2526h%253D3271795975%2526u%253Dhttps%25253A%25252F%25252Fwww.linkedin.com%25252Fcompany%25252Fnektar-therapeutics%25252F%2526a%253DLinkedIn%26a%3DLinkedIn&amp;a=LinkedIn\" rel=\"nofollow noopener\" target=\"_blank\">LinkedIn</a>.</p><p><b>For Investors:</b></p><p>Vivian Wu<br/>628-895-0661<br/><a href=\"mailto:VWu@nektar.com\" rel=\"nofollow noopener\" target=\"_blank\">VWu@nektar.com</a></p><p>Corey Davis, Ph.D.<br/>LifeSci Advisors<br/>212-915-2577<br/><a href=\"mailto:cdavis@lifesciadvisors.com\" rel=\"nofollow noopener\" target=\"_blank\">cdavis@lifesciadvisors.com</a> </p><p><b>For Media:</b></p><p>Jonathan Pappas<br/>LifeSci Communications<br/>857-205-4403<br/><a href=\"mailto:jpappas@lifescicomms.com\" rel=\"nofollow noopener\" target=\"_blank\">jpappas@lifescicomms.com</a> </p><p>SOURCE Nektar Therapeutics</p></div></article>",
            "link": "https://www.stocktitan.net/news/NKTR/nektar-to-announce-financial-results-for-the-fourth-quarter-and-year-2zh2vsk58s6l.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 23:00:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cohen & Steers Closed-End Opportunity Fund, Inc. (FOF) Notification of Sources of Distribution Under Section 19(a) | CNS Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.ny.nyc\">NEW YORK</location></span>, <span class=\"legendSpanClass\">Feb. 26, 2026</span> /PRNewswire/ -- This press release provides shareholders of Cohen &amp; Steers Closed-End Opportunity Fund, Inc. (NYSE: <a class=\"symbol-link\" href=\"/overview/FOF/\" title=\"View FOF stock overview\">FOF</a>) (the \"Fund\") with information regarding the sources of the distribution to be paid on February 27, 2026 and cumulative distributions paid fiscal year-to-date.</p><p>In December 2021, the Fund implemented a managed distribution policy in accordance with exemptive relief issued by the Securities and Exchange Commission. The managed distribution policy seeks to deliver the Fund's long-term total return potential through regular monthly distributions declared at a fixed rate per common share. The policy gives the Fund greater flexibility to realize long-term capital gains throughout the year and to distribute those gains on a regular monthly basis to shareholders. The Board of Directors of the Fund may amend, terminate or suspend the managed distribution policy at any time, which could have an adverse effect on the market price of the Fund's shares.</p><p>The Fund's monthly distributions may include long-term capital gains, short-term capital gains, net investment income and/or return of capital for federal income tax purposes. Return of capital includes distributions paid by the Fund in excess of its net investment income and net realized capital gains and such excess is distributed from the Fund's assets. A return of capital is not taxable; rather, it reduces a shareholder's tax basis in his or her shares of the Fund. The amount of monthly distributions may vary depending on a number of factors, including changes in portfolio and market conditions.</p><p>At the time of each monthly distribution, information will be posted to cohenandsteers.com and mailed to shareholders in a concurrent notice. However, this information may change at the end of the year because the final tax characteristics of the Fund's distributions cannot be determined with certainty until after the end of the calendar year. Final tax characteristics of all of the Fund's distributions will be provided on Form 1099-DIV, which is mailed after the close of the calendar year.</p><p>The following table sets forth the estimated amounts of the current distribution and the cumulative distributions paid this fiscal year-to-date from the sources indicated. All amounts are expressed per common share.</p><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prnpr2 prnpl2 prnvab prncbts prnrbrb1 prnbbbs prnbsbls\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>DISTRIBUTION ESTIMATES</b></span></p></td><td class=\"prnpr2 prnpl2 prnvab prntac prncbts prnrbrb1 prnbbbs prnsblb1\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>February 2026</b></span></p></td><td class=\"prnpr2 prnpl2 prnvab prntac prncbts prnbrbrs prnbbbs prnsblb1\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>YEAR-TO-DATE (YTD) </b></span></p><p class=\"prnml4\"><span class=\"prnews_span\"><b>February 28, 2026*</b></span></p></td></tr><tr><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Source</b></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Per Share Amount</b></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>% of Current Distribution</b></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Per Share Amount</b></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>% of 2026 Distributions</b></span></p></td></tr><tr><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Net Investment Income</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.03</money>41</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">39.20 %</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.03</money>41</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">19.60 %</span></p></td></tr><tr><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Net Realized Short-Term Capital Gains</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.00</money>00</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.00 %</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.00</money>00</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.00 %</span></p></td></tr><tr><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Net Realized Long-Term Capital Gains</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.05</money>29</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">60.80 %</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.13</money>99</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">80.40 %</span></p></td></tr><tr><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Return of Capital (or other Capital Source)</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.00</money>00</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.00 %</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.00</money>00</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.00 %</span></p></td></tr><tr><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Total Current Distribution</b></span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b><money><money>$0.08</money>70</money></b></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>100.00 %</b></span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b><money><money>$0.17</money>40</money></b></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>100.00 %</b></span></p></td></tr></table></div><p><b>You should not draw any conclusions about the Fund's investment performance from the amount of this distribution or from the terms of the Fund's managed distribution policy. The amounts and sources of distributions reported in this Notice are only estimates, are likely to change over time, and are not being provided for tax reporting purposes. The actual amounts and sources of the amounts for accounting and tax reporting purposes will depend upon the Fund's investment experience during the remainder of its fiscal year and may be subject to changes based on tax regulations. The amounts and sources of distributions year-to-date may be subject to additional adjustments.</b></p><p><b>*</b><b>THE FUND WILL SEND YOU A FORM 1099-DIV FOR THE CALENDAR YEAR THAT WILL TELL YOU HOW TO REPORT THESE DISTRIBUTIONS FOR FEDERAL INCOME TAX PURPOSES</b></p><p>The Fund's Year-to-date Cumulative Total Return for fiscal year 2026 (January 1, 2026 through January 31, 2026) is set forth below. Shareholders should take note of the relationship between the Year-to-date Cumulative Total Return with the Fund's Cumulative Distribution Rate for 2026. In addition, the Fund's Average Annual Total Return for the five-year period ending January 31, 2026 is set forth below. Shareholders should note the relationship between the Average Annual Total Return with the Fund's Current Annualized Distribution Rate for 2026. The performance and distribution rate information disclosed in the table is based on the Fund's net asset value per share (NAV). The Fund's NAV is calculated as the total market value of all the securities and other assets held by the Fund minus the total liabilities, divided by the total number of shares outstanding. While NAV performance may be indicative of the Fund's investment performance, it does not measure the value of a shareholder's individual investment in the Fund. The value of a shareholder's investment in the Fund is determined by the Fund's market price, which is based on the supply and demand for the Fund's shares in the open market.</p><p><b><i>Fund Performance and Distribution Rate Information: </i></b></p><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prnpr2 prnpl2 prnvab prncbts prnbrbrs prnbbbs prnbsbls\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Year-to-date January 1, 2026 to January 31, 2026</b></span></p></td></tr><tr><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Year-to-date Cumulative Total Return<sup>1                                        </sup></span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">3.97 %</span></p></td></tr><tr><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Cumulative Distribution Rate<sup>2</sup></span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1.28 %</span></p></td></tr><tr><td class=\"prnpr10 prnpl2 prnvab prnsbtb1 prnbrbrs prnbbbs prnbsbls\" colspan=\"2\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen5\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Five-year period ending January 31, 2026</b></span></p></td></tr><tr><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Average Annual Total Return<sup>3</sup></span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">10.66 %</span></p></td></tr><tr><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Current Annualized Distribution Rate<sup>4</sup></span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">7.65 %</span></p></td></tr></table></div><p> </p><ol type=\"1\"><li>Year-to-date Cumulative Total Return is the percentage change in the Fund's NAV over the year-to-date time period including distributions paid and assuming reinvestment of those distributions.</li><li>Cumulative Distribution Rate for the Fund's current fiscal period (January 1, 2026 through February 28, 2026) measured on the dollar value of distributions in the year-to-date period as a percentage of the Fund's NAV as of January 31, 2026.</li><li>Average Annual Total Return represents the compound average of the Annual NAV Total Returns of the Fund for the five-year period ending January 31, 2026. Annual NAV Total Return is the percentage change in the Fund's NAV over a year including distributions paid and assuming reinvestment of those distributions.</li><li>The Current Annualized Distribution Rate is the current fiscal period's distribution rate annualized as a percentage of the Fund's NAV as of January 31, 2026.</li></ol><p>Investors should consider the investment objectives, risks, charges and expense of the Fund carefully before investing. You can obtain the Fund's most recent periodic reports, when available, and other regulatory filings by contacting your financial advisor or visiting cohenandsteers.com. These reports and other filings can be found on the Securities and Exchange Commission's EDGAR Database. You should read these reports and other filings carefully before investing.</p><p><i>Shareholders should not use the information provided here in preparing their tax returns. Shareholders will receive a Form 1099-DIV for the calendar year indicating how to report Fund distributions for federal income tax purposes.</i></p><p><b>About Cohen &amp; Steers.</b> Cohen &amp; Steers is a leading global investment manager specializing in real assets and alternative income, including listed and private real estate, preferred securities, infrastructure, resource equities, commodities, as well as multi-strategy solutions. Founded in 1986, the firm is headquartered in <location idsrc=\"xmltag.org\" value=\"LU/us.ny.nyc\">New York City</location>, with offices in <location idsrc=\"xmltag.org\" value=\"LU/gb.eng.london\">London</location>, <location idsrc=\"xmltag.org\" value=\"LU/ie..dublin\">Dublin</location>, <location idsrc=\"xmltag.org\" value=\"LC/hk\">Hong Kong</location>, <location idsrc=\"xmltag.org\" value=\"LU/jp..tokyo\">Tokyo</location> and <location idsrc=\"xmltag.org\" value=\"LC/sg\">Singapore</location>.</p><p><b><i>Forward-Looking Statements<br/></i></b><i>This press release and other statements that Cohen &amp; Steers may make may contain forward looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934, which reflect the company's current views with respect to, among other things, its operations and financial performance. You can identify these forward-looking statements by the use of words such as \"outlook,\" \"believes,\" \"expects,\" \"potential,\" \"continues,\" \"may,\" \"will,\" \"should,\" \"seeks,\" \"approximately,\" \"predicts,\" \"intends,\" \"plans,\" \"estimates,\" \"anticipates,\" or the negative versions of these words or other comparable words. Such forward-looking statements are subject to various risks and uncertainties.</i></p><p><i>Accordingly, there are or will be important factors that could cause actual outcomes or results to differ materially from those indicated in these statements. The company undertakes no obligation to publicly update or review any forward-looking statement, whether as a result of new information, future developments or otherwise. </i></p><p>Website: <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628864-2&amp;h=1496067994&amp;u=https%3A%2F%2Fwww.cohenandsteers.com%2F&amp;a=https%3A%2F%2Fwww.cohenandsteers.com\" rel=\"nofollow noopener\" target=\"_blank\">https://www.cohenandsteers.com</a><br/>Symbol: (NYSE: CNS)</p><p>SOURCE Cohen &amp; Steers</p></div></article>",
            "link": "https://www.stocktitan.net/news/CNS/cohen-steers-closed-end-opportunity-fund-inc-fof-notification-of-zua8p71kd659.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 23:41:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cohen & Steers Quality Income Realty Fund, Inc. (RQI) Notification of Sources of Distribution Under Section 19(a) | CNS Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.ny.nyc\">NEW YORK</location></span>, <span class=\"legendSpanClass\">Feb. 26, 2026</span> /PRNewswire/ --This press release provides shareholders of Cohen &amp; Steers Quality Income Realty Fund, Inc. (NYSE: <a class=\"symbol-link\" href=\"/overview/RQI/\" title=\"View RQI stock overview\">RQI</a>) (the \"Fund\") with information regarding the sources of the distribution to be paid on February 27, 2026 and cumulative distributions paid fiscal year-to-date.</p><p>In December 2012, the Fund implemented a managed distribution policy in accordance with exemptive relief issued by the Securities and Exchange Commission. The managed distribution policy seeks to deliver the Fund's long-term total return potential through regular monthly distributions declared at a fixed rate per common share. The policy gives the Fund greater flexibility to realize long-term capital gains throughout the year and to distribute those gains on a regular monthly basis to shareholders. The Board of Directors of the Fund may amend, terminate or suspend the managed distribution policy at any time, which could have an adverse effect on the market price of the Fund's shares. </p><p>The Fund's monthly distributions may include long-term capital gains, short-term capital gains, net investment income and/or return of capital for federal income tax purposes. Return of capital includes distributions paid by the Fund in excess of its net investment income and net realized capital gains and such excess is distributed from the Fund's assets. A return of capital is not taxable; rather, it reduces a shareholder's tax basis in his or her shares of the Fund. In addition, distributions from the Fund's investments in real estate investment trusts (REITs) may later be characterized as capital gains and/or a return of capital, depending on the character of the dividends reported to the Fund after year end by REITs held by the Fund. The amount of monthly distributions may vary depending on a number of factors, including changes in portfolio and market conditions.</p><p>At the time of each monthly distribution, information will be posted to cohenandsteers.com and mailed to shareholders in a concurrent notice. However, this information may change at the end of the year because the final tax characteristics of the Fund's distributions cannot be determined with certainty until after the end of the calendar year. Final tax characteristics of all of the Fund's distributions will be provided on Form 1099-DIV, which is mailed after the close of the calendar year.</p><p>The following table sets forth the estimated amounts of the current distribution and the cumulative distributions paid this fiscal year-to-date from the sources indicated. All amounts are expressed per common share.</p><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prnpr2 prnpl2 prnvab prncbts prnrbrb1 prnbbbs prnbsbls\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>DISTRIBUTION ESTIMATES</b></span></p></td><td class=\"prnpr2 prnpl2 prnvab prntac prncbts prnrbrb1 prnbbbs prnsblb1\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>February 2026</b></span></p></td><td class=\"prnpr2 prnpl2 prnvab prntac prncbts prnbrbrs prnbbbs prnsblb1\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>YEAR-TO-DATE (YTD)<br/></b><b>February 28, 2026</b><b>*</b></span></p></td></tr><tr><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Source</b></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Per Share <br/>Amount</b></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>% of Current <br/>Distribution</b></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Per Share <br/>Amount</b></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>% of 2026 <br/>Distributions</b></span></p></td></tr><tr><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Net Investment Income</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.00</money>00</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.00 %</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.00</money>00</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.00 %</span></p></td></tr><tr><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Net Realized Short-Term Capital Gains</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.00</money>00</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.00 %</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.00</money>00</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.00 %</span></p></td></tr><tr><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Net Realized Long-Term Capital Gains</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.09</money>00</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">100.00 %</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.18</money>00</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">100.00 %</span></p></td></tr><tr><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Return of Capital (or other Capital Source)</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.00</money>00</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.00 %</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.00</money>00</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.00 %</span></p></td></tr><tr><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Total Current Distribution</b></span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b><money><money>$0.09</money>00</money></b></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>100.00 %</b></span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b><money><money>$0.18</money>00</money></b></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>100.00 %</b></span></p></td></tr></table></div><p><b>You should not draw any conclusions about the Fund's investment performance from the amount of this distribution or from the terms of the Fund's managed distribution policy. The amounts and sources of distributions reported in this Notice are only estimates, are likely to change over time, and are not being provided for tax reporting purposes. The actual amounts and sources of the amounts for accounting and tax reporting purposes will depend upon the Fund's investment experience during the remainder of its fiscal year and may be subject to changes based on tax regulations. The amounts and sources of distributions year-to-date may be subject to additional adjustments.</b></p><p><b>*THE FUND WILL SEND YOU A FORM 1099-DIV FOR THE CALENDAR YEAR THAT WILL TELL YOU HOW TO REPORT THESE DISTRIBUTIONS FOR FEDERAL INCOME TAX PURPOSES.</b></p><p>The Fund's Year-to-date Cumulative Total Return for fiscal year 2026 (January 1, 2026 through January 31, 2026) is set forth below. Shareholders should take note of the relationship between the Year-to-date Cumulative Total Return with the Fund's Cumulative Distribution Rate for 2026. In addition, the Fund's Average Annual Total Return for the five-year period ending January 31, 2026 is set forth below. Shareholders should note the relationship between the Average Annual Total Return with the Fund's Current Annualized Distribution Rate for 2026. The performance and distribution rate information disclosed in the table is based on the Fund's net asset value per share (NAV). The Fund's NAV is calculated as the total market value of all the securities and other assets held by the Fund minus the total liabilities, divided by the total number of shares outstanding. While NAV performance may be indicative of the Fund's investment performance, it does not measure the value of a shareholder's individual investment in the Fund. The value of a shareholder's investment in the Fund is determined by the Fund's market price, which is based on the supply and demand for the Fund's shares in the open market.</p><p><b><i>Fund Performance and Distribution Rate Information: </i></b></p><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prnpr2 prnpl2 prnvab prncbts prnbrbrs prnbbbs prnbsbls\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Year-to-date January 1, 2026 to January 31, 2026</b></span></p></td></tr><tr><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Year-to-date Cumulative Total Return<sup>1</sup></span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">2.90 %</span></p></td></tr><tr><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Cumulative Distribution Rate<sup>2</sup></span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1.46 %</span></p></td></tr><tr><td class=\"prnpr10 prnpl2 prnvab prnsbtb1 prnbrbrs prnbbbs prnbsbls\" colspan=\"2\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prngen5\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Five-year period ending January 31, 2026</b></span></p></td></tr><tr><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Average Annual Total Return<sup>3</sup></span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">7.38 %</span></p></td></tr><tr><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Current Annualized Distribution Rate<sup>4</sup></span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">8.74 %</span></p></td></tr></table></div><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1.</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Year-to-date Cumulative Total Return is the percentage change in the Fund's NAV over the year-to-date time period including distributions paid and assuming reinvestment of those distributions.</span></p></td></tr><tr><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">2.</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Cumulative Distribution Rate for the Fund's current fiscal period (January 1, 2026 through February 28, 2026) measured on the dollar value of distributions in the year-to-date period as a percentage of the Fund's NAV as of January 31, 2026.</span></p></td></tr><tr><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">3.</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Average Annual Total Return represents the compound average of the Annual NAV Total Returns of the Fund for the five-year period ending January 31, 2026. Annual NAV Total Return is the percentage change in the Fund's NAV over a year including distributions paid and assuming reinvestment of those distributions.</span></p></td></tr><tr><td class=\"prngen12\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">4.</span></p></td><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">The Current Annualized Distribution Rate is the current fiscal period's distribution rate annualized as a percentage of the Fund's NAV as of January 31, 2026.</span></p></td></tr></table></div><p>Investors should consider the investment objectives, risks, charges and expense of the Fund carefully before investing. You can obtain the Fund's most recent periodic reports, when available, and other regulatory filings by contacting your financial advisor or visiting cohenandsteers.com. These reports and other filings can be found on the Securities and Exchange Commission's EDGAR Database. You should read these reports and other filings carefully before investing.</p><p><i>Shareholders should not use the information provided here in preparing their tax returns. Shareholders will receive a Form 1099-DIV for the calendar year indicating how to report Fund distributions for federal income tax purposes.</i></p><p><b>About Cohen &amp; Steers.</b> Cohen &amp; Steers is a leading global investment manager specializing in real assets and alternative income, including listed and private real estate, preferred securities, infrastructure, resource equities, commodities, as well as multi-strategy solutions. Founded in 1986, the firm is headquartered in <location idsrc=\"xmltag.org\" value=\"LU/us.ny.nyc\">New York City</location>, with offices in <location idsrc=\"xmltag.org\" value=\"LU/gb.eng.london\">London</location>, <location idsrc=\"xmltag.org\" value=\"LU/ie..dublin\">Dublin</location>, <location idsrc=\"xmltag.org\" value=\"LC/hk\">Hong Kong</location>, <location idsrc=\"xmltag.org\" value=\"LU/jp..tokyo\">Tokyo</location> and <location idsrc=\"xmltag.org\" value=\"LC/sg\">Singapore</location>.  </p><p><b><i>Forward-Looking Statements<br/></i></b><i>This press release and other statements that Cohen &amp; Steers may make may contain forward looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934, which reflect the company's current views with respect to, among other things, its operations and financial performance. You can identify these forward-looking statements by the use of words such as \"outlook,\" \"believes,\" \"expects,\" \"potential,\" \"continues,\" \"may,\" \"will,\" \"should,\" \"seeks,\" \"approximately,\" \"predicts,\" \"intends,\" \"plans,\" \"estimates,\" \"anticipates,\" or the negative versions of these words or other comparable words. Such forward-looking statements are subject to various risks and uncertainties.</i></p><p><i>Accordingly, there are or will be important factors that could cause actual outcomes or results to differ materially from those indicated in these statements. The company undertakes no obligation to publicly update or review any forward-looking statement, whether as a result of new information, future developments or otherwise. </i></p><p>Website: <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628864-4&amp;h=569577688&amp;u=https%3A%2F%2Fcohenandsteers.com%2F&amp;a=https%3A%2F%2Fwww.cohenandsteers.com\" rel=\"nofollow noopener\" target=\"_blank\">https://www.cohenandsteers.com</a><br/>Symbol: (NYSE: CNS)</p><p>SOURCE Cohen &amp; Steers</p></div></article>",
            "link": "https://www.stocktitan.net/news/CNS/cohen-steers-quality-income-realty-fund-inc-rqi-notification-of-t6y4nbgyvm24.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 23:54:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Summit Therapeutics to Present at Upcoming Investor Conferences | SMMT Stock News",
            "description": "<article class=\"article\"><p> <location idsrc=\"xmltag.org\" value=\"LU/us.fl.miami\">MIAMI</location>--(BUSINESS WIRE)--Summit Therapeutics Inc. (NASDAQ: <a class=\"symbol-link\" href=\"/overview/SMMT/\" title=\"View SMMT stock overview\">SMMT</a>) (“Summit,” “we,” or the “Company”) today announced that it will participate in three upcoming investor conferences during March of this year. Members of the Summit leadership team will participate in individual investor meetings along with some fireside chats at the following conferences:</p><ul class=\"bwlistdisc\"><li>TD Cowen's 46th Annual Health Care Conference in <location idsrc=\"xmltag.org\" value=\"LU/us.ma.boston\">Boston</location> on Monday, March 2, 2026<ul class=\"bwlistcircle\"><li>Fireside chat 2:30pm ET</li></ul></li><li>Jefferies Conference in <location idsrc=\"xmltag.org\" value=\"LU/us.fl.miami\">Miami</location> on Tuesday, March 10, 2026<ul class=\"bwlistcircle\"><li><i>Investor meetings only</i></li></ul></li><li>Citizens Life Sciences Conference in <location idsrc=\"xmltag.org\" value=\"LU/us.fl.miami\">Miami</location> on Wednesday, March 11, 2026<ul class=\"bwlistcircle\"><li>Fireside chat 2:15pm ET</li></ul></li></ul><p>The fireside chats will be available live on our website: <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.smmttx.com%2F&amp;esheet=54434972&amp;newsitemid=20260226560754&amp;lan=en-US&amp;anchor=www.smmttx.com&amp;index=1&amp;md5=9fe63ed2db5e906dd5e9c70fbc19b4e9\" rel=\"nofollow noopener\" shape=\"rect\">www.smmttx.com</a>. An archived version of both presentations will be available on our website following the presentation.</p><p><b>About Ivonescimab</b></p><p>Ivonescimab, known as SMT112 in Summit’s license territories, <location idsrc=\"xmltag.org\" value=\"LB/nam\">North America</location>, <location idsrc=\"xmltag.org\" value=\"LB/sam\">South America</location>, <location idsrc=\"xmltag.org\" value=\"LR/eur\">Europe</location>, the <location idsrc=\"xmltag.org\" value=\"LR/mde\">Middle East</location>, <location idsrc=\"xmltag.org\" value=\"LR/afr\">Africa</location>, and <location idsrc=\"xmltag.org\" value=\"LC/jp\">Japan</location>, and as AK112 outside of Summit’s license territories, is a novel, potential first-in-class investigational bispecific antibody combining the effects of immunotherapy via a blockade of PD-1 with the anti-angiogenesis effects associated with blocking VEGF into a single molecule. By design, ivonescimab displays unique cooperative binding to each of its intended targets with multifold higher affinity to PD-1 when in the presence of VEGF.</p><p>This is intended to differentiate ivonescimab as there is potentially higher expression (presence) of both PD-1 and VEGF in tumor tissue and the tumor microenvironment (TME) as compared to normal tissue in the body. We believe ivonescimab’s specifically engineered tetravalent structure (four binding sites) enables higher avidity (accumulated strength of multiple binding interactions) in the TME (Zhong, et al, <i>iScience</i>, 2025). This tetravalent structure, the intentional novel design of the molecule, and bringing these two targets into a single bispecific antibody with cooperative binding qualities have the potential to direct ivonescimab to the tumor tissue versus healthy tissue. The intent of this design, together with a half-life of 6 to 7 days after the first dose (Zhong, et al, <i>iScience</i>, 2025) increasing to approximately 10 days at steady state dosing, is to improve upon previously established efficacy thresholds, side effects, and safety profiles associated with prior approved drugs to these targets.</p><p>Ivonescimab was engineered by Akeso Inc. (HKEX Code: 9926.HK) and is currently utilized in multiple Phase III clinical trials. Over 4,000 patients have been treated with ivonescimab in clinical studies globally, and over 60,000 patients when considering those treated in a commercial setting in <location idsrc=\"xmltag.org\" value=\"LC/cn\">China</location>, as noted by Akeso.</p><p>There are currently 15 Phase III clinical studies that are either announced, ongoing, or have been completed studying ivonescimab, four of which are Summit-sponsored global studies, one of which is a multiregional study sponsored by a cooperative group, and ten of which are being or have been conducted in <location idsrc=\"xmltag.org\" value=\"LC/cn\">China</location> by Akeso. Summit began its clinical development of ivonescimab in NSCLC, commencing enrollment in 2023 in two multiregional Phase III clinical trials, HARMONi and HARMONi-3. In 2025, the Company began enrolling patients in HARMONi-7. Summit expanded its Phase III clinical development program into CRC in the fourth quarter of 2025 by initiating enrollment in HARMONi-GI3.</p><p>HARMONi is a Phase III clinical trial which intends to evaluate ivonescimab combined with chemotherapy compared to placebo plus chemotherapy in patients with EGFR-mutated, locally advanced or metastatic non-squamous NSCLC who were previously treated with a 3rd generation EGFR TKI (e.g., osimertinib). Detailed results of the study were provided in September 2025, and a Biologics License Application (BLA) was submitted to the United States Food and Drug Administration (FDA) for marketing authorization, which the FDA accepted for filing in January 2026; the goal Prescription Drug User Fee Act (PDUFA) date is November 14, 2026.</p><p>HARMONi-3 is a Phase III clinical trial, which is intended to evaluate ivonescimab combined with chemotherapy compared to pembrolizumab combined with chemotherapy in patients with first-line metastatic, squamous or non-squamous NSCLC, irrespective of PD-L1 expression.</p><p>HARMONi-7 is a Phase III clinical trial which is intended to evaluate ivonescimab monotherapy compared to pembrolizumab monotherapy in patients with first-line metastatic NSCLC whose tumors have high PD-L1 expression.</p><p>HARMONi-GI3 is a Phase III clinical trial evaluating ivonescimab in combination with chemotherapy compared with bevacizumab plus chemotherapy in patients with first-line unresectable metastatic CRC.</p><p>Also including Summit’s license territories, a Phase III study is planned to be conducted by GORTEC, a cooperative group dedicated to Head and Neck Oncology, in recurrent / metastatic head and neck squamous cell carcinoma (r/m HNSCC). ILLUMINE is a three-arm Phase III clinical trial which is intended to evaluate ivonescimab monotherapy, as well as ivonescimab in combination with ligufalimab, Akeso’s proprietary anti-CD47 monoclonal antibody, compared to monotherapy pembrolizumab in patients with PD-L1 positive r/m HNSCC.</p><p>In addition, Akeso has recently had positive read-outs in three single-region (<location idsrc=\"xmltag.org\" value=\"LC/cn\">China</location>), randomized Phase III clinical trials, HARMONi-A, HARMONi-2, and HARMONi-6, for ivonescimab in NSCLC, including a statistically significant overall survival benefit in HARMONi-A with a manageable safety profile in each study.</p><p>HARMONi-A was a Phase III clinical trial which evaluated ivonescimab combined with chemotherapy compared to placebo plus chemotherapy in patients with EGFR-mutated, locally advanced or metastatic non-squamous NSCLC who have progressed after treatment with an EGFR TKI.</p><p>HARMONi-2 is a Phase III clinical trial evaluating monotherapy ivonescimab against monotherapy pembrolizumab in patients with locally advanced or metastatic NSCLC whose tumors have positive PD-L1 expression.</p><p>HARMONi-6 is a Phase III clinical trial evaluating ivonescimab in combination with platinum-based chemotherapy compared with tislelizumab, an anti-PD-1 antibody, in combination with platinum-based chemotherapy in patients with locally advanced or metastatic squamous NSCLC, irrespective of PD-L1 expression.</p><p>Akeso is actively conducting multiple Phase III clinical studies in settings outside of NSCLC, including biliary-tract cancer, triple-negative breast cancer, head and neck squamous cell carcinoma, small cell lung cancer, colorectal cancer, and pancreatic cancer.</p><p>Ivonescimab is an investigational therapy that is not approved by any regulatory authority in Summit’s license territories, including <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location> and <location idsrc=\"xmltag.org\" value=\"LR/eur\">Europe</location>. Ivonescimab was initially approved for marketing authorization in <location idsrc=\"xmltag.org\" value=\"LC/cn\">China</location> in May 2024. Ivonescimab was granted Fast Track designation by the US FDA for the HARMONi clinical trial setting.</p><p><b>About Summit Therapeutics</b></p><p>Summit Therapeutics Inc. is a biopharmaceutical oncology company focused on the discovery, development, and commercialization of patient-, physician-, caregiver- and societal-friendly medicinal therapies intended to improve quality of life, increase potential duration of life, and resolve serious unmet medical needs.</p><p>Summit was founded in 2003 and our shares are listed on the Nasdaq Global Market (symbol \"<a class=\"symbol-link\" href=\"/overview/SMMT/\" title=\"View SMMT stock overview\">SMMT</a>\"). We are headquartered in <location idsrc=\"xmltag.org\" value=\"LU/us.fl.miami\">Miami, Florida</location>, and we have additional offices in <location idsrc=\"xmltag.org\" value=\"LU/us.ca.paloal\">Palo Alto, California</location>, <location idsrc=\"xmltag.org\" value=\"LU/us.nj.prnctn\">Princeton, New Jersey</location>, <location idsrc=\"xmltag.org\" value=\"LU/ie..dublin\">Dublin, Ireland</location>, and <location idsrc=\"xmltag.org\" value=\"LU/gb.eng.oxford\">Oxford, UK</location>.</p><p>For more information, please visit <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.smmttx.com&amp;esheet=54434972&amp;newsitemid=20260226560754&amp;lan=en-US&amp;anchor=https%3A%2F%2Fwww.smmttx.com&amp;index=2&amp;md5=fdb74662043b851a2485acffdba9c871\" rel=\"nofollow noopener\" shape=\"rect\">https://www.smmttx.com</a> and follow us on X @SMMT_TX.</p><p><b>Summit Forward-looking Statements</b></p><p>Any statements in this press release about the Company’s future expectations, plans and prospects, including but not limited to, statements about the clinical and preclinical development of the Company’s product candidates, entry into and actions related to the Company’s partnership with Akeso Inc., the intended use of the net proceeds from the private placements, the Company's anticipated spending and cash runway, the therapeutic potential of the Company’s product candidates, the potential commercialization of the Company’s product candidates, the timing of initiation, completion and availability of data from clinical trials, the potential submission of applications for marketing approvals, the expected timing of BLA submissions or FDA decisions, potential acquisitions, statements about the previously disclosed At-The-Market equity offering program (“ATM Program”), the expected proceeds and uses thereof, the Company’s estimates regarding stock-based compensation, and other statements containing the words \"anticipate,\" \"believe,\" \"continue,\" \"could,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\" \"plan,\" \"potential,\" \"predict,\" \"project,\" \"should,\" \"target,\" \"would,\" and similar expressions, constitute forward-looking statements within the meaning of The Private Securities Litigation Reform Act of 1995. Actual results may differ materially from those indicated by such forward-looking statements as a result of various important factors, including the Company’s ability to sell shares of our common stock under the ATM Program, the conditions affecting the capital markets, general economic, industry, or political conditions, including the effects of geopolitical developments, domestic and foreign trade policies, and monetary policies, the results of our evaluation of the underlying data in connection with the development and commercialization activities for ivonescimab, the outcome of discussions with regulatory authorities, including the Food and Drug Administration, the uncertainties inherent in the initiation of future clinical trials, availability and timing of data from ongoing and future clinical trials, the results of such trials, and their success, global public health crises, that may affect timing and status of our clinical trials and operations, whether preliminary results from a clinical trial will be predictive of the final results of that trial or whether results of early clinical trials or preclinical studies will be indicative of the results of later clinical trials, whether business development opportunities to expand the Company’s pipeline of drug candidates, including without limitation, through potential acquisitions of, and/or collaborations with, other entities occur, expectations for regulatory approvals, laws and regulations affecting government contracts and funding awards, availability of funding sufficient for the Company’s foreseeable and unforeseeable operating expenses and capital expenditure requirements and other factors discussed in the \"Risk Factors\" and “Management’s Discussion and Analysis of Financial Condition and Results of Operations” sections of filings that the Company makes with the Securities and Exchange Commission. Summit defines a “positive study” as a clinical study that with one or more prespecified primary endpoints in which one of those endpoints achieves a statistically significant benefit according to the protocol or statistical analysis plan. Any change to our ongoing trials could cause delays, affect our future expenses, and add uncertainty to our commercialization efforts, as well as to affect the likelihood of the successful completion of clinical development of ivonescimab. Accordingly, readers should not place undue reliance on forward-looking statements or information. In addition, any forward-looking statements included in this press release represent the Company’s views only as of the date of this release and should not be relied upon as representing the Company’s views as of any subsequent date. The Company specifically disclaims any obligation to update any forward-looking statements included in this press release.</p><p class=\"bwalignc\">Summit Therapeutics and the Summit Therapeutics logo are trademarks of Summit Therapeutics Inc. and/or its affiliates. Copyright 2026, Summit Therapeutics Inc. All Rights Reserved.</p><p><img alt=\"\" loading=\"lazy\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226560754r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\"/><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20260226560754/en/\" rel=\"nofollow noopener\">https://www.businesswire.com/news/home/20260226560754/en/</a></span></p><p><b>Contact Summit Investor Relations:</b><br/>Dave Gancarz<br/>Chief Business &amp; Strategy Officer</p><p>Nathan LiaBraaten<br/>Senior Director, Investor Relations</p><p><a href=\"mailto:investors@smmttx.com\" rel=\"nofollow noopener\" shape=\"rect\">investors@smmttx.com</a><br/><a href=\"mailto:media@smmttx.com\" rel=\"nofollow noopener\" shape=\"rect\">media@smmttx.com</a></p><p>Source: Summit Therapeutics</p></article>",
            "link": "https://www.stocktitan.net/news/SMMT/summit-therapeutics-to-present-at-upcoming-investor-hrgjxdpk0o2w.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 23:45:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cohen & Steers Total Return Realty Fund, Inc. (RFI) Notification of Sources of Distribution Under Section 19(a) | CNS Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\"><location idsrc=\"xmltag.org\" value=\"LU/us.ny.nyc\">NEW YORK</location></span>, <span class=\"legendSpanClass\">Feb. 26, 2026</span> /PRNewswire/ -- This press release provides shareholders of Cohen &amp; Steers Total Return Realty Fund, Inc. (NYSE: <a class=\"symbol-link\" href=\"/overview/RFI/\" title=\"View RFI stock overview\">RFI</a>) (the \"Fund\") with information regarding the sources of the distribution to be paid on February 27, 2026 and cumulative distributions paid fiscal year-to-date.</p><p>In December 2011, the Fund implemented a managed distribution policy in accordance with exemptive relief issued by the Securities and Exchange Commission. The managed distribution policy seeks to deliver the Fund's long-term total return potential through regular monthly distributions declared at a fixed rate per common share. The policy gives the Fund greater flexibility to realize long-term capital gains throughout the year and to distribute those gains on a regular monthly basis to shareholders. The Board of Directors of the Fund may amend, terminate or suspend the managed distribution policy at any time, which could have an adverse effect on the market price of the Fund's shares. </p><p>The Fund's monthly distributions may include long-term capital gains, short-term capital gains, net investment income and/or return of capital for federal income tax purposes. Return of capital includes distributions paid by the Fund in excess of its net investment income and net realized capital gains and such excess is distributed from the Fund's assets. A return of capital is not taxable; rather, it reduces a shareholder's tax basis in his or her shares of the Fund. In addition, distributions from the Fund's investments in real estate investment trusts (REITs) may later be characterized as capital gains and/or a return of capital, depending on the character of the dividends reported to the Fund after year-end by REITs held by the Fund. The amount of monthly distributions may vary depending on a number of factors, including changes in portfolio and market conditions.</p><p>At the time of each monthly distribution, information will be posted to cohenandsteers.com and mailed to shareholders in a concurrent notice. However, this information may change at the end of the year because the final tax characteristics of the Fund's distributions cannot be determined with certainty until after the end of the calendar year. Final tax characteristics of all of the Fund's distributions will be provided on Form 1099-DIV, which is mailed after the close of the calendar year.</p><p>The following table sets forth the estimated amounts of the current distribution and the cumulative distributions paid this fiscal year-to-date from the sources indicated. All amounts are expressed per common share.</p><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prnpr2 prnpl2 prnvab prntal prncbts prnrbrb1 prnbbbs prnbsbls\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>DISTRIBUTION ESTIMATES</b></span></p></td><td class=\"prnpr2 prnpl2 prnvab prntac prncbts prnrbrb1 prnbbbs prnsblb1\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>February 2026</b></span></p></td><td class=\"prnpr2 prnpl2 prnvab prntac prncbts prnbrbrs prnbbbs prnsblb1\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>YEAR-TO-DATE (YTD)</b></span></p><p class=\"prnml4\"><span class=\"prnews_span\"><b>February 28, 2026* </b></span></p></td></tr><tr><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Source</b></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Per Share Amount</b></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>% of Current Distribution</b></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Per Share Amount</b></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>% of 2026 Distributions</b></span></p></td></tr><tr><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Net Investment Income</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.00</money>90</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">11.25 %</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.01</money>50</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">9.38 %</span></p></td></tr><tr><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Net Realized Short-Term Capital Gains</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.00</money>00</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.00 %</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.00</money>00</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.00 %</span></p></td></tr><tr><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Net Realized Long-Term Capital Gains</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.00</money>00</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.00 %</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.00</money>00</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.00 %</span></p></td></tr><tr><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Return of Capital (or other Capital Source)</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.07</money>10</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">88.75 %</span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><money><money>$0.14</money>50</money></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">90.62 %</span></p></td></tr><tr><td class=\"prngen5\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Total Current Distribution</b></span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b><money><money>$0.08</money>00</money></b></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>100.00 %</b></span></p></td><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b><money><money>$0.16</money>00</money></b></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>100.00 %</b></span></p></td></tr></table></div><p><b><b>You should not draw any conclusions about the Fund's investment performance from the amount of this distribution or from the terms of the Fund's managed distribution policy. The amounts and sources of distributions reported in this Notice are only estimates, are likely to change over time, and are not being provided for tax reporting purposes. The actual amounts and sources of the amounts for accounting and tax reporting purposes will depend upon the Fund's investment experience during the remainder of its fiscal year and may be subject to changes based on tax regulations. The amounts and sources of distributions year-to-date may be subject to additional adjustments.</b> </b></p><p><b>*THE FUND WILL SEND YOU A FORM 1099-DIV FOR THE CALENDAR YEAR THAT WILL TELL YOU HOW TO REPORT THESE DISTRIBUTIONS FOR FEDERAL INCOME TAX PURPOSES.</b></p><p>The Fund's Year-to-date Cumulative Total Return for fiscal year 2026 (January 1, 2026 through January 31, 2026) is set forth below. Shareholders should take note of the relationship between the Year-to-date Cumulative Total Return with the Fund's Cumulative Distribution Rate for 2026. In addition, the Fund's Average Annual Total Return for the five-year period ending January 31, 2026 is set forth below. Shareholders should note the relationship between the Average Annual Total Return with the Fund's Current Annualized Distribution Rate for 2026. The performance and distribution rate information disclosed in the table is based on the Fund's net asset value per share (NAV). The Fund's NAV is calculated as the total market value of all the securities and other assets held by the Fund minus the total liabilities, divided by the total number of shares outstanding. While NAV performance may be indicative of the Fund's investment performance, it does not measure the value of a shareholder's individual investment in the Fund. The value of a shareholder's investment in the Fund is determined by the Fund's market price, which is based on the supply and demand for the Fund's shares in the open market.</p><p><b><i>Fund Performance and Distribution Rate Information: </i></b></p><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prnpr2 prnpl2 prnvab prncbts prnbrbrs prnbbbs prnbsbls\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Year-to-date January 1, 2026 to January 31, 2026</b></span></p></td></tr><tr><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Year-to-date Cumulative Total Return<sup>1</sup></span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">2.08 %</span></p></td></tr><tr><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Cumulative Distribution Rate<sup>2</sup></span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1.42 %</span></p></td></tr><tr><td class=\"prnpr10 prnpl2 prnvab prnsbtb1 prnbrbrs prnbbbs prnbsbls\" colspan=\"2\" rowspan=\"1\"><br/></td></tr><tr><td class=\"prnpr2 prnpl2 prnvab prnsbtb1 prnbrbrs prnbbbs prnbsbls\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Five-year period ending January 31, 2026</b></span></p></td></tr><tr><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Average Annual Total Return<sup>3</sup></span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">5.80 %</span></p></td></tr><tr><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Current Annualized Distribution Rate<sup>4</sup></span></p></td><td class=\"prngen10\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">8.54 %</span></p></td></tr></table></div><div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1.</span></p></td><td class=\"prngen14\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Year-to-date Cumulative Total Return is the percentage change in the Fund's NAV over the year-to-date time period including distributions paid and assuming reinvestment of those distributions.</span></p></td></tr><tr><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">2.</span></p></td><td class=\"prngen14\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Cumulative Distribution Rate for the Fund's current fiscal period (January 1, 2026 through February 28, 2026) measured on the dollar value of distributions in the year-to-date period as a percentage of the Fund's NAV as of January 31, 2026.</span></p></td></tr><tr><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">3.</span></p></td><td class=\"prngen14\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Average Annual Total Return represents the compound average of the Annual NAV Total Returns of the Fund for the five-year period ending January 31, 2026. Annual NAV Total Return is the percentage change in the Fund's NAV over a year including distributions paid and assuming reinvestment of those distributions.</span></p></td></tr><tr><td class=\"prngen13\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">4.</span></p></td><td class=\"prngen14\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">The Current Annualized Distribution Rate is the current fiscal period's distribution rate annualized as a percentage of the Fund's NAV as of January 31, 2026.</span></p></td></tr></table></div><p>Investors should consider the investment objectives, risks, charges and expense of the Fund carefully before investing. You can obtain the Fund's most recent periodic reports, when available, and other regulatory filings by contacting your financial advisor or visiting cohenandsteers.com. These reports and other filings can be found on the Securities and Exchange Commission's EDGAR Database. You should read these reports and other filings carefully before investing.</p><p><i>Shareholders should not use the information provided here in preparing their tax returns. Shareholders will receive a Form 1099-DIV for the calendar year indicating how to report Fund distributions for federal income tax purposes.</i></p><p><b>About Cohen &amp; Steers.</b> Cohen &amp; Steers is a leading global investment manager specializing in real assets and alternative income, including listed and private real estate, preferred securities, infrastructure, resource equities, commodities, as well as multi-strategy solutions. Founded in 1986, the firm is headquartered in <location idsrc=\"xmltag.org\" value=\"LU/us.ny.nyc\">New York City</location>, with offices in <location idsrc=\"xmltag.org\" value=\"LU/gb.eng.london\">London</location>, <location idsrc=\"xmltag.org\" value=\"LU/ie..dublin\">Dublin</location>, <location idsrc=\"xmltag.org\" value=\"LC/hk\">Hong Kong</location>, <location idsrc=\"xmltag.org\" value=\"LU/jp..tokyo\">Tokyo</location> and <location idsrc=\"xmltag.org\" value=\"LC/sg\">Singapore</location>.  </p><p><b><i>Forward-Looking Statements<br/></i></b><i>This press release and other statements that Cohen &amp; Steers may make may contain forward looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934, which reflect the company's current views with respect to, among other things, its operations and financial performance. You can identify these forward-looking statements by the use of words such as \"outlook,\" \"believes,\" \"expects,\" \"potential,\" \"continues,\" \"may,\" \"will,\" \"should,\" \"seeks,\" \"approximately,\" \"predicts,\" \"intends,\" \"plans,\" \"estimates,\" \"anticipates,\" or the negative versions of these words or other comparable words. Such forward-looking statements are subject to various risks and uncertainties.</i></p><p><i>Accordingly, there are or will be important factors that could cause actual outcomes or results to differ materially from those indicated in these statements. The company undertakes no obligation to publicly update or review any forward-looking statement, whether as a result of new information, future developments or otherwise. </i></p><p>Website: <a href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628864-3&amp;h=1314339801&amp;u=https%3A%2F%2Fwww.cohenandsteers.com%2F&amp;a=https%3A%2F%2Fwww.cohenandsteers.com\" rel=\"nofollow noopener\" target=\"_blank\">https://www.cohenandsteers.com</a><br/>Symbol: (NYSE: CNS)</p><p>SOURCE Cohen &amp; Steers</p></div></article>",
            "link": "https://www.stocktitan.net/news/CNS/cohen-steers-total-return-realty-fund-inc-rfi-notification-of-sa5t07zhndo9.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 23:45:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Payment of Interest on Capital | ITUB Stock News",
            "description": "<article class=\"article\"><div class=\"xn-content\"><p><span class=\"legendSpanClass\">SÃO PAULO</span>, <span class=\"legendSpanClass\">Feb. 26, 2026</span> /PRNewswire/ -- Itaú Unibanco Holding S.A. informs its stockholders that its Board of Directors has approved, at the meeting held on this date, the payment of interest on capital to stockholders (\"IoC\") in the amount of <money>BRL3.85 billion</money>, corresponding to <money>BRL0.34888</money> per share, with income tax withholding at a rate of <percent>17.5%</percent>, resulting in net interest of <money>BRL0.287826</money> per share, except for the corporate stockholders able to prove that they are immune or exempt from such withholding, which will be made until August 31, 2026.</p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder3307\"><p><a href=\"https://mma.prnewswire.com/media/2600067/ITAU_LOGO_POS_HEX_680X680_Logo.html\" rel=\"nofollow noopener\" target=\"_blank\"><img alt=\"(PRNewsfoto/Itaú Unibanco Holding S.A.)\" loading=\"lazy\" src=\"https://mma.prnewswire.com/media/2600067/ITAU_LOGO_POS_HEX_680X680_Logo.jpg\" title=\"(PRNewsfoto/Itaú Unibanco Holding S.A.)\"/></a></p></div><p>The calculation will be based on the final stockholding position recorded on March 19, 2026, with their shares traded \"ex-rights\" starting March 20, 2026.</p><p>The amounts paid per share as interest on capital are the same for common (ITUB3) and preferred (ITUB4) shares.</p><p>For further information, please visit on <a href=\"http://www.itau.com.br/investor-relations\" rel=\"nofollow noopener\">www.itau.com.br/investor-relations</a> as follows: Menu &gt; Investor Services &gt; Contact IR.</p><p><b>Gustavo Lopes Rodrigues</b></p><p>Investor Relations Officer</p><p>Contact - Itaú Unibanco – Comunicação Corporativa<br/>Phone: (11) 5019-8880 / 8881<br/>E-mail: <a href=\"mailto:imprensa@itau-unibanco.com.br\" rel=\"nofollow noopener\" target=\"_blank\">imprensa@itau-unibanco.com.br</a></p><p> </p><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder0\"></div><p>SOURCE Itaú Unibanco Holding S.A.</p></div></article>",
            "link": "https://www.stocktitan.net/news/ITUB/payment-of-interest-on-tw75380xbjcf.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 23:46:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MOZAYYX Acquisition Corp. Announces Closing of Upsized $300,000,000 Initial Public Offering | MZYX Stock News",
            "description": "<article class=\"article\"><p align=\"justify\"><strong>Austin, TEXAS, Feb.  26, 2026  (GLOBE NEWSWIRE) -- </strong>MOZAYYX Acquisition Corp. (NYSE: <a class=\"symbol-link\" href=\"/overview/MZYX/\" title=\"View MZYX stock overview\">MZYX</a>.U) (the “Company”) today announced that it closed its upsized initial public offering of 30,000,000 units at <money>$10.00</money> per unit, including the issuance of 3,900,000 units as result of the underwriter’s partial exercise of its over-allotment option. The gross proceeds from the offering were <money>$300 million</money> before deducting underwriting discounts and estimated offering expenses. The units began trading on the New York Stock Exchange (“NYSE”) under the ticker symbol “MZYX.U” on February 25, 2026.</p> <p align=\"justify\">Each unit consists of one Class A ordinary share and one-quarter of one redeemable warrant. Each whole warrant entitles the holder to purchase one Class A ordinary share of the Company at a price of <money>$11.50</money> per share. Once the securities comprising the units begin separate trading, the Class A ordinary shares and warrants are expected to be listed on NYSE under the symbols “MZYX” and “MZYX.WS”, respectively.</p> <p align=\"justify\">The Company is a blank check company incorporated as an exempted company under the laws of the Cayman Islands, which will seek to effect a merger, share exchange, asset acquisition, share purchase, reorganization or similar business combination with one or more businesses or entities. </p> <p align=\"justify\">Cantor Fitzgerald &amp; Co. acted as the sole book-running manager in the offering.<br/>  <br/>The offering was made only by means of a prospectus, copies of which may be obtained from Cantor Fitzgerald &amp; Co., Attention: Capital Markets, 110 East 59th Street, New York, New York 10022; Email: <a href=\"https://www.globenewswire.com/Tracker?data=i-ENqTCVNDuUIFLp-Zlv2AS2aNrfexvzUSOcyIeIxZnnolIUU6ykuqw4C0qUOU6mUOBorB9PMBpItfOLn7m1e_vf3ogzmCHwNRiauyZ_u0E=\" rel=\"nofollow noopener\" target=\"_blank\">prospectus@cantor.com</a>, or from the SEC website at <a href=\"https://www.globenewswire.com/Tracker?data=gdexYSpJJzwLDCZJ5qP3HUXV_1Zfc1uY9GT-qMFgCx4Io1wK-JFk0rZn_L2jAlPwvkGGRZkwj_U4G2Gy_2Qikg==\" rel=\"nofollow noopener\" target=\"_blank\">www.sec.gov</a>.</p> <p align=\"justify\">A registration statement on Form S-1 relating to the Offering (File No. 333-293134), as amended, was filed with the Securities and Exchange Commission (“SEC”) and was declared effective by the SEC on February 24, 2026 and a registration statement on Form S-1MEF (File No. 333-293715) was filed on February 25, 2026 with the SEC which was effective automatically upon filing.</p> <p align=\"justify\">This press release shall not constitute an offer to sell or a solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.</p> <p align=\"justify\"><b>Forward-Looking Statements</b></p> <p align=\"justify\">This press release includes forward-looking statements that involve risks and uncertainties. Forward-looking statements are statements that are not historical facts. Such forward-looking statements are subject to risks and uncertainties, which could cause actual results to differ from the forward-looking statements. The Company expressly disclaims any obligations or undertaking to release publicly any updates or revisions to any forward-looking statements contained herein to reflect any change in the Company’s expectations with respect thereto or any change in events, conditions or circumstances on which any statement is based. No assurance can be given that the offering discussed above will be completed on the terms described, or at all. Forward-looking statements are subject to numerous conditions, many of which are beyond the control of the Company, including those set forth in the Risk Factors section of the Registration Statement and related preliminary prospectus filed in connection with the initial public offering with the SEC. Copies are available on the SEC’s website, <a href=\"https://www.globenewswire.com/Tracker?data=gdexYSpJJzwLDCZJ5qP3HaknwZygeZecYcXg7NkD0ffudczHGqRR0dcntAmu1ODFcPSryaJRkwsUli-a9HW02w==\" rel=\"nofollow noopener\" target=\"_blank\">www.sec.gov</a>.</p> <p align=\"justify\"><b>Contact:</b></p> <p>MOZAYYX Acquisition Corp.<br/>Benjamin Zucker<br/>Chief Executive Officer and Chief Financial Officer<br/>111 Congress Ave, Suite 1200<br/>Austin, TX 78701<br/>Email: <a href=\"https://www.globenewswire.com/Tracker?data=p5SGcszVF4UnlkNlmN0Rfr-ZIUCB4Lv0rrxsUpHY4dlfc5HngCkKClvMCS95lZ3PFOvVHkuzxKlaf11THGdZxWMBBc3DI-rdJcTs1FamhpA=\" rel=\"nofollow noopener\" target=\"_blank\">ben@mozayyxac.com</a> </p> <img alt=\"\" class=\"__GNW8366DE3E__IMG\" loading=\"lazy\" src=\"https://www.globenewswire.com/newsroom/ti?nf=OTY2MjYxNCM3NDU4NTkwIzUwMDE1ODkzOQ==\"/> <br/><img alt=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\" src=\"https://ml.globenewswire.com/media/NTg3NDY5OTItNjFiNC00NTY3LWI4ODYtYzFkYzFjMGE4ZjcwLTUwMDE1ODkzOS0yMDI2LTAyLTI2LWVu/tiny/MOZAYYX-Acquisition-Corp-.png\"/></article>",
            "link": "https://www.stocktitan.net/news/MZYX/mozayyx-acquisition-corp-announces-closing-of-upsized-300-000-000-6w0wto7qyqlp.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 23:40:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sunoco LP Announces Pricing of Upsized Private Offering of Senior Notes | ET Stock News",
            "description": "<article class=\"article\"><p> <location idsrc=\"xmltag.org\" value=\"LU/us.tx.dallas\">DALLAS</location>--(BUSINESS WIRE)--Sunoco LP (NYSE: <a class=\"symbol-link\" href=\"/overview/SUN/\" title=\"View SUN stock overview\">SUN</a>) (“Sunoco” or the “Partnership”) today announced that it has priced at <percent>100%</percent> a private offering (the “offering”) of <percent>5.375%</percent> senior notes due 2031 in an aggregate principal amount of <money><money>$600 million</money></money> (the “2031 notes”) and <percent>5.625%</percent> senior notes due 2034 in an aggregate principal amount of <money><money>$600 million</money></money> (the “2034 notes,” and collectively with the 2031 notes, the “notes”). The offering was upsized from an initial offering size of <money><money>$500 million</money></money> aggregate principal amount of the 2031 notes and <money><money>$500 million</money></money> aggregate principal amount of the 2034 notes. The sale of the notes is expected to settle on March 9, 2026, subject to the satisfaction of customary closing conditions.</p><p>Sunoco intends to use the net proceeds from the offering to redeem in full (i) NuStar Logistics, L.P.’s <percent>6.000%</percent> senior notes due 2026 (the “NuStar 2026 Notes”), and (ii) Sunoco’s <percent>6.000%</percent> senior notes due 2027 (the “Sunoco 2027 Notes”), with the remaining proceeds to be used for general partnership purposes, which may include repayment of additional indebtedness. Prior to the redemption of the Sunoco 2027 Notes, Sunoco may use the net proceeds from this offering to repay outstanding borrowings under its revolving credit facility.</p><p>The offering of the notes has not been registered under the Securities Act of 1933, as amended (the “Securities Act”), or any state securities laws and, unless so registered, the notes may not be offered or sold in <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location> except pursuant to an exemption from, or in a transaction not subject to, the registration requirements of the Securities Act and applicable state securities laws. Sunoco plans to offer and sell the notes only to persons reasonably believed to be qualified institutional buyers pursuant to Rule 144A under the Securities Act and to non-<location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> persons in transactions outside <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location> pursuant to Regulation S under the Securities Act.</p><p>This news release is neither an offer to sell nor a solicitation of an offer to buy the notes or any other securities and shall not constitute an offer to sell or a solicitation of an offer to buy, or a sale of, the notes or any other securities in any jurisdiction in which such offer, solicitation or sale is unlawful prior to the registration or qualification under the securities laws of any such state or jurisdiction. Additionally, this news release shall not constitute a notice of redemption under the indentures governing the NuStar 2026 Notes or the Sunoco 2027 Notes.</p><p><b>About Sunoco LP</b></p><p>Sunoco LP (NYSE: <a class=\"symbol-link\" href=\"/overview/SUN/\" title=\"View SUN stock overview\">SUN</a>) is a leading energy infrastructure and fuel distribution master limited partnership operating across 32 countries and territories in <location idsrc=\"xmltag.org\" value=\"LB/nam\">North America</location>, the <location idsrc=\"xmltag.org\" value=\"LB/car\">Greater Caribbean</location>, and <location idsrc=\"xmltag.org\" value=\"LR/eur\">Europe</location>. Sunoco’s midstream operations include an extensive network of approximately 14,000 miles of pipeline and over 160 terminals. This critical infrastructure complements Sunoco’s fuel distribution operations, which distribute over 15 billion gallons annually to approximately 11,000 Sunoco and partner-branded retail locations, as well as independent dealers and commercial customers. Sunoco’s general partner is owned by Energy Transfer LP (NYSE: <a class=\"symbol-link\" href=\"/overview/ET/\" title=\"View ET stock overview\">ET</a>).</p><p><b>Forward-Looking Statements</b></p><p>This news release may include certain statements concerning expectations for the future that are forward-looking statements as defined by federal law, including without limitation statements regarding the offering. Such forward-looking statements are subject to a variety of known and unknown risks, uncertainties, and other factors that are difficult to predict and many of which are beyond management’s control. An extensive list of factors that can affect future results are discussed in Sunoco’s Annual Report on Form 10-K, any subsequently filed Current Reports on Form 8-K and other documents filed from time to time with the Securities and Exchange Commission. Sunoco undertakes no obligation to update or revise any forward-looking statement to reflect new information or events.</p><p><img alt=\"\" loading=\"lazy\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226692773r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\"/><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20260226692773/en/\" rel=\"nofollow noopener\">https://www.businesswire.com/news/home/20260226692773/en/</a></span></p><p>Scott Grischow<br/>Treasurer, Senior Vice President – Finance<br/>(214) 840-5660, <a href=\"mailto:scott.grischow@sunoco.com\" rel=\"nofollow noopener\" shape=\"rect\">scott.grischow@sunoco.com</a></p><p>Brian Brungardt<br/>Director – Investor Relations<br/>(214) 840-5437, <a href=\"mailto:brian.brungardt@sunoco.com\" rel=\"nofollow noopener\" shape=\"rect\">brian.brungardt@sunoco.com</a></p><p>Source: Sunoco LP</p></article>",
            "link": "https://www.stocktitan.net/news/ET/sunoco-lp-announces-pricing-of-upsized-private-offering-of-senior-tcvpj1f1a2kn.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 23:40:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Aura Declares Dividend of US$0.66 Per Share and US$0.22 Per BDR Based on Q4 2025 Results, Resulting in a Dividend Yield of 6.2%¹  in the LTM | AUGO Stock News",
            "description": "<article class=\"article\"><p align=\"justify\">ROAD TOWN, British Virgin Islands, Feb.  26, 2026  (GLOBE NEWSWIRE) -- <strong>Aura Minerals Inc. (Nasdaq: <a class=\"symbol-link\" href=\"/overview/AUGO/\" title=\"View AUGO stock overview\">AUGO</a>) (B3: AURA33) (“Aura” or the “Company”)</strong> announced today that the Company’s Board of Directors (the “Board”) has declared and approved the payment of a dividend (the “Dividend”) of US<money>$0.66</money> per common share (approximately US<money>$55.1</money><sup>2</sup> million in total). This payment is above the minimum foreseen in the Company’s Dividend Policy (the “Dividend Policy”). Under the Dividend Policy, the Company may determine quarterly cash dividends in an aggregate amount equal to <percent>20%</percent> of its reported Adjusted EBITDA<sup>3</sup> for the relevant three months, less sustaining capital expenditures and exploration capital expenditures for the same period.</p> <p align=\"justify\">The Dividend will be paid in US dollars on March 18, 2026, to shareholders of record as of the close of business on March,11 2025 (“Record Date”).</p> <p align=\"justify\">Holders of the Company’s Brazilian Depositary Receipts as of Record Date will receive US<money>$ 0.22</money> per BDR (since 1 Aura share is equivalent to 3 BDRs) and are expected to receive payment on or around March 26, 2026, and will receive the Brazilian Reais equivalent of the Dividend, based on a market exchange rate to be disclosed in a future Press Release, in advance of its payment date.</p> <p align=\"justify\">As an example, BDR`s holders will receive:<br/>• Announced Dividend on February 26, 2026: USD 0.22 per BDR<br/>• Exchange Rate, based on closing rate as of February 25, 2026, for USD to Brazilian Reais (BRL): BRL 5.1434 per USD, Dividends Payable to Company BDR Holders would be BRL 1.131548 per BDR. This value will change according to the exchange rate on the day previous to the payment day<br/>• Record Date for Dividend Rights: March 11, 2026<br/>• Payment Date: On or around March 26, 2026</p> <p align=\"justify\">The Dividend is not subject to withholding taxes at the time of payment by the Company.</p> <p align=\"justify\">Rodrigo Barbosa, President &amp; CEO commented, \"In Q4 we delivered record-high production at stable costs, supported by higher gold prices, resulting in record EBITDA. We are pleased to announce a dividend of US<money>$0.66</money> per share — well above our Dividend Policy minimum. This brings our trailing 12-month dividend and buyback yield to <percent>6.2%</percent>, positioning Aura once again among the world’s leading gold miners for total shareholder returns. During the quarter and in recent months we achieved several key milestones: (i) Declared commercial production at Borborema; (ii) Completed the MSG acquisition; (iii) Secured the early-works license for Era Dorada; (iv) Advanced the Matupá project and (v) Signed the road-relocation agreement at Borborema. These accomplishments are concrete proof that we are executing our strategy: develop high-return greenfield projects to grow production above 600 koz GEO per year, expand resources and reserves, pursue disciplined M&amp;A, and deliver meaningful dividends to shareholders. And there is much more ahead.”</p> <p align=\"justify\"><strong>About Aura 360° Mining</strong></p> <p align=\"justify\">Aura is focused on mining in complete terms – thinking holistically about how its business impacts and benefits every one of our stakeholders: our company, our shareholders, our employees, and the countries and communities we serve. We call this 360° Mining.</p> <p align=\"justify\">Aura is a company focused on the development and operation of gold and base metal projects in the Americas. The Company's six operating assets include Minosa gold mine in Honduras; Almas, Apoena, Borborema and MSG gold mines in Brazil; and Aranzazu, a copper, gold, and silver mine in Mexico. Additionally, the Company owns Era Dorada, a gold project in Guatemala; Tolda Fria, a gold project in Colombia; and three projects in Brazil: Matupá, which is under development; São Francisco, which is in care and maintenance; and the Carajás copper project in the Carajás region, in the exploration phase.</p> <p><strong>Forward-Looking Information</strong></p> <p align=\"justify\">This press release contains “forward-looking information” and “forward-looking statements”, as defined in applicable securities laws (collectively, “<strong>forward-looking statements</strong>”) which include, but are not limited to, statements with respect to the activities, events or developments that the Company expects or anticipates will or may occur in the future, including the expected timing of the Dividend; the further potential of the Company’s properties; and the ability of the Company to achieve its short and long term outlook and the anticipated timing and results thereof.</p> <p align=\"justify\">Known and unknown risks, uncertainties and other factors, many of which are beyond the Company’s ability to predict or control, could cause actual results to differ materially from those contained in the forward-looking statements. Forward-looking statements are necessarily based upon a number of estimates and assumptions that, while considered reasonable by the Company, are inherently subject to significant business, economic and competitive uncertainties and contingencies. Specific reference is made to the most recent 20 F on file with certain Canadian provincial securities regulatory authorities for a discussion of some of the factors underlying forward-looking statements, which include, without limitation, the ability of the Company to achieve its short-term and longer-term outlook and the anticipated timing and results thereof, the ability to lower costs and increase production, the ability of the Company to successfully achieve business objectives, copper and gold or certain other commodity price volatility, changes in debt and equity markets, the uncertainties involved in interpreting geological data, increases in costs, environmental compliance and changes in environmental legislation and regulation, interest rate and exchange rate fluctuations, general economic conditions and other risks involved in the mineral exploration and development industry. Readers are cautioned that the foregoing list of factors is not exhaustive of the factors that may affect the forward-looking statements.</p> <p align=\"justify\">All forward-looking statements herein are qualified by this cautionary statement. Accordingly, readers should not place undue reliance on forward-looking statements. The Company undertakes no obligation to update publicly or otherwise revise any forward-looking statements whether as a result of new information or future events or otherwise, except as may be required by law. If the Company does update one or more forward-looking statements, no inference should be drawn that it will make additional updates with respect to those or other forward-looking statements.</p> <p>___________________________________<br/><sup>1</sup> Including shares and BDR buybacks. We calculate dividend yield as the announced dividend per share divided by the NASDAQ share price in US$ on the announcement date (dividend yield = dividend per share / share price at announcement date). The buyback yield is calculated as the total value of shares repurchased in the period divided by the average market capitalization on a given year in each case using the NASDAQ share price (buyback yield = buybacks reported / average market capitalization for a given year). The dividend yield + buyback yield is the sum of the dividend yield and the buyback yield for the reporting period<br/><sup>2</sup> As of February 25, 2026, the Company had 83,534,506 common shares issued and outstanding.<br/><sup>3</sup> Adjusted EBITDA as (Loss) profit for year, plus finance expenses, less other (expense) income, less Change in estimation for mine closure and restoration for properties in care &amp; maintenance, plus depletion and amortization.</p> <img alt=\"\" class=\"__GNW8366DE3E__IMG\" loading=\"lazy\" src=\"https://www.globenewswire.com/newsroom/ti?nf=OTY2MjU0MSM3NDU4MjcyIzIwODcwNTQ=\"/> <br/><img alt=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\" src=\"https://ml.globenewswire.com/media/NjIxYWUxMzUtNTM3Zi00OTAxLWIzM2MtMDE1NTc0ZmRkMjVmLTEwOTg2MjUtMjAyNi0wMi0yNi1lbg==/tiny/Aura-Minerals-Inc.png\"/><br/><p></p><pre>For further information, please visit Aura’s website at www.auraminerals.com or contact:Investor Relationsri@auraminerals.com</pre></article>",
            "link": "https://www.stocktitan.net/news/AUGO/aura-declares-dividend-of-us-0-66-per-share-and-us-0-22-per-bdr-gbuw621leq6g.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 23:41:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Strategic Storage Trust VI, Inc. Expands in Toronto With New Class A Facility | SMA Stock News",
            "description": "<article class=\"article\"><p> <location idsrc=\"xmltag.org\" value=\"LU/us.ca.ladnch\">LADERA RANCH, Calif.</location>--(BUSINESS WIRE)--<b>Strategic Storage Trust VI, Inc. </b><b>(“SST VI”),</b> a publicly registered non-traded real estate investment trust sponsored by an affiliate of SmartStop Self Storage REIT, Inc. (“SmartStop”) (NYSE: <a class=\"symbol-link\" href=\"/overview/SMA/\" title=\"View SMA stock overview\">SMA</a>), announced the opening of a new Class A self-storage facility in <location idsrc=\"xmltag.org\" value=\"LU/ca.on.tornto\">Toronto, Ontario</location>.</p><p>Located at 1983 Kipling Ave., the new facility reflects the company’s long-term commitment to growing its Canadian platform through high-quality development in dense, supply-constrained urban markets.</p><p>The five-story, climate-controlled facility offers approximately 90,300 net rentable square feet and features modern design, enhanced security, multiple elevators, and large indoor loading bays for convenient access throughout the building. The property is purpose-built to serve both residential and commercial customers seeking a secure, professionally managed storage solution.</p><p>Strategically positioned with convenient access from Highway 401 and Kipling Avenue, the property benefits from strong visibility within a high-traffic commercial corridor that sees approximately 400,000 vehicles pass daily. The surrounding trade area includes nearly 600,000 residents within a five-mile radius, with approximately <percent>45%</percent> of households within three miles being renter-occupied, supporting sustained demand for self-storage.</p><p>The facility will serve customers across <location idsrc=\"xmltag.org\" value=\"LU/ca.on.tornto\">Toronto</location>, Rexdale, <location idsrc=\"xmltag.org\" value=\"LU/ca.on.misuga\">Mississauga</location>, <location idsrc=\"xmltag.org\" value=\"LU/ca.on.braton\">Brampton</location>, <location idsrc=\"xmltag.org\" value=\"LU/ca.on.vauhan\">Vaughan</location>, <location idsrc=\"xmltag.org\" value=\"LU/ca.on.woodge\">Woodbridge</location>, and <location idsrc=\"xmltag.org\" value=\"LU/ca.on.norork\">North York</location>, providing modern storage solutions in one of the Greater Toronto Area’s most dynamic and densely populated corridors.</p><p>“This new <location idsrc=\"xmltag.org\" value=\"LU/ca.on.tornto\">Toronto</location> facility reflects our continued focus on expanding in high-growth, high-density markets with strong fundamentals,” said H. Michael Schwartz, President and CEO of Strategic Storage Trust VI, Inc. “With its premier location, modern design, and strong demographic profile, we believe this property is well-positioned to meet the storage needs of residents and businesses throughout the surrounding communities.”</p><p><b>About Strategic Storage Trust VI, Inc. (SST VI):</b></p><p>SST VI is a public non-traded REIT that elected to qualify as a REIT for federal income tax purposes. SST VI’s primary investment strategy is to invest in income-producing and growth self-storage facilities and related self-storage real estate investments in <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location> and <location idsrc=\"xmltag.org\" value=\"LC/ca\">Canada</location>. As of February 26, 2026, SST VI has a portfolio of 13 operating properties in <location idsrc=\"xmltag.org\" value=\"LC/us\">the United States</location> comprising approximately 9,100 units and 1,080,000 rentable square feet (including parking); 12 properties with approximately 11,100 units and 1,130,000 rentable square feet (including parking) in <location idsrc=\"xmltag.org\" value=\"LC/ca\">Canada</location>, joint venture interests in four operational and one development property in two Canadian provinces (<location idsrc=\"xmltag.org\" value=\"LS/ca.on\">Ontario</location> and <location idsrc=\"xmltag.org\" value=\"LS/ca.qc\">Québec</location>).</p><p><b>About SmartStop Self Storage REIT, Inc. (SmartStop):</b></p><p>SmartStop Self Storage REIT, Inc. (“SmartStop”) (NYSE: <a class=\"symbol-link\" href=\"/overview/SMA/\" title=\"View SMA stock overview\">SMA</a>) is a self-managed REIT with a fully integrated operations team of more than 1,000 self-storage professionals focused on growing the SmartStop® Self Storage brand. SmartStop, through its indirect subsidiary, SmartStop REIT Advisors, LLC, also sponsors other self-storage programs and, through its Managed Platform, offers third-party management services in the <location idsrc=\"xmltag.org\" value=\"LC/us\">U.S.</location> and <location idsrc=\"xmltag.org\" value=\"LC/ca\">Canada</location>. As of February 26, 2026, SmartStop has an owned or managed portfolio of over 460 operating properties in 35 states, the <location idsrc=\"xmltag.org\" value=\"LS/us.dc\">District of Columbia</location>, and <location idsrc=\"xmltag.org\" value=\"LC/ca\">Canada</location>, comprising over 270,000 units and more than 35 million rentable square feet. SmartStop and its affiliates own or manage 50 operating self-storage properties across four provinces in <location idsrc=\"xmltag.org\" value=\"LC/ca\">Canada</location>, which total approximately 43,000 units and 4.3 million rentable square feet. Additional information regarding SmartStop is available at <a href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.smartstopselfstorage.com&amp;esheet=54434531&amp;newsitemid=20260226240656&amp;lan=en-US&amp;anchor=www.smartstopselfstorage.com&amp;index=1&amp;md5=bb42f26adbf9aa1c48b291723af2cf03\" rel=\"nofollow noopener\" shape=\"rect\">www.smartstopselfstorage.com</a>.</p><p><img alt=\"\" loading=\"lazy\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226240656r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\"/><span class=\"bwct31415\"></span></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\"><a href=\"https://www.businesswire.com/news/home/20260226240656/en/\" rel=\"nofollow noopener\">https://www.businesswire.com/news/home/20260226240656/en/</a></span></p><p><b>Investor Relations Contact:</b><br/>David Corak<br/>Senior VP of Corporate Finance and Strategy<br/>SmartStop Self Storage REIT, Inc.<br/><a href=\"mailto:IR@smartstop.com\" rel=\"nofollow noopener\" shape=\"rect\">IR@smartstop.com</a></p><p><b>Media Relations Contact:</b><br/>Spotlight Marketing Communications<br/>949-427-5172<br/><a href=\"mailto:info@spotlightmc.com\" rel=\"nofollow noopener\" shape=\"rect\">info@spotlightmc.com</a></p><p>Source: Strategic Storage Trust VI, Inc.</p></article>",
            "link": "https://www.stocktitan.net/news/SMA/strategic-storage-trust-vi-inc-expands-in-toronto-with-new-class-a-03su91ztnyqb.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 23:26:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Veea Inc. Launches TerraFabric, Paving the Way to Operate AI and Autonomous Systems at the Edge | VEEA Stock News",
            "description": "<article class=\"article\"><p align=\"center\"><em>At Mobile World Congress 2026 in Barcelona, March 2-4, Veea will be demonstrating a groundbreaking control plane for distributed edge environments </em>— <em>organizations with multiple deployments</em> <em>can automate management of AI workloads, network-wide across fleets of devices, with policy enforcement, and software lifecycle management powered by prpl LCM </em></p> <p>NEW YORK, Feb.  26, 2026  (GLOBE NEWSWIRE) -- Veea Inc. (NASDAQ: <a class=\"symbol-link\" href=\"/overview/VEEA/\" title=\"View VEEA stock overview\">VEEA</a>) today announced TerraFabric, a transformative control plane that enables organizations to automate distributed edge environments composed of multi-vendor heterogeneous networks as highly coordinated systems rather than collections of individual devices or networks. TerraFabric brings together fleet orchestration, policy enforcement, and software lifecycle management to give operators the visibility and control they need to run AI workloads at the edge safely and at scale.</p> <p>TerraFabric is available for early deployments now, both as a standalone platform and as an integrated capability within VeeaONE, Veea’s edge computing platform.</p> <p><strong>The Gap Between Deploying Edge Infrastructure and Actually Operating It</strong></p> <p>The edge computing industry has become proficient at deploying hardware in the field. Organizations can register devices, push containers, and monitor basic health across dozens or hundreds of locations. However, a growing gap remains between deploying edge infrastructure and operating it efficiently with minimal overhead.</p> <p>The challenges are familiar to anyone managing a multi-site enterprise. One service may require GPU resources, while another must provide guest Wi-Fi with a captive portal. Security policies must apply consistently across every location. A software update at one site should not disrupt the entire fleet. When each location is managed independently, every change introduces risk, and teams end up performing work that could otherwise be automated.</p> <p>“We have spent the last decade making multiaccess edge computing easier to deploy,” said Allen Salmasi, co-founder and CEO of Veea. “We believe TerraFabric is about what comes next. Our customers are telling us that deployment is no longer the hard part. The challenge is coordinating dozens to hundreds of sites, keeping policies consistent, and maintaining uniform application of cybersecurity while rolling out changes without disruption. We built TerraFabric to address exactly that.”</p> <p><strong>What TerraFabric Does</strong></p> <p>TerraFabric sits above existing infrastructure. It does not replace Kubernetes, operating systems, or hardware. Instead, it provides a coordination layer that understands the full structure of an edge deployment — from fleet to region to site to device, and makes that structure actionable, instantly customizable, and verifiable.</p> <p>Operators define policies that are enforced consistently at every level. Workloads are optimally placed based on use case requirements and constraints, rather than guesswork. Software rollouts follow controlled sequences with health checks at each stage and one-click rollback if issues arise. Every action is logged, auditable, and tied to a clear chain of accountability.</p> <p>Instead of asking, “Which device should run this container?”, operators define where a system should run, under what constraints, and within what policy boundaries. TerraFabric is designed to handles the rest. Its implementation also offers the ability to continuously enhance the automation from edge to cloud in dynamic, resource constrained edge environments through machine learning and AI,</p> <p><strong>Carrier-Grade Lifecycle Management with prpl LCM</strong></p> <p>For software lifecycle management, TerraFabric incorporates prpl LCM, the open-source lifecycle management engine developed by the prpl Foundation. prpl LCM has been proven at scale, managing containerized applications across more than 12 million AT&amp;T gateways. It enables operators to remotely deploy, update, pause, restart, and remove individual containerized applications without affecting the underlying system firmware.</p> <p>By building on prpl LCM, TerraFabric inherits a lifecycle management layer that has been battle-tested across some of the largest device fleets in the world. Applications can be managed independently, updated on their own schedules, and rolled back individually if a problem is detected. Based on large scale deployments to date, we believe this allows organizations to accelerate updates and deploy new capabilities without compromising overall system stability.</p> <p>“We chose prpl LCM because it is the most proven open-source lifecycle management engine available,” Mr. Salmasi said. “TerraFabric brings that same carrier-grade lifecycle management to every edge environment, whether you are operating ten sites or ten thousand.”</p> <p><strong>Governed Autonomy for AI at the Edge</strong></p> <p>As AI agents and automated workflows become standard edge workloads, governance becomes increasingly critical. These systems make decisions, take actions, and interact with physical environments. Granting them access without clear boundaries creates risk.</p> <p>TerraFabric introduces a principle Veea calls “governed autonomy.” AI agents and automation run as workloads under explicit identity, scope, and policy controls. They operate within defined boundaries, enforced by the TerraFabric control plane, rather than relying on manual oversight at each site.</p> <p>This matters because the promise of edge AI depends on trust. Organizations deploying these systems must be confident that autonomous workloads operate within defined and enforceable limits. TerraFabric makes that confidence possible by design.</p> <p><strong>What Operators Can Do on Day One</strong></p> <p>TerraFabric is designed to deliver immediate value. On day one, operators can roll out AI model updates, whether via cloud distribution or federated learning, by region with automated health checks and failover. TerraFabric can publish network policies across entire fleets in controlled batches with immediate rollback capability. It can coordinate sensor-triggered workflows across sites without manual integration. And it can version, stage, and promote workloads with full change history and accountability.</p> <p>These are the challenges that typically emerge when edge deployments transition from pilot to production. TerraFabric was built to address them from the outset.</p> <p><strong>Three Ways to Deploy</strong></p> <p>TerraFabric runs as a standalone control plane across any mix of data centers, edge clusters, and Kubernetes environments — no rip-and-replace required. With VeeaONE, it is available directly within the Veea Control Center, where operators can enroll VeeaHubs and additional nodes and activate orchestration, policy, and lifecycle controls across the mesh. In hybrid mode, TerraFabric bridges VeeaONE and non-Veea environments under a unified control plane, enabling organizations to automate diverse infrastructure as a single coordinated system.</p> <p><strong>Availability</strong></p> <p>TerraFabric is currently available for pilot deployments. Organizations interested in evaluating TerraFabric can request early access, schedule a pilot discussion, or explore partner and licensing opportunities at veea.com.</p> <p><strong>About Veea Inc.</strong></p> <p>Veea Inc. (NASDAQ: <a class=\"symbol-link\" href=\"/overview/VEEA/\" title=\"View VEEA stock overview\">VEEA</a>) is a global leader in AI-driven edge infrastructure. Founded in 2014 and headquartered in New York City, Veea’s platform integrates connectivity, computing, cybersecurity, storage and AI in a unified solution for edge deployments ranging from SMBs to enterprise campuses, smart industries and remote communities. With more than 123 patents in related technology domains, Veea has been recognized by Gartner for its edge computing innovation. For more information, visit veea.com.</p> <p><strong>About the prpl Foundation</strong></p> <p>The prpl Foundation is a collaborative open-source community dedicated to open APIs and open industry standards for carrier-grade software. Its members include leading service providers, equipment manufacturers, and chip vendors working together to advance open-source infrastructure for broadband and edge devices. For more information, visit prplfoundation.org.</p> <p><strong>Media Contact:</strong></p> <p>Thomas Latiolais<br/>thomas.latiolais@veeasystems.com</p> <p><strong>Forward-Looking Statements</strong></p> <p>Certain statements in this press release constitute “forward-looking statements.” Such forward-looking statements are often identified by words such as “believe,” “may,” “will,” “estimate,” “continue,” “anticipate,” “intend,” “expect,” “should,” “would,” “plan,” “predict,” “forecasted,” “projected,” “potential,” “seem,” “future,” “outlook,” and similar expressions that predict or indicate future events or trends or otherwise indicate statements that are not of historical matters, but the absence of these words does not mean that a statement is not forward-looking. Forward-looking statements include, among other things, statements relating to the intended use of proceeds from our future offerings. These forward-looking statements and factors that may cause actual results to differ materially from current expectations include, but are not limited to: the ability of Veea to grow and manage growth profitably, maintain key relationships and retain its management and key employees; risks related to the uncertainty of the projected financial information with respect to Veea; risks related to the price of Veea’s securities, including volatility resulting from changes in the competitive and highly regulated industries in which Veea plans to operate, variations in performance across competitors, changes in laws and regulations affecting Veea’s business and changes in the combined capital structure; and risks related to the ability to implement business plans, forecasts, and other expectations and identify and realize additional opportunities. The foregoing list of factors is not exhaustive.</p> <p>All statements other than statements of historical facts included in this press release regarding the Company's strategies, prospects, financial condition, operations, costs, plans and objectives are forward-looking statements. Important factors that could cause the Company's actual results and financial condition to differ materially from those indicated in the forward-looking statements. Such forward-looking statements include, but are not limited to, risks and uncertainties including those regarding: the Company's business strategies, and the risk and uncertainties described in \"Risk Factors,\" \"Management's Discussion and Analysis of Financial Condition and Results of Operations,\" \"Cautionary Note on Forward-Looking Statements\" and the additional risk described in Veea’s annual report on Form 10-K for the year ended December 31, 2024, quarterly reports on Form 10-Q, registration statements on Form S-1, and any other filings which Veea makes with the U.S. Securities and Exchange Commission. You should not rely upon forward-looking statements as predictions of future events. The forward-looking statements made in the press release relate only to events or information as of the date on which the statements are made in the press release. We undertake no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, after the date on which the statements are made or to reflect the occurrence of unanticipated events except as required by law. You should read this press release with the understanding that our actual future results may be materially different from what we expect.</p> <p>Stockholders and prospective investors are cautioned not to place undue reliance on these forward-looking statements, which only speak as of the date made, are not a guarantee of future performance and are subject to a number of uncertainties, risks, assumptions and other factors, many of which are outside the control of Veea. Veea expressly disclaims any obligations or undertaking to release publicly any updates or revisions to any forward-looking statements contained herein to reflect any change in the expectations of Veea with respect thereto or any change in events, conditions or circumstances on which any statement is based.</p> <img alt=\"\" class=\"__GNW8366DE3E__IMG\" loading=\"lazy\" src=\"https://www.globenewswire.com/newsroom/ti?nf=OTY2MjYwOSM3NDU4NTM3IzIyOTIyMTc=\"/> <br/><img alt=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\" src=\"https://ml.globenewswire.com/media/MmZhZGZhZTctMWZiOS00MWU2LTg3ZmEtNmEwZDgxYTBiOTgxLTEzMDM3NjctMjAyNi0wMi0yNi1lbg==/tiny/Veea-Inc-.png\"/></article>",
            "link": "https://www.stocktitan.net/news/VEEA/veea-inc-launches-terra-fabric-paving-the-way-to-operate-ai-and-neglrn2saj29.html",
            "author": "stocktitan",
            "pub_date": "Thu, 26 Feb 2026 23:26:00 GMT",
            "source": "stocktitan",
            "kind": 1,
            "language": "en"
        }
    ]
}