{
    "data": [
        {
            "title": "What Stock Splits Reveal About Today’s Economy and Market",
            "description": "<div class=\"td-post-content tagdiv-type\">\n<!-- image -->\n<!-- content -->\n<ul class=\"wp-block-list\">\n<li>The global equity arena is filled with big winners and big losers as AI infiltrates industries</li>\n<li>Traditional split announcements have slowed, with the historically pivotal Q2 ahead</li>\n<li>Despite near record-high stock prices, reverse splits are notable, as it’s as much a K-shaped market as it is a K-shaped economy</li>\n</ul>\n<p>Dispersion is the word of the year. Thirty-six trading days into 2026, and there are 52-week highs and 52-week lows across the global equity spectrum. Sectors like Information Technology (specifically the software industry) and Financials have been hit by the heat-seeking missile that is <a href=\"https://www.wallstreethorizon.com/blog/The-Great-AI-Squeeze\" rel=\"noreferrer noopener\" target=\"_blank\">AI disruption</a>. </p>\n<p>Drawdowns of 40% or more are seen in names like Salesforce (NASDAQ: CRM), Intuit (NASDAQ: INTU), and ServiceNow (NOW). But other areas, including Energy, Materials, and Consumer Staples, trade like beach balls bears are trying to keep underwater. The bifurcation is real.</p><!-- /126710690/ims/SeeItMarket/In_text_1 -->\n\n<h3 class=\"wp-block-heading\" id=\"h-domestic-smids-amp-ex-us-surge-while-the-mag-7-stall\">Domestic SMIDs &amp; Ex-US Surge While the Mag 7 Stall</h3>\n<p>Across sizes, U.S. mid- and small-cap stocks have sharply beaten the S&amp;P 500 Index (INDEXSP: .INX) as we wrap up February. They are higher by 7–8% YTD as the SPX churns in a stubborn 2–3% range over the past two months. NVIDIA (NASDAQ: NVDA) <a href=\"https://www.wallstreethorizon.com/nvidia-earnings-calendar\" rel=\"noreferrer noopener\" target=\"_blank\">earnings are on tap</a>, while many multinational corporations determine new strategies in light of the Supreme Court striking down President Trump’s IEEPA tariffs. Within the Magnificent Seven, only NVDA is materially positive in 2026—up just 3% before Wednesday night’s Q4 report.</p>\n<p>And then there’s the geographic story. Much has been made about the S&amp;P 500’s worst start to a year compared to the ex-U.S. index in the last three-plus decades. Indeed, almost all of the dozens of individual country ETFs are solidly in the green YTD. Throw a dart at the globe, and chances are you’ll land on a hot market.</p>\n<h3 class=\"wp-block-heading\" id=\"h-haves-and-have-nots\">Haves and Have-Nots</h3>\n<p>In short, it’s difficult to recall a time when there have been so many <a href=\"https://www.wallstreethorizon.com/blog/2026-Themes-Emerge-Leading-Into-a-Busy-Q1-Second-Half-Investor-Conference-Season\" rel=\"noreferrer noopener\" target=\"_blank\">winners and losers</a> at once. That brings us to this week’s feature: stock splits.</p>\n<p>Often, traditional stock splits are announced when shares surge quarter after quarter. Conversely, reverse stock splits serve as a last resort of sorts among embattled companies in struggling sectors and industries. </p>\n<p>We’ve seen both types lately, and with many <a href=\"https://www.wallstreethorizon.com/blog/Earnings-Hold-the-Line-as-Retailers-get-Ready-to-Report-Amid-Major-Sector-Rotation-and-Tech-Fallout\" rel=\"noreferrer noopener\" target=\"_blank\">consumer company earnings reports</a> on tap, more may be on the way.</p>\n<h3 class=\"wp-block-heading\" id=\"h-when-splits-speak-corporate-signals-in-focus\">When Splits Speak: Corporate Signals in Focus</h3>\n<p>For a brief refresher, a <em>traditional stock split</em> increases the number of shares outstanding, lowering the price per share proportionally. For instance, if you owned 100 shares at $100, after a 2-for-1 split, you would own 200 shares at $50. Your financial stake and the company’s books are unchanged. </p>\n<p>A<em> reverse split</em> reduces the number of shares outstanding, raising the stock price proportionally. So, if you owned 1,000 shares at $1, after a 1-for-10 reverse split, you’d have 100 shares at $10.</p>\n<h3 class=\"wp-block-heading\" id=\"h-splitting-hairs-fewer-traditional-splits-ahead-of-the-usually-active-q2\">Splitting Hairs: Fewer Traditional Splits Ahead of the Usually Active Q2</h3>\n\n<p><a href=\"https://www.wallstreethorizon.com/stock-events\" rel=\"noreferrer noopener\" target=\"_blank\">Traditional stock splits</a> are thought to make a firm’s shares more accessible to the retail crowd and can increase liquidity (lower trading costs). Arguably more importantly, the corporate action is seen as a confidence signal. Academic data point to short-run outperformance among splitters. </p>\n<p>Reverse splits are sometimes done simply to meet exchange listing requirements, such as a minimum price rule. Companies also want to avoid penny stock perceptions in the market. So, from this angle, splits are like corporate body language, and it’s the job of portfolio managers to read between the lines. </p>\n<h3 class=\"wp-block-heading\">A Curious Decline in Traditional Splits </h3>\n<p>We track this corporate event type. Our team looks for trends in traditional and reverse split announcement totals, and today, there appears to be a slowdown in traditional splits. That’s strange, considering that global stocks are near all-time highs. </p>\n<p>The signal? Maybe there is more trepidation than CEOs and CFOs are letting on. What’s more, Q2 has historically been when bullish traditional split announcements peak. Thus, push may come to shove in the months ahead during the Q1 reporting season. </p>\n<p>As for reverse splits, the quarterly count has been steady since 2023. Could that change after the drubbings so many AI-affected firms have faced in recent weeks? At the very least, it’s worth monitoring. </p>\n<h3 class=\"wp-block-heading\">Booking’s Bold Move, Now at a 52-Week Low </h3>\n<p>So who are the winners and losers in the stock-split world right now? Perhaps surprisingly, Booking Holdings (BKNG), now at a 52-week low, announced it would execute a 25-for-1 split effective Thursday, April 2.  </p>\n<p>Having long been among the highest-priced stocks on the S&amp;P 500, the Priceline.com owner reported mixed Q4 results on February 18. Executives noted strong growth as it harnesses AI technology, but the market was clearly not convinced. Now down more than 30% from its July 2025 all-time high, the split will take the stock from $3,895 to $156. </p>\n<p>Recall that shares of travel companies were taken to the woodshed earlier this week amid fears of higher-end consumer weakness, but it wasn’t a new trend. It’s somewhat rare to see a traditional split announcement amid such weak price action. Be on the lookout for additional comments from the management team when it reports again on April 28 AMC (unconfirmed). </p>\n<h3 class=\"wp-block-heading\">Consumer Cracks and Reverse Split Reality </h3>\n<p>Staying within the consumer space, the struggling restaurant chain Noodles &amp; Company (NDLS) has been struck by the K-shaped economy. Once sporting a $600 million market cap, its equity value is now a mere $30 million. On February 4, it announced a 1-for-8 reverse stock split, which took effect on February 18.  </p>\n<p>The news came at the firm’s shareholders’ meeting, with the stock plunging from $5.16 to $4.40 the following session. Interestingly, NDLS bounced back from near $3.50 to above $5 in recent days. Its March 12 Q4 earnings date could be one to watch for those seeking high volatility. </p>\n<h3 class=\"wp-block-heading\">AI Comes After Digital Marketing &amp; Bitcoin’s Bear Market </h3>\n<p>Two other story stocks—Direct Digital (DRCT) and Bitcoin Depot (BTM)—executed sizable reverse splits earlier this year. Online advertising is on AI’s apparent hit list, while we all know crypto’s struggles since last October. DRCT reports earnings results on Tuesday, March 24 AMC (unconfirmed), while BTM Q4 results arrive on Tuesday, March 17 BMO (unconfirmed). </p>\n<h3 class=\"wp-block-heading\">The Bottom Line</h3>\n<p>Both the 52-week high and 52-week low lists are filled with flyers and fallers right now. The equity world is “split,” so to speak. A few notable split announcements underscore the corporate landscape at the moment, and with more retail and consumer earnings on tap, don’t be surprised to hear more stock-split news.</p>\n</div>",
            "link": "https://www.seeitmarket.com/what-stock-splits-reveal-about-todays-economy-and-market/",
            "pub_date": "2026-02-25 22:50:52",
            "source": "seeitmarket",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Big Pharma Is Buying — Why Biotech Stocks Could Outperform in 2026",
            "description": "<div class=\"td-post-content tagdiv-type\">\n<!-- image -->\n<!-- content -->\n\n<p>Biotech is quietly stepping into a leadership role here in early 2026 — and the move is not happening in a vacuum.</p>\n<p>After years of underperformance from 2021 through much of 2024, the sector began a powerful rebound in the second half of 2025. </p><!-- /126710690/ims/SeeItMarket/In_text_1 -->\n\n<p>That rally was significant. From its April 2025 lows, the SPDR S&amp;P Biotech ETF (NASDAQ: IBB) surged roughly 75%, dramatically outperforming the broader market’s move over the same period.</p>\n<p>In many ways, that outperformance looked like a long-overdue catch-up trade. </p>\n<p>The real question now is whether that catch-up has further to run — or whether biotech is shifting into a sustained leadership phase.</p>\n<p>Right now, the evidence suggests the latter.</p>\n<p><strong>The Fundamental Tailwinds</strong></p>\n<p>Healthcare demand continues to grow globally, and with it, investment into biotechnology. This is not just speculative capital — it is strategic capital flowing into innovation pipelines.</p>\n<p>Advancements in gene editing and next-generation therapies are accelerating research timelines and expanding what is medically possible. At the same time, we are seeing a steady stream of encouraging clinical trial data and improved FDA filing activity.</p>\n<p>Successful trials and new approvals create real valuation support for companies across the biotech space. These are not hypothetical technologies anymore — they are moving toward commercialization and revenue generation.</p>\n<p>Another key factor is public awareness. Acceptance of biotechnology solutions, from genetic therapies to obesity drugs to personalized medicine, continues to expand. That growing comfort level helps support demand, funding, and long-term adoption.</p>\n<p><strong>Follow the Big Money: M&amp;A and Partnerships</strong></p>\n<p>Perhaps the most important theme to watch in 2026 is mergers and acquisitions.</p>\n<p>Large pharmaceutical companies are facing major patent expirations — what the industry calls “loss of exclusivity” cliffs. Those cliffs represent massive revenue gaps that must be filled. The fastest way to fill them is by acquiring or partnering with innovative biotech firms that already have promising drug pipelines.</p>\n<p>That dynamic sets up a supportive backdrop for biotech valuations.<br/>Strategic partnerships and early-stage acquisitions can reward investors and create a floor under many emerging companies.</p>\n<p><strong>Capital Rotation Back to Risk</strong></p>\n<p>We are also seeing a rotation of capital back into higher-beta growth sectors, including biotech. After a period where investors favored mega-cap technology and defensive positioning, money is starting to move into areas with stronger upside potential.</p>\n<p>Biotech sits squarely in that category.</p>\n<p>When risk appetite improves, biotech often becomes a destination for capital seeking outsized returns. That rotation is one of the clearest signs of improving confidence in the broader market environment.</p>\n<p><strong>Risks to Respect</strong></p>\n<p>Of course, biotech is never without risk.</p>\n<p>Interest rate pressures remain a macro consideration. Higher rates can weigh on growth-oriented sectors that rely heavily on future earnings potential. Regulatory headlines, drug pricing debates, and company-specific clinical setbacks can also introduce volatility.</p>\n<p>There is also ongoing competition for capital. Artificial intelligence and other high-growth themes continue to attract significant investment flows that might otherwise find their way into biotech.</p>\n<p>Yet despite these risks, sector fundamentals remain strong. Robust drug development pipelines, improving clinical data, and the likelihood of continued M&amp;A activity all support the longer-term outlook.</p>\n<p><strong>The Bottom Line</strong></p>\n<p>Biotech’s recent outperformance is not just a short-term bounce. It reflects improving fundamentals, renewed capital flows, and strategic demand from large pharmaceutical companies.</p>\n<p>If the sector continues to attract investment and deliver positive clinical and regulatory developments, leadership could persist well into 2026.</p>\n<p>For investors and traders alike, biotech is no longer a space to ignore.<br/>It is a space to watch closely — because when innovation, capital, and momentum align, this sector can move fast.</p>\n<p><iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\" frameborder=\"0\" height=\"597\" referrerpolicy=\"strict-origin-when-cross-origin\" src=\"https://www.youtube.com/embed/T81Y3b_Jgm0\" title=\"Big Pharma Is Buying Again — Why Biotech Could Explode in 2026!\" width=\"336\"></iframe></p>\n<p></p>\n</div>",
            "link": "https://www.seeitmarket.com/big-pharma-is-buying-why-biotech-stocks-could-outperform-in-2026/",
            "pub_date": "2026-02-25 04:26:34",
            "source": "seeitmarket",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "United States Economic Update: From Inflation to Japanification (And the Road That Led Here)",
            "description": "<div class=\"td-post-content tagdiv-type\">\n<!-- image -->\n<!-- content -->\n<p>This is a follow-up to The Cold War Collapse: Why the Fourth Turning Ends With Capital, Not War.</p>\n<p>The Cold War Collapse argued that the Fourth Turning would not end in war but in the destruction of capital. That argument did not emerge from thin air. It is the logical conclusion of a sequence that has been unfolding since 2016.</p><!-- /126710690/ims/SeeItMarket/In_text_1 -->\n\n<p>2016: The Constructive Thesis</p>\n<p>As commodities and wages bottomed together for the first time since the financial crisis, there was a genuine possibility of healthy normalization. If wages and prices recovered in sequence the system could rebalance. Labor’s share of growth could be restored. The political fractures widening beneath the surface might have healed before they became irreparable.</p>\n<p><a href=\"https://www.seeitmarket.com/low-commodity-and-wage-costs-will-drive-new-growth-cycle-15268/\">Low Commodity and Wage Costs W</a>ill Drive a New Growth Cycle — SeeItMarket, February 2016</p>\n<p>2018 to 2020: The Sequence Breaks</p>\n<p>The path was interrupted. Trade wars distorted supply chains and capital flows before the normalization could take hold. Then the pandemic triggered collapse followed by the most extraordinary monetary and fiscal intervention in modern history.</p>\n<p>Asset prices reflated long before wages recovered. The sequence that might have healed the system was broken. Inequality did not widen because inflation returned. It widened because the recovery was captured by capital before it reached labor. The Cantillon effect playing out in real time, exactly as it always has.</p>\n<p>2023: The Capital Reflexivity Question</p>\n<p>By 2023 the question had sharpened into something more structural. If U.S. growth slows and external capital no longer reflexively returns to U.S. assets after each global crisis, what actually anchors American valuations?</p>\n<p>For decades every crisis sent capital to the US as the last safe haven. European stagnation. The Hang Seng bubble. The pandemic. All of it funneled into U.S. assets. That dynamic inflated valuations to levels only justifiable if American exceptionalism continues indefinitely.</p>\n<p>But that dynamic was never permanent. It was a privilege extended by dollar reserve currency status and the absence of credible alternatives. And it is exhausting itself.</p>\n<p><a href=\"https://www.seeitmarket.com/what-happens-to-interest-rates-when-the-chinese-consumer-recovers/\">What Happens to Interest Rates When the Chinese Consumer Recovers?</a> — SeeItMarket, July 2023</p>\n<p>Now: The Japanification Threshold</p>\n<p>The Japanification thesis is the endpoint of this sequence, not a pivot from one view to another. It is a coherent layering of observations across time.</p>\n<p>Wage normalization interrupted. Recovery distorted by extraordinary intervention. Growth constraint emerging. Capital reflexivity weakening. The result is what The Cold War Collapse described:  A long grinding revaluation of American exceptionalism. Not a crash. A reckoning.</p>\n<p>The clearing that should have happened in 2008 was delayed. The clearing that should have happened in 2020 was delayed again. Each delay inflated the next bubble higher and pushed the reckoning further out.</p>\n<p>We are now watching for whether the delay ends. The capital destruction The Cold War Collapse identified as the necessary reset mechanism is being tested in real time. The confirmation will come not from the selloff but from what follows it. Whether capital returns to the US as it always has. Or whether it doesn’t.</p>\n<p>That question remains open. And it is the only one that matters.</p>\n<p>#FourthTurning #Japanification #ColdWarCollapse #Capital #Cantillon #USExceptionalism #Reckoning #GlobalRotation #LongCycles #Kondratieff​​​​​​​​​​​​​​​​</p>\n<p></p>\n<p><em>The author may have positions in mentioned securities at the time of publication.  Any opinions expressed herein are solely those of the author, and do not in any way represent the views or opinions of any other person or entity.</em></p>\n </div></div>",
            "link": "https://www.seeitmarket.com/united-states-economic-update-from-inflation-to-japanification-and-the-road-that-led-here/",
            "pub_date": "2026-02-25 03:56:55",
            "source": "seeitmarket",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "This Small Cap Signal Could Move The Entire Stock Market",
            "description": "<div class=\"td-post-content tagdiv-type\">\n<!-- image -->\n<!-- content -->\n\n<p>Today, I discuss why small cap stocks may decide the stock market’s next big move.</p>\n<p>Right now, small caps are showing clear leadership. </p><!-- /126710690/ims/SeeItMarket/In_text_1 -->\n\n<p>While the S&amp;P 500 continues to struggle to reclaim its 50-day moving average and the NASDAQ remains well below that key level, the <strong>Russell 2000 Index</strong> (INDEXRUSSELL: RUT) — tracked by the etf <strong>IWM</strong> (NYSEARCA: IWM) — is holding its 50-DMA and remains in a bullish phase. </p>\n<p>Leadership from small caps often signals broader economic confidence, making this development especially important for traders and investors watching overall market direction.</p>\n<p>However, beneath the surface there’s a developing divergence. </p>\n<p>Momentum in IWM is declining and has already slipped below its own 50-day moving average, even as price holds firm. </p>\n<p>This creates a classic technical setup where momentum could precede price. </p>\n<p>When momentum weakens ahead of price, it can serve as an early warning that leadership may be vulnerable unless price action confirms renewed strength.</p>\n<p>This puts small caps at the center of the market’s next move.<br/>If IWM can maintain its bullish price structure and momentum turns back up, it would support continued risk appetite and potentially help lift the broader indexes. But if price begins to confirm the weakening momentum, it could signal increasing risk across equities regardless of headlines or macro narratives.</p>\n<p>Bottom line:<br/>The next directional move in the market may well depend on what small caps do from here. Leadership, confirmation, and momentum alignment will be key signals to watch</p>\n<p><strong><a href=\"https://youtube.com/shorts/_f1IpPQKWEA?si=EEwHpglGhIEYae8a\">Watch the Video Here</a></strong></p>\n<p>This puts small caps at the center of the market’s next move.</p>\n<p>If IWM can maintain its bullish price structure and momentum turns back up, it would support continued risk appetite and potentially help lift the broader indexes. </p>\n<p>But if price begins to confirm the weakening momentum, it could signal increasing risk across equities regardless of headlines or macro narratives.</p>\n<p><strong>Bottom line:</strong><br/>The next directional move in the market may well depend on what small caps do from here. </p>\n<p>Leadership, confirmation, and momentum alignment will be key signals to watch.</p>\n</div>",
            "link": "https://www.seeitmarket.com/this-small-cap-signal-could-move-the-entire-stock-market/",
            "pub_date": "2026-02-21 22:35:18",
            "source": "seeitmarket",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Is The Housing Market About To Surprise Everyone?",
            "description": "<div class=\"td-post-content tagdiv-type\">\n<!-- image -->\n<!-- content -->\n\n<p>In today’s Mish’s Market Minute video, we break down the current state of real estate and why investors should be paying attention right now. </p>\n<p>Real estate has a long-standing relationship with the stock market — sometimes it leads, sometimes it lags — but the connection is always meaningful.</p><!-- /126710690/ims/SeeItMarket/In_text_1 -->\n\n<p>Recent housing data shows prices rising back toward 2024 levels, signaling growing optimism. </p>\n<p>However, this is not a full-blown housing boom yet — more like a steady reset as the market adjusts to potentially lower rates and improving economic expectations.</p>\n<p>Meanwhile, major homebuilders are moving forward with confidence, building tract homes in anticipation of lower borrowing costs and stronger demand ahead. </p>\n<p>That confidence suggests expectations for a better economic backdrop in the coming cycle.</p>\n<p>The weekly chart of the Real Estate Investment Trust ETF (NYSEARCA: IYR), tells an equally compelling story. </p>\n<p>IYR has cleared its 2025 highs and is currently outperforming the S&amp;P 500 as noted by the Leadership chart featured.</p>\n<p>Weekly momentum is improving (as shown in the Real Motion indicator chart).</p>\n<p>Still, price remains below the major peaks from 2021 and 2024 — leaving room for potential upside if momentum continues.</p>\n<p>Real estate is quietly improving.</p>\n<p>The question now: is this the early signal of a bigger move ahead?</p>\n<p><strong><a href=\"https://youtube.com/shorts/I-2nlTv0Pq8?si=JGT1ZPtaz2sRQI5n\">Video </a></strong></p>\n<p><strong>Note</strong> that this is different than our other YouTube channel featuring the Economic Modern Family.</p>\n<p>That is for financial literacy.</p>\n<p></p>\n</div>",
            "link": "https://www.seeitmarket.com/is-the-housing-market-about-to-surprise-everyone/",
            "pub_date": "2026-02-20 08:41:09",
            "source": "seeitmarket",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "AI Wrecking Ball: What’s Next For AI Stocks and Market?",
            "description": "<div class=\"td-post-content tagdiv-type\">\n<!-- image -->\n<!-- content -->\n<p>There is a wrecking ball bouncing from one stock market industry to the next and folks are calling it the “AI Scare Trade”.</p>\n<p>Any whiff of how Artificial Intelligence (AI) could potentially disrupt an existing business model or service, and stocks plunge lower. We discussed this in last week’s Ethos, <a href=\"https://richardsonwealth.com/insights/marketethos/mixed-signals/\">“Mixed signals”</a>, as new functionalities on Anthropic AI services impacted the software space generally. This spread to legal and other services. </p><!-- /126710690/ims/SeeItMarket/In_text_1 -->\n\n<p>This past week, the AI wrecking ball visited wealth services, real estate firms, insurance brokers, rating agencies and trucking. Some of the price moves are a bit eyewatering. S&amp;P and Moody’s, both providers of financial services including credit ratings, were down -25% and -20% over past couple weeks. Raymond James, a wealth service company, dropped -10% when a financial planning AI tool was announced.</p>\n\n<p>Perhaps the most outrageous price reaction may have been in the trucking industry.</p>\n<p>A Florida company, Algorhythm Holdings, announced its service has improved customers’ scale freight volumes by 300% to 400% without adding headcount. This knocked billions in market capitalization off truck transport shares. This company had $2M in revenue as of September and just recently divested its previous core business of selling karaoke machines. The company’s ticker is RIME, more fitting than when the name was Singing Machine Company.</p>\n<p>As the AI wrecking ball moves from one industry to the next on even the slightest whiff of disruption, is this an opportunity or is the market right to drop -5, -10, -20%? Markets do overreact in the short term and sometimes underreact in the really long term. It also appears these dramatic moves are driven in part by retail and likely some quant algos. It is somewhat reminiscent of Roaring Kitty (the meme stock king), but instead of hyping up questionable business models, it’s quickly deflating profitable businesses.</p>\n<h2 class=\"wp-block-heading\" id=\"h-can-the-market-have-it-both-ways\">Can the market have it both ways?</h2>\n<p>Lately, there have been rising concerns over the return on investment for these hyperscalers building out AI infrastructure. Capex levels are eyewatering, and still rising, while the market remains unsure they will make enough money to justify the dollars spent. This is captured in the credit default swaps for Oracle, perhaps the hyperscaler with the most aggressive push into the space. In September, swaps sat at 40 bps; now they are at 160 bps. BUT, if AI can disrupt all the above-mentioned industries in a material way, there clearly is a huge ROI.</p>\n<p>As with everything, the truth usually sits somewhere in the middle. The hyperscalers will likely have a challenging time to generate enough ROI, but they have strong balance sheets and are comfortable with the risk. Plus, the trend over the past year has been to spread that risk via more debt structures and circular finance arrangements. On the various industry side, yes there will be disruption and business models will evolve, but probably not quite the doomsday being priced in off one headline here or there.</p>\n<p>This has all created a higher level of divergence in the market. In fact, the current level of divergence, measuring performance dispersion among index members, is one typically seen during market sell-offs. Yet the market aggregates are down just a bit. What has been saving the overall market from a weakening technology sector was originally the defensives in Q4 2025, including health care, consumer staples, utilities and telcos. More recently cyclicals from industrials, energy and materials have been the savior.</p>\n\n<p>For all the fanfare, we should point out the S&amp;P 500 is currently is down a paltry -2.5% from its all-time high set in late January, with the TSX down -2.0% from its all-time high set mid last week. At the headline index, this is really just noise. But it does highlight the fragility of this market so far in 2026. These kinds of moves, even if in smaller companies that don’t influence the index much, are not signs of a healthy market.</p>\n<p>Another point of interest to maintain a bit of a defensive tilt in 2026 is leverage. One factor that really helped equity markets post those strong returns in the second half of 2025 was increased leverage by investors. The chart below is the six-month change in debit balances, adjusted for the level of the S&amp;P. This makes comparisons with years past a bit more apples to apples. Late last year, there was a pretty big increase in debit balances, stock ownership in margin accounts, as investors took on more leverage. The key is that when this reverses or loses upward momentum, it often is followed by a market reversal as well. And based on the latest data point (December) the pace of margin growth has slowed.</p>\n\n<h2 class=\"wp-block-heading\">Final thoughts</h2>\n<p>Leadership change, AI wrecking ball hitting one industry after another, margin leverage starting to lose momentum and a market that is less than a stone’s throw from all-time highs are all good reasons not to chase this market. That being said, the price reactions in various industries are clearly knee-jerk at this point, and may open up some potential opportunities.</p>\n<p></p>\n</div>",
            "link": "https://www.seeitmarket.com/ai-wrecking-ball-whats-next-for-ai-stocks-and-market/",
            "pub_date": "2026-02-19 00:16:52",
            "source": "seeitmarket",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Retailers Ready Earnings Reports Amid Major Sector Rotation and Tech Fallout",
            "description": "<div class=\"td-post-content tagdiv-type\">\n<!-- image -->\n<!-- content -->\n<ul class=\"wp-block-list\">\n<li>With 74% of S&amp;P 500 companies reporting thus far, EPS growth for Q4 2025 currently stands at 13.2%</li>\n<li>This week, 1,033 companies are expected to report, including results from WalMart, Palo Alto Networks, Wayfair and more</li>\n<li>Potential earnings surprises this week: Booking Holdings, Global Payments, Insulet Corp and more</li>\n</ul>\n<h3 class=\"wp-block-heading\" id=\"h-macro-resilience-tech-resistance-as-rotation-into-cyclicals-continues\">Macro Resilience, Tech Resistance as Rotation into Cyclicals Continues</h3>\n<p>Volatility was once again the theme in US markets last week as a profound alpha rotation reshapes Wall Street. Investors continued to flee mega-cap tech, software stocks, and anything considered an AI loser, in favor of more cyclical sectors such as energy, materials and industrials.</p>\n<p>The list of impacted industries expanded across certain real estate, trucking and financial services names. </p><!-- /126710690/ims/SeeItMarket/In_text_1 -->\n\n<p>This exodus from software stocks over the last couple of weeks was triggered by advancements in agentic AI, specifically the launch of Anthropic’s Claude Code and Claude Cowork. These tools have shifted the narrative from “AI helps software” to “AI replaces software,” leading to fears that the traditional per-seat licensing model, the bedrock of companies like Salesforce and Adobe, is becoming obsolete.</p>\n<p>As companies realize that a handful of AI agents can do the work of dozens of human employees, the demand for traditional software seats will continue to decline, unless these names can prove they are beneficiaries of AI and show core revenue improvements. </p>\n<p>Against this backdrop of tech turbulence, the delayed January Jobs Report provided a confusing but ultimately stabilizing signal for the broader economy. The report showed 130,000 jobs were added in January, more than double the 55,000 expectation by economists surveyed by Dow Jones. The unemployment rate edged down to 4.3% from 4.4%.<sup>1</sup> Strength was once again seen in health care, social assistance and construction. Economists are calling this a “low-hire, low-fire” environment. While the labor market isn’t exactly thawing, it seems to have found a floor that is preventing a broader economic collapse even as tech workers face a fresh wave of AI-driven layoffs.</p>\n<p>More positive macro news came on Friday when the latest Consumer Price Index (CPI) reading was released. The headline annual inflation rate dropped to 2.4% in January (down from 2.7% in December), undershooting the 2.5% forecast and marking its slowest pace since May 2025.<sup>2</sup></p>\n<h3 class=\"wp-block-heading\" id=\"h-q4-2025-earnings-scorecard-heading-into-the-final-peak-weeks\">Q4 2025 Earnings Scorecard – Heading into the Final Peak Weeks</h3>\n<p>Corporate earnings continued to do their part to support the current economy. With 74% of S&amp;P 500 companies now reporting for Q4 2025, YoY EPS growth stands at 13.2% and revenue growth at 9.0%.<sup>3</sup> Consumer-facing names such as McDonald’s, Coca-Cola and Marriott gave us an early peek at the health of American shoppers ahead of the retail earnings parade which is scheduled to begin next week when WalMart reports results. The results from those names were mixed, and pointed to a theme we saw throughout 2025 in which higher-income consumers continue to do the heavy lifting while lower and middle-income shoppers remain more cautious. </p>\n<p>Retail sales results for December also came in flat last week.<sup>4 </sup>One upcoming tailwind for US consumers? A roughly $100B tax refund windfall is expected in the first half of the year due to permanent individual, estate and business tax extensions in the One Big Beautiful Bill Act (OBBBA). Consumers tend to treat tax refunds as windfall and will most likely spend those discretionary funds. </p>\n<ul class=\"wp-block-list\">\n<li><strong>Positive Surprises:</strong> 74% of companies have beaten EPS estimates, below the 5-year and 10-year averages. Meanwhile 73% have beaten on the top line, above both the 5- and 10-year averages.</li>\n<li><strong>Sector Leaders:</strong> Information Technology, Communication Services are leading the charge in top and bottom-line growth.</li>\n<li><strong>The Laggards:</strong> Meanwhile, Consumer Discretionary is expected to post a YoY decline in EPS, while Energy is estimated to show YoY declines on both the top and bottom-line.<sup>5</sup></li>\n</ul>\n<h3 class=\"wp-block-heading\" id=\"h-on-deck-this-week-nbsp-nbsp\">On Deck This Week  </h3>\n<p>This week, the market’s focus will shift from AI and software stocks to the Main Street health of the American consumer. U.S. markets were closed yesterday, Monday, February 16, for Presidents’ Day, setting the stage for a shortened but high-stakes four-day trading week dominated by the world’s largest retailer. While Walmart is the headliner, several other names will provide clarity on the sector rotation we’ve been seeing.</p>\n\n<h3 class=\"wp-block-heading\">Outlier Earnings Dates This Week</h3>\n<p>Academic research shows that when a company confirms a quarterly earnings date that is later than when they have historically reported, it’s typically a sign that the company will share bad news on their upcoming call, while moving a release date earlier suggests the opposite.<sup>6</sup></p>\n<p>This week we get results from a number of large companies on major indexes that have pushed their Q4 2025 earnings dates outside of their historical norms. Six companies within the S&amp;P 500 confirmed outlier earnings dates for this week, five of which are earlier than usual and therefore have positive DateBreaks Factors*. Those names are: Expand Energy Corp. (EXE), Edison International (EIX), Insulet Corp (PODD), Booking Holdings (BKING), and Evergy (EVRG). Only Global Payments (GPN) has a negative DateBreaks Factor this week.</p>\n<h3 class=\"wp-block-heading\">Q4 2025 Earnings Wave </h3>\n<p>In this shortened trading week, 1,033 companies are expected to release results (out of our universe of 11,000+ global names). Currently, February 26 is predicted to be the most active day with 831 companies anticipated to report. Thus far, 75% of companies have confirmed their earnings date and 41% have reported. The remaining dates are estimated based on historical reporting data.</p>\n<h3 class=\"wp-block-heading\">The Bottom Line</h3>\n<p>Heading into this shortened trading week, all eyes will turn to the state of the US consumer when WalMart releases Q4 results on Thursday and University of Michigan’s February Consumer Sentiment reading hits the tape on Friday. While the shift toward cyclicals suggests a defensive posture, the combination of a stabilizing labor floor and positive earnings outliers provides a compelling case for optimism. Ultimately, the next four days will reveal whether the current rotation is a temporary retreat or the beginning of a fundamental rebalancing of the 2026 market.</p>\n<p><strong><em>Sources:</em></strong></p>\n<p>1 The Employment Situation — January 2026, U.S. Department of Labor, Bureau of Labor Statistics, February 11, 2026, <a href=\"https://www.bls.gov/news.release/pdf/empsit.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">https://www.bls.gov</a><br/>2 Consumer Price Index Summary, January 2026, Bureau of Labor Statistics, February 13, 2026, <a href=\"https://www.bls.gov/news.release/cpi.nr0.htm\" rel=\"noreferrer noopener\" target=\"_blank\">https://www.bls.gov</a><br/>3 FactSet Earnings Insight, John Butters, February 13, 2026, <a href=\"https://advantage.factset.com/hubfs/Website/Resources%20Section/Research%20Desk/Earnings%20Insight/EarningsInsight_021326.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">https://advantage.factset.com</a><br/>4 Advance Monthly Sales for Retail and Food Services, December 2025, US Census Bureau, February 10, 2026, https://www.census.gov/retail/sales.html <br/>5 FactSet Earnings Insight, John Butters, February 13, 2026, <a href=\"https://advantage.factset.com/hubfs/Website/Resources%20Section/Research%20Desk/Earnings%20Insight/EarningsInsight_021326.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">https://advantage.factset.com</a><br/>6 Time Will Tell: Information in the Timing of Scheduled Earnings News, Journal of Financial and Quantitative Analysis, Eric C. So, Travis L. Johnson, Dec, 2018, <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2480662%E2%80%8B\" rel=\"noreferrer noopener\" target=\"_blank\">https://papers.ssrn.com</a></p>\n</div>",
            "link": "https://www.seeitmarket.com/retailers-ready-earnings-reports-amid-major-sector-rotation-and-tech-fallout/",
            "pub_date": "2026-02-18 01:11:39",
            "source": "seeitmarket",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "The 4-Step Formula to Spot a Stock Bottom Early",
            "description": "<div class=\"td-post-content tagdiv-type\">\n<!-- image -->\n<!-- content -->\n\n<p>How do you know when a stock or ETF has truly bottomed?</p>\n<p>Not guessing. Not hoping for. An actual bottom.</p><!-- /126710690/ims/SeeItMarket/In_text_1 -->\n\n<p>There’s a simple signal professional traders watch for — and when it appears, it often marks the moment sellers are exhausted and buyers quietly step in.</p>\n<p>First, we want to see a new 60-day low.<br/>That fresh low matters. It shakes out weak hands, triggers emotional selling, and creates what traders call <em>capitulation</em>. Without that flush, a real bottom is less likely.</p>\n\n<p>But the low alone is not enough.</p>\n<p>The next step is the real tell:<br/>the very next day, price must break above the prior day’s high.<br/>That’s the shift. Sellers pushed price down — but buyers immediately took control. When price can reclaim and exceed that prior high so quickly, it signals demand has returned.</p>\n<p>Then we look to volume for confirmation.<br/>A bounce on light volume can fail.<br/>A bounce with a <strong>clear volume surge</strong> shows institutions and serious money stepping in. Volume is proof that the reversal has participation.</p>\n<p>Finally — and this is the part that separates traders from gamblers — we define risk.<br/>The stop goes <strong>right under the day of the 60-day low</strong>.<br/>If price breaks that low again, the bottom isn’t in. </p>\n<p>We exit quickly and keep capital protected.</p>\n<p><strong>This simple four-step process:</strong><br/>1. new low → break prior high → volume → defined stop<br/>gives traders a structured way to spot potential market bottoms without guessing.</p>\n<p>2. Learn the pattern.<br/>3. Respect the risk.<br/>4. And let the market confirm when the bottom is truly in.</p>\n<p><iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\" frameborder=\"0\" height=\"602\" referrerpolicy=\"strict-origin-when-cross-origin\" src=\"https://www.youtube.com/embed/T10CWO9CES0\" title=\"How to spot a stock bottom before everyone else!\" width=\"339\"></iframe></p>\n<p></p>\n</div>",
            "link": "https://www.seeitmarket.com/the-4-step-formula-to-spot-a-stock-bottom-early/",
            "pub_date": "2026-02-14 11:42:51",
            "source": "seeitmarket",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Silver’s Next Big Trade: Calm After the Crash",
            "description": "<div class=\"td-post-content tagdiv-type\">\n<!-- image -->\n<!-- content -->\n\n<p>Silver has delivered both excitement and anxiety— surging higher in a volatile run and then stunning traders with a dramatic one-day selloff. </p>\n<p>Since that shakeout, the metal has begun to stabilize, moving into a period of consolidation that could define its next major trend.</p><!-- /126710690/ims/SeeItMarket/In_text_1 -->\n\n<p>While the price action has been intense, the bigger picture for silver remains constructive. </p>\n<p>The underlying fundamentals continue to lean bullish, with supply constraints and steady industrial and investment demand supporting the longer-term outlook. </p>\n<p>In other words, the recent volatility has not changed the core story — it has simply reset expectations and levels.</p>\n<p>Now that silver is calming down, this is where strategy comes into play. </p>\n<p>Consolidation phases often create the best opportunities to develop a clear trading and investment plan rather than reacting emotionally to sharp moves.</p>\n<p><strong>Watch the video here:</strong> <a href=\"https://youtube.com/shorts/HSgIt9uG1T8?si=eYkQE_1s8L3MqW8h\">https://youtube.com/shorts/HSgIt9uG1T8?si=eYkQE_1s8L3MqW8h</a></p>\n<p>The key technical level to watch on the downside is $80, which now becomes an important support zone. Holding above that level keeps the current bullish structure intact.</p>\n<p>On the upside, a decisive move over $90 an ounce could signal renewed momentum and attract fresh buying interest. If that breakout occurs, silver has the potential to run back toward $110 or even higher over time.</p>\n<p>As always, in Mish’s Market Minute, price leads the narrative — and silver’s next chapter will be written by how it behaves around these critical levels.</p>\n<p><strong>In this video, topics covered:</strong></p>\n<ul class=\"wp-block-list\">\n<li>Silver’s recent volatility and sharp selloff</li>\n<li>Why the bullish supply–demand story remains intact</li>\n<li>What consolidation means for traders and investors</li>\n<li>Key support level to watch: $80</li>\n<li>Breakout trigger: above $90</li>\n<li>Potential upside target: $110+</li>\n</ul>\n<p>Video <a href=\"https://youtube.com/shorts/HSgIt9uG1T8?si=eYkQE_1s8L3MqW8h\">https://youtube.com/shorts/HSgIt9uG1T8?si=eYkQE_1s8L3MqW8h</a></p>\n<p><strong>Note</strong> that this is different than our other YouTube channel featuring the Economic Modern Family.</p>\n<p>That is for financial literacy. </p>\n<p>Mish’s Daily of Mish’s Market Minute on the MarketGauge YouTube channel under “shorts” is meant for the more serious self-directed investor.</p>\n<p>They do, however, overlap.</p>\n<p><strong>Stock Market ETFs Analysis and Summary: </strong></p>\n<p>(Pivotal means short-term bullish above that level and bearish below) </p>\n<p><strong>S&amp;P 500 (SPY)</strong> Back to bullish phase and near the highs-critical next moves</p>\n<p><strong>Russell 2000 (IWM)</strong> Failed 267 which might be a bit concerning</p>\n<p><strong>Dow (DIA)</strong> 49,600 needs to hold</p>\n<p><strong>Nasdaq (QQQ)</strong> 620 puts this back over the 50-DMA but under 610 again will be trouble</p>\n<p><strong>Regional banks (KRE)</strong> Sold off a bit so now has to hold around 70.00</p>\n<p><strong>Semiconductors (SMH</strong>) sister semis is back in the game with all time high 420</p>\n<p><strong>Transportation (IYT)</strong> 79 has to hold</p>\n<p><strong>Biotechnology (IBB)</strong> Good consolidation probably means higher in store if holds 170</p>\n<p><strong>Retail (XRT)</strong> Granny in an unconfirmed warning phase-if gets a second close under 88 could be concerning </p>\n<p><strong>Bitcoin (BTCUSD)</strong> 58k is the 200-week moving average. 72,500 place to clear and the good news is that the high volatility has cooled off some</p>\n<p></p>\n</div>",
            "link": "https://www.seeitmarket.com/silvers-next-big-trade-calm-after-the-crash/",
            "pub_date": "2026-02-13 01:16:39",
            "source": "seeitmarket",
            "kind": 1,
            "language": "zh-HK"
        },
        {
            "title": "Treasury Bonds Elliott Wave Analysis: Poised For Rally",
            "description": "<div class=\"td-post-content tagdiv-type\">\n<!-- image -->\n<!-- content -->\n<p>Treasury bond futures appear ready for a sizeable bounce that could persist for several months or longer.</p>\n<p>Here we show how the same move might appear in the iShares 20+ Year Treasury Bond ETF (NYSEARCA:TLT).</p><!-- /126710690/ims/SeeItMarket/In_text_1 -->\n\n<p>Although we continue to believe the major high in bonds was set in 2020, the downward pattern since that time might be complete. It is possible to count a five-wave (i)-(ii)-(iii)-(iv)-(v) impulsive move into the TLT support zone near 82.00.</p>\n\n<p>If price remains above the 2023 low of 82.42, then a rally should take it to test initial resistance near 94.60 – 95.20, as drawn with the gray path. Moving above that level would serve as initial confirmation of the bounce scenario and would allow for a test of the higher areas shown: 102.50, 106.70 – 107.70, and our preferred upward target at 114.40. A stretch target for the move awaits near 118.90.</p>\n<p>The most prominent alternative scenario is that bonds haven’t yet found a low. As shown with the red path, a break beneath 82.42 would allow for a run to the next support at 75.40 and might allow tests of lower supports.</p>\n<p>If price declines, then 65.10 appears the most likely area for the downward move to finish, but even a test of 55.10 would be possible.</p>\n<p>You can join us every day at <a href=\"https://tradingonthemark.substack.com/\">Trading On The Mark</a> for more charts and livestreamed discussions of intraday markets.</p>\n</div>",
            "link": "https://www.seeitmarket.com/treasury-bonds-elliott-wave-analysis-poised-for-rally/",
            "pub_date": "2026-02-12 11:57:42",
            "source": "seeitmarket",
            "kind": 1,
            "language": "zh-HK"
        }
    ]
}