{
    "data": [
        {
            "title": "Judges seem inclined to allow CFPB RIFs — if there's a plan",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><ul class=\"rte2-style-ul\"><li><b>What's at Stake: </b>The CFPB's top managers want to fire 90% of the staff, which would both dramatically reduce the agency's headcount and severely cripple the Trump administration's rulemaking and supervisory agenda. </li><li><b>Key Insight:</b> A preliminary injunction issued by a district court was a necessary judicial \"stop gap\" measure to prevent the CFPB's operations from effectively ceasing. </li><li><b>Forward Look:</b> Experts say that if the government presented a credible plan to run the agency and abide by its legally required duties and functions with as small a workforce as it envisions, it would likely prevail in court. </li></ul><p>Federal appeals court judges hinted at a potential solution to the contentious showdown between the Consumer Financial Protection Bureau and the National Treasury Employees Union that could keep the agency alive.</p><p>During oral arguments Tuesday, judges on the U.S. Court of Appeals for the District of Columbia appeared poised to find a middle ground in a dispute that has wended its way through the lower courts for over a year. The move challenges the Trump administration's uncompromising refusal to scale back a mass firing, or reduction in force, of the CFPB staff, and potentially force acting CFPB Director Russell Vought to uphold the agency's legally required functions. </p><p>That solution was this: If the CFPB presents a credible plan to run the agency and fulfill its legal duties, the judges will remand the case back to the district court, and an injunction could be modified to allow a scaled-back round of firings.</p><p>\"There was a real willingness to try to come to a resolution of the case that works for the long-term,\" said Brad Lipton, director of corporate power and financial regulation at the Roosevelt Institute, and a former CFPB senior advisor. </p><p>That solution, Lipton said, would be \"in accordance with the separation of powers,\" and would allow the existing injunction that has stopped the CFPB's leadership from firing up to 90% of the agency's staff to be narrowed, allowing for some firings. </p><p>Over three hours of heated arguments Tuesday, judges floated a compromise: The CFPB could proceed with a scaled-back reduction in force, or RIF, but not without certain assurances. Legal experts noted that the Department of Justice under the Trump administration has failed in many cases to abide by court rulings it disagrees with, causing it to lose credibility with the judiciary. </p><p>Eric McArthur, a DOJ deputy assistant attorney general, reiterated during the hearing that acting CFPB Director Russell Vought's actions last year did not constitute a policy or even a final agency action. Disputes by federal employees must be channeled to the Merit System Protection Board, McArthur claimed, though the board itself has been caught up in a lawsuit of its own. After its lone Democratic appointee, Cathy Harris, was fired by President Trump last year, she sued the administration arguing that her termination was unlawful. An appeal court sanctioned her removal, but her absence has left the board without a quorum and a long backlog of cases to review. The ruling is out on appeal.</p><p>Crucially, some experts warn that allowing a RIF to continue could cripple the CFPB's ability to rewrite rules and perform effective supervision, two legally required functions. </p><p>\"There have been some mixed signals about the administration's intentions for the CFPB,\" said Chris Willis, a partner at the law firm Troutman Pepper Locke. \"The agency is pursuing a number of policy initiatives and rulemaking efforts that it presumably wants to complete. It has recently announced that it's going to re-engage in supervisory exams. But, there have been statements by the agency's leadership that the CFPB should be shut down completely.\"</p><p>Several experts said the agency is caught in a pickle. On the one hand, the Trump administration wants to use the agency to deregulate, which involves reissuing rulemakings and pursuing other regulatory efforts such as debanking and virtual supervisory exams. On the other hand, acting CFPB Director Russell Vought has <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/how-the-trump-administration-has-neutralized-the-cfpb\" target=\"_blank\"><u>stated explicitly</u></a></ps-link> that the agency is unconstitutional and should not exist. </p><p>Christa Bieker, a partner at Mayer Brown, said she has seen an uptick in dormant investigations being reopened by the CFPB, which suggests the agency's leadership is moving forward on some level. </p><p>\"We're seeing the CFPB slowly restart some of these investigations after a year of dismissing many cases with prejudice and terminating existing consent order obligations,\" Bieker said. \"Are they going to have enough people to continue these cases? Or are they going to decide to fire 90% of employees or come up with some other plan where they keep more staff? It's really unclear at this time.\"</p><p>The National Treasury Employees Union sued the CFPB's acting Director Russell Vought last February after he issued a <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/cfpb-workers-told-to-stand-down-stop-all-work\" target=\"_blank\"><u>stop-work order</u></a></ps-link>, told staff to halt all work, closed the bureau's headquarters and locked out its employees. The case is one of dozens in litigation against the Trump administration's ongoing efforts to fire federal workers and unilaterally fire Democrats on independent regulatory boards. </p><p>At oral arguments on Tuesday, judges noted the breathtaking speed with which Vought sought to dismantle the CFPB, a process so swift that the agency would have been eliminated within 30 days if the district court had not issued an injunction barring mass firings, the union claims.</p><p>McArthur dropped a bombshell during the last 10 minutes of the hearing, saying the CFPB's leadership has a plan to issue a RIF while also performing the agency's legally required functions. The mere mention of a plan immediately perked up the ears of several of the judges. </p><p>\"The planning has continued, and if it's of interest to the court, that's something that I could take back to the CFPB,\" McArthur said. \"The planning for what to do with this agency if and when an injunction is vacated or modified so as to allow us to proceed with the RIF, which is a lawful measure that the agency is allowed to take.\"</p><p>Judge Patricia Millett replied: \"Are you offering to share with us your plans for what to do if the injunction is lifted?\"</p><p>\"If that's something of interest to the court, I can certainly take that back to my client,\" McArthur said, referring to the CFPB.</p><p>The oral arguments centered on two critical issues: Whether the president can shut down an agency created by Congress, and whether federal courts have the power to halt a unilateral dismissal of employees with a preliminary injunction.</p><p>Several judges suggested the litigation could be resolved easily by remanding the case back to District Court Judge Amy Berman Jackson of the District Court for the District of Columbia to narrow the injunction that she <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/judge-grants-cfpb-preliminary-injunction-halts-mass-firings\" target=\"_blank\"><u>granted the union</u></a></ps-link> last March. </p><p>Judge Justin Walker asked the government what it would do if the D.C. Circuit sided with the union in finding that the CFPB's management had, in fact, taken a final action by telling employees last February to stop work with the intention of firing nearly all of the agency's employees. </p><p>\"If we were to vacate the injunction as overbroad, and then on remand, the District Court were to conclude that the Feb. 10 email was final agency action, and the district court then vacated that final agency action and did nothing more than that, what would you do?\"</p><p>McArthur replied: \"I don't know exactly what we do, but that sounds like not something that we would have a particular objection to.\"</p></div>",
            "link": "https://www.americanbanker.com/news/judges-seem-inclined-to-allow-cfpb-rifs-if-theres-a-plan",
            "pub_date": "2026-02-27 19:05:44",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "RBC raises provisions again amid renewed tariff uncertainty",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><ul class=\"rte2-style-ul\" style=\"margin-top:0;margin-bottom:0;padding-inline-start:48px;\"><li><b>Key Insight</b>: Canada's largest bank is once again bracing for pressure on the Canadian economy from U.S. tariffs.</li><li><b>Supporting Data</b>: In the quarter ending Jan. 31, RBC raised provisions for credit losses by 4% year over year.</li><li><b>Expert Quote</b>: \"While we believe the Canadian economy has demonstrated resilience, factors such as U.S. trade policy … add ongoing uncertainty to our outlook,\" said RBC Chief Risk Officer Graeme Hepworth.</li></ul><p></p><p></p><p></p><p>The Royal Bank of Canada is back where it was a year ago — bracing for possible trouble from U.S. tariffs.</p><p>Though the Toronto-based bank beat analysts' earnings expectations in the quarter that ended Jan. 31, it also raised provisions for credit losses to CA$1.09 billion, up 4% from one year ago. Its allowance for credit losses rose to CA$7.77 billion, up 12% year over year.</p><p>Those actions were taken at least in part to address concerns over U.S.-Canadian trade relations, as RBC Chief Risk Officer Graeme Hepworth made clear Thursday.</p><p>\"Looking ahead, while we believe the Canadian economy has demonstrated resilience, factors such as U.S. trade policy … and geopolitical tensions add ongoing uncertainty to our outlook,\" Hepworth said during a call with analysts. \"Against this backdrop, we have maintained a prudent approach with our allowances.\"</p><p>In March 2025, U.S. President Donald Trump <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/bankers-in-both-canada-u-s-mull-threat-of-trade-war\" target=\"_blank\"><u>imposed a 25% tariff</u></a></ps-link> on most Canadian goods, which he later raised to 35%. Since then, the new Canada-United States-Mexico Agreement exempted most Canadian goods from that tariff. Then came <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/supreme-court-strikes-down-trumps-liberation-day-tariffs\" target=\"_blank\"><u>this month's U.S. Supreme Court decision</u></a></ps-link> finding that last year's tariffs were illegal, though Trump vowed to revive them by other means. </p><p>The upshot for Canada's businesses has been a heavy dose of uncertainty.</p><p>RBC remains \"cautiously optimistic\" about the Canadian economy, Hepworth said. But the scenarios the bank has prepared for include a possible \"severe North American recession driven by escalating global trade wars,\" he said.</p><p>CEO Dave McKay echoed these concerns.</p><p>\"The Canadian economy remained resilient through the elevated uncertainty from persistent and evolving geopolitical and trade tensions,\" McKay said. \"That said, the impact from tariffs on the economy varies depending on the clients or sectors. We are seeing strong profitability and improving productivity for many of our corporate clients, while commercial clients in tariff-impacted sectors and geographies are facing headwinds.\"</p><p>This is not the first time RBC has raised its provisions amid tariff concerns. In the first quarter of 2025, shortly after Trump began his second term, the bank <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/rbc-raises-loss-provision-amid-concern-over-u-s-tariffs\" target=\"_blank\"><u>increased its provision for credit losses</u></a></ps-link> to CA$1.05 billion, a CA$237 million jump from the year before.</p><p>Going forward, RBC is hoping for the best but preparing for the worst. Its base outlook, Hepworth said, is still that tariffs and Canada-United States-Mexico-Agreement-related exemptions will remain at their current levels.</p><p>For the quarter, RBC's earnings per share reached CA$4.03, beating analysts' consensus estimate of CA$3.81, according to S&amp;P. Net income was also a beat, rising to CA$5.78 billion, above estimates of CA$5.33 billion.</p><p>Canada's largest bank got solid contributions from its U.S. operations. Revenue from U.S. wealth management, including at the American subsidiary City National Bank, rose to US$1.93 billion in the first quarter, a 12% increase from one year before.</p><p>RBC acquired City National in 2015, but starting in 2023, the Los Angeles-based bank struggled starting amid rising interest rates and regulatory problems. By 2025, City National's net income and credit outlook were <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/rbcs-city-national-bank-is-back-on-front-foot-ceo-says\" target=\"_blank\"><u>improving</u></a></ps-link> — a comeback that has continued into this year. </p><p>In the first quarter of 2026, City National's net income rose to US$143 million, RBC said during the call, more than doubling year over year.</p><p>\"We are very excited about being on a growth front-footing right now with that business, profitability-wise and customer growth-wise,\" McKay said.</p></div>",
            "link": "https://www.americanbanker.com/news/rbc-raises-provisions-again-amid-renewed-tariff-uncertainty",
            "pub_date": "2026-02-27 06:16:02",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nubank reports 45% revenue increase in latest earnings",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><p>Nubank announced its fourth quarter and full year earnings results after market close on Wednesday, reporting strong growth but slightly missing Wall Street earnings estimates.</p><p>The Brazilian neobank reported approximately $4.9 billion in revenue for the quarter ending December 31, 2025, a 45% increase year over year from $3.1 billion in 2024. Full year revenue for 2025 was $16.3 billion, also a 45% increase year over year from 2024's $11.7 billion.</p><p>Total operating expenses for the year were $2.8 billion, an 11% increase year over year from $2.5 billion in 2024. Nubank executives noted on the company earnings call Wednesday night that the Q4 earnings report included multiple one-time expenses, such as $22 million of transition expenses for the company's <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/nubank-co-founder-cristina-junqueira-sets-sights-on-u-s-market\" target=\"_blank\"><u>2026 return-to-office</u></a></ps-link> decision and a $25 million one-off expense towards a sector-wide deposit insurance fund in Mexico.</p><p>Net income for the full year came out to $2.9 billion in 2025, a 37% increase year over year from $2 billion in 2024.</p><p>Earnings per share came out to $0.58, slightly under Wall Street analyst consensus estimates of $0.59 per share, according to S&amp;P Capital.</p><p>Nu Holding's total credit portfolio expanded 40% year over year and 11% quarter over quarter to $32.7 billion, according to its earnings statement. </p><p>The neobank launched its AI-powered credit underwriting model, nuFormer, in late 2025 for credit underwriting in Brazil. The model boosted Nubank's largest quarterly gain in credit card market share in ten quarters, according to the company. The nuFormer model will also be expanded to lending in Brazil and credit cards in Mexico, according to Nubank's earnings statement.</p><p>A Nubank representative told American Banker that starting this quarter, the earnings report now includes \"a consolidated view of credit quality across the entire Nu platform.\" Previous earnings figures only included the neobank's Brazilian operation.</p><p>Nubank has established customer bases in Mexico and Colombia, and the fintech is also moving forward to establish a U.S. bank division after <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/nubank-receives-approval-for-us-bank-charter\" target=\"_blank\"><u>receiving</u></a></ps-link> a conditionally approved de novo bank charter from the OCC in January. Since the fourth quarter and fiscal year ended in December 2025, this earnings cycle was not impacted by the U.S. charter approval.</p><p>\"During 2026, we will lay the operational groundwork for our U.S. opportunity, building on the conditional bank charter approval,\" Nubank CEO David Velez told investors on the company earnings call Wednesday night. \"Latin America remains our primary growth engine.\"</p><p>Nubank co-founder <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/nubank-co-founder-cristina-junqueira-sets-sights-on-u-s-market\" target=\"_blank\"><u>Cristina Junqueira</u></a></ps-link>, recently appointed as the CEO of Nu's U.S. bank division, previously told American Banker that she is working on expanding Nubank's physical presence in the U.S. by establishing additional office spaces and hiring more employees. Nubank did not disclose specific figures regarding its U.S. expansion plans in its earnings.</p><p>\"There are team increases that we're having for the U.S. launch, but I wouldn't say they're expected to be significant in 2026,\" Velez said in the earnings call.</p><p>Although Nubank will be opening a U.S. division operating as a bank under the de novo charter within the next couple of years, the Brazil-based parent company Nu Holdings does not yet have a banking license from Brazil and currently operates as a nonbank fintech. Nubank announced in December that it <ps-link><a class=\"Link\" href=\"https://international.nubank.com.br/company/nubank-intends-to-obtain-banking-license-in-brazil-in-2026/\" target=\"_blank\"><u>intends to acquire</u></a></ps-link> a Brazil banking license in 2026. Nubank did not comment on the Brazil bank license in its earnings statement or call.</p><p>Market analysts viewed Nubank's earnings positively, but acknowledged that upcoming expenses may have a negative short-term impact on the neobank's stock prices.</p><p>\"We remain constructive on geo growth opportunity and improving credit models as a source of additional growth/profitability,\" Keybank analysts wrote in a research note. \"Messaging on 2026 spend is likely a moderately negative surprise, but incremental operating leverage is still on the table.\"</p><p>Citi analysts wrote in a research note that the bank continues to grow at a strong pace, citing \"a strong quarter by Nubank on top-line, with an acceleration in loan portfolio growth and net interest income. However, cost of risk and operating expenses mud[dy] the picture. Expenses outpaced fees, creating some pressures on earnings before taxes.\"</p><p>Nubank's stock price was down by about 9% as of Thursday afternoon.</p></div>",
            "link": "https://www.americanbanker.com/news/nubank-reports-45-revenue-increase-in-latest-earnings",
            "pub_date": "2026-02-27 05:45:31",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Washington's FS Bancorp to enter Portland with deal",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><ul><li><b>Supporting data:</b> FS Bancorp in Mountlake Terrace, Wash., announced its first whole-bank acquisition since 2019 on Thursday. </li><li><b>Key insight:</b> The deal for the four-branch Pacific West Bank moves FS and its 1st Security Bank subsidiary into the Portland, Ore., market. </li><li><b>Expert Quote:</b> \"This partnership with Pacific West represents a compelling step forward in our continued expansion across the Pacific Northwest.\" — FS President Matthew Mullet</li></ul><p>FS Bancorp, the Mountlake Terrace, Wash.-based holding company for 1st Security Bank, has agreed to pay $34.6 million in cash and stock for Pacific West Bank in West Linn, Ore. </p><p>Though small in dollar terms, the deal, which is expected to close in the third quarter, has important strategic implications, since it would give FS its first presence in Portland. It also marks the first whole-bank acquisition by FS since 2019, when the company <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/anchor-in-wash-finds-new-buyer-after-reg-issue-snagged-prior-deal#:~:text=Anchor%20in%20Wash.-,finds%20new%20buyer%20after%20reg%20issue%20snagged%20prior%20deal,of%20Anchor's%20tangible%20book%20value.\" target=\"_blank\"><u>acquired</u></a></ps-link> the $480 million-asset Anchor Bank in Lacey, Wash.</p><p>The deal comes at a time of increased bank-merger activity, with institutions scrambling to take advantage of a <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/need-for-speed-faster-deal-timelines-may-spur-more-bank-m-a\" target=\"_blank\"><u>more favorable regulatory environment</u></a></ps-link>. In 22 deals announced through Feb. 23, buyers paid an average price-to-tangible-book-value of 170% compared to an average of 144% in 2025, according to Seaport Research Partners senior analyst Laurie Havener Hunsicker.</p><p>\"We think the bull market still has legs,\" Hunsicker wrote Monday in a research note. \"The strength in stock prices, the pent-up demand to do deals, and the substantially faster regulatory approval process will continue to accelerate M&amp;A.\" </p><p>The $386 million-asset Pacific West operates four Portland-area branches. The region is home to about 2.5 million people and 45,000 businesses, most of them small enterprises with 50 or fewer employees, according to the Census Bureau. </p><p>The combined institution would have $3.6 billion of assets, $2.98 billion of loans and $3.03 billion of deposits. Its 0.5% share of Portland's $65.6 billion deposit market leaves plenty of room to grow. </p><p>\"This partnership with Pacific West represents a compelling step forward in our continued expansion across the Pacific Northwest,\" FS President Matthew Mullet said Wednesday in a press release. \"Pacific West has built a customer-focused commercial banking franchise with deep roots in the Portland-Vancouver metro area. Combining our organizations brings together complementary strengths that enhance our ability to serve our customers and communities.\"</p><p>Mullet, who served previously as the organization's chief financial officer, <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/washingtons-1st-security-taps-numbers-guy-as-next-in-line\" target=\"_blank\"><u>was named CEO</u></a></ps-link> of 1st Security Bank in August. The Federal Reserve Bank of San Francisco appointed Mullet to the board of directors of its Seattle branch earlier this month. </p><p>The deal's financial highlights include expected growth in earnings-per-share of 7.4% in 2027. Tangible book value dilution is 2.2% with a projected earn-back of less than two-and-one-half years. First Security is projecting cost savings equal to 30% of Pacific West's noninterest expenses, which totaled $10.5 million in 2025, according to the Federal Deposit Insurance Corp. </p><p>FS is estimating a loan discount of $4.2 million or 1.51% of Pacific West's $276.6 million loan portfolio in assessing its fair value mark. </p><p>Pacific West reported net income totaling $650,000 in 2025, powered by 25% year-over-year growth in deposits. Pacific West lost money in 2024 and 2024, however. </p><p>Now, merging with FS will give its bankers and clients access to more capital, improved technology and a wider product set, CEO Jason Wessling said in the press release. </p><p>\"We are excited to join FS Bancorp, a company that shares our commitment to relationship banking and community engagement,\" Wessling said. </p></div>",
            "link": "https://www.americanbanker.com/news/washingtons-fs-bancorp-to-enter-portland-with-deal",
            "pub_date": "2026-02-27 05:36:19",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chime beats Q4 estimates, leans into Trump Accounts",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><ul class=\"rte2-style-ul\" style=\"margin-top: 0px; margin-bottom: 0px; padding-inline-start: 48px;\"><li><b>Supporting data:</b> Chime reported $596 million in fourth-quarter revenue, representing a 25% year-over-year increase.</li><li><b>Expert quote:</b> JPMorgan analyst Tien-tsin Huang noted that the fourth-quarter results came in \"ahead of expectation as high-quality [customer growth] supports engagement and monetization.\"</li><li><b>Forward look:</b> Following a strong fourth quarter, Chime anticipates achieving GAAP profitability in 2026.</li></ul><p><i>Overview bullets generated by AI with editorial review</i></p><p>Chime Financial reported strong fourth-quarter and full-year earnings Wednesday evening, beating analyst expectations and setting up to reach profitability in 2026 while expanding its product suite to include new Trump-branded children's investment accounts.</p><p>The San Francisco-based digital bank posted $596 million in fourth-quarter revenue, a 25% year-over-year increase, and an adjusted EBITDA of $57 million.</p><p>The company is leaning heavily into new products like its proprietary core processor, its credit card, and so-called Trump Accounts to sustain momentum.</p><p>For the U.S. banking industry, Chime's continued growth and lower operating costs pose a competitive threat as the digital bank captures market share in primary checking accounts and wades into the nascent Trump Account program that traditional banks are also targeting.</p><h2 class=\"cms-heading-h2 HeadingH2\">Financial performance and outlook</h2><p>Chime beat fourth-quarter Wall Street consensus estimates, which had projected roughly $578 million for revenue and $46 for adjusted EBITDA, based on 13 analyst estimates collected by S&amp;P Global Market Intelligence.</p><p>The company reported a fourth-quarter net loss of $44.8 million (a net earnings per share of -$0.12) and a full-year net loss of $1.01 billion.</p><p>The full-year net loss was heavily driven by $928 million of stock-based compensation expense and related payroll taxes linked to the company's initial public offering. However, the company generated $2.19 billion in full-year revenue, up 31% from the previous year, and reached an adjusted EBITDA of $127 million.</p><p>Chime issued full-year 2026 guidance projecting revenue between $2.63 billion and $2.67 billion and an adjusted EBITDA of $380 million to $400 million.</p><p>Analyst expectations for the next year align with this guidance; the consensus mean revenue expectation is $2.64 billion and EBITDA at $387 million, according to S&amp;P's analysis.</p><p>Chime expects \"to achieve GAAP profitability in 2026,\" according to a Wednesday press release, and analysts agree, expecting $65 million in net income in the coming year.</p><h2 class=\"cms-heading-h2 HeadingH2\">Analysts applaud the results</h2><p>Stock analysts tracking the company praised the earnings report, noting that Chime's underlying growth metrics look healthy.</p><p>\"This was a 'show me' quarter for investors, and Chime delivered,\" according to a Wednesday research note from Piper Sandler senior research analyst Patrick Moley.</p><p>JPMorgan analyst Tien-tsin Huang said the fourth-quarter results came in \"ahead of expectation as high-quality [customer growth] supports engagement and monetization,\" according to a Thursday report.</p><p>Huang noted that Chime's member growth of 500,000 for the quarter \"came in better than anticipated while revenue and EBITDA were nicely ahead of estimates.\"</p><p>B. Riley Securities analyst Hal Goetsch wrote that the company saw a \"solid beat\" and issued 2026 guidance \"well ahead of our estimates,\" according to a Thursday note.</p><h2 class=\"cms-heading-h2 HeadingH2\">Leaning into Trump Accounts</h2><p>Chime is also pushing to capture a piece of the new Trump Accounts program.</p><p>Created by the Working Families Tax Cuts under the One, Big, Beautiful Bill Act, the program allows parents to open traditional individual retirement accounts for their eligible children. The federal government will provide a one-time $1,000 seed deposit for eligible children born between 2025 and 2028, and individuals and employers can contribute up to $5,000 annually.</p><p>During his State of the Union address, President Donald Trump described the program as providing \"tax-free investment accounts,\" but financial planners point out that the accounts actually function like traditional IRAs, meaning pretax funds and earnings will be subject to regular income taxes upon withdrawal.</p><p>To capture this market, Chime integrated the enrollment process — IRS Form 4547 — directly into its tax filing app to make the accounts \"more accessible for working families,\" according to a Feb. 13 press release from the company. The company also pledged to match the $1,000 government contribution for the eligible children of its own employees.</p><p>Other financial institutions are jumping in, as well. Banks and investment firms including JPMorgan Chase, BlackRock, SoFi, Charles Schwab, and BNY have announced programs to match employee contributions to the accounts.</p><h2 class=\"cms-heading-h2 HeadingH2\">Chime now on its own core</h2><p>Chime finalized a multi-year migration to its proprietary payment processor and ledger, ChimeCore, in the fourth quarter of 2025.</p><p>The digital bank is \"now 100% on our own tech stack,\" said Christopher Britt, CEO of Chime, during the Wednesday earnings call. Britt noted that the new system differentiates Chime from traditional banks and other financial technology companies that rely on inflexible and expensive third-party processors.</p><p>Company executives expect the migration to reduce transaction processing costs by roughly 60%, which supports a long-term gross margin target of 90%, according to a Wednesday press release from Chime.</p><p>As part of the transition, Chime moved all member accounts to ChimeCore on Nov. 4 and ceased using its former third-party processor, Galileo. The company incurred an approximately $32.7 million one-time termination fee during the fourth quarter to sever the agreement, though the contractual relationship will technically continue until March 2026, according to a November financial filing from the company</p><h2 class=\"cms-heading-h2 HeadingH2\">Other major developments</h2><p>During the fourth quarter, Chime also pushed into the corporate benefits space, launching Chime Enterprise to provide fee-free financial tools and earned-wage access to employees at companies like Cedarhurst Senior Living, eXp Realty, and Lakeshore Recycling Systems.</p><p>In the sports world, Chime secured sponsorships to feature its logo on the jerseys of the Portland Fire women's basketball team and became the official retail banking partner of Major League Soccer.</p><p>The company reorganized its executive ranks in December, promoting Mark Troughton to president, Janelle Sallenave to chief operating officer, and Vineet Mehra to chief growth officer.<br/></p></div>",
            "link": "https://www.americanbanker.com/news/chime-beats-q4-estimates-leans-into-trump-accounts",
            "pub_date": "2026-02-27 05:10:33",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TD reports progress on turnaround as AML efforts press on",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><ul><li><b>Key insight:</b> TD's efforts to shrink its U.S. balance sheet are nearing the end, as the bank expects to beef up its lending in certain areas throughout the year.</li><li><b>Supporting data:</b> While total stateside loans were down some 11% from the previous year, lending rose by more than 2% in the sectors where TD is targeting growth.</li><li><b>Forward look:</b> Still, the tailwind that the U.S. unit got from certain balance-sheet repositioning efforts isn't expected to be as strong going forward as it was in the first quarter.</li></ul><p>TD Bank Group says it's on track to resume growing its U.S. loan portfolio later in 2026, about two years after regulators capped the size of its American operations.</p><p>The Toronto-based company has been running off certain U.S. portfolios, while also building up stateside business in what it calls \"core\" lending areas, such as middle market, consumer and credit cards.</p><p>During the quarter that ended on Jan. 31, U.S. revenue rose from the same period a year earlier, TD reported Thursday. Better credit quality and a balance-sheet restructuring were factors in the improvement.</p><p>\"You put the revenue momentum that we're enjoying now, the pricing discipline we put in place, the expense focus that we have, and will continue to materialize over the rest of the year — I feel quite confident with regards to the outlook for the rest of the year,\" said Leo Salom, who leads TD's American operations, during the company's earnings call on Thursday.</p><p>TD's stock was up some 1.7% on Thursday afternoon, as the bank stuck to the expense <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/tds-u-s-leader-lays-out-ambitious-post-scandal-goals\" target=\"_blank\"><u>guidance it had offered last year</u></a></ps-link> and logged revenue growth across its operations.</p><p>In the U.S., the company's revenue of $2.9 billion was up 8% on an adjusted basis from the prior year. Reported net income excluding the impact of the company's stake in Charles Schwab rose to $747 million, up from just $105 million in the first quarter of 2025. The massive difference was largely due to a change in how certain tax benefits are accounted for, along with stronger credit quality.</p><p>John Aiken, an analyst at Jefferies, said in a note that TD's first quarter, which ended Jan. 31,  was a \"positive\" look, with the bank \"moving forward on its goals.\"</p><p>TD has been seeking to turn around its U.S. operations after <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/td-pleads-guilty-to-money-laundering-conspiracy-hit-with-asset-cap\" target=\"_blank\"><u>historic compliance failures</u></a></ps-link> for which law enforcement and regulators required it to pay more than $3.1 billion and keep its U.S. assets under $434 billion. The scandal also led to a change at the top of the parent company, with Raymond Chun taking over as president and CEO.</p><p>Since Chun's appointment, the bank has been on a mission not only to <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/td-bank-shrinks-by-10-in-u-s-to-comply-with-asset-cap\" target=\"_blank\"><u>realign its American operations</u></a></ps-link>, but also to structurally reduce costs across its businesses.</p><p>The company has reduced its U.S. branch count by 7.5% since Jan. 31, 2025, and has sold or run off portfolios in its \"non-core\" businesses, including point-of-sale finance, correspondent lending, commercial auto deal lending and export and import lending.</p><p>Average loans in non-core U.S. businesses fell from $33 billion in the first quarter of 2025 to $11 billion in the same period this year.</p><p>Salom said Thursday that the loan-repositioning work, along with repricing actions across deposit and loan books, were tailwinds to TD's U.S. business during the first quarter. The effects of those tailwinds may not be as strong going forward, he added.</p><p>He also said that \"economic momentum\" in the U.S. was leading to solid loan growth in the areas where TD wants to expand. While total average loans in the States were down about 9% from the previous year, core average loans were up about 2.5%, the company said in its earnings presentation.</p><p>Middle-market loans grew 4%, with a 15% increase in pipelines for that business, Salom said. TD's specialty higher-education loan book also increased by about 5%, he said.</p><p>The bank has been investing in certain parts of its cards business since 2022, and Salom said that U.S. proprietary credit card balances were up 15% year-over-year.</p><p>\"Where we're seeing a little bit of sluggishness in the U.S. market broadly is that the small business and lower-end community banking level,\" Salom said. \"I think that those businesses are just more susceptible to the trade uncertainty, the supply-chain disruptions, and the current state of interest rates. So I think there we're still seeing some muted growth.\"</p><p>Still, TD is targeting a return to U.S. net loan growth in the third quarter, Salom said.</p><p>Earlier this month, the bank took another step in sharpening its focus on credit cards by converting its Nordstrom card portfolio from the department store chain's servicing platform onto its own. The move, which TD had teased for months, will give the bank a higher share of revenue, along with higher expected losses. </p><p>The bank reiterated Thursday that it plans to spend $1 billion across 2025 and 2026 on <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/td-has-completed-majority-of-u-s-aml-remediation\" target=\"_blank\"><u>overhauling its U.S. anti-money-laundering controls.</u></a></ps-link> The composition of that spending will gradually shift, though, toward validating the progress that the company has made, Salom said.</p><p>In December, Salom said that the company had completed the majority of the actions that it had to take, but it still needed to audit and earn the approval of regulators and law enforcement for its enhanced controls.</p><p>On top of its U.S. compliance fixes, the bank will continue to work on revamping its anti-money-laundering controls across the enterprise.</p><p>During the first quarter, TD also completed one major restructuring effort that it began last year, which was part of its mission to reduce expenses.</p><p>Across the enterprise, the bank has logged 886 million in Canadian dollars of total pre-tax charges from the restructuring program, which included layoffs, real-estate optimization and business wind-downs. TD expects the changes to drive C$500 million of pre-tax savings in 2026, plus fully-realized pre-tax annual cost savings of C$775 million.</p><p>Chun said Thursday that he expects the bank's gains from artificial intelligence to beat its projections from September. Last fall, TD said it expected AI tools to cut C$500 million in expenses and drive C$500 million in revenue across the company by 2029.</p><p>But those AI tools are becoming more advanced and more useful than the bank had predicted six months ago, Chun said Thursday.</p><p>\"I do think we're going to get more from the value, from an AI perspective, beyond the billion dollars,\" Chun said. \"We're seeing better momentum than what we had thought.\"</p></div>",
            "link": "https://www.americanbanker.com/news/td-reports-progress-on-turnaround-as-aml-efforts-press-on",
            "pub_date": "2026-02-27 05:05:42",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Senate tees up Housing bill, but what's in it is unclear",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><ul><li><b>Key insight:</b> The core of both the Senate and House versions of the legislation aim to increase the supply of housing, but a slew of bipartisan riders in the House version have been opposed by some Democrats in the upper chamber. </li><li><b>What's at stake:</b> The House version has a number of bank-favored riders, like brokered and custodial deposits, that could still end up in the Senate version. </li><li><b>Forward look:</b> The key point will be what Senate Majority Leader John Thune, R-S.D., is willing to add, and if enough Democrats will support the community bank provisions to reach a compromise with House Financial Services Committee Rep. French Hill, R-Ark. </li></ul><p>WASHINGTON — Senate Majority Leader John Thune, R-S.D., has filed cloture on the Senate's version of a housing affordability package, teeing it up for a vote next week. </p><p>The legislation, sponsored by the Senate Banking Committee chair and ranking member, Sens. Tim Scott, R-S.C. and Elizabeth Warren, D-Mass., previously <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/housing-bills-advance-with-pluses-minuses-for-bankers\" target=\"_blank\"><u>passed out of the committee</u></a></ps-link> unanimously. The Senate has been pressured to move the legislation since the House <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/housing-bill-passes-house-with-community-bank-riders\" target=\"_blank\"><u>passed its own version</u></a></ps-link> earlier this month. </p><p>The House version of the legislation has a number of bank-favored riders attached to it, including provisions on brokered and custodial deposits. </p><p>While the Senate version doesn't include these provisions, Thune's filing sets off a wave of negotiations between the House, Senate and White House over <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/bank-riders-have-murky-future-as-housing-bill-heads-to-senate\" target=\"_blank\"><u>which priorities</u></a></ps-link> will be included in the final version that senators will vote on. House Financial Services Chairman French Hill, R-Ark., has fought to include these sections of his bill, convincing his Democratic counterpart, ranking member Rep. Maxine Waters, D-Calif., to support them, and he is expected to continue to push for them in the next few days. </p><p>\"It is imperative that my Senate colleagues work with the House to deliver a bipartisan housing bill to President Trump's desk — one that reflects the shared priorities of the House, Senate, and White House,\" Hill said in a statement. </p><p>Another item that could be in play is the ban on institutional investors buying up single family homes, a populist plank that has found agreement between parties as disparate Warren and President Donald Trump, who <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/trump-talks-housing-affordability-at-state-of-the-union\" target=\"_blank\"><u>touched on the measure</u></a></ps-link> in his State of the Union address this week. </p><p>It's unclear at this point what version of housing legislation will actually make it to the Senate floor. </p><p>Warren has already opposed the community bank riders. </p><p>\"I'm glad to see the House move forward on housing proposals, but House Republicans should not hold housing relief hostage to push forward several bank deregulatory bills that will make our community banks more fragile while harming consumers, small businesses, and economic growth. Americans need relief from the housing crisis now,\" she said in a statement earlier this month. </p><p>But there still might be enough Democrats interested in the issue to clear the 60-vote threshold necessary to bring the bill to a final vote, making the community bank provisions an attractive sweetener for Senators looking to win over Hill and the House in general. The brokered deposit items have Democratic support on the Senate side, but it's not clear if those lawmakers will agree to put them in the wider housing package. </p></div>",
            "link": "https://www.americanbanker.com/news/senate-tees-up-housing-bill-but-whats-in-it-unclear",
            "pub_date": "2026-02-27 04:45:32",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Exclusive: Lawmakers introduce bipartisan FHLB bond bill",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><ul><li><b>Key insight:</b> A bill offered by Sens. Catherine Cortez Masto, D-Nev., and Todd Young, R-Ind., would allow Federal Home Loan Bank members to set up tax-exempt bonds for community development projects, much the same way they already do for housing projects. </li><li><b>Expert quote:</b> \"For too long, communities across the country have had a hard time raising the funds they need to make improvements to sewer and water systems, hospitals, schools, and more.\" — Sen. Catherine Cortez Masto, D-Nev. </li><li><b>Forward look:</b> With support for community lending on both sides of the aisle, the bill could have a future even if Democrats gain ground in the Senate and House after this year's elections. </li></ul><p>WASHINGTON — A group of bipartisan lawmakers are introducing a bill today that would expand the ability of Federal Home Loan Bank members to support tax-exempt bonds for community development projects. </p><p>The legislation, introduced by Sens. Catherine Cortez Masto, D-Nev., and Todd Young, R-Ind., would let FHLB member institutions to set up tax-exempt bonds — much the way that they're currently allowed to do to support housing-related projects — for other community development infrastructure, such as water and sewage treatment facilities, transportation centers, industrial development, health care facilities or schools. </p><p>The bill, known as the Municipal Investment and Neighborhood Transformation, or MINT, Act, would make such projects eligible for Letters of Credit from Federal Home Loan Bank member institutions. The bill would effectively restore an authority that was granted to the FHLBs as part of the Housing and Economic Recovery Act of 2008. The provision expired in 2010. Extending the provision was, <ps-link><a class=\"Link\" href=\"https://www.cdfa.net/cdfa/cdfaweb.nsf/fbaad5956b2928b086256efa005c5f78/4ee2201461cd76b8862577290057e5c3/$FILE/Community%20Development%20Financing%20Act%20of%202010%20Fact%20Sheet%205-11-2010%20a.pdf\" target=\"_blank\"><u>at the time</u></a></ps-link>, supported by bank trade groups. </p><p>The bill is bipartisan, meaning it has a better chance of passing the tightly divided Congress than it otherwise would be. There's also an appetite — stemming from long-held policy convictions on both sides of the aisle and vocal push from President Donald Trump — to pursue housing-related legislation.</p><p>\"For too long, communities across the country have had a hard time raising the funds they need to make improvements to sewer and water systems, hospitals, schools, and more,\" Cortez Masto said in a statement. \"Our legislation unlocks more options for these communities that were previously unavailable to them and empowers the Federal Home Loan Bank system to better fulfill its mission to support community development.\"</p><p>FHLB legislation could find a home in a housing package or a number of other vehicles in the coming years. With support for community lending on both sides of the aisle, a bill like this doesn't have the same short life span that issues that are quickly becoming more political and could wane as Democrats retake parts of Congress after the midterm elections. </p><p>\"The Federal Home Loan Banks play a critical role in providing reliable liquidity to financial institutions to make local economic projects possible,\" Young said in a statement. \"Our bill will restore a proven financing tool to help lower costs for community development projects in towns across America.\" </p><p>A companion bill is being introduced in the House by Reps. Lisa McClain, R-Mich., and Sam Liccardo, D-Calif. </p><p>\"Communities shouldn't have to pay higher borrowing costs simply because they lack access to Wall Street financing. This bill levels the playing field by giving local lenders the tools they need to help their communities invest in infrastructure, health care, and economic development without putting taxpayers on the hook for higher interest rates. It will help unlock investment where it's needed most,\" McClain said in a statement. </p></div>",
            "link": "https://www.americanbanker.com/news/exclusive-lawmakers-introduce-bipartisan-fhlb-bond-bill",
            "pub_date": "2026-02-27 04:06:24",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OCC proposes comprehensive stablecoin framework",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><p>Key insight: Issuers must hold liquid reserves and capital as well as an additional FDIC-insured operational backstop.</p><p>Supporting data: OCC sets $5 million minimum capital for all new stablecoin issuers.</p><p>Forward look: The rule will be open for 60 days for comment. </p><p>The Office of the Comptroller of the Currency on Wednesday proposed a comprehensive framework for capital and other requirements for payment stablecoin issuers under the GENIUS Act.</p><p>The nearly 400-page <ps-link><a class=\"Link\" href=\"https://occ.gov/news-issuances/news-releases/2026/nr-occ-2026-9a.pdf\" target=\"_blank\"><u>proposed rule</u></a></ps-link> aims to establish federal oversight while supporting innovation in the digital payments ecosystem. The proposal focuses on licensing, operational and reserve requirements, governance, transparency, risk management and capital adequacy, reflecting the agency's objective of fostering a safe and stable stablecoin market without unduly burdening new entrants.</p><p>\"The OCC has given thoughtful consideration to a proposed regulatory framework in which the stablecoin industry can flourish in a safe and sound manner,\" said Comptroller of the Currency Jonathan V. Gould. \"We welcome feedback on the proposal to inform a final rule that is effective, practical and reflects broad industry perspective. The OCC will continue its work to implement the GENIUS Act and provide OCC regulated entities with more opportunities to meet the needs of their customers and communities.\"</p><p>Under the proposal, stablecoin issuers would need to have a federal charter from the OCC to operate as \"permitted payment stablecoin issuers.\" The agency would undergo a case-by-case process for granting issuers licenses, considering each applicant's business model, likely growth trajectory, operational risks and governance. </p><p>The OCC puts emphasis on its ability to flexibly evaluate each model and likened its thinking about stablecoin issuance to that of its current chartering regime for national trust banks. </p><p>\"The overall approach in the proposed rule would provide for an individualized evaluation of each prospective permitted payment stablecoin issuer,\" the proposal notes. \"Consistent with the process the OCC applies when determining minimum capital requirements for chartering national trust banks.\"</p><p>Applicants would be required to demonstrate that their stablecoin activities can be conducted safely, that reserve assets are appropriately managed and that they have systems in place to handle operational disruptions. The OCC also proposes a \"de novo\" period of approximately three years for newly chartered issuers, during which the OCC would monitor operations closely and retain the ability to adjust requirements based on performance or changes in the business model originally applied for.</p><p>The OCC is also proposing implementing a $5 million minimum capital requirement that sets a floor for new stablecoin issuer entrants, regardless of size. </p><p>\"This floor is primarily intended to ensure that every proposed payment stablecoin issuer has sufficient resources to support initial operations, particularly to cover the losses that are expected to occur early in the startup phase of a new stablecoin,\" the OCC proposal states. \"The OCC's experience with chartering de novo national trust banks seeking to provide stablecoin programs determined that minimum capital amounts ranging from $6.05 million to $25 million would be necessary to establish a viable business model.\"</p><p>Issuers would be required to maintain liquid reserve assets including U.S. Treasuries, deposits at insured depository institutions, certain money market funds and cleared or tri-party reverse repurchase agreements. OCC says it is mulling publishing a list of reserve assets to assist banks in ensuring compliance. </p><p>\"To the extent feasible, the OCC is considering publishing a list of, or otherwise making public, the acceptable tokenized reserve assets for the sake of transparency,\" the proposal said. \"In determining whether a potential reserve asset qualifies…the OCC will consider, among other relevant factors, whether the asset has liquidity characteristics, including during times of stress, comparable to the other reserve assets allowed…[whether] permitted payment stablecoin issuers will be operationally capable of monetizing the asset to meet redemption request.\"</p><p>The proposal requires stablecoin issuers to manage liquidity carefully and be able to redeem stablecoins quickly, even during stressful market conditions. The OCC considered adding extra capital rules for risky reserve assets or counterparties but decided that holding diversified, liquid reserves and monitoring them regularly is enough to protect users without imposing additional costs for issuers.</p><p>Issuers would be required to maintain common equity tier 1 capital and additional tier 1 capital, sufficient to cover operational risks and ensure ongoing operations. Capital levels would be assessed both at the outset of the charter and with additional ongoing evaluations. </p><p>\"These two elements are generally consistent with the capital elements for national banks and</p><p>Federal savings associations under [OCC regulations],\" the proposal states. \"These elements consist of common equity, retained earnings and noncumulative perpetual preferred stock that meet certain terms designed to ensure significant loss-absorbing capabilities.\"</p><p>As part of the proposal, the OCC is also proposing a designated pool of highly liquid assets separate from both capital and reserves to act as an operational backstop for firms. The backstop aims to allow issuers to maintain operations during disruptions, such as system outages, cyberattacks or unexpected operational losses. The amount would be calculated quarterly based on the firm's overall operating costs, which OCC says, \"are highly correlated with the permitted payment stablecoin issuer's ability to maintain the operations of its payment stablecoin and stabilize from a business disruption.\"</p><p>\"This amount would need to be held in U.S. currency directly or at a Federal Reserve Bank, as demand deposits at a U.S. insured depository institution, with those deposits fully insured by the FDIC, or in U.S. Treasuries that meet the requirements to qualify as reserve assets, which could be readily liquidated,\" The proposal notes. The OCC would also impose penalties for issuers which fail to meet their capital and backstop requirements. </p><p>\"If a permitted payment stablecoin issuer does not meet the minimum capital…[or] the operational backstop at the end of a quarter, it must make efforts [that] may include raising additional capital, reducing the size of the operations or risk profile…converting less-liquid assets into highly liquid assets,\" the proposal states. \"Until the capital and backstop requirements are satisfied, the stablecoin issuer would be restricted from issuing any new stablecoins, except as necessary to facilitate a transfer…from one distributed ledger to another …[if noncompliant] for two consecutive quarters, it must begin liquidating reserve assets and redeeming outstanding stablecoins at the start of the following month and can no longer issue any new payment stablecoins going forward.\"</p><p>Boards and management of issuers must maintain risk management frameworks that address operational, market and legal risks. Issuers must submit quarterly reports detailing financial statements, reserve holdings, operational backstop amounts among other compliance metrics, the OCC said. </p></div>",
            "link": "https://www.americanbanker.com/news/occ-proposes-comprehensive-stablecoin-framework",
            "pub_date": "2026-02-27 04:06:24",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oregon community bank ceases mortgage operations",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><p>Oregon's Willamette Valley Bank announced it is exiting mortgage lending, pointing to challenges facing small institutions and macroeconomic concerns behind its decision. </p><p>The community bank, based in Salem, Oregon, will formally end residential lending operations on March 31. Along with four full-service branches across the state, Willamette Valley also runs five designated home loan centers located in both Oregon and neighboring Idaho.  </p><p>\"The residential mortgage industry has undergone significant changes in recent years, including the <ps-link><a class=\"Link\" href=\"https://www.nationalmortgagenews.com/news/exclusive-research-community-banks-face-nonbank-pressures\" target=\"_blank\"><u>growth of online and nonbank</u></a></ps-link> lenders and a prolonged period of higher interest rates,\" Willamette Valley Bank President and CEO Ryan Dempster said in a press release.</p><p>\"These conditions have made it increasingly difficult for community financial institutions to compete sustainably in this segment,\" Dempster said. </p><p>Between 2015 and 2024, the share of originations by community banks decreased from 21.8% to 12.4%, </p><p>In 2024, Willamette Valley originated $273.6 million worth of residential loans comprising 742 transactions, according to Iemergent's analysis of Home Mortgage Disclosure Act data.  Volumes came in at well under half their levels as recently as two years earlier, when the bank originated $785.7 million in volume for 2,177 units. </p><p>Other retail and commercial banking activities will proceed at the bank, which reported $3.2 million in net income for full year 2025. <br/></p><h2 class=\"cms-heading-h2 HeadingH2\">Mortgage trends among banks</h2><p>Willamette Valley's mortgage exit is the latest by a depository institution in recent months, with other midsized and community banks similarly exiting and citing the challenges of turning profits in home lending in today's economic environment. </p><p>An initial spike in mortgage rates, which more than doubled within months from near-3% levels in early 2022, contributed to decisions of some to <ps-link><a class=\"Link\" href=\"https://www.nationalmortgagenews.com/news/peoples-bank-of-commerce-in-oregon-to-exit-mortgage-lending\" target=\"_blank\"><u>leave the segment in the following year</u></a></ps-link>. Stubbornly sticky rates in the ensuing years sustained the trend, as both depository institutions and nonbanks <ps-link><a class=\"Link\" href=\"https://www.nationalmortgagenews.com/news/mba-says-productivity-origination-pull-through-is-falling\" target=\"_blank\"><u>struggled to profit</u></a></ps-link>, with the 30-year average only falling back below 6% this month for the first time since 2022.  </p><p>At the same time, <ps-link><a class=\"Link\" href=\"https://www.nationalmortgagenews.com/news/mortgage-trade-groups-back-call-for-updates-to-basel-iii\" target=\"_blank\"><u>regulatory capital restrictions on depository banks</u></a></ps-link>, which some have criticized as onerous, also diminished any appetite to plan for mortgage growth. </p><p>Still, while the industry has seen a number of departures in the past year, not all banks are choosing to pull back from mortgages entirely, taking different approaches, including expansion to keep their brands in the space. </p><p>Here are a few of the recent developments:</p><ul class=\"rte2-style-ul\" style=\"margin-top:0;margin-bottom:0;padding-inline-start:48px;\"><li>Willamette Valley joins a list of financial institutions that includes Wafd, <ps-link><a class=\"Link\" href=\"https://www.nationalmortgagenews.com/news/popular-bank-exits-mortgage-lending\" target=\"_blank\"><u>Popular Bank and</u></a></ps-link> Ally Financial to leave residential lending since early 2025.</li><li>Others are turning to nonbanks as outsource mortgage partners in order to continue providing home lending options to banking customers. <ps-link><a class=\"Link\" href=\"https://www.nationalmortgagenews.com/news/embrace-invests-in-mid-atlantic-growth-with-oceanfirst-deal\" target=\"_blank\"><u>Both Oceanfirst Bank</u></a></ps-link> and Amalgamated Bank signed such cooperation agreements with Embrace Home Loans to direct potential mortgage customers its way.  </li><li>In February, Firstrust Bank announced an operations partnership with direct lender Mortgagecountry. Unlike the Embrace agreements, Firstrust will still continue to originate and close loans under its own name, with the <ps-link><a class=\"Link\" href=\"https://www.nationalmortgagenews.com/news/bank-turns-to-nonbank-to-run-mortgage-production\" target=\"_blank\"><u>nonbank responsible for all mortgage production</u></a></ps-link>, technology services and strategic guidance of the business.</li><li>At the same time, other community financial institutions have found opportunities to grow their lending businesses, with First Federal Bank and <ps-link><a class=\"Link\" href=\"https://www.nationalmortgagenews.com/news/maryland-community-bank-bucks-trend-pins-hopes-on-mortgages\" target=\"_blank\"><u>the Bank of Glen Burnie</u></a></ps-link> both making mortgage acquisitions since summer 2025. <br/></li></ul><p>Recent regulatory developments, if approved, may open a window for increased mortgage lending from banks in the coming months. Federal Reserve Gov. Michelle Bowman recently indicated she <ps-link><a class=\"Link\" href=\"https://www.nationalmortgagenews.com/news/feds-bowman-wants-to-boost-banks-share-of-mortgage-market\" target=\"_blank\"><u>wished to see the return of banks</u></a></ps-link> into home lending, with a publication of a proposed update to ease capital-risk requirements expected at the end of the current quarter. </p></div>",
            "link": "https://www.americanbanker.com/news/oregon-community-bank-ceases-mortgage-operations",
            "pub_date": "2026-02-27 03:55:46",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Comptroller Gould minimizes leading bank concerns in hearing",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><ul><li><b>Key insight:</b> Comptroller of the Currency Jonathan Gould said the burden of banks collecting citizenship information would be \"minor,\" likening it to existing I-9 employment eligibility requirements. </li><li><b>What's at stake:</b> On debanking, Gould said the OCC is reviewing the largest national banks and investigating complaints. The OCC and other regulators have proposed eliminating \"reputation risk\" as a supervisory tool, which he said has been used to cut off politically disfavored customers.</li><li><b>Forward look:</b> Federal Reserve Vice Chair for Supervision Michelle Bowman said regulatory proposals are coming soon to encourage community and commercial banks to re-enter the mortgage market, while Federal Deposit Insurance Corp. Chair Travis Hill offered a cautious assessment that deposit insurance reform may only have only a minor impact on bank assessment fees.</li></ul><p>WASHINGTON — Comptroller of the Currency Jonathan Gould dismissed concerns about the cost for banks associated with collecting citizenship information at a hearing in front of the Senate Banking Committee on Thursday. </p><p>Gould appeared alongside other prudential regulators — Federal Reserve Vice Chair for Supervision Michelle Bowman, Federal Deposit Insurance Corp. Chair Travis Hill and National Credit Union Administration Chair Kyle Hauptman — in nearly three hours of testimony in the Senate Banking Committee Thursday morning, the first prudential regulator hearing in the upper chamber since 2024.  </p><p>While most of the Trump-era bank regulation has centered on a <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/bowmans-reform-agenda-targets-ratings-supervision-capital\" target=\"_blank\"><u>pullback of oversight</u></a></ps-link> for small and large institutions alike, banks have expressed concern about emerging threats to the traditional banking system, including potential enforcement actions in response to <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/gould-says-debanking-crackdown-will-target-large-banks\" target=\"_blank\"><u>debanking</u></a></ps-link> actions, the potential growth of crypto and stablecoin usage, headline risk from volatile <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/supreme-court-strikes-down-trumps-liberation-day-tariffs\" target=\"_blank\"><u>tariff policies</u></a></ps-link> and a reported <ps-link><a class=\"Link\" href=\"https://www.wsj.com/politics/policy/trump-administration-considers-action-requiring-banks-to-collect-citizenship-info-8e26f6d2?gaa_at=eafs&amp;gaa_n=AWEtsqfB1uklfujBpN81NZqheNtZVC7UFvAgeaF-OsC-KLZJUy-dm8DLcwiyYLfVrFY%3D&amp;gaa_ts=699e7382&amp;gaa_sig=SweQ0DatavWj8IfSKx6CRsfPpUXqRuvl1UeOzLE9ml3B8OlH8nAsET4Vf4GPe3SgAUEsAbgY6YC8IinoYDkjFQ%3D%3D\" target=\"_blank\"><u>citizenship information requirement</u></a></ps-link> for new bank customers. </p><p>Gould spoke to several of those issues during the hearing. </p><p>In response to a direct question from Sen. Catherine Cortez Masto, D-Nev., about the potential costs associated with banks potentially being required to collect citizenship information, Gould said that the impact would be \"minor.\" The Wall Street Journal reported earlier this week that the White House is considering an executive order that would require banks to obtain citizenship documentation as part of banks' Know Your Customer requirements.</p><p>\"I think the additional burden would be minor,\" he said. </p><p>Gould said that, for people who do not have easy access to their birth certificates or who don't have a passport, there are alternative forms of paperwork, although he didn't specify what those alternative options would be. He said that employers already collect so-called I-9 employment eligibility data, which requires similar documentation. </p><p>\"Just like with an I-9, I think there are alternatives available,\" Gould said. \"Banks have demonstrated an ability to find ways to know their customer under the existing framework.\"</p><p>He also tried to avoid discussing the national trust charter application of World Liberty Financial, a crypto firm owned partly by President Donald Trump and his family. Banks have<ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/banks-urge-scrutiny-of-fintech-trust-charter-applications\" target=\"_blank\"><u> publicly pushed back</u></a></ps-link> on the wave of fintech and <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/bank-trade-group-opposes-coinbase-charter-application\" target=\"_blank\"><u>crypto</u></a></ps-link> firm applications for national trust charters, but have been silent on World Liberty Financial. </p><p>\"I'm not going to discuss the specifics of any application,\" Gould said.</p><p>In response to a question posed by Sen. Bernie Moreno, R-Ohio, on whether a loose regulation of stablecoin issuers or third parties offering yield-like rewards to stablecoin holders could sap core deposits from traditional banks, Gould offered the most candid analysis. </p><p>\"I can, I think, say with some certainty, that any significant deposit flight or material deposit flight would not go unnoticed — certainly by me, by you and other elected officials on this committee,\" Gould said. \"And if there were to be significant deposit flight, I believe that I and other federal bank agency regulators would take steps, since that would raise safety and soundness concerns.\"</p><p>Gould also outlined the concerns he has about banks dropping customers for political reasons, a phenomenon known as \"debanking,\" which has <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/bank-group-agrees-with-trump-diagnosis-of-debanking\" target=\"_blank\"><u>been a priority</u></a></ps-link> of President Trump, who signed an <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/trump-signs-debanking-executive-order\" target=\"_blank\"><u>executive order</u></a></ps-link> last August directing regulators to identify instances of unlawful political or religious bias motivating such actions.</p><p>\"No American should be denied access to banking products and services because of political or religious beliefs or lawful business activity,\" Gould said in his prepared remarks. \"We are implementing President Trump's Executive Order on Guaranteeing Fair Banking for All Americans by, among other things, reviewing the activities of the largest national banks and investigating complaints of alleged debanking.\"</p><p>Gould's comments came in contrast to his fellow regulators on the panel, who largely navigated around questions posed to them with familiar talking points. Bowman continued to tout tailoring efforts for community banks — a longtime priority of hers — and her <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/feds-bowman-wants-to-boost-banks-share-of-mortgage-market\" target=\"_blank\"><u>recent push</u></a></ps-link> to align the joint forthcoming Basel III endgame proposal with the goal of having banks reengage in mortgage lending. </p><p>Bowman said that regulatory proposals will be introduced in the near-term as a means to reengage both community banks and commercial banks in the mortgage space. She also said that other agencies also have a role to play in making banks bigger players in the home mortgage market.</p><p>\"We're very focused, as we were thinking about the Basel approach in ways that we could right-size and recalibrate the approach for residential mortgage lending, so that we could encourage the banks to get back into the mortgage business,\" Bowman said. \"[Consumer Financial Protection Bureau] regulations … put onerous requirements and large fines on banks for making mistakes in mortgage applications and things like that. So I think it's important that we think about this in a more broad manner and holistically.\"</p><p>When asked by Sen. Angela Alsobrooks, D-Md., about his view of the impact on raising deposit insurance for business accounts on banks deposit insurance assessments, Hill gave a cautious answer, saying the impact would likely fall on larger banks, but the details would determine the outcome. </p><p>\"I said last time it is possible that it would not result in increases,\" Hill said, adding that if such a reform did have an impact, it would likely be small and fall on large banks, \"just based on the way that the current assessment formulas work.\" </p><p>He also said that regulators would \"need to think about the potential impact on the reserve ratio.\"</p><p>\"If you increase the amount of insured deposits in the system based on the way that the reserve ratio was currently defined, that would result in a decrease in the reserve ratio,\" he said.</p></div>",
            "link": "https://www.americanbanker.com/news/comptroller-gould-minimizes-leading-bank-concerns-in-hearing",
            "pub_date": "2026-02-27 03:35:51",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Banks face risks, opportunities from card surcharges",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><p><ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/payments/news/why-surcharging-remains-controversial-even-when-most-states-allow-it\" target=\"_blank\"><u>Surcharging</u></a></ps-link>, where merchants tack on a fee, often 3%, for credit card use, is on the rise. This poses potential revenue challenges for banks' credit card business as well as opportunities for financial institutions with merchant processing arms.</p><p>Slightly more than a third of small businesses (35%) add a surcharge for customers paying by credit card. That's according to a recent JD Power <ps-link><a class=\"Link\" href=\"https://www.jdpower.com/business/press-releases/2026-us-merchant-services-satisfaction-study\" target=\"_blank\"><u>report </u></a></ps-link>on merchant services satisfaction. Businesses do this to offset fees charged by card networks such as Visa and Mastercard. The trend, which has been <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/payments/news/banks-face-new-threats-from-credit-card-surcharging\" target=\"_blank\"><u>accelerating in recent years</u></a></ps-link>, can cause problems for merchants, with 32% saying their retail customers occasionally or frequently cancel a purchase when a surcharge is added.</p><p>The practice of surcharging also raises concerns for issuing banks' credit card revenue, as JD Power's U.S. credit card satisfaction <ps-link><a class=\"Link\" href=\"https://www.jdpower.com/business/press-releases/2025-us-credit-card-satisfaction-study\" target=\"_blank\"><u>report</u></a></ps-link> published last August illustrates. The report found that 65% of cardholders have been charged higher prices for goods and services for using their credit cards. Among cardholders who experienced a surcharge, 81% said they used a different payment method at some point to avoid the extra fee.  </p><p>\"There's an increasing trend here. Now, a majority of cardholders are saying they have used an alternate payment method,\" John Cabell, managing director of payments intelligence at JD Power, told American Banker. </p><p>Here's what banks need to know about the latest trends related to surcharging:<br/></p><h2 class=\"cms-heading-h2 HeadingH2\">Alternative payment methods gain ground</h2><p>While consumers don't like surcharging, credit cards remain a popular payment option. Notably, credit card use was higher in 2024 as a percentage than in 2023 — 35% compared with 32%, according to a Federal Reserve <ps-link><a class=\"Link\" href=\"https://www.frbservices.org/binaries/content/assets/crsocms/news/research/2025-diary-of-consumer-payment-choice.pdf\" target=\"_blank\"><u>report</u></a></ps-link> released in May. Debit use held steady at 30%.</p><p>Even so, many consumers are willing to use another payment method to avoid a surcharge. Case studies from payments technology company Stax Payments show 22% of transactions migrate to lower-cost debit or ACH rails once a credit surcharge is introduced, according to Adam Gray, the company's chief transformation officer.</p><p>Banks make less on ACH transactions than they do on credit cards. Debit cards also yield significantly less in interchange fees than credit cards. \"A bank can make seven to eight times on credit versus debit,\" Eric Cohen, chief executive of Merchant Advocate, an advisor to merchants on processing-related issues, told American Banker.</p><p>Over time, and if the economy tightens, more consumers may shift to debit to avoid surcharges. A sizable shift to debit would be meaningful to a bank, Cohen said. Say a bank does a million transactions a month and receives $1.50 less revenue on each. That's $18 million a year in lost revenue, Cohen said. \"Even a 10% shift would be a large shift if they're doing tens of millions of transactions,\" he added.</p><p>Banks with $10 billion in assets have even more reason to be concerned because they have the strictest requirements for debit interchange rates. It could be more of an issue if the Federal Reserve's attempts to lower debit card interchange fees take effect. It's currently in regulatory and legal limbo, and several industry associations have <ps-link><a class=\"Link\" href=\"https://bpi.com/joint-trades-urge-federal-reserve-to-withdraw-2023-regulation-ii-proposal/\" target=\"_blank\"><u>asked </u></a></ps-link>the Fed to withdraw its proposed amendments. </p><p>As surcharging becomes more prevalent, consumers could shift toward other up-and-coming payment options. Buy-now-pay-later offered by non-banks, for instance, is becoming a more viable alternative to credit cards. BNPL is accepted by 58% of U.S. small businesses, up from 54% in 2024, making it the fourth-most-accepted form of payment behind debit or credit cards, digital wallets and cash, according to JD Power.</p><p>Some consumers are also paying with cryptocurrency, though it's still \"a very small on-the-margin-type of payment,\" JD Power's Cabell said. Cryptocurrency adoption among U.S. small businesses stood at 19% this year, up 4 percentage points from 2025. Directionally, however, more merchants are showing interest. According to JD Power, 37% of merchants expressed a favorable view of cryptocurrency, and 33% of non-accepting merchants said they'd be likely to accept crypto payments if offered by their merchant services provider.<br/></p><h2 class=\"cms-heading-h2 HeadingH2\">Opportunities for banks to boost credit card processing</h2><p>Banks that sell credit card processing services have a vested interest in encouraging merchants to surcharge because they make more money on credit card processing by allowing surcharging, Cohen of Merchant Advocate told American Banker. </p><p>For these banks, encouraging surcharging is a smart business move, according to Gray of Stax Payments. This is especially true in historically cash-heavy verticals, such as professional and field services, where removing \"the margin-eroding barrier of interchange\" through surcharging allows banks to capture entirely new revenue streams that were previously locked in paper checks, Gray noted. <br/></p><h2 class=\"cms-heading-h2 HeadingH2\">More regulation could be coming</h2><p>Most states allow surcharging, though in recent years, several, including New York, Illinois, Colorado, Georgia, Texas, and California, have implemented rules or restrictions on it, such as caps on surcharge rates or customer disclosure requirements. It takes time for regulation to catch up to merchant practices, so more states could seek to regulate it, Cohen of Merchant Advocate told American Banker. </p><p>The question is: will these stricter surcharging rules and others that may come down the pike be enforced? Today, for example, many merchants impose surcharges on debit cards, which is illegal; however, they get away with it, partly because enforcement is lax and customers don't know better, Cohen said. \"Regulation means nothing if it's not being policed.\"</p></div>",
            "link": "https://www.americanbanker.com/payments/news/banks-face-risks-opportunities-from-card-surcharges",
            "pub_date": "2026-02-27 01:16:27",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Market Intelligence Community banks should grab the opportunities created by stablecoins",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><p></p><ul class=\"rte2-style-ul\" data-pm-slice=\"3 1 []\"><li><b>Key insight: </b>Stablecoins present opportunities for community banks to explore new forms of capital formation while strengthening their own exposure to risk.</li><li><b>Supporting data: </b>The share of small-business lending handled by community banks has dropped from almost 60% at the turn of the century to just over 40%.</li><li><p><b>What's at stake: </b>It's important that community banks stay relevant, given their role in servicing the small businesses that<u> </u>account for 40% of U.S. GDP, 39% of private employment, 97% of<u> </u>U.S. importers and 33% of import value.</p></li></ul><p>One of the main<ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/banks-consumer-groups-push-back-against-stablecoin-yield\" target=\"_blank\"><u> arguments from the banking lobby</u></a></ps-link> against stablecoins is the potential threat to banks. We're told again and again that, if allowed to earn yield or rewards, stablecoins will siphon off deposits from banks and depress lending into the community.</p><p></p><p>While the logic may seem simple, banking isn't, and the conclusion rests on erroneous assumptions about how funds flow into and around the U.S. economy. But here I'm not going to dwell on how recent history has shown that most deposits are not sensitive to interest rates (existing yield-bearing alternatives have not made much of a dent), nor on how aggregate deposits wouldn't change and could even increase should stablecoins end up attracting significant inflows. Rather, I want to focus on the opportunity stablecoins present for community banks.</p><p></p><p>That's not to say strong inflows into stablecoins pose no threats at all. They wouldn't reduce overall deposit levels, but they would lead to a reallocation toward large banks as the sellers of Treasuries and other reserve assets tend to use national institutions.</p><p></p><p>This does not need to imply that community banks lose relevance, however. Indeed, it's important that they don't, given their role in servicing the small businesses that<ps-link><a class=\"Link\" href=\"https://advocacy.sba.gov/2024/07/23/frequently-asked-questions-about-small-business-2024/\" target=\"_blank\"><u> account for</u></a></ps-link> 40% of U.S. GDP, 39% of private employment, 97% of<ps-link><a class=\"Link\" href=\"https://www.census.gov/foreign-trade/Press-Release/edb/edbrel2023.pdf\" target=\"_blank\"><u> U.S. importers</u></a></ps-link> and 33% of import value.</p><p></p><p>Yet to maintain their relevance, community banks need to rethink their approach to their core business, whatever happens with stablecoin regulation, as competition from other corners of finance has been building<i>. </i>With<ps-link><a class=\"Link\" href=\"https://www.clevelandfed.org/collections/research-in-brief/2020/rib-20200709-fintech-lending\" target=\"_blank\"><u> fintechs offering</u></a></ps-link> more efficient and cheaper loan solutions and<ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/opinion/chase-and-other-megabanks-arent-and-never-will-be-community-banks\" target=\"_blank\"><u> large banks</u></a></ps-link> looking to<ps-link><a class=\"Link\" href=\"https://media.chase.com/news/chase-to-open-more-than-160-branches-in-over-30-states-in-2026\" target=\"_blank\"><u> gain market share</u></a></ps-link> in<ps-link><a class=\"Link\" href=\"https://newsroom.bankofamerica.com/content/newsroom/press-releases/2025/05/bofa-to-open-150-financial-centers-by-2027--investing-over--5-bi.html\" target=\"_blank\"><u> growing areas</u></a></ps-link>, the share of small-business lending handled by community banks has dropped from<ps-link><a class=\"Link\" href=\"https://www.hks.harvard.edu/sites/default/files/centers/mrcbg/files/Final_State_and_Fate_Lux_Greene.pdf\" target=\"_blank\"><u> almost 60%</u></a></ps-link> at the turn of the century to<ps-link><a class=\"Link\" href=\"https://www.fdic.gov/system/files/2024-09/small-business-lending-survey-2024-full.pdf\" target=\"_blank\"><u> just over 40%</u></a></ps-link>.</p><p></p><p>Stablecoins, rather than a threat, are an ally in this necessary evolution. Rather than fighting the technology's flexibility and appeal, community banks could harness it to deepen their competitive moat: specifically, their relationship to the savers and small businesses in their communities.</p><p></p><p>First, community banks can offer stablecoin custody, combining wallets conveniently embedded in banking apps with the lure of rewards for balances or activity, funded by distribution fees paid by the stablecoin issuers out of the interest they earn on the backing reserves. With stablecoins held in-app, community banks can earn payment fees while offering local importers and exporters a better experience with cross-border transactions. And as more merchants onboard direct stablecoin acceptance via existing banking relationships, some fees could be competed away from the large card issuers.  </p><p></p><p>Second, looking ahead, stablecoins can support a new type of funding: token issuance. True, fiat dollars can settle any type of asset transaction, regardless of the underlying rails; but stablecoins enable banks and businesses to plug into blockchain connectivity, powering faster settlement and more complex automation while harnessing enhanced transparency to meet compliance requirements.</p><p></p><p>Tokenization is still young and heavily weighted toward on-chain representations of existing assets such as equities, bonds and real estate. But we are seeing signs of progress in native blockchain issuance, such as<ps-link><a class=\"Link\" href=\"https://www.globenewswire.com/news-release/2026/02/18/3240027/0/en/Figure-Technology-Solutions-Announces-Pricing-and-Upsizing-of-Offering-of-Class-A-Common-Stock-and-Blockchain-Native-Common-Stock.html\" target=\"_blank\"><u> the upsized offering</u></a></ps-link> from Figure Technology Solutions that closed last week. As the Securities and Exchange Commission progresses in its commitment to reassess securities rules around disclosure and filing requirements for tokenized assets, friction will be smoothed as on-chain platforms open up a more flexible and efficient form of capital formation. Community banks can play a key role here.</p><p></p><p>After all, their competitive moat has long been based on a familiarity with local businesses. This moat is being eroded by cheaper services, but can be recovered via a new type of funding relationship, one that could also open up new business lines for banks and their customers. For instance, tokenized cross-border invoices swapped for stablecoins that can then be used to efficiently settle the trade, with smart contracts handling the timing and execution; data center financing via yield-bearing tokens that can be used as collateral for a separate loan; tradeable membership tokens issued by a local event venue that trigger discounts and grant privileged access; on-chain equity interests in local restaurants, bowling alleys and hardware stores that accrue loyalty points for activity.</p><p>By helping customers to test token issuance with the support of a trusted name, small banks could tiptoe into the investment banking activity typically concentrated in the large banks. And in the process, they could reduce their exposure to<ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/opinion/deposit-insurance-reform-is-a-critical-opportunity-for-main-street\" target=\"_blank\"><u> relatively risky</u></a></ps-link> small-business lending while deepening their footprint in capital formation.</p><p></p><p>In sum, once new rules are developed to lower the barriers of uncertainty and cost of tokenization, community banks will be able to broaden their offering for businesses looking to raise capital, more effectively competing against fintechs and large banks while reinforcing their resilience.</p><p></p><p>As for the considerable development costs, we've seen<ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/opinion/white-label-stablecoins-are-the-next-evolution-of-money\" target=\"_blank\"><u> white label stablecoin services</u></a></ps-link> emerge to lower issuance barriers; we're likely to see the same trend in tokenization platforms. This suggests a much more fragmented mosaic of marketplaces than the current, centralized system — but for local and niche businesses, that fragmentation could represent a friendlier, more scalable opportunity, as blockchain connectivity leaves the door open for expansion.</p><p></p><p>A key connector of a distributed on-chain landscape? Stablecoins.</p><p></p><p>Community banks know their communities. They also know that their communities' priorities are changing, that global finance is undergoing a transformation, and that demographics are impacting expectations: As younger clients create or take over businesses, digital adaptation increasingly becomes an essential pillar of growth.</p><p></p><p>In developing and offering stablecoin and tokenization services, community banks can strengthen their exposure to risk as well as their core relationship with customers, while future-proofing digital services for a younger generation of businesses.</p><p></p><p>What's more, rather than clinging to the futile hope that the current structure of banking will hold, they would be wading into the bracing efficiency of competition, a defining feature of American business and one that decides who sits at the table around which the format of tomorrow's financial system is decided.</p></div>",
            "link": "https://www.americanbanker.com/payments/news/stablecoins-offer-multiple-opportunities-to-support-community-banks",
            "pub_date": "2026-02-26 20:35:28",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "How Santander plans to avoid U.S 'graveyard' for European banks",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><ul><li><b>Key insight: </b>Banco Santander's pending acquisition of the Northeast regional bank Webster Financial is one leg of the Spanish bank's plan to boost U.S. profitability, executives said Wednesday.<br/></li><li><b>What's at stake: </b>Santander laid out new financial targets, including a U.S. return on tangible equity goal of 18% by 2028.<br/></li><li><b>Forward look: </b>The proposed acquisition of Webster is expected to close during the second half of this year.</li></ul><p>Executives at Spain's <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/organization/santander\">Banco Santander</a></ps-link><span class=\"QModMiniQuotesRichText\"> <span class=\"QModMiniQuotesRichText-tool\"> <span class=\"qtool\" data-qmod-params='{\"lang\":\"en\", \"symbol\": \"SAN\"}' data-qmod-tool=\"miniquotes\"></span> </span> </span> are confident in their ability to improve profitability in the United States, saying that the pending acquisition of a Northeast regional bank will boost returns, even as other European banks have retreated from the U.S.'s competitive retail market.</p><p>At an investor day Wednesday in London, the banking giant laid out its new financial targets, including a goal to improve its return on tangible equity in the U.S. to 18% by 2028, up from 10% last year. </p><p>Part of the strategy involves the successful acquisition and integration of Webster Financial in Stamford, Connecticut, <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/organization/santander\">Santander</a></ps-link> executives said. The <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/deal-gives-santander-final-step-change-needed-for-u-s-growth\" target=\"_blank\"><u>pending $12.3 billion deal</u></a></ps-link>, announced earlier this month, marks the first time in years that a European-based bank has agreed to buy a U.S. bank.</p><p>It is also <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/banco-santander-inks-12-3b-deal-to-buy-webster-financial\" target=\"_blank\"><u>the largest bank M&amp;A deal announced so far in 2026</u></a></ps-link>, and it is one of the largest deals in the past five years. The combined entity is expected to have approximately $327 billion of assets. </p><p>One analyst at Wednesday's meeting expressed skepticism about <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/organization/santander\">Santander's</a></ps-link> plan, saying the integration of U.S. assets into European banks \"has been a graveyard over the last 25 years.\" <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/organization/santander\">Santander</a></ps-link> is one of the only European banks that's still operating a U.S. retail business.</p><p>Ana Botín, <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/organization/santander\">Santander's</a></ps-link> executive chair, countered by saying that Webster is \"a fantastic bank\" with \"best-in-class profitability.\"</p><p>\"This time it's different, and we are going to deliver the goods,\" Botín said.</p><p>She also pointed out that Webster has prior experience in managing successful integrations. In 2022, the $84 billion-asset Webster <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/webster-turns-to-big-bank-m-a-to-address-growth-challenges\" target=\"_blank\"><u>completed a merger of equals</u></a></ps-link> with Sterling Bancorp in New York, a transaction that was designed to build scale in a slower-growth part of the country.</p><p>Christiana Riley, <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/how-santander-plans-to-grow-in-the-u-s\" target=\"_blank\"><u>Santander's U.S. country head for the past year</u></a></ps-link>, said Wednesday that the bank is \"building on significant momentum in the U.S. business already,\" and that it has more than one lever to pull to increase profitability, including a ramp-up in fees from corporate and investment banking. </p><p>Fees in that segment have increased 30% in the past two years, Riley told analysts at the meeting. The bank is also combining its auto-lending platform with its deposit-taking platform, a move that should help increase profitability by reducing redundancies, she added.</p><p>At least one analyst expects the acquisition, which still needs approval from U.S. and European regulators as well as shareholders of both banks, to be successful overall. <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/organization/santander\">Santander</a></ps-link> is already familiar with the U.S. banking market, and its size and scale mean that it has the necessary technology to support a solid integration, said María Parra, an analyst at Morningstar DBRS.</p><p>\"They are completely changing the game in the U.S. to position them to be one of the best retail and commercial banks in terms of profitability and market share,\" Parra told American Banker.</p><p>The deal has been expected to close during the second half of this year. On Wednesday, Botín narrowed the window by saying the bank is estimating a closing date during the third quarter.</p><p><ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/organization/santander\">Santander</a></ps-link>, which entered the U.S. in 2005 by buying a partial stake in Sovereign Bank in Philadelphia, has been trying to boost its stateside profitability for the past several years. It has been known in the U.S. as a consumer-finance lender, as evidenced by its sizable auto-lending portfolio, which historically has been funded by higher-cost, less-sticky wholesale deposits.</p><p>In October 2024, <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/organization/santander\">Santander</a></ps-link> launched a nationwide digital bank in the U.S. to collect low-cost deposits. A year later, the platform known as Openbank had attracted more than $6 billion of customer funds. </p><p>But <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/organization/santander\">Santander</a></ps-link> has struggled in recent years with profitability in the U.S. In 2023, its return on tangible equity adjusted for certain capital costs was 6%, it said Wednesday. For all of 2025, the same metric was 10%.</p><p>The proposed acquisition of Webster offers a major step-up in the quality and diversity of <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/organization/santander\">Santander's</a></ps-link> U.S. deposits. Webster has 195 branches, mostly in Connecticut but also in Massachusetts, New York and Rhode Island, and an array of deposit sources, including a consumer bank, a commercial bank, health-savings accounts and deposits affiliated with medical insurance claim settlements. </p><p>The deal should result in $800 million in cost savings, <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/organization/santander\">Santander</a></ps-link> executives reiterated Wednesday. About one-third of the total is expected to come from technology and operations, another one-third from office consolidations, and the remaining one-third from retail and commercial overlap, Riley said.</p><p>The $800 million includes cost reductions at both banks, Riley said. <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/organization/santander\">Santander</a></ps-link>, which bills itself as \"a digital bank with branches,\" has not mentioned any specific post-acquisition branch closures.</p><p>One of the deal's main risks is being able to realize the $800 million in cost savings, Parra said.</p><p>\"But I think they are pretty committed to this,\" Parra said. \"They're not expecting to do any big M&amp;A in the next few years, so as long as they remain focused … I think they will deliver here.\"</p><p>John Ciulla, Webster's chairman and CEO, appeared virtually Wednesday to talk about the pending acquisition. Ciulla is set to become CEO of <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/organization/santander\">Santander Bank</a></ps-link> N.A., while Luis Massiani, Webster's president and chief operating officer, will serve as COO of <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/organization/santander\">Santander</a></ps-link> Holdings USA and <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/organization/santander\">Santander Bank</a></ps-link> N.A. Massiani is also on deck to lead the integration efforts.</p><p>\"We are confident in our ability to deliver the promised financial metrics of the combined company,\" Ciulla told the audience. \"We're really excited about the scale and the technology that <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/organization/santander\">Santander</a></ps-link> brings to the combined [entity], and we think there are really opportunities to do things not only more efficiently, but more effectively to deliver products and services to our clients.\"</p></div>",
            "link": "https://www.americanbanker.com/news/how-santander-plans-to-avoid-u-s-graveyard-for-european-banks",
            "pub_date": "2026-02-26 06:45:31",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "WisdomTree gets SEC approval for 24/7 trading",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><ul><li>Key insight: SEC and FINRA granted the necessary approvals for WisdomTree to launch 24/7 trading and settlement for its tokenized money market fund.</li><li>Expert quote: \"The fact that regulators are now willing to allow it shows how far the idea has come.\" — Javelin Strategy's James Wester</li><li>Forward look: Other investment firms and markets are moving towards tokenized 24/7 trading options.</li></ul><p>WisdomTree has launched 24/7 trading and settlement for its tokenized money market funds after being granted regulatory approval from multiple agencies. </p><p>The global exchange-traded fund broker and investment platform announced on Tuesday that its tokenized MMF, known as WisdomTree Treasury Money Market Digital Fund, now has 24/7 trading and instant settlement capabilities through Circle's USDC stablecoin.</p><p>The announcement came a day after the Securities and Exchange Commission <ps-link><a class=\"Link\" href=\"https://www.sec.gov/files/rules/ic/2026/ic-35968.pdf\" target=\"_blank\"><u>approved an exemptive relief</u></a></ps-link> to WisdomTree so the broker could execute same-day transaction settlements.</p><p>WisdomTree Securities, a broker-dealer subsidiary of WisdomTree, separately received approval from the Financial Industry Regulatory Authority to expand its broker-dealer activities to include principal trading of registered fund shares, according to the company. FINRA approval enables 24/7 liquidity for WisdomTree's tokenized MMF shares, with settlement facilitated by stablecoins.</p><p>\"As we see it, this is the first example of a fund trading and settling on a 'T instant' basis, which is an innovative step forward in terms of how securities and fund markets work,\" Will Peck, head of digital assets for WisdomTree, told American Banker. </p><p>\"T instant,\" or T+0, refers to a transaction with real-time or same-day settlement. The standard transaction date for stocks and most bonds in the U.S. is T+1, which means trades settle one business day after the initial transaction.</p><p><ps-link><a class=\"Link\" href=\"https://www.sec.gov/files/rules/ic/2026/ic-35968.pdf\" target=\"_blank\"><u>In the SEC filing</u></a></ps-link> granting the exemption on Monday, the agency stated that it \"is appropriate in the public interest and consistent with the protection of investors and the purposes fairly intended by the policy and provisions of the act,\" referring to the Investment Company Act of 1940, which regulates investment funds.</p><p>\"Participation by the covered funds in the proposed transactions is consistent with the provisions, policies and purposes of the act and is on a basis no less advantageous than that of other participants,\" the filing continued.</p><p>Tokenized MMFs are a form of tokenized real world assets (RWAs), where a unique digital representation of an asset is stored on a distributed ledger as a \"token.\"</p><p>\"The blockchain will enable this future state where we can have 24/7, always-on, immutable recordkeeping,\" BNY Chief Product and Innovation Officer <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/bny-sees-blockchain-as-future-of-finance-infrastructure\" target=\"_blank\"><u>Carolyn Weinberg said</u></a></ps-link> at American Banker's Most Powerful Women in Banking conference last October. BNY provides banking-as-a-service infrastructure to WisdomTree for its retail digital assets platform through a <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/bny-provides-baas-infrastructure-to-wisdomtree\" target=\"_blank\"><u>partnership announced last fall</u></a></ps-link>.</p><p>Like most retail MMFs, WisdomTree's tokenized MMF is designed to maintain a stable net asset value (NAV) of $1.00 per share and will trade at that price, according to the company.</p><p>Peck told American Banker that both the USDC stablecoin and WisdomTree's tokenized MMF are on the Ethereum ledger, which provides the digital infrastructure needed for real-time settlement.</p><p>\"Both of these [types of] assets are represented as tokens on Ethereum, though they're different structures,\" he said. \"One's a stablecoin, one's a fund interest, but with that unified record we're able to do faster and more convenient transactions than with traditional systems.\"</p><p>James Wester, research director for cryptocurrency for the financial services advisory firm Javelin Strategy and Research, told American Banker that the SEC's exemption for WisdomTree opens the door for future 24/7 trading opportunities.</p><p>\"Markets don't actually need to close; they just always have,\" Wester said. \"We're finally seeing the round-the-clock trading that crypto has demonstrated for more than a decade.\"</p><p>Wester noted that a regulated fund, such as WisdomTree's tokenized MMF, moving to continuous trading could change how investors approach accessing liquidity and moving into cash-like assets.</p><p>\"The fact that regulators are now willing to allow it shows how far the idea has come,\" he said.</p><p>Other firms and markets are moving towards tokenized 24/7 trading options as well. <ps-link><a class=\"Link\" href=\"https://finance.yahoo.com/news/blackrock-looks-tokenize-blockbuster-etfs-091233657.html\" target=\"_blank\"><u>BlackRock announced its plans</u></a></ps-link> for tokenized exchange-traded funds (ETFs) in September to facilitate 24/7 trading, and the New York Stock Exchange is <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/nyse-dtcc-developing-blockchain-based-securities-trading\" target=\"_blank\"><u>developing</u></a></ps-link> a 24/7 platform for tokenized stocks and ETFs.</p></div>",
            "link": "https://www.americanbanker.com/news/wisdomtree-gets-sec-approval-for-real-time-trading",
            "pub_date": "2026-02-26 06:26:17",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Stablecoins draw attention, but are still a tiny market",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><ul class=\"rte2-style-ul\"><li><b>Key insights</b>: Revolut, Tether and Circle made announcements this week designed to boost their stablecoin profiles. </li><li><b>What's at stake</b>: Stablecoins are growing quickly and are attracting investment, creating an arms race among banks and fintechs. </li><li><b>Forward look</b>: Despite the growth in stablecoins, McKinsey says stablecoin payments are still a small part of the overall payments market. </li></ul><p>One of the big stories in the payments industry over the past year has been stablecoins, which have gotten a <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/customers-ceo-says-bank-poised-to-benefit-from-genius-act\" target=\"_blank\"><u>regulatory boost </u></a></ps-link>and a series of fintechs <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/payments/news/payoneer-seeks-bank-charter-for-new-stablecoin\" target=\"_blank\"><u>seeking bank charters</u></a></ps-link> and <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/payments/list/big-banks-are-working-on-payment-stablecoins\" target=\"_blank\"><u>banks</u></a></ps-link> considering how to approach the market. </p><p>But the story appears to be outracing the reality. Even with fast growth the market is very small, according to <ps-link><a class=\"Link\" href=\"https://www.mckinsey.com/industries/financial-services/our-insights/stablecoins-in-payments-what-the-raw-transaction-numbers-miss\" target=\"_blank\"><u>McKinsey</u></a></ps-link>. </p><p>There are about $300 billion in stablecoins circulating, according to McKinsey, adding that's up from less than $30 billion in 2020. McKinsey also noted projections from U.S. Treasury Secretary Scott Bessent that the stablecoin supply could reach $3 trillion by 2030. And financial institutions peg the supply could reach as high as $4 trillion in the same time frame. </p><p>But that's not the payments market. McKinsey partnered with blockchain analytics firm Artemis Analytics to separate trading, internal fund movements, and automated activity from payments. After running those numbers through the strainer, McKinsey found that actual stablecoin payments totaled closer to $390 billion in 2025 — or about 0.02% of global payments volume.And even for use cases such as B2B payments and remittances, stablecoins are gains of sand on the beach.</p><p>For B2B payments, stablecoins totaled about $226 billion in 2026, or about 0.01% of the global B2B payment volume of about $1.6 quadrillion, McKinsey said. And for remittances, </p><p>there were $90 billion in stablecoin payments volumes, which is less than 1% of the more than $100 trillion in total volumes from this segment, McKinsey said. </p><p>There are benefits to stablecoins, McKinsey said, such as addressing inefficiencies in cross-border payments. They just aren't being used for that yet.</p><p>And banks are interested. Forty-seven percent of banks say their institution's clients were asking for general information about cryptocurrency, followed by 35% who said clients were asking for the ability to make payments using cryptocurrencies, according to <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/payments/news/exclusive-research-crypto-stablecoins-have-staying-power\" target=\"_blank\"><u>research from American Banker</u></a></ps-link>, adding 27% said that customers were asking for institutionally provided custody of digital assets.</p><p>Given the growth and anticipated demand, there's plenty of investment in stablecoins, with several announcements in just the past few days. </p><p></p><h2 class=\"cms-heading-h2 HeadingH2\">Tether invests in web market Whop</h2><p>In an effort to extend stablecoins deeper into what it calls \"real economic activity,\" stablecoin issuer Tether has made an investment in Whop, an internet marketplace.</p><p>The size of the investment was not disclosed. Tether hopes the resulting partnership will enable easier processing for customers who use USDT and USAT for international payments, avoiding what Tether says is a complicated exchange process.  Whop's platform supports more than 18.4 million users, with participants earning approximately $3 billion annually. </p><p>Tether's funding round will support expansion in Latin America, Europe and Asia-Pacific.\"Stablecoins and wallets become most powerful when they are embedded directly into people's lives, supporting their businesses, activities, families and individual stories,\" Paolo Ardoino, CEO of Tether, said in a release.</p><p>In an earlier <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/payments/news/tether-ceo-paolo-ardoino-discusses-stablecoin-strategy\" target=\"_blank\"><u>interview</u></a></ps-link>, Ardoino said Tether will focus on its strength in emerging markets to counter bank interest in stablecoins due to the passage of enabling legislation in the U.S.\"In a certain way Tether is lucky,\" Ardoino told American Banker in 2025. \"Everyone that is launching a stablecoin will go after a single user base … the institutional or wealthy user base, at least relative to the rest of the world.\"</p><p></p><h2 class=\"cms-heading-h2 HeadingH2\">Circle touts stablecoin growth</h2><p>The boost in attention that <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/stablecoins\" target=\"_blank\"><u>stablecoins</u></a></ps-link> have gotten over the past year appears to be paying off for Circle, as the USDC issuer reports there was $75.3 billion of the stablecoin in circulation at the end of 2025, up 72% from the prior year. C</p><p>ircle on Wednesday also reported a net loss from continuing operations in 2025 of $70 million, mostly due to  $424 million for stock-based compensation related to vesting conditions met by its IPO, the company said. This compares to net income from continuing operations in 2024 of $157 million.</p><p>\"The fourth quarter marked another step forward in Circle's mission to build the infrastructure for an open, programmable internet financial system,\" said Jeremy Allaire, co-founder and CEO of Circle, in a release. Circle has gotten a boost from initiatives such as the <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/payments/news/circle-builds-a-stablecoin-powered-network-for-real-time-pay\" target=\"_blank\"><u>Circle Payments Network</u></a></ps-link>, which has enrolled 55 financial institutions with 74 others going through eligibility reviews as of Feb. 20. \"USDC adoption continued to expand globally as more enterprises, developers and public institutions integrated digital dollars into real-world payments, treasury and onchain financial workflows,\" Allaire said.</p><p>Circle in the past year has also added scale through <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/payments/news/fis-collaborates-with-circle-to-boost-stablecoin-scale\" target=\"_blank\"><u>partnerships</u></a></ps-link> with firms such as Visa, Intuit, Polymarket and FIS. The \"timing of USDC commercialization remains uncertain, in our view, but we believe Circle is increasingly controlling its own destiny,\" William Blair said in a research note.</p><p></p><h2 class=\"cms-heading-h2 HeadingH2\">Revolut joins a U.K. stablecoin sandbox</h2><p>The Financial Conduct Authority has chosen London fintech Revolut to test stablecoin technology in a \"sandbox,\" which refers to a lab setting with less regulatory pressure than a real-world environment. </p><p>The FCA, which said it got 20 applications, also chose fintechs Monee Financial Technologies, ReStabilise and VVTX. These firms will study how stablecoins would perform given pending regulations and economic risk. The first use cases will be payments, wholesale settlement and crypto trading ahead of regulations that go into effect in September.</p><p>The U.K. has come under fire for its relatively slow pace in <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/payments/news/how-lagging-stablecoin-regulations-could-threaten-the-u-k-economy\" target=\"_blank\"><u>regulating stablecoins</u></a></ps-link>, which critics say places the country behind the European Union and the U.S., which have passed enabling regulations for stablecoins.  </p><p>\"We are supporting U.K. stablecoin issuers to ensure they can be trusted for payments, settlement and trading. It will benefit consumers and financial transactions and help to deliver the FCA's strategy and the Government's National Payments Vision,\" Matthew Long, director of payments and digital assets at the FCA, said in a release.</p><p></p><h2 class=\"cms-heading-h2 HeadingH2\">Visa boosts its profile in Argentina</h2><p>In global payments news this week from outside stablecoins, Visa has agreed to acquire Prisma and Newpay from private acuity firm Advent International. Both firms sell primarily to clients in Argentina. Prisma offers credit, debit and prepaid cards. </p><p>Newpay offers real-time payments, and manages the local Benelco ATM network and bill payment platform PagoMisCuentas. Visa plans to pair the two firms to accelerate deployment of tokenization, biometric authentication, advance risk management and agentic commerce. Terms were not disclosed, and Visa said the deal is expected to close in the second quarter. </p><p>\"This acquisition is an important step for Visa in Argentina, strengthening our client partnerships and advancing innovation across the payments ecosystem,\" said Ryan McInerney, CEO of Visa, in a <ps-link><a class=\"Link\" href=\"https://investor.visa.com/news/news-details/2026/Visa-to-Acquire-Prisma-Medios-de-Pago-and-Newpay-in-Argentina/default.aspx\" target=\"_blank\"><u>release</u></a></ps-link>. \"By bringing together Prisma's and Newpay's deep local expertise with Visa's global solutions and technology, we will empower our clients to make payments simpler, faster, and more secure for consumers and businesses.\"</p><p>Both <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/payments/news/visa-mastercard-enlist-fintechs-to-reach-latin-americas-unbanked\" target=\"_blank\"><u>Visa and Mastercard</u></a></ps-link> have invested in Latin America in recent years, relying mostly on local partnerships and acquisitions to build scale. </p><p></p><h2 class=\"cms-heading-h2 HeadingH2\">Worldline updates payments tech to fuel turnaround</h2><p>French payments processor Wordline has integrated several merchant products to support shopping and payment experiences that cross channels such as mobile, online and in-store. </p><p>Called One Commerce, the firm is attempting to address \"<ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/video/digital-banking-2025/prioritizing-a-mobile-first-strategy-to-enhance-the-customers-omnichannel-experience\" target=\"_blank\"><u>omnichannel commerce</u></a></ps-link>,\" or the trend toward merchants consolidating different ways to engage with shoppers. </p><p>Worldline will also introduce an \"à-la-carte\" acquiring model, which enables merchants to choose their preferred acquires, with Worldline's merchant acquiring service being among the options. </p><p>\"Worldline One Commerce is a strategic shift for retailers. It transforms payments from a transactional necessity into a powerful enabler of growth, efficiency and customer engagement. Our ambition is clear: to help merchants scale faster, innovate with confidence and deliver truly seamless omnichannel experiences,\" David Valero Compte, global head of retail at Worldline Enterprise, said in a release. </p><p>Worldline, which is restructuring amid <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/worldline-accused-of-serving-sketchy-firms-laundering-money\" target=\"_blank\"><u>regulatory pressure</u></a></ps-link> and <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/list/worldline-plans-to-cut-its-workforce-moneygram-hires-four-new-leaders\" target=\"_blank\"><u>economic challenges</u></a></ps-link>, recently sold its Swedish subsidiary <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/payments/news/visa-mastercard-enlist-fintechs-to-reach-latin-americas-unbanked\" target=\"_blank\"><u>CoreOrchestration</u></a></ps-link> to Incore Invest for about $160 million. Worldline plans to use the proceeds of the sale to redeploy capital toward its core payments business. Following a <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/payments/news/is-worldlines-stock-plunge-a-sign-of-trouble-for-the-u-s\" target=\"_blank\"><u>stock sell-off</u></a></ps-link>, Worldline has also sold units that manage mobile technology, North American payments and electronic data management, totaling about $600 million.</p><p></p><h2 class=\"cms-heading-h2 HeadingH2\">Fiserv picks up distribution in Canada</h2><p>Like Worldline, Fiserv is also battling an earnings slump. Fiserv has partnered with Canadian technology company Peoples Group to sell a suite of payments technology covering real-time processing, e-commerce and other tools.</p><p>Fiserv has entered into a series of partnerships in recent months as it looks to recover from an <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/payments/news/fiserv-looks-to-ai-to-spur-its-recovery\" target=\"_blank\"><u>earrings slump</u></a></ps-link> in the fall. Recent moves include an expanded strategic partnership with enterprise artificial-intelligence firm ServiceNow, a deal that will add to improve Fiserv's IT departments and the customer service units that support Fiserv's clients. </p><p>Fiserv is also working with Google, Mastercard and Visa to expand agentic commerce, which refers to a form of AI that enables shopping and payments with little or no human supervision. \"Peoples Group is at the leading edge of innovation in Canada's financial ecosystem, and we're proud to support their next-generation payments strategy,\" said Sayantan Chakraborty, head of digital Payments at Fiserv, in a release. \"With the Fiserv Enterprise Payments Platform, we're delivering the scale, security and connectivity financial institutions and fintechs need to grow and compete across Canada.\"</p><p></p><h2 class=\"cms-heading-h2 HeadingH2\">MoneyGram lends its scale to U.K. blockchain project</h2><p>Transfer giant MoneyGram has joined Vodafone and eToro in running three of the ten nodes for a new blockchain from the Midnight Foundation, a decentralized commerce organization. The three companies will each run a \"node,\" which means they are one of the users and operators of a shared network. </p><p>MoneyGram will also work with the Midnight Foundation to find ways for traditional payment networks to adopt blockchains while managing inhibiting factors such as privacy, compliance and security. Like rival Western Union, MoneyGram has <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/payments/news/moneygrams-ceo-on-cross-border-payments-this-is-an-expensive-business\" target=\"_blank\"><u>updated its business </u></a></ps-link>in recent years to respond to the growth of digital payments while maintaining its existing branch network. This includes a crypto wallet and a series of partnerships that enable crypto-to-traditional currency transfers. </p><p>\"MoneyGram has been delivering real-world crypto solutions for years, focusing on making the benefits of digital finance accessible to the people who actually need them,\" said Luke Tuttle, MoneyGram chief product and technology officer, in a release. \"Working with Midnight and running blockchain nodes fits naturally into this strategy, allowing us to help ensure that privacy, compliance and reliability are built in from day one.\" <br/></p></div>",
            "link": "https://www.americanbanker.com/payments/news/stablecoins-draw-attention-but-are-still-a-tiny-market",
            "pub_date": "2026-02-26 06:06:12",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BMO says it's finishing U.S. reset, set to resume loan growth",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><ul><li><b>Key insights:</b> Canadian lender BMO Financial Group reported a $1.82 billion profit for the first quarter of its 2026 fiscal year.<br/></li><li><b>What's at stake: </b>The solid bottom-line result pushed BMO closer to reaching its twin profitability targets, a 15% return on assets for companywide operations and a 12% ROA for its U.S. banking operations.<br/></li><li><b>Expert quote: </b>\"With the U.S. economy expected to outpace Canada for a fourth straight year … we're well-positioned to capture growth opportunities as business activity expands.\" — BMO CEO Darryl White</li></ul><p></p><p>BMO Financial Group is nearly done optimizing its U.S. balance sheet and is sounding bullish about growing stateside loans in the second half of its 2026 fiscal year.</p><p>\"We expect to see positive commercial loan growth in the second half of the year, supported by currently strong pipelines,\" BMO CEO Darryl White said Wednesday on a conference call with analysts. \"With the U.S. economy expected to outpace Canada for a fourth straight year … we're well-positioned to capture growth opportunities as business activity expands.\"</p><p>\"It's all coming together,\" BMO U.S. President Aron Levine said later on the call. \"We've got work to do, but we feel confident about where the momentum is pointing to over the next couple of quarters.\"</p><p>Levine said BMO is projecting U.S. loan growth in the mid-single digits, though he did not provide a specific timeframe for that forecast. His prediction would put BMO in line with the rest of the U.S. banking industry, which experienced 2% loan growth between the third quarter and the fourth quarter, according to <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/banks-close-out-2025-with-strong-profits-higher-lending\" target=\"_blank\"><u>recently released Federal Deposit Insurance Corp. statistics.</u></a></ps-link></p><p>The confident tones from BMO executives represent a turnabout from 2025. The $1.07 trillion-asset Canadian bank spent last year focused on shedding low-yield loans and high-cost deposits in its U.S. business.</p><p>The company released financial results for the quarter ending Jan. 31 on Wednesday, reporting a 3% year-over-year decline in U.S. loan volume, along with a 5% annual decline in deposits. </p><p><ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/bmo-sells-lagging-businesses-in-push-to-boost-u-s-returns\" target=\"_blank\"><u>As part of its U.S. optimization plan</u></a></ps-link>, Toronto-based BMO previously sold what it described as a nonrelationship credit card portfolio, and it exited an underperforming franchise loan portfolio.</p><p>It also <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/bmo-inks-deal-to-sell-138-u-s-branches-to-first-citizens\" target=\"_blank\"><u>agreed to sell 138 branches</u></a></ps-link> in the Midwest and Mountain West regions to the $229.7 billion-asset First Citizens BancShares in Raleigh, North Carolina. That transaction, which was intended to sharpen BMO's focus on markets such as California where it sees the highest growth potential, is expected to close in the second half of 2026.</p><p>Now, the optimization program is 90% complete, with the finish expected to come between February and April of 2026, according to Darrel Hackett, BMO's U.S. CEO. \"What you should see from here is the low-return stuff that still exists from time to time rolls off, and better-return assets roll on,\" Hackett said on the conference call.</p><p>The effort, aimed at boosting the return on assets for BMO's U.S. operation to 12% over the next three to five years, appears to be paying dividends. For the three months ending Jan. 31, BMO reported a 7.9% ROE for its U.S. segment, up from 6.5% a year ago. </p><p>The U.S. banking unit produced first-quarter net income totaling $539 million, up 21% from the same quarter in 2025. Revenues of $2.1 billion were up 2%.</p><p>Company-wide, BMO reported quarterly net income totaling $1.82 billion in U.S. dollars, up 16% year over year.  Buoyed by the acquisition of Burgundy Asset Management in November, wealth revenue grew 14% from a year earlier to $1.1 billion. Meanwhile, strong deposit growth helped push revenue from Canadian personal and commercial banking operations to $2.38 billion, up 7% from the same period in 2025.</p><p>BMO has targeted a company-wide 15% return on assets. The goal is in reach and should be attained by the end of fiscal 2027, White said. The return on equity for the quarter ending Jan. 31 was 12.1%.</p><p>\"First-quarter results were very strong,\"  White said. \"We're executing on our commitment to deliver higher returns and profitable earnings growth.\"</p></div>",
            "link": "https://www.americanbanker.com/news/bmo-says-its-finishing-u-s-reset-set-to-resume-loan-growth",
            "pub_date": "2026-02-26 05:40:30",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Anthropic's AI tool sparks cybersecurity panic",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><ul class=\"rte2-style-ul\" style=\"margin-top: 0px; margin-bottom: 0px; padding-inline-start: 48px;\"><li><b>Key insight:</b> While Anthropic's new AI tool excels at finding bugs in source code, it lacks the real-time monitoring required to defend live enterprise networks.</li><li><b>What's at stake:</b> Replacing dedicated security platforms with general-purpose AI models could create systemic vulnerabilities and widespread disruptions across the financial system.</li><li><b>Expert quote:</b> \"Claude Code Security finds bugs in your source code before they're exploited ... CrowdStrike detects and responds to threats at runtime,\" CrowdStrike CEO George Kurtz said.</li></ul><p><i>Overview bullets generated by AI with editorial review</i></p><p>Anthropic's recent launch of an artificial intelligence vulnerability scanner sent cybersecurity stocks tumbling, but vendors and analysts are pushing back against the narrative that AI will render existing security platforms obsolete.</p><p>On Friday, the AI research company unveiled Claude Code Security, a tool that uses AI reasoning to spot complex vulnerabilities in software code. The announcement sparked a sudden market selloff that battered the shares of cybersecurity giants including CrowdStrike and Palo Alto Networks, as well as software supply chain companies like JFrog.</p><p>For U.S. banks, the market turbulence raises critical questions about whether the security vendors protecting their networks will be replaced by AI models, and the potential consequences of this.</p><p>For example, shifting security responsibilities entirely to a handful of foundational AI models could run afoul of U.S. Treasury Department warnings about concentration risks, which caution that relying too heavily on a few AI providers could create systemic vulnerabilities and widespread disruptions across the financial system.</p><h2 class=\"cms-heading-h2 HeadingH2\">Anthropic's product release causes a selloff</h2><p>Claude Code Security is a limited-preview tool that scans codebases for security vulnerabilities and suggests targeted software patches.</p><p>Rather than scanning for known patterns like traditional static analysis tools do, Claude reads and reasons about code in a way that emulates a human security researcher's thinking, attempting to understand how data moves through an application to catch complex flaws.</p><p>Anthropic has been leaning heavily into cybersecurity. Alongside releasing its Claude Opus 4.6 model (which the company claims found over 500 zero-day vulnerabilities in well-tested open-source codebases), it recently partnered with the Pacific Northwest National Laboratory to explore using AI to defend critical infrastructure.</p><p>Investors reacted to Friday's product launch with alarm, interpreting the AI advancement as a direct threat to the business models of established security vendors.</p><p>The Global X Cybersecurity ETF (BUG) fell 3.7% on the day of the announcement, closing at its lowest level since November 2023.</p><p>Software supply chain and application security vendor JFrog suffered the steepest decline, dropping 24.6%.</p><p>Identity and access management firm Okta fell 8.3%, while CrowdStrike dropped 7.32% amid intense short-selling pressure.</p><p>Palo Alto Networks experienced a more moderate decline of 1.1%.</p><h2 class=\"cms-heading-h2 HeadingH2\">Security vendors push back against market sentiment</h2><p>Executives at the cybersecurity vendors quickly argued following Anthropic's Friday announcement that the market fundamentally misunderstands the difference between scanning code during development and defending a live network.</p><p>CrowdStrike CEO George Kurtz said he directly asked Claude to build a tool to replace his company's platform, according to a post he made on LinkedIn. Claude responded that it could not replicate CrowdStrike's real-time endpoint monitoring or automated incident response with a simple script.</p><p>\"Claude Code Security finds bugs in your source code before they're exploited — proactive, development-stage security,\" Kurtz wrote. \"CrowdStrike detects and responds to threats at runtime across live endpoints — reactive, operational security.\"</p><p>Other application security vendors agreed that AI reasoning is powerful for discovering vulnerabilities but insufficient for enforcing enterprise security.</p><p>AI models frequently introduce business logic and authorization risks themselves, according to Manoj Nair, chief innovation officer at developer security firm Snyk. Trust in the AI era must be built on evidence-backed verification outside of the AI model's cognitive loop, according to Nair.</p><p>\"You can ask an AI to reason about a vulnerability,\" Nair wrote. \"You cannot ask a probabilistic model to guarantee compliance, prove data flow or enforce enterprise policy across thousands of repositories.\"</p><p>Similarly, code quality vendor Sonar emphasized that Claude Code Security engages in a sampling-based, spot-checking approach, whereas enterprise security tools systematically evaluate every line of code to provide the consistent, auditable evidence required by compliance frameworks.</p><h2 class=\"cms-heading-h2 HeadingH2\">Palo Alto preempted the panic</h2><p>Palo Alto Networks CEO Nikesh Arora got in an early word during his company's earnings call on February 17, three days before Anthropic's announcement.</p><p>Responding to analyst questions about whether large language models pose an existential threat to security information and event management tools, Arora argued that AI is a net positive addition to security capabilities, not a replacement.</p><p>Security platforms require near-perfect precision to protect customers, a threshold that current AI models cannot meet on their own, he said.</p><p>\"Until they get to 99%, 99.9% accuracy, [LLMs] are not a threat to delivering security,\" Arora said. \"They are tools that can be used to summarize capabilities.\"</p><p>Arora also noted that security companies generate proprietary data by sitting at the network edges and blocking billions of attacks daily. Because a language model is not a system of record that generates this domain-specific threat data, it cannot replace the security product itself, according to Arora.</p><p>Instead of fragmenting the market, the rise of AI is actually driving enterprise customers to consolidate their security vendors into unified platforms, Arora said.</p><h2 class=\"cms-heading-h2 HeadingH2\">Analysts share vendors' skepticism</h2><p>Financial analysts covering the cybersecurity sector echoed the vendors' defenses, viewing the market selloff as an overreaction.</p><p>Bank of America Global Research analysts wrote in a Monday note that they disagree with investor concerns that AI will automate away meaningful parts of the security market. While AI tools like Claude represent progress in developer automation and code scanning, they remain too fragile for autonomous defense, according to the Bank of America report.</p><p>\"Runtime security is <i>continuous</i>, always observing execution behavior; <i>contextual</i>, combining signals across endpoint, identity, network, and cloud; and <i>defensive</i>, with required accuracy hitting ~99.99% as false negatives have immediate consequences,\" the Bank of America analysts wrote. (Emphasis original)</p><p>Morningstar equity analyst Malik Ahmed Khan also pushed back against the panic, noting that the adversarial nature of cybersecurity means AI advancements will benefit both attackers and defenders.</p><p>\"While LLMs can be trained on security methods and techniques, they simply don't have access to petabytes of real-time data gathered by large security vendors on a daily basis,\" Khan wrote.</p><h2 class=\"cms-heading-h2 HeadingH2\">How it all bears on systemic risk for banks</h2><p>For the banking sector, the debate over replacing dedicated security platforms with general-purpose AI models touches on serious regulatory and systemic concerns.</p><p>U.S. banks are currently exploring how to integrate AI to improve efficiency and fraud detection, but the U.S. Treasury has explicitly warned about the dangers of industry-wide reliance on a small number of AI providers.</p><p>In a 2024 report on AI in the financial services sector, the Treasury Department noted that the high costs and computing power required to build generative AI models force smaller institutions to depend heavily on a few large tech companies.</p><p>\"Respondents worried that this concentration risk could also lead to systemic and market vulnerabilities, as interruption at a single AI provider could create widespread disruptions across the financial system,\" according to the Treasury report.</p><p>If banks were to abandon their diversified, real-time cybersecurity platforms in favor of relying solely on a few foundational AI models for code analysis, they could exacerbate these exact systemic vulnerabilities while losing the active runtime defenses required to stop active breaches.<br/></p></div>",
            "link": "https://www.americanbanker.com/news/anthropics-ai-tool-sparks-cybersecurity-panic",
            "pub_date": "2026-02-26 05:35:06",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "What Stripe would get by acquiring PayPal",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><ul><li><b>Key insights</b>: Stripe is considering acquiring all or parts of PayPal, according to Bloomberg. </li><li><b>What's at stake</b>: PayPal is struggling and could sell at a discount, while Stripe's valuation is on the rise, setting the stage for a potential deal. </li><li><b>Forward look</b>: Stripe could face other bidders for PayPal.</li></ul><p>With <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/payments/news/paypal-replaces-alex-chriss-with-hps-enrique-lores-as-ceo\" target=\"_blank\"><u>PayPal restructuring</u></a></ps-link> its business and leadership, rumors are circulating that all or parts of the company may be for sale. </p><p>Stripe, which Wednesday reported a jump in its valuation to $159 billion, is <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/articles/payments-processor-stripe-expresses-interest-in-paypal\" target=\"_blank\"><u>considering an acquisition of PayPal</u></a></ps-link>, a deal that would combine two of the payments industry's largest fintechs.   </p><p>\"I'm not surprised about the speculation that some or all of PayPal is in play. Attempts by previous leadership to rationalize the portfolio have had mixed results, making a merger or divestiture of some kind plausible,\" Aaron Press, research director for IDC, told American Banker, noting PayPal's recent earnings miss and the selection of Enrique Lores to <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/payments/news/paypal-replaces-alex-chriss-with-hps-enrique-lores-as-ceo\" target=\"_blank\"><u>replace Alex Chriss </u></a></ps-link>as CEO. \"The choice of a CEO with experience in large scale organizational change points toward a likely change in mindset.\"<br/></p><h2 class=\"cms-heading-h2 HeadingH2\">AI and merchants are the prize</h2><p>Stripe, which is a privately held company and does not issue a formal earnings report, on Wednesday said it has signed agreements with investors to provide liquidity to current and former Stripe employees, and other shareholders, through a tender offer at $159 billion. While the majority of funds for the tender offer are being provided by investors including Thrive Capital, Coatue, a16z, and others, Stripe will also use a portion of its own capital to repurchase shares. </p><p>Stripe also reported what it called a \"strong year,\" saying businesses running on Stripe generated $1.9 trillion in total volume, up 34% from 2024, and equivalent to roughly 1.6% of global GDP. Stripe's Revenue suite, or non-payment products such as Stripe Billing, Invoicing, and Tax, is on pace to reach an annual run rate of $1 billion this year.The company's management also called out its progress in artificial intelligence. </p><p>\"Our programmable financial services now power more than 5 million businesses directly or via platforms, including all of the top AI companies, many of the largest blue-chip companies, most of the biggest tech companies (80% of the Nasdaq 100), and a significant fraction of freshly minted startups,\" Stripe co-founders John and Patrick Collison said in the company's shareholder letter. \"All in all, 2025 was a strong year for the internet economy, and we're delighted to see so many of Stripe's customers do so well.\"</p><p>Stripe said it is working with partners across AI labs, retailers and e-commerce platforms to lay the groundwork for the migration to agentic commerce. This includes an agentic commerce protocol and an Agentic Commerce Suite, which sells tools for businesses to use across multiple AI interfaces and protocols with a single integration. Early adopters include Anthropologie, Urban Outfitters, Etsy, Coach and Kate Spade.PayPal would be a fit for that strategy. While PayPal has struggled in recent quarters, it has made major investments in <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/payments/news/paypals-solution-for-ai-scalability-partners\" target=\"_blank\"><u>AI-powered shopping and payments</u></a></ps-link> over the past two years.</p><p>\"Stripe knows this is a fire sale and is bottom feeding, hoping to buy PayPal or cherry-pick assets like Braintree at a deep discount to its own $159B valuation, all with the ultimate goal of using PayPal to secure a viable position in agentic commerce,\" Richard Crone, a payments consultant, told American Banker. \"Despite the recent management shakeup, PayPal remains a leader.\" </p><p>PayPal additionally has a range of properties and capabilities that are likely to be attractive to Stripe, Press said, adding PayPal has a significant acquiring portfolio, the Braintree gateway, core wallet and checkout offerings that have significant global presence and could complement Stripe's existing offerings that power wallets for platforms. \"Ancillary offerings, such as fraud management or conversion optimization, could also be leveraged,\" Press said. \"Venmo may be more challenging, but Stripe could give the system additional scale with merchants.\"</p><p>Adding Stripe as a potential owner would be good for PayPal, giving it a much-improved framework for selling its services to small and medium-sized businesses, according to Aaron McPherson, principal at AFM Consulting.</p><p>\"Stripe, for its part, would gain a leading consumer-facing brand, moving it into new markets and vastly increasing its scale,\" McPherson told American Banker, noting Stripe could also leverage PayPal's PYUSD stablecoin. to advance its own stablecoin strategy. <br/></p><h2 class=\"cms-heading-h2 HeadingH2\">A bidding war?</h2><p>Stripe and PayPal would not comment on the rumors, which were initially reported by Bloomberg without on the record attribution. </p><p>Even at a $159 billion valuation, it's hard to see Stripe being able to afford what it would take to win the bidding war that would ensue with the AI super powers, Crone said, noting firms like Google, Microsoft, OpenAI, Perplexity, Meta and Anthropic could be interested. </p><p>\"By adding PayPal, large language models–the technology behind new forms of AI, can marry buyer reasoning, deliberation history and intent scoring to a proprietary payment credential,\" Crone said. </p><p>Stripe is likely leading the speculation as much due to its valuation as to the overall strategic fit, Press said. </p><p>\"That said, valuation is not the same as cash, and any transaction of this scale involving Stripe would be a feat of financial engineering,\" Press said, noting a private equity buyer is also a possibility. \"There aren't many strategic buyers that could realistically contemplate such a move.\"</p><p>PayPal and Stripe would also be a complicated integration, according to McPherson, noting  the two companies have different cultures and very different tech stacks.  </p><p>\"Despite Stripe's $159 billion valuation, this would be a big acquisition, and could become a distraction,\" McPherson said. \"Stripe is not the only interested party, so we will probably hear about others shortly that may be a better fit.\"</p><p></p></div>",
            "link": "https://www.americanbanker.com/payments/news/stripe-considers-acquiring-paypal",
            "pub_date": "2026-02-26 05:06:10",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Why banks see opportunity in advising art collectors",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><p>As wealthy Americans increasingly see art as an investment, some banks are taking on a dual role: part wealth manager, part connoisseur.</p><p>The latest example is <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/organization/bank-of-america\">Bank of America</a></ps-link><span class=\"QModMiniQuotesRichText\"> <span class=\"QModMiniQuotesRichText-tool\"> <span class=\"qtool\" data-qmod-params='{\"lang\":\"en\", \"symbol\": \"BAC\"}' data-qmod-tool=\"miniquotes\"></span> </span> </span>. On Feb. 18, the nation's second-largest lender unveiled its new <ps-link><a class=\"Link\" href=\"https://www.prnewswire.com/news-releases/bank-of-america-launches-art-consulting-service-302691393.html\" target=\"_blank\"><u>art consulting</u></a></ps-link> service, which advises clients as they start or expand their collections. </p><p>\"We really wanted to be able to round out our offering, to be able to support clients regardless of where they are in their collecting journey,\" Drew Watson, <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/organization/bank-of-america\">BofA's</a></ps-link> head of art services, told American Banker.</p><p>The Charlotte, North Carolina-based bank is far from alone. Citi, Morgan Stanley, UBS, HSBC and other big banks all offer art advisory services. Just last year, Goldman Sachs expanded its art and collectibles business into Asia and the Middle East for the first time.</p><p>And <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/organization/bank-of-america\">BofA</a></ps-link> itself has long offered an art consignment service, which focuses on clients who are looking to sell art. What's new about the art consulting service is that it's focused on buying — something collectors have been doing more often lately. </p><p>That's because since 2023, the high-end art market has been suffering a prolonged correction. In the first half of 2025, the number of public transactions for artworks worth more than $10 million fell by 44% from 2024, and by 72% from 2022, according to a <ps-link><a class=\"Link\" href=\"https://www.privatebank.bankofamerica.com/articles/art-market-fall-update.html\" target=\"_blank\"><u>BofA analysis</u></a></ps-link>.</p><p>This downturn has opened up opportunities for collectors — and for banks ready to advise them.</p><p>\"Over the past three or four years, we've been in more of a buyer's market than a seller's market,\" <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/organization/bank-of-america\">BofA's</a></ps-link> Watson said. \"So this service allows us to maintain a high degree of relevancy to clients regardless of the market cycle.\"</p><p>The new service caters to clients at <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/organization/bank-of-america\">BofA's</a></ps-link> private bank and its Merrill wealth management division, both of which serve high net worth and ultra-high net worth individuals. </p><p>This mega-rich demographic has been rapidly getting richer. Since the first quarter of 2020, the top 0.1% of Americans by wealth have more than doubled their fortunes, from $12.08 trillion to $24.89 trillion in the third quarter of 2025, according to data from the <ps-link><a class=\"Link\" href=\"https://www.federalreserve.gov/releases/z1/dataviz/dfa/distribute/chart/\" target=\"_blank\"><u>Federal Reserve</u></a></ps-link>.</p><p><ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/organization/bank-of-america\">BofA's</a></ps-link> new art service pairs wealthy clients with advisors who have deep backgrounds in the art world, including at galleries, auction houses and museums. These consultants work with collectors to determine their goals, introduce them to the right dealers and auction houses, and continuously provide market updates and other key information.</p><p>\"It's a highly tailored service that is designed to meet our clients where they are,\" Watson said. \"People collect for different reasons — sometimes to fill the walls of their home, other times to support working contemporary artists, other times just for pure love of the art objects themselves.\"</p><p>There is also another reason. In recent years, wealthy Americans have increasingly come to see paintings and sculptures not just as forms of self-expression, but as financial assets. In 2011, 25% of wealth managers offered art-consulting services, according to research by <ps-link><a class=\"Link\" href=\"https://www.deloitte.com/lu/en/services/financial-advisory/research/art-finance-report.html\" target=\"_blank\"><u>Deloitte</u></a></ps-link>. By 2025, that number had risen to 51%.</p><p>\"Clearly this is an area which is growing significantly in terms of the perception of its importance, among both wealth managers and high-net-worth and ultra-high-net-worth clients,\" Mike Foy, head of wealth intelligence at JD Power, said in an interview.</p><p>One benefit of art, Foy said, is that it's a truly distinct asset class, untethered to more traditional investments. In an era when stocks and bonds often suffer at the same time, that diversification is highly appealing to many investors.\"I think a lot of asset classes that traditionally have been perceived to offer diversification benefits are now more correlated than they were historically, so there's a need to cast a wider net,\" Foy said.</p><p>In recent months, the art market has shown some signs of recovering. In 2025, the British auction house Christie's projected $6.2 billion in global sales for the full year, up 6% from 2024.</p><p>\"We're coming off of a great fall season,\" Sayuri Ganepola, global head of art finance at Christie's, told American Banker. \"We're hearing all the doom and gloom from beforehand, but we had some great results at the end of last year.\"</p><p>As business picks back up, Ganepola said, investors' demand for advice on art has ticked up as well. And like Foy, she's noticed Americans' rising interest in art for its financial as well as aesthetic value.</p><p>\"What we've been seeing in our own space is more and more clients over the past couple of years have been proactively seeking out and asking for this type of service,\" Ganepola said. \"So it's no surprise that many banks are also positioning themselves similarly to how we have been.\"</p></div>",
            "link": "https://www.americanbanker.com/news/why-banks-see-opportunity-in-advising-art-collectors",
            "pub_date": "2026-02-26 04:36:10",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        }
    ]
}