{
    "data": [
        {
            "title": "Fulton's latest acquisition nears finish line",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><p>In this week's banking news roundup:<br/></p><ul class=\"rte2-style-ul\"><li>Lancaster, Penn.-based Fulton Financial received approvals to acquire Blue Foundry Bancorp in Northern New Jersey;</li><li>Wells Fargo named Dennis Devine head of business banking;</li><li>JPMorganChase added Bank of America veterans Roy Wouters and James Mitford to its health care investment banking team; and more.<br/></li></ul></div>",
            "link": "https://www.americanbanker.com/list/fultons-latest-acquisition-nears-finish-line",
            "pub_date": "2026-02-28 04:06:27",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OCC finalizes rule allowing trust non-fiduciary custody",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><p><b>Key insight:</b> The new rule from the Office of the Comptroller of the Currency codifies the Trump administration's stance that \"trust operations and activities related thereto,\" include non-fiduciary activities.</p><p><b>Expert quote:</b> \"The OCC has granted itself unfettered discretion to decide — on a case-by-case basis — what activities any future applicant for a national trust charter can perform.\" — Conference of State Banking Supervisors President Brandon Milhorn.</p><p><b>Forward look:</b> While no litigation has yet been filed challenging the rule, concerns from the banking industry and state bank supervisors could be the basis for litigation now that the rule has been finalized.</p><p>The Office of the Comptroller of the Currency on Friday finalized a January <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/occ-moves-to-formalize-non-fiduciary-activities-for-trust-banks\" target=\"_blank\"><u>proposal</u></a></ps-link> codifying a longstanding agency stance that national trusts may engage in fiduciary or \"business of banking\" activities — including non-fiduciary custody — over banking industry objections. </p><p>The <ps-link><a class=\"Link\" href=\"https://occ.gov/news-issuances/bulletins/2026/bulletin-2026-4a.pdf\" target=\"_blank\"><u>finalized regulation</u></a></ps-link> made few substantive changes to the January proposal, but the final rule's discussion of comments received expounded at some length the agency's defense of nonfiduciary custody at trusts. Responding to commenters who argued that \"trust company\" must mean only federally defined fiduciary powers under the National Bank Act, the OCC said the statute has always allowed the agency's interpretation. </p><p>\"The purpose of the final rule is merely to align the OCC's regulations with the statutory authorization in [The National Bank Act] to avoid any implication that national trust banks may not conduct any activities within the business of banking,\" the final rule stated. \"These activities may be part of trust company operations, such as custody, or activities related thereto.\"</p><p>Banking industry concerns center around whether trust companies and \"activities related thereto\" inherently includes nonfiduciary custody. For years, OCC regulations held that a national bank that only conducted \"fiduciary activities\" did not need to perform one of the three core banking functions — taking deposits, paying checks or making loans — in order to avoid being classified as a traditional bank and thus be subject to heightened prudential regulation. </p><p>In <ps-link><a class=\"Link\" href=\"https://www.federalregister.gov/documents/2026/01/12/2026-00372/national-bank-chartering\" target=\"_blank\"><u>2003</u></a></ps-link>, the OCC moved to clarify that a limited-purpose national bank could operate in areas beyond fiduciary activities, as long as those activities were part of the business of banking. At the time, several commenters said the proposal was overly broad, and the final rule was amended to require that \"a special purpose bank that conducts activities other than fiduciary activities must conduct at least one of the following three core banking functions: Receiving deposits; paying checks; or lending money.\"</p><p>The National Bank Act says a bank \"is not illegally constituted solely because its operations are or have been required by the Comptroller of the Currency to be limited to those of a trust company and activities related thereto.\"</p><p>The final rule asserts that the prior regulations were not directed at national trust companies, but other types of special purpose banks.</p><p>\"The language in [2003 OCC regulations] referencing a 'bank that conducts activities other than fiduciary activities' was intended to clarify that the provision did not address national trust banks; the provision addressed special purpose banks that would engage in activities other than those of a trust company,\" the OCC stated. \"The language was not intended, and has never been interpreted by the OCC, to circumscribe national trust bank activities.\"</p><p>Mayer Brown lawyer Matt Bisanz told American Banker that the OCC's move to issue a formal rulemaking in January to clarify the matter is an effort to lessen confusion between the law and the OCC's regulations. </p><p>\"I think what this rulemaking is trying to do is eliminate that translation,\" Bisanz said. \"I'm sure someone back when [OCC licensing rules were updated] in 2003 was like, 'Everyone knows that fiduciary activities is the shorthand for activities a Trust Company and activities related thereto.'</p><p>\"Now people are hyper fixated on it because there are all these various competitive concerns,\" Bisanz continued.</p><p>The OCC first tried to smooth over that tension in 2021 with Interpretive <ps-link><a class=\"Link\" href=\"https://www.occ.gov/topics/charters-and-licensing/interpretations-and-actions/2021/int1176.pdf\" target=\"_blank\"><u>Letter 1176</u></a></ps-link>, authored by then-General Counsel and now Comptroller of the Currency Jonathan Gould. </p><p>Rather than formally rewriting the rule, the letter took the position that trust bank activities inherently include fiduciary activities as well as non-fiduciary activities, like custody. That gave crypto firms and fintechs an opening to apply for custody-oriented trust charters without triggering a formal \"bank\" designation. </p><p>Friday's final rule formalizes that earlier position by amending the 2003 regulation itself, replacing \"fiduciary activities\" with \"the operations of a trust company and activities related thereto\" in an administrative rulemaking. Interpretive letters are more vulnerable to challenges, in part because they do not incorporate public comments. </p><p>Critics of allowing national trust companies to engage in non-fiduciary activities argue that \"fiduciary activities,\" as defined in the National Bank Act refer to narrow powers involving discretion, like serving as trustee, executor or adviser and do not include non-fiduciary custody, where a bank merely safekeeps assets without making decisions on a customer's behalf.</p><p>Art Wilmarth, professor emeritus of law at George Washington University Law School, <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/is-the-occ-stretching-trust-charters-too-far\" target=\"_blank\"><u>said in an interview</u></a></ps-link> prior to the final rule's publication that the proposal relies on an expansive interpretation of the intent behind the original legal language. </p><p>\"There isn't a word in [the National Bank Act's provisions on trust powers] that says anything about non-fiduciary activities — that's totally out of left field,\" Wilmarth said. \"It's clear that the OCC thinks that 'related' will allow them to run a Mack truck through.\"</p><p>Brandon Milhorn, President and CEO of the Conference of State Bank Supervisors, said in a statement Friday that the rule justifies allowing trusts to perform non-fiduciary custody by claiming it falls within trust company operations and activities related thereto, without ever defining what \"related thereto\" actually means. He also suggested the rule may violate the law, saying, \"neither this vague rule, nor trust charter applications approved under the OCC's case-by-case process, should be entitled to any deference by the courts.\"</p><p>\"The OCC has granted itself unfettered discretion to decide — on a case-by-case basis — what activities any future applicant for a national trust charter can perform,\" Milhorn said, arguing the agency has \"doubled down on an already opaque process.\"</p><p>\"The OCC missed an opportunity to provide critical transparency regarding its exercise of the specific and limited chartering authority granted by Congress under the National Bank Act,\" Milhorn continued.  \"I challenge anyone to explain what the scope and limits of the business of a 'national trust bank' are after reading this rule.\"</p></div>",
            "link": "https://www.americanbanker.com/news/occ-finalizes-rule-allowing-trust-non-fiduciary-custody",
            "pub_date": "2026-02-28 03:35:59",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LA bank is latest lender to be ensnared in alleged fraud saga",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><ul class=\"rte2-style-ul\"><li><b>Key insight</b>: Preferred Bank has moved a $115 million block of loans, which are backed by multifamily and commercial real estate properties, to nonaccrual status.</li><li><b>What's at stake</b>: The $7.6 billion-asset Preferred is the latest bank to be ensnared in a saga involving alleged borrower fraud. Both Zions Bancorp. and Western Alliance Bancorp. have sued the entities, whose lawyer has denied wrongdoing.</li><li><b>Forward look</b>: Preferred believes it can resolve the nonaccrual credits by the end of the second quarter.</li></ul><p>Los Angeles-based Preferred Bank has been pulled into a high-stakes saga involving alleged borrower fraud that previously ensnared two larger Western banks.</p><p>Preferred disclosed earlier this week that it has downgraded to nonaccrual status a large relationship involving $115 million of loans backed by multifamily and commercial real estate properties.</p><p>While Preferred did not identify the borrowers, court filings and other publicly available documents link the $7.6 billion-asset bank to properties connected to an alleged fraud controversy involving the Cantor Group, a real estate investment firm based in Newport Beach, California.</p><p>Preferred noted in a press release that the borrowers are \"involved in several complicated lawsuits with other banks.\"</p><p>Both Zions Bancorp. in Salt Lake City and Western Alliance Bancorp. in Phoenix have sued entities affiliated with the Cantor Group, alleging that the borrowers obtained sizable loans by offering collateral that had already been pledged to other creditors. The lawsuits contributed to <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/bank-stocks-see-bloodbath-amid-fraud-linked-credit-fears\" target=\"_blank\"><u>a selloff in regional bank stocks</u></a></ps-link> in the fall.</p><p>Preferred's decision to downgrade $115 million of loans is \"definitely isolated to this relationship,\" Chief Financial Officer Edward Czajka told American Banker.</p><p>\"It has to do with the principals in the relationship, who we've been involved with for a number of years,\" Czajka said. \"It's been a great relationship until now.\"</p><p>In an investor presentation Thursday, Preferred said it had initially flagged the loans as substandard during the fourth quarter due to \"a member of the borrowing entity being the subject of fraud allegations against another financial institution.\" </p><p>A lawyer representing the Cantor Group-affiliated entities in the Zions and Western Alliance suits has said that his clients \"vehemently deny all the allegations of wrongdoing\" and has called the banks' claims \"unfounded.\"</p><p>Western Alliance, which has $92.8 billion of assets, booked an $80 million loan-loss provision in the third quarter of 2025, roughly double the second-quarter amount, due mainly to its Cantor Group exposure.</p><p>The $89 billion-asset Zions, which reported recoveries in the second quarter of 2025, booked a $49 million third-quarter provision for credit losses.</p><p>A number of other banks have reportedly also filed suit against Cantor.</p><p>Preferred isn't forecasting significant losses due to its downgrade. The five properties involved have relatively low loan-to-value ratios — the average is 52.7% — limiting the downside potential.</p><p>\"There's very little leverage in the overall relationship,\" Czajka said. </p><p>In its Feb. 23 press release, Preferred disclosed that it opted to move the loans to nonaccrual because of \"sluggish cash flow and unacceptable payment patterns,\" which it attributed to the borrowers' legal issues. </p><p>\"We felt it was prudent to place them all on nonaccrual and move forward with actions that are going to resolve these credits with the least amount of disruption to our operating income,\" Czajka said.</p><p>The company believes it can resolve a majority of the loans by the end of the second quarter with no significant impact on earnings. </p><p>\"Management intends to aggressively work out the loans, including giving the borrowers the opportunity to refinance the loans elsewhere,\" Tim Coffey, an analyst at Brean Capital who covers Preferred, wrote in a research note. </p><p>\"We do not forecast material losses on the downgraded loans,\" Coffey added. \"The borrower has substantial equity in the collateral, and is unlikely to walk away from the loans.\"</p><p>Founded in 1991, Preferred operates mainly as a commercial real estate lender. As of Dec. 31, about 50% of its $6 billion loan portfolio consisted of multifamily and CRE credits.</p><p>Preferred produced $133.6 million of net income in 2025, up about 2% from 2024.</p></div>",
            "link": "https://www.americanbanker.com/news/la-bank-is-latest-lender-to-be-ensnared-in-alleged-fraud-saga",
            "pub_date": "2026-02-28 03:35:59",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Block's AI-driven staff purge comes with a warning",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><ul><li><b>Key insights</b>: Block plans to lay off about 40% of its workforce, with CEO Jack Dorsey stating bluntly that improvements in artificial intelligence are quickly changing how companies will operate in the future. </li><li><b>Expert quote</b>: \"Something has changed. We're already seeing that the intelligence tools we're creating and using, paired with smaller and flatter teams, are enabling a new way of working which fundamentally changes what it means to build and run a company.\"</li><li><b>Forward look</b>: Dorsey predicted other companies will make similar moves as they come to the same realization he said he has. </li></ul><p>Amid speculation about the impact artificial intelligence <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/feds-barr-outlines-ai-risks-to-finance-labor-market\" target=\"_blank\"><u>could have on employment</u></a></ps-link>, Block became an early company to quantify the impact. </p><p>The payments company said it's laying off more than 4,000 employees, about 40% of its headcount, mostly during the first quarter. This will cut Block's staff to just under 6,000. </p><p>In announcing the layoffs, Block CEO Jack Dorsey did not mention corporate underperformance – his <ps-link><a class=\"Link\" href=\"https://s29.q4cdn.com/628966176/files/doc_financials/2025/q4/Q4-2025-Shareholder-Letter_Block.pdf\" target=\"_blank\"><u>letter to shareholders</u></a></ps-link> said \"2025 was a strong year\" in the second paragraph. But it was the first paragraph that will draw attention across all industries. </p><p>\"The core thesis is simple, intelligence  tools have changed what it means to build and run a company,\" Dorsey said in his letter. \"I don't think we're early to this realization. I think most companies are late.\" </p><p>Dorsey also predicted other companies would make similar adjustments, and he was hoping to get out in front of the trend. \"I'd rather get there honestly and on our own terms than be forced into it reactively.\"<br/></p><h2 class=\"cms-heading-h2 HeadingH2\">Not about corporate strength</h2><p>In a separate <ps-link><a class=\"Link\" href=\"https://x.com/jack/status/2027129697092731343\" target=\"_blank\"><u>social media post</u></a></ps-link>, Dorsey said Block's business is strong, gross profit continues to grow and the company is serving more customers. </p><p>\"But something has changed. We're already seeing that the intelligence tools we're creating and using, paired with smaller and flatter teams, are enabling a new way of working which fundamentally changes what it means to build and run a company. And that's accelerating rapidly. I had two options: Cut gradually over months or years as this shift plays out, or be honest about where we are and act on it now. I chose the latter. Repeated rounds of cuts are destructive to morale.\"</p><p>Dorsey said a cut of this size carries risk \"but so does standing still.\"Block has undergone repeated rounds of cuts in recent years. <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/payments/news/block-plans-another-round-of-layoffs#:~:text=Last%20March%2C%20Block%20cut%20931%20people,employers%2C%20or%20roughly%208%25%20of%20its%20staff\" target=\"_blank\"><u>Block forecast this week's cuts</u></a></ps-link> earlier in February. And <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/payments/news/block-lays-off-8-of-staff-western-union-adopts-ai\" target=\"_blank\"><u>Block fired 8% of its staff</u></a></ps-link> in 2023 and another 8% in 2024. <br/></p><h2 class=\"cms-heading-h2 HeadingH2\">How it's playing</h2><p>The immediate market response was positive. Following the current layoff announcement, <ps-link><a class=\"Link\" href=\"https://finance.yahoo.com/quote/XYZ/\" target=\"_blank\"><u>Block's shares</u></a></ps-link> rallied 16% on Friday, after being up more than 24% in premarket trading.  </p><p>\"The company is the first fintech we cover to reassess the fundamental nature of its workforce and how it will compete,\" analysts at William Blair said in a research note. \"We think shares' rally suggests that the market approves of its aggressive move to be more focused, nimble, and profitable.\"</p><p>Analysts noted risks to the company's ability to function with a lower headcount, and impacts on the broader economy. </p><p>\"Block's headcount reduction is a transformative reset that materially accelerates the margin expansion trajectory beyond prior expectations while allowing flexibility to reinvest in growth,\" Keefe, Bruyette &amp; Woods said in a research note. </p><p>Early benefits from AI tools at Block include improving product velocity and customer engagement, which combined with investments in sales and marketing are yielding solid top-line trends, according to KBW.</p><p>\"While execution risk cannot be dismissed, the magnitude of the cost reset positions the company for earnings upside potential over the medium term,\" KBW said. </p><p>Investors could be conflicted about the sudden and massive downsizing, according to analysts at TD Cowen. \"In the near term, it translates to higher financial projections,\" TD Cowen's analysts said. \"Thereafter, comes the execution risk questions as Block navigates with nearly half its workforce. And further down the road, comes the implications for commerce-based businesses.\"</p><p>Analysts at William Blair did not address Block's downsizing directly. The firm did note that Block's shares have \"underperformed\" in the past 12 months, and trades at parity with other payment companies such as Fiserv, Global Payments and PayPal. \"This is despite Block growing organic gross profit approximately three times faster than app peers.\" </p><p>Dorsey announced the layoffs during a strong quarter for Block. For the quarter ending Dec. 31, Block reported adjusted earnings per share of $0.65 and diluted net income per share of $0.19. The company reported $6.25 billion in revenue, compared to London Stock Exchange analyst estimates of $0.65 on $6.24 billion in revenue. Gross profit was up 24% from the prior year to $2.87 billion. Block projected $12.2 billion in gross profit with the adjusted EPS of $3.66 for 2026.</p><p>The layoffs are expected to cost Block between $450 million and $500 million, mostly due to severance payments and employee benefits on other costs related to share vesting, according to Block. </p><p>\"2026 outlook is better than our expectations and ahead of the preliminary outlook shared at the investor day. First quarter outlook is also better, but more of the profitability upside related to the headcount reduction is expected in the second quarter and into the second half,\" KBW analysts said. </p><p></p></div>",
            "link": "https://www.americanbanker.com/payments/news/block-replacing-40-of-its-staff-with-ai",
            "pub_date": "2026-02-28 01:51:00",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump's $200B MBS plan set off by GSE valuation gap: Pulte",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><p>Mortgage-backed securities purchases became the current focus of near-term plans for Fannie Mae and Freddie Mac due to lower-than-anticipated valuations for a planned stock offering, a housing official told Fox Business.</p><p>\"Today some people say the businesses are worth up to $1 trillion. They're worth $500 billion to $700 billion, we believe,\" Federal Housing Finance Agency Director Bill Pulte said, noting that some valuations haven't reached that point.</p><p>Some analysts have said $500 billion is high, and estimate that it is <ps-link><a class=\"Link\" href=\"https://www.axios.com/pro/fintech-deals/2025/08/11/kbw-fannie-mae-freddie-mac-ipo-2025\" target=\"_blank\"><u>half that amount.</u></a></ps-link></p><p>Pulte has <ps-link><a class=\"Link\" href=\"https://www.nationalmortgagenews.com/news/fannie-freddie-ipo-awaits-trumps-decision-on-timing\" target=\"_blank\"><u>repeatedly</u></a></ps-link> recounted how Trump \"got approached to sell these companies for about $100 billion\" during his first term, and characterized this as a low-ball offer.</p><p>(There was not a clear consensus on valuations back then. While there was some discussion of releasing the government-sponsored enterprises from conservatorship at the time, there were no immediate plans for a stock offering or widespread, formal valuations.)</p><p>When asked by Fox's Maria Bartiromo if a 2026 offering of certain Fannie Mae and Freddie Mac's shares is still possible, Pulte called it \"more likely than not\" but said that the decision remains in President Trump's hands.</p><p>\"Everything's on the table with President Trump. He keeps all options on the table at all times. <ps-link><a class=\"Link\" href=\"https://www.nationalmortgagenews.com/news/what-fannie-mae-freddie-mac-mbs-purchases-mean-for-reform\" target=\"_blank\"><u>This $200 billion mortgage buy</u></a></ps-link> is a perfect example,\" Pulte said of Trump's January order to have the GSEs purchase up to $200 billion in securitized loans.</p><p>Pulte said that the Jan. 8 news of plans for the bond purchases \"reduced mortgage rates right away.\" Freddie Mac's weekly rate report shows home financing costs fell about 10 basis points to <ps-link><a class=\"Link\" href=\"https://www.nationalmortgagenews.com/news/mortgage-rates-at-lowest-since-sept-2022-but-still-over-6\" target=\"_blank\"><u>a three-year-low</u></a></ps-link> of 6.06% after the announcement.<br/></p><h2 class=\"cms-heading-h2 HeadingH2\">Rate and housing updates</h2><p>Although mortgage rates have generally declined since then, the benchmark bonds that indicate the direction of long-term borrowing costs have fluctuated at times.</p><p>When asked about a 2.5 basis point rise in the mortgage rate-indicative 10-year government bond yield one day this week, Pulte noted that some drivers of financing costs are outside his sphere of influence and more within Treasury Secretary Scott Bessent's.</p><p>\"What I can say as it pertains to the mortgage rates is that we have reduced the spread. The spreads are tighter, meaning risk is out of the system,\" Pulte said, referring to how MBS trade relative to Treasury bonds.</p><p>The winter months are typically slow for housing finance activity and many mortgages still have pandemic-era rates that are still far below <ps-link><a class=\"Link\" href=\"https://www.nationalmortgagenews.com/news/mortgage-rates-dip-under-6-for-first-time-since-22\" target=\"_blank\"><u>the 5.98% average reported Thursday</u></a></ps-link>, which marks the lowest that financing costs have been since 2022.</p><p>In January, home resales dropped to their lowest level since September 2024, according to the National Association of Realtors, which attributed this in part to particularly bad weather in some regions.</p><p>Reluctance to move on the part of borrowers with low rates from the pandemic also has played a role in constraining existing home sales.</p><p>In contrast, new home sales have wavered but generally have remained near a four-year high, according to recent Census reports. </p></div>",
            "link": "https://www.americanbanker.com/news/trumps-200b-mbs-plan-set-off-by-gse-valuation-gap",
            "pub_date": "2026-02-27 23:41:26",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BankThink Banks need to choose carefully between public and private blockchains",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><p></p><ul><li><b>Key insight: </b>Decisions about the kind of blockchains to use in rolling out banking products creates future path dependencies. It's important that banks get this decision right.</li><li><b>Supporting data: </b>Deutsche Bank Research puts the tokenized real-world asset market at roughly $33 billion<b> </b></li><li><b>Forward look: </b>Banks evaluating blockchain rails should ask three questions: Who controls the network? What are their incentives today? How will those incentives change as the network gains adoption?</li></ul><p>The industry has stopped debating whether<ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/blockchain\" target=\"_blank\"> <u>blockchain</u></a></ps-link> matters and started asking how to implement it.</p><p>The New York Stock Exchange recently announced plans for 24/7 securities trading. Major banks are experimenting with<ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/payments/news/tokenized-treasuries-what-happens-when-securities-become-money\" target=\"_blank\"> <u>blockchain-based settlement</u></a></ps-link>. Asset managers are<ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/opinion/the-tokenization-of-assets-is-an-adapt-or-die-moment-for-finance-firms\" target=\"_blank\"> <u>tokenizing funds</u></a></ps-link> worth billions. But this shift obscures a more consequential choice: Should banks build on proprietary systems controlled by vendors and consortiums, or on open networks with no single owner? Get this wrong, and the lock-in lasts for generations.</p><p>Banks know this pattern. Core banking systems, payment networks, data providers have all created dependencies that limit flexibility and extract margin over time. The question isn't whether blockchain infrastructure will follow the same trajectory. It's whether banks will recognize it before committing.</p><p>When infrastructure is owned, owners serve shareholders. That means monetization pressure and pricing power over captive customers. Incentives diverge from users' interests as market power accumulates.</p><p>Open infrastructure works differently. With no shareholders to satisfy, fees can remain minimal, access remains open and standards can evolve for users rather than for owners.</p><p>Four advantages matter here.</p><p>First is interoperability without permission. Private chains require bilateral agreements to connect with other networks. A bank on one consortium's infrastructure can't transact with a bank on another's without middleware, negotiations or both. Public networks allow any-to-any connectivity by default.<ps-link><a class=\"Link\" href=\"https://remittanceprices.worldbank.org/\" target=\"_blank\"> <u>The World Bank</u></a></ps-link> puts average cross-border payment costs at 6.49% of transaction value. Interoperability is where those costs get attacked.</p><p>There is also reduced concentration risk.<ps-link><a class=\"Link\" href=\"https://www.dallasfed.org/research/papers/2025/wp2524\" target=\"_blank\"> <u>The Dallas Fed</u></a></ps-link> recently flagged technology service providers as a source of systemic vulnerability for financial institutions. This applies to blockchain infrastructure, too. Networks with single operators, even sophisticated ones, introduce single points of failure. Distributed networks spread that risk across independent validators in multiple jurisdictions.</p><p>Next comes better auditability. This one's counterintuitive. Open networks let regulators and auditors observe transactions directly rather than relying on what a private operator allows them to see. Verifiability strengthens compliance positions.<ps-link><a class=\"Link\" href=\"https://www.bis.org/publ/arpdf/ar2025e3.htm\" target=\"_blank\"> <u>The Bank for International Settlements</u></a></ps-link> addressed tokenized platforms in its 2025 annual report because transparency enables regulatory oversight rather than undermining it.</p><p>Finally, public infrastructure is faster to adapt to change. Proprietary systems evolve at the pace their owners choose, which often means slowly. Upgrades often require vendor prioritization and contract renegotiations. Open networks develop differently. Independent teams can build, test and deploy improvements without waiting for permission from a central authority. The result is infrastructure that adapts at the speed of business rather than the speed of procurement cycles. Banks have watched this pattern play out in other technology layers. Open-source software now underpins most critical systems precisely because it evolved faster than proprietary alternatives.</p><p>Still, banks worry about public infrastructure. Fair enough. Here are direct answers.</p><p>On control: Open network infrastructure doesn't mean losing control of assets. Issuers keep freeze, clawback and holder determination functions at the asset layer. Network openness and asset governance are separate design choices. Regulated issuers maintain full compliance controls whether the settlement layer is proprietary or open.</p><p>On compliance: BlackRock, Franklin Templeton and Fidelity have tokenized funds on public networks while meeting regulatory requirements.<ps-link><a class=\"Link\" href=\"https://www.dbresearch.com/PROD/RPS_EN-PROD/PROD0000000000610273/Asset_Tokenization_101%3A_Everything_you_should_know.PDF\" target=\"_blank\"> <u>Deutsche Bank Research</u></a></ps-link> puts the tokenized real-world asset market at roughly $33 billion. The compliance model works at institutional scale.</p><p>On risk: Private chains have their own risks that often go unexamined. Gatekeeping by competitors who also run the infrastructure. Unilateral rule changes by consortium governance. Single points of failure in operations and decision-making. The question is which risks any given bank prefers to manage.</p><p>Banks evaluating blockchain rails should ask three questions. Who controls the network? What are their incentives today? How will those incentives change as the network gains adoption?</p><p>The answers look different for proprietary versus public infrastructure. And unlike software vendors that can be replaced with enough effort, blockchain rails create path dependencies. Assets issued on one network, integrations built on one protocol, processes designed for one architecture. Switching costs compound over time.</p><p>This isn't ideology. It's structural economics: who captures value, who sets rules, whose interests the system serves. Banks have been on the wrong end of that equation before. They don't have to be again.<br/></p></div>",
            "link": "https://www.americanbanker.com/opinion/banks-need-to-choose-carefully-between-public-and-private-blockchains",
            "pub_date": "2026-02-27 20:36:18",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BankThink Banks need to rethink how they train staff to fight financial crime",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><p></p><ul><li><b>Key insight: </b>Financial crime is evolving at a pace that far outstrips the education of bankers charged with combating them. That needs to change.</li><li><b>What's at stake: </b>The risk is now a board-level issue, a geopolitical variable and a reputational threat. </li><li><b>Forward look: </b>The solution lives inside the institution. Not in the abstract, but in how compliance training is funded, prioritized and maintained.</li></ul><p>The fight against<ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/tag/financial-crimes\" target=\"_blank\"> <u>financial crime</u></a></ps-link> has become one of the most strategically exposed functions in the financial system, and one where banks are least prepared to evolve at the speed the threat environment now demands. It's not because people don't care. It's because the infrastructure around them was built for a different era.</p><p>Unlike other core finance disciplines, financial crime compliance has never benefited from a clearly defined or standardized entry pipeline. There is no established academic pathway, no consistent early‑career recruiting ecosystem, and only a small number of universities that offer programs meaningfully aligned with the realities of the field. As a result, the profession lacks the kind of structured feeder system that underpins talent development elsewhere in finance. Most professionals arrive mid-career. Some come from audit or law enforcement. Many land in compliance roles as a lateral move or are appointed to lead teams with little prior domain exposure. There are superstars in the field. But institutionally, the bench is thin.</p><p>This wasn't a critical flaw when the field was more narrowly defined. For years, financial crime was largely<ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/opinion/anti-money-laundering-rules-in-the-us-need-an-overhaul\" target=\"_blank\"> <u>covered by AML</u></a></ps-link>, know your customer and periodic risk reviews. Today, those boundaries are gone. Fraud, laundering, sanctions evasion, geopolitics and national security are converging into a single risk surface. The same team may now be asked to identify fraud tied to Southeast Asia's scam networks, respond to a sanctions designation from the<ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/opinion/fincen-should-reassert-its-control-over-anti-money-laundering-policy\" target=\"_blank\"> <u>Treasury Department</u></a></ps-link>, assess exposure to Russian logistics flows, and detect trade-based laundering through crypto rails. This is no longer a technical niche. It's a front-line function in a high-velocity threat environment.</p><p>What makes the problem harder is that the threat evolves faster than institutional learning cycles. Financial crime actors change tactics constantly. When methods are flagged, they are replaced. Laundering corridors shift. Evasion networks adapt. New typologies emerge in weeks, not years. The response from most institutions? Training modules that refresh annually, at best.</p><p>Over the past 12 months, the gap has widened. The second Trump administration has brought a dramatic shift in enforcement posture. Some priorities have been relaxed; others have hardened. Sanctions, once static, are now a central pillar of statecraft and diplomacy. Maritime evasion has exploded. Narcotics flows, trade finance and sovereign risk have become deeply entangled. And yet, in many institutions, the training cycle has not meaningfully changed. People are still being trained for yesterday's problems in tomorrow's environment.</p><p>This isn't just a U.S. issue. Globally, we're watching the same trend play out: growing exposure paired with a shallow pool of professionals trained to manage it. Compliance teams are over-extended. Specialist roles are rare. Interdisciplinary learning between sanctions, fraud and AML is even rarer. And the idea that geopolitical context should be part of a compliance team's day-to-day analysis is still treated as optional in too many organizations.</p><p>The academic pipeline won't solve this. If there were strong demand for financial crime programs, universities would have already expanded them. Instead, some of the few that exist are being wound down. This isn't a critique of academia. It's a recognition of pace. The problem isn't that formal training is bad, it's that it can't keep up.</p><p>Which means the solution lives inside the institution. Not in the abstract, but in how compliance training is funded, prioritized and maintained. If you accept that financial crime evolves rapidly, and that the people charged with managing it are often underprepared, then the response must be built around continuity, not compliance cycles. Learning has to be embedded, and it has to move.</p><p>Baseline expectations need to change. Fraud, sanctions and laundering cannot be taught in siloes. They intersect in practice. They should intersect in training. Governance functions should abandon the notion that training is something to be resolved through periodic refreshes or static modules. Instead, it must be approached as a dynamic, continuously evolving discipline — one that draws directly from real-time threat intelligence and responds to shifting risk patterns in near-term cycles. Senior executives should not be briefed after the fact; they should be embedded in that process. Exposure isn't limited to staff-level decision-making. Boards must understand how financial crime exposure changes quarter to quarter, because that's how fast it's moving now.</p><p>What makes this urgent isn't just the scope of the threat, it's the mismatch in pace. The institutions being exploited aren't necessarily incompetent. They're just static. And in an environment that's defined by movement, static behavior is the weakest position you can take.</p><p>Every headline about a fraud breach, a sanctions violation or a laundering scandal is usually followed by the same internal realization: The controls didn't fail. The understanding of risk did. The signals were missed not because the tools weren't working, but because the training that governs how those tools are interpreted hadn't kept up. That is a preventable failure.</p><p>The answer isn't more headcount. It's sharper focus on the infrastructure of learning. Financial crime risk is now a board-level issue, a geopolitical variable and a reputational threat. The speed at which that risk changes requires systems that move with it.</p><p>Compliance is often described as a function of enforcement. But in the current environment, it functions more like memory. It either remembers how the threat actually operates, or it doesn't. And when it forgets, that's when institutions fall behind.</p><p>The risk isn't being wrong. It's being too slow to see the change.</p><p>And right now, that's exactly where too many institutions are sitting.<br/></p></div>",
            "link": "https://www.americanbanker.com/opinion/banks-need-to-rethink-how-they-train-staff-to-fight-financial-crime",
            "pub_date": "2026-02-27 20:36:18",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Judges seem inclined to allow CFPB RIFs — if there's a plan",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><ul class=\"rte2-style-ul\"><li><b>What's at Stake: </b>The CFPB's top managers want to fire 90% of the staff, which would both dramatically reduce the agency's headcount and severely cripple the Trump administration's rulemaking and supervisory agenda. </li><li><b>Key Insight:</b> A preliminary injunction issued by a district court was a necessary judicial \"stop gap\" measure to prevent the CFPB's operations from effectively ceasing. </li><li><b>Forward Look:</b> Experts say that if the government presented a credible plan to run the agency and abide by its legally required duties and functions with as small a workforce as it envisions, it would likely prevail in court. </li></ul><p>Federal appeals court judges hinted at a potential solution to the contentious showdown between the Consumer Financial Protection Bureau and the National Treasury Employees Union that could keep the agency alive.</p><p>During oral arguments Tuesday, judges on the U.S. Court of Appeals for the District of Columbia appeared poised to find a middle ground in a dispute that has wended its way through the lower courts for over a year. The move challenges the Trump administration's uncompromising refusal to scale back a mass firing, or reduction in force, of the CFPB staff, and potentially force acting CFPB Director Russell Vought to uphold the agency's legally required functions. </p><p>That solution was this: If the CFPB presents a credible plan to run the agency and fulfill its legal duties, the judges will remand the case back to the district court, and an injunction could be modified to allow a scaled-back round of firings.</p><p>\"There was a real willingness to try to come to a resolution of the case that works for the long-term,\" said Brad Lipton, director of corporate power and financial regulation at the Roosevelt Institute, and a former CFPB senior advisor. </p><p>That solution, Lipton said, would be \"in accordance with the separation of powers,\" and would allow the existing injunction that has stopped the CFPB's leadership from firing up to 90% of the agency's staff to be narrowed, allowing for some firings. </p><p>Over three hours of heated arguments Tuesday, judges floated a compromise: The CFPB could proceed with a scaled-back reduction in force, or RIF, but not without certain assurances. Legal experts noted that the Department of Justice under the Trump administration has failed in many cases to abide by court rulings it disagrees with, causing it to lose credibility with the judiciary. </p><p>Eric McArthur, a DOJ deputy assistant attorney general, reiterated during the hearing that acting CFPB Director Russell Vought's actions last year did not constitute a policy or even a final agency action. Disputes by federal employees must be channeled to the Merit System Protection Board, McArthur claimed, though the board itself has been caught up in a lawsuit of its own. After its lone Democratic appointee, Cathy Harris, was fired by President Trump last year, she sued the administration arguing that her termination was unlawful. An appeal court sanctioned her removal, but her absence has left the board without a quorum and a long backlog of cases to review. The ruling is out on appeal.</p><p>Crucially, some experts warn that allowing a RIF to continue could cripple the CFPB's ability to rewrite rules and perform effective supervision, two legally required functions. </p><p>\"There have been some mixed signals about the administration's intentions for the CFPB,\" said Chris Willis, a partner at the law firm Troutman Pepper Locke. \"The agency is pursuing a number of policy initiatives and rulemaking efforts that it presumably wants to complete. It has recently announced that it's going to re-engage in supervisory exams. But, there have been statements by the agency's leadership that the CFPB should be shut down completely.\"</p><p>Several experts said the agency is caught in a pickle. On the one hand, the Trump administration wants to use the agency to deregulate, which involves reissuing rulemakings and pursuing other regulatory efforts such as debanking and virtual supervisory exams. On the other hand, acting CFPB Director Russell Vought has <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/how-the-trump-administration-has-neutralized-the-cfpb\" target=\"_blank\"><u>stated explicitly</u></a></ps-link> that the agency is unconstitutional and should not exist. </p><p>Christa Bieker, a partner at Mayer Brown, said she has seen an uptick in dormant investigations being reopened by the CFPB, which suggests the agency's leadership is moving forward on some level. </p><p>\"We're seeing the CFPB slowly restart some of these investigations after a year of dismissing many cases with prejudice and terminating existing consent order obligations,\" Bieker said. \"Are they going to have enough people to continue these cases? Or are they going to decide to fire 90% of employees or come up with some other plan where they keep more staff? It's really unclear at this time.\"</p><p>The National Treasury Employees Union sued the CFPB's acting Director Russell Vought last February after he issued a <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/cfpb-workers-told-to-stand-down-stop-all-work\" target=\"_blank\"><u>stop-work order</u></a></ps-link>, told staff to halt all work, closed the bureau's headquarters and locked out its employees. The case is one of dozens in litigation against the Trump administration's ongoing efforts to fire federal workers and unilaterally fire Democrats on independent regulatory boards. </p><p>At oral arguments on Tuesday, judges noted the breathtaking speed with which Vought sought to dismantle the CFPB, a process so swift that the agency would have been eliminated within 30 days if the district court had not issued an injunction barring mass firings, the union claims.</p><p>McArthur dropped a bombshell during the last 10 minutes of the hearing, saying the CFPB's leadership has a plan to issue a RIF while also performing the agency's legally required functions. The mere mention of a plan immediately perked up the ears of several of the judges. </p><p>\"The planning has continued, and if it's of interest to the court, that's something that I could take back to the CFPB,\" McArthur said. \"The planning for what to do with this agency if and when an injunction is vacated or modified so as to allow us to proceed with the RIF, which is a lawful measure that the agency is allowed to take.\"</p><p>Judge Patricia Millett replied: \"Are you offering to share with us your plans for what to do if the injunction is lifted?\"</p><p>\"If that's something of interest to the court, I can certainly take that back to my client,\" McArthur said, referring to the CFPB.</p><p>The oral arguments centered on two critical issues: Whether the president can shut down an agency created by Congress, and whether federal courts have the power to halt a unilateral dismissal of employees with a preliminary injunction.</p><p>Several judges suggested the litigation could be resolved easily by remanding the case back to District Court Judge Amy Berman Jackson of the District Court for the District of Columbia to narrow the injunction that she <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/judge-grants-cfpb-preliminary-injunction-halts-mass-firings\" target=\"_blank\"><u>granted the union</u></a></ps-link> last March. </p><p>Judge Justin Walker asked the government what it would do if the D.C. Circuit sided with the union in finding that the CFPB's management had, in fact, taken a final action by telling employees last February to stop work with the intention of firing nearly all of the agency's employees. </p><p>\"If we were to vacate the injunction as overbroad, and then on remand, the District Court were to conclude that the Feb. 10 email was final agency action, and the district court then vacated that final agency action and did nothing more than that, what would you do?\"</p><p>McArthur replied: \"I don't know exactly what we do, but that sounds like not something that we would have a particular objection to.\"</p></div>",
            "link": "https://www.americanbanker.com/news/judges-seem-inclined-to-allow-cfpb-rifs-if-theres-a-plan",
            "pub_date": "2026-02-27 19:05:44",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "RBC raises provisions again amid renewed tariff uncertainty",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><ul class=\"rte2-style-ul\" style=\"margin-top:0;margin-bottom:0;padding-inline-start:48px;\"><li><b>Key Insight</b>: Canada's largest bank is once again bracing for pressure on the Canadian economy from U.S. tariffs.</li><li><b>Supporting Data</b>: In the quarter ending Jan. 31, RBC raised provisions for credit losses by 4% year over year.</li><li><b>Expert Quote</b>: \"While we believe the Canadian economy has demonstrated resilience, factors such as U.S. trade policy … add ongoing uncertainty to our outlook,\" said RBC Chief Risk Officer Graeme Hepworth.</li></ul><p></p><p></p><p></p><p>The Royal Bank of Canada is back where it was a year ago — bracing for possible trouble from U.S. tariffs.</p><p>Though the Toronto-based bank beat analysts' earnings expectations in the quarter that ended Jan. 31, it also raised provisions for credit losses to CA$1.09 billion, up 4% from one year ago. Its allowance for credit losses rose to CA$7.77 billion, up 12% year over year.</p><p>Those actions were taken at least in part to address concerns over U.S.-Canadian trade relations, as RBC Chief Risk Officer Graeme Hepworth made clear Thursday.</p><p>\"Looking ahead, while we believe the Canadian economy has demonstrated resilience, factors such as U.S. trade policy … and geopolitical tensions add ongoing uncertainty to our outlook,\" Hepworth said during a call with analysts. \"Against this backdrop, we have maintained a prudent approach with our allowances.\"</p><p>In March 2025, U.S. President Donald Trump <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/bankers-in-both-canada-u-s-mull-threat-of-trade-war\" target=\"_blank\"><u>imposed a 25% tariff</u></a></ps-link> on most Canadian goods, which he later raised to 35%. Since then, the new Canada-United States-Mexico Agreement exempted most Canadian goods from that tariff. Then came <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/supreme-court-strikes-down-trumps-liberation-day-tariffs\" target=\"_blank\"><u>this month's U.S. Supreme Court decision</u></a></ps-link> finding that last year's tariffs were illegal, though Trump vowed to revive them by other means. </p><p>The upshot for Canada's businesses has been a heavy dose of uncertainty.</p><p>RBC remains \"cautiously optimistic\" about the Canadian economy, Hepworth said. But the scenarios the bank has prepared for include a possible \"severe North American recession driven by escalating global trade wars,\" he said.</p><p>CEO Dave McKay echoed these concerns.</p><p>\"The Canadian economy remained resilient through the elevated uncertainty from persistent and evolving geopolitical and trade tensions,\" McKay said. \"That said, the impact from tariffs on the economy varies depending on the clients or sectors. We are seeing strong profitability and improving productivity for many of our corporate clients, while commercial clients in tariff-impacted sectors and geographies are facing headwinds.\"</p><p>This is not the first time RBC has raised its provisions amid tariff concerns. In the first quarter of 2025, shortly after Trump began his second term, the bank <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/rbc-raises-loss-provision-amid-concern-over-u-s-tariffs\" target=\"_blank\"><u>increased its provision for credit losses</u></a></ps-link> to CA$1.05 billion, a CA$237 million jump from the year before.</p><p>Going forward, RBC is hoping for the best but preparing for the worst. Its base outlook, Hepworth said, is still that tariffs and Canada-United States-Mexico-Agreement-related exemptions will remain at their current levels.</p><p>For the quarter, RBC's earnings per share reached CA$4.03, beating analysts' consensus estimate of CA$3.81, according to S&amp;P. Net income was also a beat, rising to CA$5.78 billion, above estimates of CA$5.33 billion.</p><p>Canada's largest bank got solid contributions from its U.S. operations. Revenue from U.S. wealth management, including at the American subsidiary City National Bank, rose to US$1.93 billion in the first quarter, a 12% increase from one year before.</p><p>RBC acquired City National in 2015, but starting in 2023, the Los Angeles-based bank struggled starting amid rising interest rates and regulatory problems. By 2025, City National's net income and credit outlook were <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/rbcs-city-national-bank-is-back-on-front-foot-ceo-says\" target=\"_blank\"><u>improving</u></a></ps-link> — a comeback that has continued into this year. </p><p>In the first quarter of 2026, City National's net income rose to US$143 million, RBC said during the call, more than doubling year over year.</p><p>\"We are very excited about being on a growth front-footing right now with that business, profitability-wise and customer growth-wise,\" McKay said.</p></div>",
            "link": "https://www.americanbanker.com/news/rbc-raises-provisions-again-amid-renewed-tariff-uncertainty",
            "pub_date": "2026-02-27 06:16:02",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nubank reports 45% revenue increase in latest earnings",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><p>Nubank announced its fourth quarter and full year earnings results after market close on Wednesday, reporting strong growth but slightly missing Wall Street earnings estimates.</p><p>The Brazilian neobank reported approximately $4.9 billion in revenue for the quarter ending December 31, 2025, a 45% increase year over year from $3.1 billion in 2024. Full year revenue for 2025 was $16.3 billion, also a 45% increase year over year from 2024's $11.7 billion.</p><p>Total operating expenses for the year were $2.8 billion, an 11% increase year over year from $2.5 billion in 2024. Nubank executives noted on the company earnings call Wednesday night that the Q4 earnings report included multiple one-time expenses, such as $22 million of transition expenses for the company's <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/nubank-co-founder-cristina-junqueira-sets-sights-on-u-s-market\" target=\"_blank\"><u>2026 return-to-office</u></a></ps-link> decision and a $25 million one-off expense towards a sector-wide deposit insurance fund in Mexico.</p><p>Net income for the full year came out to $2.9 billion in 2025, a 37% increase year over year from $2 billion in 2024.</p><p>Earnings per share came out to $0.58, slightly under Wall Street analyst consensus estimates of $0.59 per share, according to S&amp;P Capital.</p><p>Nu Holding's total credit portfolio expanded 40% year over year and 11% quarter over quarter to $32.7 billion, according to its earnings statement. </p><p>The neobank launched its AI-powered credit underwriting model, nuFormer, in late 2025 for credit underwriting in Brazil. The model boosted Nubank's largest quarterly gain in credit card market share in ten quarters, according to the company. The nuFormer model will also be expanded to lending in Brazil and credit cards in Mexico, according to Nubank's earnings statement.</p><p>A Nubank representative told American Banker that starting this quarter, the earnings report now includes \"a consolidated view of credit quality across the entire Nu platform.\" Previous earnings figures only included the neobank's Brazilian operation.</p><p>Nubank has established customer bases in Mexico and Colombia, and the fintech is also moving forward to establish a U.S. bank division after <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/nubank-receives-approval-for-us-bank-charter\" target=\"_blank\"><u>receiving</u></a></ps-link> a conditionally approved de novo bank charter from the OCC in January. Since the fourth quarter and fiscal year ended in December 2025, this earnings cycle was not impacted by the U.S. charter approval.</p><p>\"During 2026, we will lay the operational groundwork for our U.S. opportunity, building on the conditional bank charter approval,\" Nubank CEO David Velez told investors on the company earnings call Wednesday night. \"Latin America remains our primary growth engine.\"</p><p>Nubank co-founder <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/nubank-co-founder-cristina-junqueira-sets-sights-on-u-s-market\" target=\"_blank\"><u>Cristina Junqueira</u></a></ps-link>, recently appointed as the CEO of Nu's U.S. bank division, previously told American Banker that she is working on expanding Nubank's physical presence in the U.S. by establishing additional office spaces and hiring more employees. Nubank did not disclose specific figures regarding its U.S. expansion plans in its earnings.</p><p>\"There are team increases that we're having for the U.S. launch, but I wouldn't say they're expected to be significant in 2026,\" Velez said in the earnings call.</p><p>Although Nubank will be opening a U.S. division operating as a bank under the de novo charter within the next couple of years, the Brazil-based parent company Nu Holdings does not yet have a banking license from Brazil and currently operates as a nonbank fintech. Nubank announced in December that it <ps-link><a class=\"Link\" href=\"https://international.nubank.com.br/company/nubank-intends-to-obtain-banking-license-in-brazil-in-2026/\" target=\"_blank\"><u>intends to acquire</u></a></ps-link> a Brazil banking license in 2026. Nubank did not comment on the Brazil bank license in its earnings statement or call.</p><p>Market analysts viewed Nubank's earnings positively, but acknowledged that upcoming expenses may have a negative short-term impact on the neobank's stock prices.</p><p>\"We remain constructive on geo growth opportunity and improving credit models as a source of additional growth/profitability,\" Keybank analysts wrote in a research note. \"Messaging on 2026 spend is likely a moderately negative surprise, but incremental operating leverage is still on the table.\"</p><p>Citi analysts wrote in a research note that the bank continues to grow at a strong pace, citing \"a strong quarter by Nubank on top-line, with an acceleration in loan portfolio growth and net interest income. However, cost of risk and operating expenses mud[dy] the picture. Expenses outpaced fees, creating some pressures on earnings before taxes.\"</p><p>Nubank's stock price was down by about 9% as of Thursday afternoon.</p></div>",
            "link": "https://www.americanbanker.com/news/nubank-reports-45-revenue-increase-in-latest-earnings",
            "pub_date": "2026-02-27 05:45:31",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Washington's FS Bancorp to enter Portland with deal",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><ul><li><b>Supporting data:</b> FS Bancorp in Mountlake Terrace, Wash., announced its first whole-bank acquisition since 2019 on Thursday. </li><li><b>Key insight:</b> The deal for the four-branch Pacific West Bank moves FS and its 1st Security Bank subsidiary into the Portland, Ore., market. </li><li><b>Expert Quote:</b> \"This partnership with Pacific West represents a compelling step forward in our continued expansion across the Pacific Northwest.\" — FS President Matthew Mullet</li></ul><p>FS Bancorp, the Mountlake Terrace, Wash.-based holding company for 1st Security Bank, has agreed to pay $34.6 million in cash and stock for Pacific West Bank in West Linn, Ore. </p><p>Though small in dollar terms, the deal, which is expected to close in the third quarter, has important strategic implications, since it would give FS its first presence in Portland. It also marks the first whole-bank acquisition by FS since 2019, when the company <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/anchor-in-wash-finds-new-buyer-after-reg-issue-snagged-prior-deal#:~:text=Anchor%20in%20Wash.-,finds%20new%20buyer%20after%20reg%20issue%20snagged%20prior%20deal,of%20Anchor's%20tangible%20book%20value.\" target=\"_blank\"><u>acquired</u></a></ps-link> the $480 million-asset Anchor Bank in Lacey, Wash.</p><p>The deal comes at a time of increased bank-merger activity, with institutions scrambling to take advantage of a <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/need-for-speed-faster-deal-timelines-may-spur-more-bank-m-a\" target=\"_blank\"><u>more favorable regulatory environment</u></a></ps-link>. In 22 deals announced through Feb. 23, buyers paid an average price-to-tangible-book-value of 170% compared to an average of 144% in 2025, according to Seaport Research Partners senior analyst Laurie Havener Hunsicker.</p><p>\"We think the bull market still has legs,\" Hunsicker wrote Monday in a research note. \"The strength in stock prices, the pent-up demand to do deals, and the substantially faster regulatory approval process will continue to accelerate M&amp;A.\" </p><p>The $386 million-asset Pacific West operates four Portland-area branches. The region is home to about 2.5 million people and 45,000 businesses, most of them small enterprises with 50 or fewer employees, according to the Census Bureau. </p><p>The combined institution would have $3.6 billion of assets, $2.98 billion of loans and $3.03 billion of deposits. Its 0.5% share of Portland's $65.6 billion deposit market leaves plenty of room to grow. </p><p>\"This partnership with Pacific West represents a compelling step forward in our continued expansion across the Pacific Northwest,\" FS President Matthew Mullet said Wednesday in a press release. \"Pacific West has built a customer-focused commercial banking franchise with deep roots in the Portland-Vancouver metro area. Combining our organizations brings together complementary strengths that enhance our ability to serve our customers and communities.\"</p><p>Mullet, who served previously as the organization's chief financial officer, <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/washingtons-1st-security-taps-numbers-guy-as-next-in-line\" target=\"_blank\"><u>was named CEO</u></a></ps-link> of 1st Security Bank in August. The Federal Reserve Bank of San Francisco appointed Mullet to the board of directors of its Seattle branch earlier this month. </p><p>The deal's financial highlights include expected growth in earnings-per-share of 7.4% in 2027. Tangible book value dilution is 2.2% with a projected earn-back of less than two-and-one-half years. First Security is projecting cost savings equal to 30% of Pacific West's noninterest expenses, which totaled $10.5 million in 2025, according to the Federal Deposit Insurance Corp. </p><p>FS is estimating a loan discount of $4.2 million or 1.51% of Pacific West's $276.6 million loan portfolio in assessing its fair value mark. </p><p>Pacific West reported net income totaling $650,000 in 2025, powered by 25% year-over-year growth in deposits. Pacific West lost money in 2024 and 2024, however. </p><p>Now, merging with FS will give its bankers and clients access to more capital, improved technology and a wider product set, CEO Jason Wessling said in the press release. </p><p>\"We are excited to join FS Bancorp, a company that shares our commitment to relationship banking and community engagement,\" Wessling said. </p></div>",
            "link": "https://www.americanbanker.com/news/washingtons-fs-bancorp-to-enter-portland-with-deal",
            "pub_date": "2026-02-27 05:36:19",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chime beats Q4 estimates, leans into Trump Accounts",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><ul class=\"rte2-style-ul\" style=\"margin-top: 0px; margin-bottom: 0px; padding-inline-start: 48px;\"><li><b>Supporting data:</b> Chime reported $596 million in fourth-quarter revenue, representing a 25% year-over-year increase.</li><li><b>Expert quote:</b> JPMorgan analyst Tien-tsin Huang noted that the fourth-quarter results came in \"ahead of expectation as high-quality [customer growth] supports engagement and monetization.\"</li><li><b>Forward look:</b> Following a strong fourth quarter, Chime anticipates achieving GAAP profitability in 2026.</li></ul><p><i>Overview bullets generated by AI with editorial review</i></p><p>Chime Financial reported strong fourth-quarter and full-year earnings Wednesday evening, beating analyst expectations and setting up to reach profitability in 2026 while expanding its product suite to include new Trump-branded children's investment accounts.</p><p>The San Francisco-based digital bank posted $596 million in fourth-quarter revenue, a 25% year-over-year increase, and an adjusted EBITDA of $57 million.</p><p>The company is leaning heavily into new products like its proprietary core processor, its credit card, and so-called Trump Accounts to sustain momentum.</p><p>For the U.S. banking industry, Chime's continued growth and lower operating costs pose a competitive threat as the digital bank captures market share in primary checking accounts and wades into the nascent Trump Account program that traditional banks are also targeting.</p><h2 class=\"cms-heading-h2 HeadingH2\">Financial performance and outlook</h2><p>Chime beat fourth-quarter Wall Street consensus estimates, which had projected roughly $578 million for revenue and $46 for adjusted EBITDA, based on 13 analyst estimates collected by S&amp;P Global Market Intelligence.</p><p>The company reported a fourth-quarter net loss of $44.8 million (a net earnings per share of -$0.12) and a full-year net loss of $1.01 billion.</p><p>The full-year net loss was heavily driven by $928 million of stock-based compensation expense and related payroll taxes linked to the company's initial public offering. However, the company generated $2.19 billion in full-year revenue, up 31% from the previous year, and reached an adjusted EBITDA of $127 million.</p><p>Chime issued full-year 2026 guidance projecting revenue between $2.63 billion and $2.67 billion and an adjusted EBITDA of $380 million to $400 million.</p><p>Analyst expectations for the next year align with this guidance; the consensus mean revenue expectation is $2.64 billion and EBITDA at $387 million, according to S&amp;P's analysis.</p><p>Chime expects \"to achieve GAAP profitability in 2026,\" according to a Wednesday press release, and analysts agree, expecting $65 million in net income in the coming year.</p><h2 class=\"cms-heading-h2 HeadingH2\">Analysts applaud the results</h2><p>Stock analysts tracking the company praised the earnings report, noting that Chime's underlying growth metrics look healthy.</p><p>\"This was a 'show me' quarter for investors, and Chime delivered,\" according to a Wednesday research note from Piper Sandler senior research analyst Patrick Moley.</p><p>JPMorgan analyst Tien-tsin Huang said the fourth-quarter results came in \"ahead of expectation as high-quality [customer growth] supports engagement and monetization,\" according to a Thursday report.</p><p>Huang noted that Chime's member growth of 500,000 for the quarter \"came in better than anticipated while revenue and EBITDA were nicely ahead of estimates.\"</p><p>B. Riley Securities analyst Hal Goetsch wrote that the company saw a \"solid beat\" and issued 2026 guidance \"well ahead of our estimates,\" according to a Thursday note.</p><h2 class=\"cms-heading-h2 HeadingH2\">Leaning into Trump Accounts</h2><p>Chime is also pushing to capture a piece of the new Trump Accounts program.</p><p>Created by the Working Families Tax Cuts under the One, Big, Beautiful Bill Act, the program allows parents to open traditional individual retirement accounts for their eligible children. The federal government will provide a one-time $1,000 seed deposit for eligible children born between 2025 and 2028, and individuals and employers can contribute up to $5,000 annually.</p><p>During his State of the Union address, President Donald Trump described the program as providing \"tax-free investment accounts,\" but financial planners point out that the accounts actually function like traditional IRAs, meaning pretax funds and earnings will be subject to regular income taxes upon withdrawal.</p><p>To capture this market, Chime integrated the enrollment process — IRS Form 4547 — directly into its tax filing app to make the accounts \"more accessible for working families,\" according to a Feb. 13 press release from the company. The company also pledged to match the $1,000 government contribution for the eligible children of its own employees.</p><p>Other financial institutions are jumping in, as well. Banks and investment firms including JPMorgan Chase, BlackRock, SoFi, Charles Schwab, and BNY have announced programs to match employee contributions to the accounts.</p><h2 class=\"cms-heading-h2 HeadingH2\">Chime now on its own core</h2><p>Chime finalized a multi-year migration to its proprietary payment processor and ledger, ChimeCore, in the fourth quarter of 2025.</p><p>The digital bank is \"now 100% on our own tech stack,\" said Christopher Britt, CEO of Chime, during the Wednesday earnings call. Britt noted that the new system differentiates Chime from traditional banks and other financial technology companies that rely on inflexible and expensive third-party processors.</p><p>Company executives expect the migration to reduce transaction processing costs by roughly 60%, which supports a long-term gross margin target of 90%, according to a Wednesday press release from Chime.</p><p>As part of the transition, Chime moved all member accounts to ChimeCore on Nov. 4 and ceased using its former third-party processor, Galileo. The company incurred an approximately $32.7 million one-time termination fee during the fourth quarter to sever the agreement, though the contractual relationship will technically continue until March 2026, according to a November financial filing from the company</p><h2 class=\"cms-heading-h2 HeadingH2\">Other major developments</h2><p>During the fourth quarter, Chime also pushed into the corporate benefits space, launching Chime Enterprise to provide fee-free financial tools and earned-wage access to employees at companies like Cedarhurst Senior Living, eXp Realty, and Lakeshore Recycling Systems.</p><p>In the sports world, Chime secured sponsorships to feature its logo on the jerseys of the Portland Fire women's basketball team and became the official retail banking partner of Major League Soccer.</p><p>The company reorganized its executive ranks in December, promoting Mark Troughton to president, Janelle Sallenave to chief operating officer, and Vineet Mehra to chief growth officer.<br/></p></div>",
            "link": "https://www.americanbanker.com/news/chime-beats-q4-estimates-leans-into-trump-accounts",
            "pub_date": "2026-02-27 05:10:33",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TD reports progress on turnaround as AML efforts press on",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><ul><li><b>Key insight:</b> TD's efforts to shrink its U.S. balance sheet are nearing the end, as the bank expects to beef up its lending in certain areas throughout the year.</li><li><b>Supporting data:</b> While total stateside loans were down some 11% from the previous year, lending rose by more than 2% in the sectors where TD is targeting growth.</li><li><b>Forward look:</b> Still, the tailwind that the U.S. unit got from certain balance-sheet repositioning efforts isn't expected to be as strong going forward as it was in the first quarter.</li></ul><p>TD Bank Group says it's on track to resume growing its U.S. loan portfolio later in 2026, about two years after regulators capped the size of its American operations.</p><p>The Toronto-based company has been running off certain U.S. portfolios, while also building up stateside business in what it calls \"core\" lending areas, such as middle market, consumer and credit cards.</p><p>During the quarter that ended on Jan. 31, U.S. revenue rose from the same period a year earlier, TD reported Thursday. Better credit quality and a balance-sheet restructuring were factors in the improvement.</p><p>\"You put the revenue momentum that we're enjoying now, the pricing discipline we put in place, the expense focus that we have, and will continue to materialize over the rest of the year — I feel quite confident with regards to the outlook for the rest of the year,\" said Leo Salom, who leads TD's American operations, during the company's earnings call on Thursday.</p><p>TD's stock was up some 1.7% on Thursday afternoon, as the bank stuck to the expense <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/tds-u-s-leader-lays-out-ambitious-post-scandal-goals\" target=\"_blank\"><u>guidance it had offered last year</u></a></ps-link> and logged revenue growth across its operations.</p><p>In the U.S., the company's revenue of $2.9 billion was up 8% on an adjusted basis from the prior year. Reported net income excluding the impact of the company's stake in Charles Schwab rose to $747 million, up from just $105 million in the first quarter of 2025. The massive difference was largely due to a change in how certain tax benefits are accounted for, along with stronger credit quality.</p><p>John Aiken, an analyst at Jefferies, said in a note that TD's first quarter, which ended Jan. 31,  was a \"positive\" look, with the bank \"moving forward on its goals.\"</p><p>TD has been seeking to turn around its U.S. operations after <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/td-pleads-guilty-to-money-laundering-conspiracy-hit-with-asset-cap\" target=\"_blank\"><u>historic compliance failures</u></a></ps-link> for which law enforcement and regulators required it to pay more than $3.1 billion and keep its U.S. assets under $434 billion. The scandal also led to a change at the top of the parent company, with Raymond Chun taking over as president and CEO.</p><p>Since Chun's appointment, the bank has been on a mission not only to <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/td-bank-shrinks-by-10-in-u-s-to-comply-with-asset-cap\" target=\"_blank\"><u>realign its American operations</u></a></ps-link>, but also to structurally reduce costs across its businesses.</p><p>The company has reduced its U.S. branch count by 7.5% since Jan. 31, 2025, and has sold or run off portfolios in its \"non-core\" businesses, including point-of-sale finance, correspondent lending, commercial auto deal lending and export and import lending.</p><p>Average loans in non-core U.S. businesses fell from $33 billion in the first quarter of 2025 to $11 billion in the same period this year.</p><p>Salom said Thursday that the loan-repositioning work, along with repricing actions across deposit and loan books, were tailwinds to TD's U.S. business during the first quarter. The effects of those tailwinds may not be as strong going forward, he added.</p><p>He also said that \"economic momentum\" in the U.S. was leading to solid loan growth in the areas where TD wants to expand. While total average loans in the States were down about 9% from the previous year, core average loans were up about 2.5%, the company said in its earnings presentation.</p><p>Middle-market loans grew 4%, with a 15% increase in pipelines for that business, Salom said. TD's specialty higher-education loan book also increased by about 5%, he said.</p><p>The bank has been investing in certain parts of its cards business since 2022, and Salom said that U.S. proprietary credit card balances were up 15% year-over-year.</p><p>\"Where we're seeing a little bit of sluggishness in the U.S. market broadly is that the small business and lower-end community banking level,\" Salom said. \"I think that those businesses are just more susceptible to the trade uncertainty, the supply-chain disruptions, and the current state of interest rates. So I think there we're still seeing some muted growth.\"</p><p>Still, TD is targeting a return to U.S. net loan growth in the third quarter, Salom said.</p><p>Earlier this month, the bank took another step in sharpening its focus on credit cards by converting its Nordstrom card portfolio from the department store chain's servicing platform onto its own. The move, which TD had teased for months, will give the bank a higher share of revenue, along with higher expected losses. </p><p>The bank reiterated Thursday that it plans to spend $1 billion across 2025 and 2026 on <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/td-has-completed-majority-of-u-s-aml-remediation\" target=\"_blank\"><u>overhauling its U.S. anti-money-laundering controls.</u></a></ps-link> The composition of that spending will gradually shift, though, toward validating the progress that the company has made, Salom said.</p><p>In December, Salom said that the company had completed the majority of the actions that it had to take, but it still needed to audit and earn the approval of regulators and law enforcement for its enhanced controls.</p><p>On top of its U.S. compliance fixes, the bank will continue to work on revamping its anti-money-laundering controls across the enterprise.</p><p>During the first quarter, TD also completed one major restructuring effort that it began last year, which was part of its mission to reduce expenses.</p><p>Across the enterprise, the bank has logged 886 million in Canadian dollars of total pre-tax charges from the restructuring program, which included layoffs, real-estate optimization and business wind-downs. TD expects the changes to drive C$500 million of pre-tax savings in 2026, plus fully-realized pre-tax annual cost savings of C$775 million.</p><p>Chun said Thursday that he expects the bank's gains from artificial intelligence to beat its projections from September. Last fall, TD said it expected AI tools to cut C$500 million in expenses and drive C$500 million in revenue across the company by 2029.</p><p>But those AI tools are becoming more advanced and more useful than the bank had predicted six months ago, Chun said Thursday.</p><p>\"I do think we're going to get more from the value, from an AI perspective, beyond the billion dollars,\" Chun said. \"We're seeing better momentum than what we had thought.\"</p></div>",
            "link": "https://www.americanbanker.com/news/td-reports-progress-on-turnaround-as-aml-efforts-press-on",
            "pub_date": "2026-02-27 05:05:42",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Senate tees up Housing bill, but what's in it is unclear",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><ul><li><b>Key insight:</b> The core of both the Senate and House versions of the legislation aim to increase the supply of housing, but a slew of bipartisan riders in the House version have been opposed by some Democrats in the upper chamber. </li><li><b>What's at stake:</b> The House version has a number of bank-favored riders, like brokered and custodial deposits, that could still end up in the Senate version. </li><li><b>Forward look:</b> The key point will be what Senate Majority Leader John Thune, R-S.D., is willing to add, and if enough Democrats will support the community bank provisions to reach a compromise with House Financial Services Committee Rep. French Hill, R-Ark. </li></ul><p>WASHINGTON — Senate Majority Leader John Thune, R-S.D., has filed cloture on the Senate's version of a housing affordability package, teeing it up for a vote next week. </p><p>The legislation, sponsored by the Senate Banking Committee chair and ranking member, Sens. Tim Scott, R-S.C. and Elizabeth Warren, D-Mass., previously <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/housing-bills-advance-with-pluses-minuses-for-bankers\" target=\"_blank\"><u>passed out of the committee</u></a></ps-link> unanimously. The Senate has been pressured to move the legislation since the House <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/housing-bill-passes-house-with-community-bank-riders\" target=\"_blank\"><u>passed its own version</u></a></ps-link> earlier this month. </p><p>The House version of the legislation has a number of bank-favored riders attached to it, including provisions on brokered and custodial deposits. </p><p>While the Senate version doesn't include these provisions, Thune's filing sets off a wave of negotiations between the House, Senate and White House over <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/bank-riders-have-murky-future-as-housing-bill-heads-to-senate\" target=\"_blank\"><u>which priorities</u></a></ps-link> will be included in the final version that senators will vote on. House Financial Services Chairman French Hill, R-Ark., has fought to include these sections of his bill, convincing his Democratic counterpart, ranking member Rep. Maxine Waters, D-Calif., to support them, and he is expected to continue to push for them in the next few days. </p><p>\"It is imperative that my Senate colleagues work with the House to deliver a bipartisan housing bill to President Trump's desk — one that reflects the shared priorities of the House, Senate, and White House,\" Hill said in a statement. </p><p>Another item that could be in play is the ban on institutional investors buying up single family homes, a populist plank that has found agreement between parties as disparate Warren and President Donald Trump, who <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/trump-talks-housing-affordability-at-state-of-the-union\" target=\"_blank\"><u>touched on the measure</u></a></ps-link> in his State of the Union address this week. </p><p>It's unclear at this point what version of housing legislation will actually make it to the Senate floor. </p><p>Warren has already opposed the community bank riders. </p><p>\"I'm glad to see the House move forward on housing proposals, but House Republicans should not hold housing relief hostage to push forward several bank deregulatory bills that will make our community banks more fragile while harming consumers, small businesses, and economic growth. Americans need relief from the housing crisis now,\" she said in a statement earlier this month. </p><p>But there still might be enough Democrats interested in the issue to clear the 60-vote threshold necessary to bring the bill to a final vote, making the community bank provisions an attractive sweetener for Senators looking to win over Hill and the House in general. The brokered deposit items have Democratic support on the Senate side, but it's not clear if those lawmakers will agree to put them in the wider housing package. </p></div>",
            "link": "https://www.americanbanker.com/news/senate-tees-up-housing-bill-but-whats-in-it-unclear",
            "pub_date": "2026-02-27 04:45:32",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Exclusive: Lawmakers introduce bipartisan FHLB bond bill",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><ul><li><b>Key insight:</b> A bill offered by Sens. Catherine Cortez Masto, D-Nev., and Todd Young, R-Ind., would allow Federal Home Loan Bank members to set up tax-exempt bonds for community development projects, much the same way they already do for housing projects. </li><li><b>Expert quote:</b> \"For too long, communities across the country have had a hard time raising the funds they need to make improvements to sewer and water systems, hospitals, schools, and more.\" — Sen. Catherine Cortez Masto, D-Nev. </li><li><b>Forward look:</b> With support for community lending on both sides of the aisle, the bill could have a future even if Democrats gain ground in the Senate and House after this year's elections. </li></ul><p>WASHINGTON — A group of bipartisan lawmakers are introducing a bill today that would expand the ability of Federal Home Loan Bank members to support tax-exempt bonds for community development projects. </p><p>The legislation, introduced by Sens. Catherine Cortez Masto, D-Nev., and Todd Young, R-Ind., would let FHLB member institutions to set up tax-exempt bonds — much the way that they're currently allowed to do to support housing-related projects — for other community development infrastructure, such as water and sewage treatment facilities, transportation centers, industrial development, health care facilities or schools. </p><p>The bill, known as the Municipal Investment and Neighborhood Transformation, or MINT, Act, would make such projects eligible for Letters of Credit from Federal Home Loan Bank member institutions. The bill would effectively restore an authority that was granted to the FHLBs as part of the Housing and Economic Recovery Act of 2008. The provision expired in 2010. Extending the provision was, <ps-link><a class=\"Link\" href=\"https://www.cdfa.net/cdfa/cdfaweb.nsf/fbaad5956b2928b086256efa005c5f78/4ee2201461cd76b8862577290057e5c3/$FILE/Community%20Development%20Financing%20Act%20of%202010%20Fact%20Sheet%205-11-2010%20a.pdf\" target=\"_blank\"><u>at the time</u></a></ps-link>, supported by bank trade groups. </p><p>The bill is bipartisan, meaning it has a better chance of passing the tightly divided Congress than it otherwise would be. There's also an appetite — stemming from long-held policy convictions on both sides of the aisle and vocal push from President Donald Trump — to pursue housing-related legislation.</p><p>\"For too long, communities across the country have had a hard time raising the funds they need to make improvements to sewer and water systems, hospitals, schools, and more,\" Cortez Masto said in a statement. \"Our legislation unlocks more options for these communities that were previously unavailable to them and empowers the Federal Home Loan Bank system to better fulfill its mission to support community development.\"</p><p>FHLB legislation could find a home in a housing package or a number of other vehicles in the coming years. With support for community lending on both sides of the aisle, a bill like this doesn't have the same short life span that issues that are quickly becoming more political and could wane as Democrats retake parts of Congress after the midterm elections. </p><p>\"The Federal Home Loan Banks play a critical role in providing reliable liquidity to financial institutions to make local economic projects possible,\" Young said in a statement. \"Our bill will restore a proven financing tool to help lower costs for community development projects in towns across America.\" </p><p>A companion bill is being introduced in the House by Reps. Lisa McClain, R-Mich., and Sam Liccardo, D-Calif. </p><p>\"Communities shouldn't have to pay higher borrowing costs simply because they lack access to Wall Street financing. This bill levels the playing field by giving local lenders the tools they need to help their communities invest in infrastructure, health care, and economic development without putting taxpayers on the hook for higher interest rates. It will help unlock investment where it's needed most,\" McClain said in a statement. </p></div>",
            "link": "https://www.americanbanker.com/news/exclusive-lawmakers-introduce-bipartisan-fhlb-bond-bill",
            "pub_date": "2026-02-27 04:06:24",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OCC proposes comprehensive stablecoin framework",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><p>Key insight: Issuers must hold liquid reserves and capital as well as an additional FDIC-insured operational backstop.</p><p>Supporting data: OCC sets $5 million minimum capital for all new stablecoin issuers.</p><p>Forward look: The rule will be open for 60 days for comment. </p><p>The Office of the Comptroller of the Currency on Wednesday proposed a comprehensive framework for capital and other requirements for payment stablecoin issuers under the GENIUS Act.</p><p>The nearly 400-page <ps-link><a class=\"Link\" href=\"https://occ.gov/news-issuances/news-releases/2026/nr-occ-2026-9a.pdf\" target=\"_blank\"><u>proposed rule</u></a></ps-link> aims to establish federal oversight while supporting innovation in the digital payments ecosystem. The proposal focuses on licensing, operational and reserve requirements, governance, transparency, risk management and capital adequacy, reflecting the agency's objective of fostering a safe and stable stablecoin market without unduly burdening new entrants.</p><p>\"The OCC has given thoughtful consideration to a proposed regulatory framework in which the stablecoin industry can flourish in a safe and sound manner,\" said Comptroller of the Currency Jonathan V. Gould. \"We welcome feedback on the proposal to inform a final rule that is effective, practical and reflects broad industry perspective. The OCC will continue its work to implement the GENIUS Act and provide OCC regulated entities with more opportunities to meet the needs of their customers and communities.\"</p><p>Under the proposal, stablecoin issuers would need to have a federal charter from the OCC to operate as \"permitted payment stablecoin issuers.\" The agency would undergo a case-by-case process for granting issuers licenses, considering each applicant's business model, likely growth trajectory, operational risks and governance. </p><p>The OCC puts emphasis on its ability to flexibly evaluate each model and likened its thinking about stablecoin issuance to that of its current chartering regime for national trust banks. </p><p>\"The overall approach in the proposed rule would provide for an individualized evaluation of each prospective permitted payment stablecoin issuer,\" the proposal notes. \"Consistent with the process the OCC applies when determining minimum capital requirements for chartering national trust banks.\"</p><p>Applicants would be required to demonstrate that their stablecoin activities can be conducted safely, that reserve assets are appropriately managed and that they have systems in place to handle operational disruptions. The OCC also proposes a \"de novo\" period of approximately three years for newly chartered issuers, during which the OCC would monitor operations closely and retain the ability to adjust requirements based on performance or changes in the business model originally applied for.</p><p>The OCC is also proposing implementing a $5 million minimum capital requirement that sets a floor for new stablecoin issuer entrants, regardless of size. </p><p>\"This floor is primarily intended to ensure that every proposed payment stablecoin issuer has sufficient resources to support initial operations, particularly to cover the losses that are expected to occur early in the startup phase of a new stablecoin,\" the OCC proposal states. \"The OCC's experience with chartering de novo national trust banks seeking to provide stablecoin programs determined that minimum capital amounts ranging from $6.05 million to $25 million would be necessary to establish a viable business model.\"</p><p>Issuers would be required to maintain liquid reserve assets including U.S. Treasuries, deposits at insured depository institutions, certain money market funds and cleared or tri-party reverse repurchase agreements. OCC says it is mulling publishing a list of reserve assets to assist banks in ensuring compliance. </p><p>\"To the extent feasible, the OCC is considering publishing a list of, or otherwise making public, the acceptable tokenized reserve assets for the sake of transparency,\" the proposal said. \"In determining whether a potential reserve asset qualifies…the OCC will consider, among other relevant factors, whether the asset has liquidity characteristics, including during times of stress, comparable to the other reserve assets allowed…[whether] permitted payment stablecoin issuers will be operationally capable of monetizing the asset to meet redemption request.\"</p><p>The proposal requires stablecoin issuers to manage liquidity carefully and be able to redeem stablecoins quickly, even during stressful market conditions. The OCC considered adding extra capital rules for risky reserve assets or counterparties but decided that holding diversified, liquid reserves and monitoring them regularly is enough to protect users without imposing additional costs for issuers.</p><p>Issuers would be required to maintain common equity tier 1 capital and additional tier 1 capital, sufficient to cover operational risks and ensure ongoing operations. Capital levels would be assessed both at the outset of the charter and with additional ongoing evaluations. </p><p>\"These two elements are generally consistent with the capital elements for national banks and</p><p>Federal savings associations under [OCC regulations],\" the proposal states. \"These elements consist of common equity, retained earnings and noncumulative perpetual preferred stock that meet certain terms designed to ensure significant loss-absorbing capabilities.\"</p><p>As part of the proposal, the OCC is also proposing a designated pool of highly liquid assets separate from both capital and reserves to act as an operational backstop for firms. The backstop aims to allow issuers to maintain operations during disruptions, such as system outages, cyberattacks or unexpected operational losses. The amount would be calculated quarterly based on the firm's overall operating costs, which OCC says, \"are highly correlated with the permitted payment stablecoin issuer's ability to maintain the operations of its payment stablecoin and stabilize from a business disruption.\"</p><p>\"This amount would need to be held in U.S. currency directly or at a Federal Reserve Bank, as demand deposits at a U.S. insured depository institution, with those deposits fully insured by the FDIC, or in U.S. Treasuries that meet the requirements to qualify as reserve assets, which could be readily liquidated,\" The proposal notes. The OCC would also impose penalties for issuers which fail to meet their capital and backstop requirements. </p><p>\"If a permitted payment stablecoin issuer does not meet the minimum capital…[or] the operational backstop at the end of a quarter, it must make efforts [that] may include raising additional capital, reducing the size of the operations or risk profile…converting less-liquid assets into highly liquid assets,\" the proposal states. \"Until the capital and backstop requirements are satisfied, the stablecoin issuer would be restricted from issuing any new stablecoins, except as necessary to facilitate a transfer…from one distributed ledger to another …[if noncompliant] for two consecutive quarters, it must begin liquidating reserve assets and redeeming outstanding stablecoins at the start of the following month and can no longer issue any new payment stablecoins going forward.\"</p><p>Boards and management of issuers must maintain risk management frameworks that address operational, market and legal risks. Issuers must submit quarterly reports detailing financial statements, reserve holdings, operational backstop amounts among other compliance metrics, the OCC said. </p></div>",
            "link": "https://www.americanbanker.com/news/occ-proposes-comprehensive-stablecoin-framework",
            "pub_date": "2026-02-27 04:06:24",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oregon community bank ceases mortgage operations",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><p>Oregon's Willamette Valley Bank announced it is exiting mortgage lending, pointing to challenges facing small institutions and macroeconomic concerns behind its decision. </p><p>The community bank, based in Salem, Oregon, will formally end residential lending operations on March 31. Along with four full-service branches across the state, Willamette Valley also runs five designated home loan centers located in both Oregon and neighboring Idaho.  </p><p>\"The residential mortgage industry has undergone significant changes in recent years, including the <ps-link><a class=\"Link\" href=\"https://www.nationalmortgagenews.com/news/exclusive-research-community-banks-face-nonbank-pressures\" target=\"_blank\"><u>growth of online and nonbank</u></a></ps-link> lenders and a prolonged period of higher interest rates,\" Willamette Valley Bank President and CEO Ryan Dempster said in a press release.</p><p>\"These conditions have made it increasingly difficult for community financial institutions to compete sustainably in this segment,\" Dempster said. </p><p>Between 2015 and 2024, the share of originations by community banks decreased from 21.8% to 12.4%, </p><p>In 2024, Willamette Valley originated $273.6 million worth of residential loans comprising 742 transactions, according to Iemergent's analysis of Home Mortgage Disclosure Act data.  Volumes came in at well under half their levels as recently as two years earlier, when the bank originated $785.7 million in volume for 2,177 units. </p><p>Other retail and commercial banking activities will proceed at the bank, which reported $3.2 million in net income for full year 2025. <br/></p><h2 class=\"cms-heading-h2 HeadingH2\">Mortgage trends among banks</h2><p>Willamette Valley's mortgage exit is the latest by a depository institution in recent months, with other midsized and community banks similarly exiting and citing the challenges of turning profits in home lending in today's economic environment. </p><p>An initial spike in mortgage rates, which more than doubled within months from near-3% levels in early 2022, contributed to decisions of some to <ps-link><a class=\"Link\" href=\"https://www.nationalmortgagenews.com/news/peoples-bank-of-commerce-in-oregon-to-exit-mortgage-lending\" target=\"_blank\"><u>leave the segment in the following year</u></a></ps-link>. Stubbornly sticky rates in the ensuing years sustained the trend, as both depository institutions and nonbanks <ps-link><a class=\"Link\" href=\"https://www.nationalmortgagenews.com/news/mba-says-productivity-origination-pull-through-is-falling\" target=\"_blank\"><u>struggled to profit</u></a></ps-link>, with the 30-year average only falling back below 6% this month for the first time since 2022.  </p><p>At the same time, <ps-link><a class=\"Link\" href=\"https://www.nationalmortgagenews.com/news/mortgage-trade-groups-back-call-for-updates-to-basel-iii\" target=\"_blank\"><u>regulatory capital restrictions on depository banks</u></a></ps-link>, which some have criticized as onerous, also diminished any appetite to plan for mortgage growth. </p><p>Still, while the industry has seen a number of departures in the past year, not all banks are choosing to pull back from mortgages entirely, taking different approaches, including expansion to keep their brands in the space. </p><p>Here are a few of the recent developments:</p><ul class=\"rte2-style-ul\" style=\"margin-top:0;margin-bottom:0;padding-inline-start:48px;\"><li>Willamette Valley joins a list of financial institutions that includes Wafd, <ps-link><a class=\"Link\" href=\"https://www.nationalmortgagenews.com/news/popular-bank-exits-mortgage-lending\" target=\"_blank\"><u>Popular Bank and</u></a></ps-link> Ally Financial to leave residential lending since early 2025.</li><li>Others are turning to nonbanks as outsource mortgage partners in order to continue providing home lending options to banking customers. <ps-link><a class=\"Link\" href=\"https://www.nationalmortgagenews.com/news/embrace-invests-in-mid-atlantic-growth-with-oceanfirst-deal\" target=\"_blank\"><u>Both Oceanfirst Bank</u></a></ps-link> and Amalgamated Bank signed such cooperation agreements with Embrace Home Loans to direct potential mortgage customers its way.  </li><li>In February, Firstrust Bank announced an operations partnership with direct lender Mortgagecountry. Unlike the Embrace agreements, Firstrust will still continue to originate and close loans under its own name, with the <ps-link><a class=\"Link\" href=\"https://www.nationalmortgagenews.com/news/bank-turns-to-nonbank-to-run-mortgage-production\" target=\"_blank\"><u>nonbank responsible for all mortgage production</u></a></ps-link>, technology services and strategic guidance of the business.</li><li>At the same time, other community financial institutions have found opportunities to grow their lending businesses, with First Federal Bank and <ps-link><a class=\"Link\" href=\"https://www.nationalmortgagenews.com/news/maryland-community-bank-bucks-trend-pins-hopes-on-mortgages\" target=\"_blank\"><u>the Bank of Glen Burnie</u></a></ps-link> both making mortgage acquisitions since summer 2025. <br/></li></ul><p>Recent regulatory developments, if approved, may open a window for increased mortgage lending from banks in the coming months. Federal Reserve Gov. Michelle Bowman recently indicated she <ps-link><a class=\"Link\" href=\"https://www.nationalmortgagenews.com/news/feds-bowman-wants-to-boost-banks-share-of-mortgage-market\" target=\"_blank\"><u>wished to see the return of banks</u></a></ps-link> into home lending, with a publication of a proposed update to ease capital-risk requirements expected at the end of the current quarter. </p></div>",
            "link": "https://www.americanbanker.com/news/oregon-community-bank-ceases-mortgage-operations",
            "pub_date": "2026-02-27 03:55:46",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Comptroller Gould minimizes leading bank concerns in hearing",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><ul><li><b>Key insight:</b> Comptroller of the Currency Jonathan Gould said the burden of banks collecting citizenship information would be \"minor,\" likening it to existing I-9 employment eligibility requirements. </li><li><b>What's at stake:</b> On debanking, Gould said the OCC is reviewing the largest national banks and investigating complaints. The OCC and other regulators have proposed eliminating \"reputation risk\" as a supervisory tool, which he said has been used to cut off politically disfavored customers.</li><li><b>Forward look:</b> Federal Reserve Vice Chair for Supervision Michelle Bowman said regulatory proposals are coming soon to encourage community and commercial banks to re-enter the mortgage market, while Federal Deposit Insurance Corp. Chair Travis Hill offered a cautious assessment that deposit insurance reform may only have only a minor impact on bank assessment fees.</li></ul><p>WASHINGTON — Comptroller of the Currency Jonathan Gould dismissed concerns about the cost for banks associated with collecting citizenship information at a hearing in front of the Senate Banking Committee on Thursday. </p><p>Gould appeared alongside other prudential regulators — Federal Reserve Vice Chair for Supervision Michelle Bowman, Federal Deposit Insurance Corp. Chair Travis Hill and National Credit Union Administration Chair Kyle Hauptman — in nearly three hours of testimony in the Senate Banking Committee Thursday morning, the first prudential regulator hearing in the upper chamber since 2024.  </p><p>While most of the Trump-era bank regulation has centered on a <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/bowmans-reform-agenda-targets-ratings-supervision-capital\" target=\"_blank\"><u>pullback of oversight</u></a></ps-link> for small and large institutions alike, banks have expressed concern about emerging threats to the traditional banking system, including potential enforcement actions in response to <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/gould-says-debanking-crackdown-will-target-large-banks\" target=\"_blank\"><u>debanking</u></a></ps-link> actions, the potential growth of crypto and stablecoin usage, headline risk from volatile <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/supreme-court-strikes-down-trumps-liberation-day-tariffs\" target=\"_blank\"><u>tariff policies</u></a></ps-link> and a reported <ps-link><a class=\"Link\" href=\"https://www.wsj.com/politics/policy/trump-administration-considers-action-requiring-banks-to-collect-citizenship-info-8e26f6d2?gaa_at=eafs&amp;gaa_n=AWEtsqfB1uklfujBpN81NZqheNtZVC7UFvAgeaF-OsC-KLZJUy-dm8DLcwiyYLfVrFY%3D&amp;gaa_ts=699e7382&amp;gaa_sig=SweQ0DatavWj8IfSKx6CRsfPpUXqRuvl1UeOzLE9ml3B8OlH8nAsET4Vf4GPe3SgAUEsAbgY6YC8IinoYDkjFQ%3D%3D\" target=\"_blank\"><u>citizenship information requirement</u></a></ps-link> for new bank customers. </p><p>Gould spoke to several of those issues during the hearing. </p><p>In response to a direct question from Sen. Catherine Cortez Masto, D-Nev., about the potential costs associated with banks potentially being required to collect citizenship information, Gould said that the impact would be \"minor.\" The Wall Street Journal reported earlier this week that the White House is considering an executive order that would require banks to obtain citizenship documentation as part of banks' Know Your Customer requirements.</p><p>\"I think the additional burden would be minor,\" he said. </p><p>Gould said that, for people who do not have easy access to their birth certificates or who don't have a passport, there are alternative forms of paperwork, although he didn't specify what those alternative options would be. He said that employers already collect so-called I-9 employment eligibility data, which requires similar documentation. </p><p>\"Just like with an I-9, I think there are alternatives available,\" Gould said. \"Banks have demonstrated an ability to find ways to know their customer under the existing framework.\"</p><p>He also tried to avoid discussing the national trust charter application of World Liberty Financial, a crypto firm owned partly by President Donald Trump and his family. Banks have<ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/banks-urge-scrutiny-of-fintech-trust-charter-applications\" target=\"_blank\"><u> publicly pushed back</u></a></ps-link> on the wave of fintech and <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/bank-trade-group-opposes-coinbase-charter-application\" target=\"_blank\"><u>crypto</u></a></ps-link> firm applications for national trust charters, but have been silent on World Liberty Financial. </p><p>\"I'm not going to discuss the specifics of any application,\" Gould said.</p><p>In response to a question posed by Sen. Bernie Moreno, R-Ohio, on whether a loose regulation of stablecoin issuers or third parties offering yield-like rewards to stablecoin holders could sap core deposits from traditional banks, Gould offered the most candid analysis. </p><p>\"I can, I think, say with some certainty, that any significant deposit flight or material deposit flight would not go unnoticed — certainly by me, by you and other elected officials on this committee,\" Gould said. \"And if there were to be significant deposit flight, I believe that I and other federal bank agency regulators would take steps, since that would raise safety and soundness concerns.\"</p><p>Gould also outlined the concerns he has about banks dropping customers for political reasons, a phenomenon known as \"debanking,\" which has <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/bank-group-agrees-with-trump-diagnosis-of-debanking\" target=\"_blank\"><u>been a priority</u></a></ps-link> of President Trump, who signed an <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/trump-signs-debanking-executive-order\" target=\"_blank\"><u>executive order</u></a></ps-link> last August directing regulators to identify instances of unlawful political or religious bias motivating such actions.</p><p>\"No American should be denied access to banking products and services because of political or religious beliefs or lawful business activity,\" Gould said in his prepared remarks. \"We are implementing President Trump's Executive Order on Guaranteeing Fair Banking for All Americans by, among other things, reviewing the activities of the largest national banks and investigating complaints of alleged debanking.\"</p><p>Gould's comments came in contrast to his fellow regulators on the panel, who largely navigated around questions posed to them with familiar talking points. Bowman continued to tout tailoring efforts for community banks — a longtime priority of hers — and her <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/feds-bowman-wants-to-boost-banks-share-of-mortgage-market\" target=\"_blank\"><u>recent push</u></a></ps-link> to align the joint forthcoming Basel III endgame proposal with the goal of having banks reengage in mortgage lending. </p><p>Bowman said that regulatory proposals will be introduced in the near-term as a means to reengage both community banks and commercial banks in the mortgage space. She also said that other agencies also have a role to play in making banks bigger players in the home mortgage market.</p><p>\"We're very focused, as we were thinking about the Basel approach in ways that we could right-size and recalibrate the approach for residential mortgage lending, so that we could encourage the banks to get back into the mortgage business,\" Bowman said. \"[Consumer Financial Protection Bureau] regulations … put onerous requirements and large fines on banks for making mistakes in mortgage applications and things like that. So I think it's important that we think about this in a more broad manner and holistically.\"</p><p>When asked by Sen. Angela Alsobrooks, D-Md., about his view of the impact on raising deposit insurance for business accounts on banks deposit insurance assessments, Hill gave a cautious answer, saying the impact would likely fall on larger banks, but the details would determine the outcome. </p><p>\"I said last time it is possible that it would not result in increases,\" Hill said, adding that if such a reform did have an impact, it would likely be small and fall on large banks, \"just based on the way that the current assessment formulas work.\" </p><p>He also said that regulators would \"need to think about the potential impact on the reserve ratio.\"</p><p>\"If you increase the amount of insured deposits in the system based on the way that the reserve ratio was currently defined, that would result in a decrease in the reserve ratio,\" he said.</p></div>",
            "link": "https://www.americanbanker.com/news/comptroller-gould-minimizes-leading-bank-concerns-in-hearing",
            "pub_date": "2026-02-27 03:35:51",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Banks face risks, opportunities from card surcharges",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><p><ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/payments/news/why-surcharging-remains-controversial-even-when-most-states-allow-it\" target=\"_blank\"><u>Surcharging</u></a></ps-link>, where merchants tack on a fee, often 3%, for credit card use, is on the rise. This poses potential revenue challenges for banks' credit card business as well as opportunities for financial institutions with merchant processing arms.</p><p>Slightly more than a third of small businesses (35%) add a surcharge for customers paying by credit card. That's according to a recent JD Power <ps-link><a class=\"Link\" href=\"https://www.jdpower.com/business/press-releases/2026-us-merchant-services-satisfaction-study\" target=\"_blank\"><u>report </u></a></ps-link>on merchant services satisfaction. Businesses do this to offset fees charged by card networks such as Visa and Mastercard. The trend, which has been <ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/payments/news/banks-face-new-threats-from-credit-card-surcharging\" target=\"_blank\"><u>accelerating in recent years</u></a></ps-link>, can cause problems for merchants, with 32% saying their retail customers occasionally or frequently cancel a purchase when a surcharge is added.</p><p>The practice of surcharging also raises concerns for issuing banks' credit card revenue, as JD Power's U.S. credit card satisfaction <ps-link><a class=\"Link\" href=\"https://www.jdpower.com/business/press-releases/2025-us-credit-card-satisfaction-study\" target=\"_blank\"><u>report</u></a></ps-link> published last August illustrates. The report found that 65% of cardholders have been charged higher prices for goods and services for using their credit cards. Among cardholders who experienced a surcharge, 81% said they used a different payment method at some point to avoid the extra fee.  </p><p>\"There's an increasing trend here. Now, a majority of cardholders are saying they have used an alternate payment method,\" John Cabell, managing director of payments intelligence at JD Power, told American Banker. </p><p>Here's what banks need to know about the latest trends related to surcharging:<br/></p><h2 class=\"cms-heading-h2 HeadingH2\">Alternative payment methods gain ground</h2><p>While consumers don't like surcharging, credit cards remain a popular payment option. Notably, credit card use was higher in 2024 as a percentage than in 2023 — 35% compared with 32%, according to a Federal Reserve <ps-link><a class=\"Link\" href=\"https://www.frbservices.org/binaries/content/assets/crsocms/news/research/2025-diary-of-consumer-payment-choice.pdf\" target=\"_blank\"><u>report</u></a></ps-link> released in May. Debit use held steady at 30%.</p><p>Even so, many consumers are willing to use another payment method to avoid a surcharge. Case studies from payments technology company Stax Payments show 22% of transactions migrate to lower-cost debit or ACH rails once a credit surcharge is introduced, according to Adam Gray, the company's chief transformation officer.</p><p>Banks make less on ACH transactions than they do on credit cards. Debit cards also yield significantly less in interchange fees than credit cards. \"A bank can make seven to eight times on credit versus debit,\" Eric Cohen, chief executive of Merchant Advocate, an advisor to merchants on processing-related issues, told American Banker.</p><p>Over time, and if the economy tightens, more consumers may shift to debit to avoid surcharges. A sizable shift to debit would be meaningful to a bank, Cohen said. Say a bank does a million transactions a month and receives $1.50 less revenue on each. That's $18 million a year in lost revenue, Cohen said. \"Even a 10% shift would be a large shift if they're doing tens of millions of transactions,\" he added.</p><p>Banks with $10 billion in assets have even more reason to be concerned because they have the strictest requirements for debit interchange rates. It could be more of an issue if the Federal Reserve's attempts to lower debit card interchange fees take effect. It's currently in regulatory and legal limbo, and several industry associations have <ps-link><a class=\"Link\" href=\"https://bpi.com/joint-trades-urge-federal-reserve-to-withdraw-2023-regulation-ii-proposal/\" target=\"_blank\"><u>asked </u></a></ps-link>the Fed to withdraw its proposed amendments. </p><p>As surcharging becomes more prevalent, consumers could shift toward other up-and-coming payment options. Buy-now-pay-later offered by non-banks, for instance, is becoming a more viable alternative to credit cards. BNPL is accepted by 58% of U.S. small businesses, up from 54% in 2024, making it the fourth-most-accepted form of payment behind debit or credit cards, digital wallets and cash, according to JD Power.</p><p>Some consumers are also paying with cryptocurrency, though it's still \"a very small on-the-margin-type of payment,\" JD Power's Cabell said. Cryptocurrency adoption among U.S. small businesses stood at 19% this year, up 4 percentage points from 2025. Directionally, however, more merchants are showing interest. According to JD Power, 37% of merchants expressed a favorable view of cryptocurrency, and 33% of non-accepting merchants said they'd be likely to accept crypto payments if offered by their merchant services provider.<br/></p><h2 class=\"cms-heading-h2 HeadingH2\">Opportunities for banks to boost credit card processing</h2><p>Banks that sell credit card processing services have a vested interest in encouraging merchants to surcharge because they make more money on credit card processing by allowing surcharging, Cohen of Merchant Advocate told American Banker. </p><p>For these banks, encouraging surcharging is a smart business move, according to Gray of Stax Payments. This is especially true in historically cash-heavy verticals, such as professional and field services, where removing \"the margin-eroding barrier of interchange\" through surcharging allows banks to capture entirely new revenue streams that were previously locked in paper checks, Gray noted. <br/></p><h2 class=\"cms-heading-h2 HeadingH2\">More regulation could be coming</h2><p>Most states allow surcharging, though in recent years, several, including New York, Illinois, Colorado, Georgia, Texas, and California, have implemented rules or restrictions on it, such as caps on surcharge rates or customer disclosure requirements. It takes time for regulation to catch up to merchant practices, so more states could seek to regulate it, Cohen of Merchant Advocate told American Banker. </p><p>The question is: will these stricter surcharging rules and others that may come down the pike be enforced? Today, for example, many merchants impose surcharges on debit cards, which is illegal; however, they get away with it, partly because enforcement is lax and customers don't know better, Cohen said. \"Regulation means nothing if it's not being policed.\"</p></div>",
            "link": "https://www.americanbanker.com/payments/news/banks-face-risks-opportunities-from-card-surcharges",
            "pub_date": "2026-02-27 01:16:27",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Market Intelligence Community banks should grab the opportunities created by stablecoins",
            "description": "<div class=\"RichTextArticleBody-body RichTextBody\"><p></p><ul class=\"rte2-style-ul\" data-pm-slice=\"3 1 []\"><li><b>Key insight: </b>Stablecoins present opportunities for community banks to explore new forms of capital formation while strengthening their own exposure to risk.</li><li><b>Supporting data: </b>The share of small-business lending handled by community banks has dropped from almost 60% at the turn of the century to just over 40%.</li><li><p><b>What's at stake: </b>It's important that community banks stay relevant, given their role in servicing the small businesses that<u> </u>account for 40% of U.S. GDP, 39% of private employment, 97% of<u> </u>U.S. importers and 33% of import value.</p></li></ul><p>One of the main<ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/news/banks-consumer-groups-push-back-against-stablecoin-yield\" target=\"_blank\"><u> arguments from the banking lobby</u></a></ps-link> against stablecoins is the potential threat to banks. We're told again and again that, if allowed to earn yield or rewards, stablecoins will siphon off deposits from banks and depress lending into the community.</p><p></p><p>While the logic may seem simple, banking isn't, and the conclusion rests on erroneous assumptions about how funds flow into and around the U.S. economy. But here I'm not going to dwell on how recent history has shown that most deposits are not sensitive to interest rates (existing yield-bearing alternatives have not made much of a dent), nor on how aggregate deposits wouldn't change and could even increase should stablecoins end up attracting significant inflows. Rather, I want to focus on the opportunity stablecoins present for community banks.</p><p></p><p>That's not to say strong inflows into stablecoins pose no threats at all. They wouldn't reduce overall deposit levels, but they would lead to a reallocation toward large banks as the sellers of Treasuries and other reserve assets tend to use national institutions.</p><p></p><p>This does not need to imply that community banks lose relevance, however. Indeed, it's important that they don't, given their role in servicing the small businesses that<ps-link><a class=\"Link\" href=\"https://advocacy.sba.gov/2024/07/23/frequently-asked-questions-about-small-business-2024/\" target=\"_blank\"><u> account for</u></a></ps-link> 40% of U.S. GDP, 39% of private employment, 97% of<ps-link><a class=\"Link\" href=\"https://www.census.gov/foreign-trade/Press-Release/edb/edbrel2023.pdf\" target=\"_blank\"><u> U.S. importers</u></a></ps-link> and 33% of import value.</p><p></p><p>Yet to maintain their relevance, community banks need to rethink their approach to their core business, whatever happens with stablecoin regulation, as competition from other corners of finance has been building<i>. </i>With<ps-link><a class=\"Link\" href=\"https://www.clevelandfed.org/collections/research-in-brief/2020/rib-20200709-fintech-lending\" target=\"_blank\"><u> fintechs offering</u></a></ps-link> more efficient and cheaper loan solutions and<ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/opinion/chase-and-other-megabanks-arent-and-never-will-be-community-banks\" target=\"_blank\"><u> large banks</u></a></ps-link> looking to<ps-link><a class=\"Link\" href=\"https://media.chase.com/news/chase-to-open-more-than-160-branches-in-over-30-states-in-2026\" target=\"_blank\"><u> gain market share</u></a></ps-link> in<ps-link><a class=\"Link\" href=\"https://newsroom.bankofamerica.com/content/newsroom/press-releases/2025/05/bofa-to-open-150-financial-centers-by-2027--investing-over--5-bi.html\" target=\"_blank\"><u> growing areas</u></a></ps-link>, the share of small-business lending handled by community banks has dropped from<ps-link><a class=\"Link\" href=\"https://www.hks.harvard.edu/sites/default/files/centers/mrcbg/files/Final_State_and_Fate_Lux_Greene.pdf\" target=\"_blank\"><u> almost 60%</u></a></ps-link> at the turn of the century to<ps-link><a class=\"Link\" href=\"https://www.fdic.gov/system/files/2024-09/small-business-lending-survey-2024-full.pdf\" target=\"_blank\"><u> just over 40%</u></a></ps-link>.</p><p></p><p>Stablecoins, rather than a threat, are an ally in this necessary evolution. Rather than fighting the technology's flexibility and appeal, community banks could harness it to deepen their competitive moat: specifically, their relationship to the savers and small businesses in their communities.</p><p></p><p>First, community banks can offer stablecoin custody, combining wallets conveniently embedded in banking apps with the lure of rewards for balances or activity, funded by distribution fees paid by the stablecoin issuers out of the interest they earn on the backing reserves. With stablecoins held in-app, community banks can earn payment fees while offering local importers and exporters a better experience with cross-border transactions. And as more merchants onboard direct stablecoin acceptance via existing banking relationships, some fees could be competed away from the large card issuers.  </p><p></p><p>Second, looking ahead, stablecoins can support a new type of funding: token issuance. True, fiat dollars can settle any type of asset transaction, regardless of the underlying rails; but stablecoins enable banks and businesses to plug into blockchain connectivity, powering faster settlement and more complex automation while harnessing enhanced transparency to meet compliance requirements.</p><p></p><p>Tokenization is still young and heavily weighted toward on-chain representations of existing assets such as equities, bonds and real estate. But we are seeing signs of progress in native blockchain issuance, such as<ps-link><a class=\"Link\" href=\"https://www.globenewswire.com/news-release/2026/02/18/3240027/0/en/Figure-Technology-Solutions-Announces-Pricing-and-Upsizing-of-Offering-of-Class-A-Common-Stock-and-Blockchain-Native-Common-Stock.html\" target=\"_blank\"><u> the upsized offering</u></a></ps-link> from Figure Technology Solutions that closed last week. As the Securities and Exchange Commission progresses in its commitment to reassess securities rules around disclosure and filing requirements for tokenized assets, friction will be smoothed as on-chain platforms open up a more flexible and efficient form of capital formation. Community banks can play a key role here.</p><p></p><p>After all, their competitive moat has long been based on a familiarity with local businesses. This moat is being eroded by cheaper services, but can be recovered via a new type of funding relationship, one that could also open up new business lines for banks and their customers. For instance, tokenized cross-border invoices swapped for stablecoins that can then be used to efficiently settle the trade, with smart contracts handling the timing and execution; data center financing via yield-bearing tokens that can be used as collateral for a separate loan; tradeable membership tokens issued by a local event venue that trigger discounts and grant privileged access; on-chain equity interests in local restaurants, bowling alleys and hardware stores that accrue loyalty points for activity.</p><p>By helping customers to test token issuance with the support of a trusted name, small banks could tiptoe into the investment banking activity typically concentrated in the large banks. And in the process, they could reduce their exposure to<ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/opinion/deposit-insurance-reform-is-a-critical-opportunity-for-main-street\" target=\"_blank\"><u> relatively risky</u></a></ps-link> small-business lending while deepening their footprint in capital formation.</p><p></p><p>In sum, once new rules are developed to lower the barriers of uncertainty and cost of tokenization, community banks will be able to broaden their offering for businesses looking to raise capital, more effectively competing against fintechs and large banks while reinforcing their resilience.</p><p></p><p>As for the considerable development costs, we've seen<ps-link><a class=\"Link\" href=\"https://www.americanbanker.com/opinion/white-label-stablecoins-are-the-next-evolution-of-money\" target=\"_blank\"><u> white label stablecoin services</u></a></ps-link> emerge to lower issuance barriers; we're likely to see the same trend in tokenization platforms. This suggests a much more fragmented mosaic of marketplaces than the current, centralized system — but for local and niche businesses, that fragmentation could represent a friendlier, more scalable opportunity, as blockchain connectivity leaves the door open for expansion.</p><p></p><p>A key connector of a distributed on-chain landscape? Stablecoins.</p><p></p><p>Community banks know their communities. They also know that their communities' priorities are changing, that global finance is undergoing a transformation, and that demographics are impacting expectations: As younger clients create or take over businesses, digital adaptation increasingly becomes an essential pillar of growth.</p><p></p><p>In developing and offering stablecoin and tokenization services, community banks can strengthen their exposure to risk as well as their core relationship with customers, while future-proofing digital services for a younger generation of businesses.</p><p></p><p>What's more, rather than clinging to the futile hope that the current structure of banking will hold, they would be wading into the bracing efficiency of competition, a defining feature of American business and one that decides who sits at the table around which the format of tomorrow's financial system is decided.</p></div>",
            "link": "https://www.americanbanker.com/payments/news/stablecoins-offer-multiple-opportunities-to-support-community-banks",
            "pub_date": "2026-02-26 20:35:28",
            "source": "americanbanker",
            "kind": 1,
            "language": "en"
        }
    ]
}